{"id": "1011.5053", "review": {"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "23-Nov-2010", "title": "Tight Sample Complexity of Large-Margin Learning", "abstract": "We obtain a tight distribution-specific characterization of the sample complexity of large-margin classification with L_2 regularization: We introduce the \\gamma-adapted-dimension, which is a simple function of the spectrum of a distribution's covariance matrix, and show distribution-specific upper and lower bounds on the sample complexity, both governed by the \\gamma-adapted-dimension of the source distribution. We conclude that this new quantity tightly characterizes the true sample complexity of large-margin classification. The bounds hold for a rich family of sub-Gaussian distributions.", "histories": [["v1", "Tue, 23 Nov 2010 10:44:21 GMT  (89kb,S)", "https://arxiv.org/abs/1011.5053v1", "Appearing in Neural Information Processing Systems (NIPS) 2010; This is the full version, including appendix with proofs"], ["v2", "Thu, 5 Apr 2012 16:40:03 GMT  (29kb)", "http://arxiv.org/abs/1011.5053v2", "Appearing in Neural Information Processing Systems (NIPS) 2010; This is the full version, including appendix with proofs; Also with some corrections"]], "COMMENTS": "Appearing in Neural Information Processing Systems (NIPS) 2010; This is the full version, including appendix with proofs", "reviews": [], "SUBJECTS": "cs.LG math.PR math.ST stat.ML stat.TH", "authors": ["sivan sabato", "nathan srebro", "naftali tishby"], "accepted": true, "id": "1011.5053"}, "pdf": {"name": "1011.5053.pdf", "metadata": {"source": "CRF", "title": "Tight Sample Complexity of Large-Margin Learning", "authors": ["Sivan Sabato", "Nathan Srebro", "Naftali Tishby"], "emails": ["sabato@cs.huji.ac.il,", "tishby@cs.huji.ac.il,", "nati@ttic.edu"], "sections": [{"heading": null, "text": "ar X\niv :1\n01 1.\n50 53\nv2 [\ncs .L\nG ]\n5 A\npr 2\nWe obtain a tight distribution-specific characterization of the sample complexity of large-margin classification with L2 regularization: We introduce the γ-adapted-dimension, which is a simple function of the spectrum of a distribution’s covariance matrix, and show distribution-specific upper and lower bounds on the sample complexity, both governed by the γ-adapted-dimension of the source distribution. We conclude that this new quantity tightly characterizes the true sample complexity of large-margin classification. The bounds hold for a rich family of sub-Gaussian distributions."}, {"heading": "1 Introduction", "text": "In this paper we tackle the problem of obtaining a tight characterization of the sample complexity which a particular learning rule requires, in order to learn a particular source distribution. Specifically, we obtain a tight characterization of the sample complexity required for large (Euclidean) margin learning to obtain low error for a distribution D(X,Y ), for X ∈ Rd, Y ∈ {±1}. Most learning theory work focuses on upper-bounding the sample complexity. That is, on providing a bound m(D, ǫ) and proving that when using some specific learning rule, if the sample size is at least m(D, ǫ), an excess error of at most ǫ (in expectation or with high probability) can be ensured. For instance, for large-margin classification we know that if PD[‖X‖ ≤ B] = 1, then m(D, ǫ) can be set to O(B2/(γ2ǫ2)) to get true error of no more than ℓ∗γ + ǫ, where ℓ∗γ = min‖w‖≤1 PD(Y 〈w,X〉 ≤ γ) is the optimal margin error at margin γ. Such upper bounds can be useful for understanding positive aspects of a learning rule. But it is difficult to understand deficiencies of a learning rule, or to compare between different rules, based on upper bounds alone. After all, it is possible, and often the case, that the true sample complexity, i.e. the actual number of samples required to get low error, is much lower than the bound.\nOf course, some sample complexity upper bounds are known to be “tight” or to have an almostmatching lower bound. This usually means that the bound is tight as a worst-case upper bound for a specific class of distributions (e.g. all those with PD[‖X‖ ≤ B] = 1). That is, there exists some source distribution for which the bound is tight. In other words, the bound concerns some quantity of the distribution (e.g. the radius of the support), and is the lowest possible bound in terms of this quantity. But this is not to say that for any specific distribution this quantity tightly characterizes the sample complexity. For instance, we know that the sample complexity can be much smaller than the radius of the support of X , if the average norm √ E[‖X‖2] is small. However, E[‖X‖2] is also not a precise characterization of the sample complexity, for instance in low dimensions.\nThe goal of this paper is to identify a simple quantity determined by the distribution that does precisely characterize the sample complexity. That is, such that the actual sample complexity for the learning rule on this specific distribution is governed, up to polylogarithmic factors, by this quantity.\nIn particular, we present the γ-adapted-dimension kγ(D). This measure refines both the dimension and the average norm ofX , and it can be easily calculated from the covariance matrix ofX . We show that for a rich family of “light tailed” distributions (specifically, sub-Gaussian distributions with independent uncorrelated directions – see Section 2), the number of samples required for learning by minimizing the γ-margin-violations is both lower-bounded and upper-bounded by Θ̃(kγ). More precisely, we show that the sample complexity m(ǫ, γ,D) required for achieving excess error of no more than ǫ can be bounded from above and from below by:\nΩ(kγ(D)) ≤ m(ǫ, γ,D) ≤ Õ( kγ(D)\nǫ2 ).\nAs can be seen in this bound, we are not concerned about tightly characterizing the dependence of the sample complexity on the desired error [as done e.g. in 1], nor with obtaining tight bounds for very small error levels. In fact, our results can be interpreted as studying the sample complexity needed to obtain error well below random, but bounded away from zero. This is in contrast to classical statistics asymptotic that are also typically tight, but are valid only for very small ǫ. As was recently shown by Liang and Srebro [2], the quantities on which the sample complexity depends on for very small ǫ (in the classical statistics asymptotic regime) can be very different from those for moderate error rates, which are more relevant for machine learning.\nOur tight characterization, and in particular the distribution-specific lower bound on the sample complexity that we establish, can be used to compare large-margin (L2 regularized) learning to other learning rules. In Section 7 we provide two such examples: we use our lower bound to rigorously establish a sample complexity gap betweenL1 andL2 regularization previously studied in [3], and to show a large gap between discriminative and generative learning on a Gaussian-mixture distribution.\nIn this paper we focus only on large L2 margin classification. But in order to obtain the distributionspecific lower bound, we develop novel tools that we believe can be useful for obtaining lower bounds also for other learning rules."}, {"heading": "Related work", "text": "Most work on “sample complexity lower bounds” is directed at proving that under some set of assumptions, there exists a source distribution for which one needs at least a certain number of examples to learn with required error and confidence [4, 5, 6]. This type of a lower bound does not, however, indicate much on the sample complexity of other distributions under the same set of assumptions.\nAs for distribution-specific lower bounds, the classical analysis of Vapnik [7, Theorem 16.6] provides not only sufficient but also necessary conditions for the learnability of a hypothesis class with respect to a specific distribution. The essential condition is that the ǫ-entropy of the hypothesis class with respect to the distribution be sub-linear in the limit of an infinite sample size. In some sense, this criterion can be seen as providing a “lower bound” on learnability for a specific distribution. However, we are interested in finite-sample convergence rates, and would like those to depend on simple properties of the distribution. The asymptotic arguments involved in Vapnik’s general learnability claim do not lend themselves easily to such analysis.\nBenedek and Itai [8] show that if the distribution is known to the learner, a specific hypothesis class is learnable if and only if there is a finite ǫ-cover of this hypothesis class with respect to the distribution. Ben-David et al. [9] consider a similar setting, and prove sample complexity lower bounds for learning with any data distribution, for some binary hypothesis classes on the real line. In both of these works, the lower bounds hold for any algorithm, but only for a worst-case target hypothesis. Vayatis and Azencott [10] provide distribution-specific sample complexity upper bounds for hypothesis classes with a limited VC-dimension, as a function of how balanced the hypotheses are with respect to the considered distributions. These bounds are not tight for all distributions, thus this work also does not provide true distribution-specific sample complexity."}, {"heading": "2 Problem setting and definitions", "text": "Let D be a distribution over Rd × {±1}. DX will denote the restriction of D to Rd. We are interested in linear separators, parametrized by unit-norm vectors in Bd1 , {w ∈ Rd | ‖w‖2 ≤ 1}.\nFor a predictor w denote its misclassification error with respect to distribution D by ℓ(w,D) , P(X,Y )∼D[Y 〈w,X〉 ≤ 0]. For γ > 0, denote the γ-margin loss of w with respect to D by ℓγ(w,D) , P(X,Y )∼D[Y 〈w,X〉 ≤ γ]. The minimal margin loss with respect to D is denoted by ℓ∗γ(D) , minw∈Bd 1 ℓγ(w,D). For a sample S = {(xi, yi)}mi=1 such that (xi, yi) ∈ Rd × {±1}, the margin loss with respect to S is denoted by ℓ̂γ(w, S) , 1m |{i | yi〈xi, w〉 ≤ γ}| and the misclassification error is ℓ̂(w, S) , 1m |{i | yi〈xi, w〉 ≤ 0}|. In this paper we are concerned with learning by minimizing the margin loss. It will be convenient for us to discuss transductive learning algorithms. Since many predictors minimize the margin loss, we define:\nDefinition 2.1. A margin-error minimization algorithm A is an algorithm whose input is a margin γ, a training sample S = {(xi, yi)}mi=1 and an unlabeled test sample S̃X = {x̃i}mi=1, which outputs a predictor w̃ ∈ argminw∈Bd\n1 ℓ̂γ(w, S). We denote the output of the algorithm by\nw̃ = Aγ(S, S̃X).\nWe will be concerned with the expected test loss of the algorithm given a random training sample and a random test sample, each of size m, and define ℓm(Aγ , D) , ES,S̃∼Dm [ℓ̂(A(S, S̃X), S̃)], where S, S̃ ∼ Dm independently. For γ > 0, ǫ ∈ [0, 1], and a distribution D, we denote the distributionspecific sample complexity by m(ǫ, γ,D): this is the minimal sample size such that for any marginerror minimization algorithm A, and for any m ≥ m(ǫ, γ,D), ℓm(Aγ , D)− ℓ∗γ(D) ≤ ǫ."}, {"heading": "Sub-Gaussian distributions", "text": "We will characterize the distribution-specific sample complexity in terms of the covariance of X ∼ DX . But in order to do so, we must assume that X is not too heavy-tailed. Otherwise, X can have even infinite covariance but still be learnable, for instance if it has a tiny probability of having an exponentially large norm. We will thus restrict ourselves to sub-Gaussian distributions. This ensures light tails in all directions, while allowing a sufficiently rich family of distributions, as we presently see. We also require a more restrictive condition – namely that DX can be rotated to a product distribution over the axes of Rd. A distribution can always be rotated so that its coordinates are uncorrelated. Here we further require that they are independent, as of course holds for any multivariate Gaussian distribution.\nDefinition 2.2 (See e.g. [11, 12]). A random variable X is sub-Gaussian with moment B (or B-sub-Gaussian) for B ≥ 0 if\n∀t ∈ R, E[exp(tX)] ≤ exp(B2t2/2). (1)\nWe further say that X is sub-Gaussian with relative moment ρ = B/ √ E[X2].\nThe sub-Gaussian family is quite extensive: For instance, any bounded, Gaussian, or Gaussianmixture random variable with mean zero is included in this family.\nDefinition 2.3. A distribution DX over X ∈ Rd is independently sub-Gaussian with relative moment ρ if there exists some orthonormal basis a1, . . . , ad ∈ Rd, such that 〈X, ai〉 are independent sub-Gaussian random variables, each with a relative moment ρ.\nWe will focus on the family Dsgρ of all independently ρ-sub-Gaussian distributions in arbitrary dimension, for a small fixed constant ρ. For instance, the family Dsg3/2 includes all Gaussian distributions, all distributions which are uniform over a (hyper)box, and all multi-Bernoulli distributions, in addition to other less structured distributions. Our upper bounds and lower bounds will be tight up to quantities which depend on ρ, which we will regard as a constant, but the tightness will not depend on the dimensionality of the space or the variance of the distribution."}, {"heading": "3 The γ-adapted-dimension", "text": "As mentioned in the introduction, the sample complexity of margin-error minimization can be upperbounded in terms of the average norm E[‖X‖2] by m(ǫ, γ,D) ≤ O(E[‖X‖2]/(γ2ǫ2)) [13]. Alternatively, we can rely only on the dimensionality and conclude m(ǫ, γ,D) ≤ Õ(d/ǫ2) [7]. Thus,\nalthough both of these bounds are tight in the worst-case sense, i.e. they are the best bounds that rely only on the norm or only on the dimensionality respectively, neither is tight in a distributionspecific sense: If the average norm is unbounded while the dimensionality is small, an arbitrarily large gap is created between the true m(ǫ, γ,D) and the average-norm upper bound. The converse happens if the dimensionality is arbitrarily high while the average-norm is bounded.\nSeeking a distribution-specific tight analysis, one simple option to try to tighten these bounds is to consider their minimum, min(d,E[‖X‖2]/γ2)/ǫ2, which, trivially, is also an upper bound on the sample complexity. However, this simple combination is also not tight: Consider a distribution in which there are a few directions with very high variance, but the combined variance in all other directions is small. We will show that in such situations the sample complexity is characterized not by the minimum of dimension and norm, but by the sum of the number of high-variance dimensions and the average norm in the other directions. This behavior is captured by the γ-adapted-dimension:\nDefinition 3.1. Let b > 0 and k a positive integer.\n(a). A subset X ⊆ Rd is (b, k)-limited if there exists a sub-space V ⊆ Rd of dimension d − k such that X ⊆ {x ∈ Rd | ‖x′P‖2 ≤ b}, where P is an orthogonal projection onto V .\n(b). A distribution DX over Rd is (b, k)-limited if there exists a sub-space V ⊆ Rd of dimension d− k such that EX∼DX [‖X ′P‖2] ≤ b, with P an orthogonal projection onto V .\nDefinition 3.2. The γ-adapted-dimension of a distribution or a set, denoted by kγ , is the minimum k such that the distribution or set is (γ2k, k) limited.\nIt is easy to see that kγ(DX) is upper-bounded by min(d,E[‖X‖2]/γ2). Moreover, it can be much smaller. For example, for X ∈ R1001 with independent coordinates such that the variance of the first coordinate is 1000, but the variance in each remaining coordinate is 0.001 we have k1 = 1 but d = E[‖X‖2] = 1001. More generally, if λ1 ≥ λ2 ≥ · · ·λd are the eigenvalues of the covariance matrix of X , then kγ = min{k | ∑d i=k+1 λi ≤ γ2k}. A quantity similar to kγ was studied previously in [14]. kγ is different in nature from some other quantities used for providing sample complexity bounds in terms of eigenvalues, as in [15], since it is defined based on the eigenvalues of the distribution and not of the sample. In Section 6 we will see that these can be quite different.\nIn order to relate our upper and lower bounds, it will be useful to relate the γ-adapted-dimension for different margins. The relationship is established in the following Lemma , proved in the appendix:\nLemma 3.3. For 0 < α < 1, γ > 0 and a distribution DX , kγ(DX) ≤ kαγ(DX) ≤ 2kγ(DX )α2 + 1.\nWe proceed to provide a sample complexity upper bound based on the γ-adapted-dimension."}, {"heading": "4 A sample complexity upper bound using γ-adapted-dimension", "text": "In order to establish an upper bound on the sample complexity, we will bound the fat-shattering dimension of the linear functions over a set in terms of the γ-adapted-dimension of the set. Recall that the fat-shattering dimension is a classic quantity for proving sample complexity upper bounds:\nDefinition 4.1. Let F be a set of functions f : X → R, and let γ > 0. The set {x1, . . . , xm} ⊆ X is γ-shattered by F if there exist r1, . . . , rm ∈ R such that for all y ∈ {±1}m there is an f ∈ F such that ∀i ∈ [m], yi(f(xi) − ri) ≥ γ. The γ-fat-shattering dimension of F is the size of the largest set in X that is γ-shattered by F .\nThe sample complexity of γ-loss minimization is bounded by Õ(dγ/8/ǫ2) were dγ/8 is the γ/8fat-shattering dimension of the function class [16, Theorem 13.4]. Let W(X ) be the class of linear functions restricted to the domain X . For any set we show: Theorem 4.2. If a set X is (B2, k)-limited, then the γ-fat-shattering dimension of W(X ) is at most 3 2 (B 2/γ2 + k + 1). Consequently, it is also at most 3kγ(X ) + 1.\nProof. Let X be a m × d matrix whose rows are a set of m points in Rd which is γ-shattered. For any ǫ > 0 we can augment X with an additional column to form the matrix X̃ of dimensions m× (d+1), such that for all y ∈ {−γ,+γ}m, there is a wy ∈ Bd+11+ǫ such that X̃wy = y (the details\ncan be found in the appendix). Since X is (B2, k)-limited, there is an orthogonal projection matrix P̃ of size (d + 1) × (d + 1) such that ∀i ∈ [m], ‖X̃ ′iP‖2 ≤ B2 where X̃i is the vector in row i of X̃ . Let Ṽ be the sub-space of dimension d− k spanned by the columns of P̃ . To bound the size of the shattered set, we show that the projected rows of X̃ on V are ‘shattered’ using projected labels. We then proceed similarly to the proof of the norm-only fat-shattering bound [17].\nWe have X̃ = X̃P̃ + X̃(I − P̃ ). In addition, X̃wy = y. Thus y − X̃P̃wy = X̃(I − P̃ )wy . I − P̃ is a projection onto a k + 1-dimensional space, thus the rank of X̃(I − P̃ ) is at most k + 1. Let T be an m × m orthogonal projection matrix onto the subspace orthogonal to the columns of X̃(I − P̃ ). This sub-space is of dimension at most l = m − (k + 1), thus trace(T ) = l. T (y − X̃P̃wy) = T X̃(I − P̃ )wy = 0(d+1)×1. Thus Ty = T X̃P̃wy for every y ∈ {−γ,+γ}m.\nDenote row i of T by ti and row i of T X̃P̃ by zi. We have ∀i ≤ m, 〈zi, w1y〉 = tiy =∑ j≤m ti[j]y[j]. Therefore 〈 ∑ i ziy[i], w 1 y〉 = ∑ i≤m ∑ j≤(l+k) ti[j]y[i]y[j]. Since ‖w1y‖ ≤ 1 + ǫ, ∀x ∈ Rd+1, (1 + ǫ)‖x‖ ≥ ‖x‖‖w1y‖ ≥ 〈x,w1y〉. Thus ∀y ∈ {−γ,+γ}m, (1 + ǫ)‖ ∑\ni ziy[i]‖ ≥∑ i≤m ∑ j≤m ti[j]y[i]y[j]. Taking the expectation of y chosen uniformly at random, we have\n(1 + ǫ)E[‖ ∑\ni\nziy[i]‖] ≥ ∑\ni,j\nE[ti[j]y[i]y[j]] = γ 2 ∑\ni\nti[i] = γ 2trace(T ) = γ2l.\nIn addition, 1γ2E[‖ ∑ i ziy[i]‖2] = ∑l\ni=1 ‖zi‖2 = trace(P̃ ′X̃ ′T 2X̃P̃ ) ≤ trace(P̃ ′X̃ ′X̃P̃ ) ≤ B2m. From the inequality E[X2] ≤ E[X ]2, it follows that l2 ≤ (1 + ǫ)2B2γ2 m. Since this holds for any ǫ > 0, we can set ǫ = 0 and solve for m. Thus m ≤ (k + 1) + B22γ2 + √ B4 4γ4 + B2 γ2 (k + 1) ≤\n(k + 1) + B 2 γ2 + √ B2 γ2 (k + 1) ≤ 32 (B 2 γ2 + k + 1).\nCorollary 4.3. Let D be a distribution over X × {±1}, X ⊆ Rd. Then\nm(ǫ, γ,D) ≤ Õ ( kγ/8(X )\nǫ2\n) .\nThe corollary above holds only for distributions with bounded support. However, since sub-Gaussian variables have an exponentially decaying tail, we can use this corollary to provide a bound for independently sub-Gaussian distributions as well (see appendix for proof): Theorem 4.4 (Upper Bound for Distributions in Dsgρ ). For any distribution D over Rd×{±1} such that DX ∈ Dsgρ ,\nm(ǫ, γ,D) = Õ( ρ2kγ(DX)\nǫ2 ).\nThis new upper bound is tighter than norm-only and dimension-only upper bounds. But does the γ-adapted-dimension characterize the true sample complexity of the distribution, or is it just another upper bound? To answer this question, we need to be able to derive sample complexity lower bounds as well. We consider this problem in following section."}, {"heading": "5 Sample complexity lower bounds using Gram-matrix eigenvalues", "text": "We wish to find a distribution-specific lower bound that depends on the γ-adapted-dimension, and matches our upper bound as closely as possible. To do that, we will link the ability to learn with a margin, with properties of the data distribution. The ability to learn is closely related to the probability of a sample to be shattered, as evident from Vapnik’s formulations of learnability as a function of the ǫ-entropy. In the preceding section we used the fact that non-shattering (as captured by the fat-shattering dimension) implies learnability. For the lower bound we use the converse fact, presented below in Theorem 5.1: If a sample can be fat-shattered with a reasonably high probability, then learning is impossible. We then relate the fat-shattering of a sample to the minimal eigenvalue of its Gram matrix. This allows us to present a lower-bound on the sample complexity using a lower bound on the smallest eigenvalue of the Gram-matrix of a sample drawn from the data distribution. We use the term ‘γ-shattered at the origin’ to indicate that a set is γ-shattered by setting the bias r ∈ Rm (see Def. 4.1) to the zero vector.\nTheorem 5.1. Let D be a distribution over Rd × {±1}. If the probability of a sample of size m drawn from DmX to be γ-shattered at the origin is at least η, then there is a margin-error minimization algorithm A, such that ℓm/2(Aγ , D) ≥ η/2.\nProof. For a given distribution D, let A be an algorithm which, for every two input samples S and S̃X , labels S̃X using the separator w ∈ argminw∈Bd\n1 ℓ̂γ(w, S) that maximizes ES̃Y ∈DmY [ℓ̂γ(w, S̃)].\nFor every x ∈ Rd there is a label y ∈ {±1} such that P(X,Y )∼D[Y 6= y | X = x] ≥ 12 . If the set of examples in SX and S̃X together is γ-shattered at the origin, then A chooses a separator with zero margin loss on S, but loss of at least 12 on S̃. Therefore ℓm/2(Aγ , D) ≥ η/2.\nThe notion of shattering involves checking the existence of a unit-norm separator w for each labelvector y ∈ {±1}m. In general, there is no closed form for the minimum-norm separator. However, the following Theorem provides an equivalent and simple characterization for fat-shattering:\nTheorem 5.2. Let S = (X1, . . . , Xm) be a sample in Rd, denoteX the m×dmatrix whose rows are the elements of S. Then S is 1-shattered iff X is invertible and ∀y ∈ {±1}m, y′(XX ′)−1y ≤ 1.\nThe proof of this theorem is in the appendix. The main issue in the proof is showing that if a set is shattered, it is also shattered with exact margins, since the set of exact margins {±1}m lies in the convex hull of any set of non-exact margins that correspond to all the possible labelings. We can now use the minimum eigenvalue of the Gram matrix to obtain a sufficient condition for fat-shattering, after which we present the theorem linking eigenvalues and learnability. For a matrix X , λn(X) denotes the n’th largest eigenvalue of X .\nLemma 5.3. Let S = (X1, . . . , Xm) be a sample in Rd, with X as above. If λm(XX ′) ≥ m then S is 1-shattered at the origin.\nProof. If λm(XX ′) ≥ m then XX ′ is invertible and λ1((XX ′)−1) ≤ 1/m. For any y ∈ {±1}m we have ‖y‖ = √m and y′(XX ′)−1y ≤ ‖y‖2λ1((XX ′)−1) ≤ m(1/m) = 1. By Theorem 5.2 the sample is 1-shattered at the origin.\nTheorem 5.4. Let D be a distribution over Rd×{±1},S be an i.i.d. sample of size m drawn from D, and denote XS the m× d matrix whose rows are the points from S. If P[λm(XSX ′S) ≥ mγ2] ≥ η, then there exists a margin-error minimization algorithm A such that ℓm/2(Aγ , D) ≥ η/2.\nTheorem 5.4 follows by scaling XS by γ, applying Lemma 5.3 to establish γ-fat shattering with probability at least η, then applying Theorem 5.1. Lemma 5.3 generalizes the requirement for linear independence when shattering using hyperplanes with no margin (i.e. no regularization). For unregularized (homogeneous) linear separation, a sample is shattered iff it is linearly independent, i.e. if λm > 0. Requiring λm > mγ2 is enough for γ-fat-shattering. Theorem 5.4 then generalizes the simple observation, that if samples of size m are linearly independent with high probability, there is no hope of generalizing from m/2 points to the other m/2 using unregularized linear predictors. Theorem 5.4 can thus be used to derive a distribution-specific lower bound. Define:\nmγ(D) , 1\n2 min\n{ m ∣∣∣∣ PS∼Dm [λm(XSX ′ S) ≥ mγ2] < 1\n2\n}\nThen for any ǫ < 1/4− ℓ∗γ(D), we can conclude that m(ǫ, γ,D) ≥ mγ(D), that is, we cannot learn within reasonable error with less than mγ examples. Recall that our upper-bound on the sample\ncomplexity from Section 4 was Õ(kγ). The remaining question is whether we can relate mγ and kγ , to establish that the our lower bound and upper bound tightly specify the sample complexity."}, {"heading": "6 A lower bound for independently sub-Gaussian distributions", "text": "As discussed in the previous section, to obtain sample complexity lower bound we require a bound on the value of the smallest eigenvalue of a random Gram-matrix. The distribution of this eigenvalue has been investigated under various assumptions. The cleanest results are in the case where m, d → ∞ and md → β < 1, and the coordinates of each example are identically distributed:\nTheorem 6.1 (Theorem 5.11 in [18]). Let Xi be a series of mi×di matrices whose entries are i.i.d. random variables with mean zero, variance σ2 and finite fourth moments. If limi→∞\nmi di = β < 1,\nthen limi→∞ λm( 1dXiX ′ i) = σ\n2(1−√β)2.\nThis asymptotic limit can be used to calculate mγ and thus provide a lower bound on the sample complexity: Let the coordinates of X ∈ Rd be i.i.d. with variance σ2 and consider a sample of size m. If d,m are large enough, we have by Theorem 6.1:\nλm(XX ′) ≈ dσ2(1− √ m/d)2 = σ2( √ d−√m)2\nSolving σ2( √ d −√2mγ)2 = 2mγγ2 we get mγ ≈ 12d/(1 + γ/σ)2. We can also calculate the γadapted-dimension for this distribution to get kγ ≈ d/(1+ γ2/σ2), and conclude that 14kγ ≤ mγ ≤ 1 2kγ . In this case, then, we are indeed able to relate the sample complexity lower bound with kγ , the same quantity that controls our upper bound. This conclusion is easy to derive from known results, however it holds only asymptotically, and only for a highly limited set of distributions. Moreover, since Theorem 6.1 holds asymptotically for each distribution separately, we cannot deduce from it any finite-sample lower bounds for families of distributions.\nFor our analysis we require finite-sample bounds for the smallest eigenvalue of a random Grammatrix. Rudelson and Vershynin [19, 20] provide such finite-sample lower bounds for distributions with identically distributed sub-Gaussian coordinates. In the following Theorem we generalize results of Rudelson and Vershynin to encompass also non-identically distributed coordinates. The proof of Theorem 6.2 can be found in the appendix. Based on this theorem we conclude with Theorem 6.3, stated below, which constitutes our final sample complexity lower bound.\nTheorem 6.2. Let ρ > 0. There is a constant β > 0 which depends only on B, such that for any δ ∈ (0, 1) there exists a number L0, such that for any independently sub-Gaussian distribution with covariance matrix Σ ≤ I and trace(Σ) ≥ L0, if each of its independent sub-Gaussian coordinates has relative moment ρ, then for any m ≤ β · trace(Σ)\nP[λm(XmX ′ m) ≥ m] ≥ 1− δ,\nWhere Xm is an m× d matrix whose rows are independent draws from DX . Theorem 6.3 (Lower bound for distributions in Dsgρ ). For any ρ > 0, there are a constant β > 0 and an integer L0 such that for any D such that DX ∈ Dsgρ and kγ(DX) > L0, for any margin γ > 0 and any ǫ < 14 − ℓ∗γ(D),\nm(ǫ, γ,D) ≥ βkγ(DX).\nProof. The covariance matrix of DX is clearly diagonal. We assume w.l.o.g. that Σ = diag(λ1, . . . , λd) where λ1 ≥ . . . ≥ λd > 0. Let S be an i.i.d. sample of size m drawn from D. Let X be the m× d matrix whose rows are the unlabeled examples from S. Let δ be fixed, and set β and L0 as defined in Theorem 6.2 for δ. Assume m ≤ β(kγ − 1). We would like to use Theorem 6.2 to bound the smallest eigenvalue of XX ′ with high probability, so that we can then apply Theorem 5.4 to get the desired lower bound. However, Theorem 6.2 holds only if all the coordinate variances are bounded by 1. Thus we divide the problem to two cases, based on the value of λkγ+1, and apply Theorem 6.2 separately to each case.\nCase I: Assume λkγ+1 ≥ γ2. Then ∀i ∈ [kγ ], λi ≥ γ2. Let Σ1 = diag(1/λ1, . . . , 1/λkγ , 0, . . . , 0). The random matrix X √ Σ1 is drawn from an independently sub-Gaussian distribution, such that each of its coordinates has sub-Gaussian relative moment ρ and covariance matrix Σ · Σ1 ≤ Id. In addition, trace(Σ ·Σ1) = kγ ≥ L0. Therefore Theorem 6.2 holds for X √ Σ1, and P[λm(XΣ1X ′) ≥ m] ≥ 1−δ. Clearly, for any X , λm( 1γ2XX ′) ≥ λm(XΣ1X ′). Thus P[λm( 1γ2XX ′) ≥ m] ≥ 1−δ. Case II: Assume λkγ+1 < γ\n2. Then λi < γ2 for all i ∈ {kγ + 1, . . . , d}. Let Σ2 = diag(0, . . . , 0, 1/γ2, . . . , 1/γ2), with kγ zeros on the diagonal. Then the random matrix X √ Σ2 is drawn from an independently sub-Gaussian distribution with covariance matrix Σ ·Σ2 ≤ Id, such that all its coordinates have sub-Gaussian relative moment ρ. In addition, from the properties of kγ (see discussion in Section 2), trace(Σ·Σ2) = 1γ2 ∑d i=kγ+1\nλi ≥ kγ−1 ≥ L0−1. Thus Theorem 6.2 holds for X √ Σ2, and so P[λm( 1γ2XX ′) ≥ m] ≥ P[λm(XΣ2X ′) ≥ m] ≥ 1− δ.\nIn both cases P[λm( 1γ2XX ′) ≥ m] ≥ 1− δ for any m ≤ β(kγ − 1). By Theorem 5.4, there exists an algorithm A such that for any m ≤ β(kγ − 1) − 1, ℓm(Aγ , D) ≥ 12 − δ/2. Therefore, for any ǫ < 12 − δ/2− ℓ∗γ(D), we have m(ǫ, γ,D) ≥ β(kγ − 1). We get the theorem by setting δ = 14 ."}, {"heading": "7 Summary and consequences", "text": "Theorem 4.4 and Theorem 6.3 provide an upper bound and a lower bound for the sample complexity of any distribution D whose data distribution is in Dsgρ for some fixed ρ > 0. We can thus draw the following bound, which holds for any γ > 0 and ǫ ∈ (0, 14 − ℓ∗γ(D)):\nΩ(kγ(DX)) ≤ m(ǫ, γ,D) ≤ Õ( kγ(DX)\nǫ2 ). (2)\nIn both sides of the bound, the hidden constants depend only on the constant ρ. This result shows that the true sample complexity of learning each of these distributions is characterized by the γadapted-dimension. An interesting conclusion can be drawn as to the influence of the conditional distribution of labels DY |X : Since Eq. (2) holds for any DY |X , the effect of the direction of the best separator on the sample complexity is bounded, even for highly non-spherical distributions. We can use Eq. (2) to easily characterize the sample complexity behavior for interesting distributions, and to compare L2 margin minimization to learning methods.\nGaps between L1 and L2 regularization in the presence of irrelevant features. Ng [3] considers learning a single relevant feature in the presence of many irrelevant features, and compares using L1 regularization and L2 regularization. When ‖X‖∞ ≤ 1, upper bounds on learning with L1 regularization guarantee a sample complexity of O(log(d)) for an L1-based learning rule [21]. In order to compare this with the sample complexity of L2 regularized learning and establish a gap, one must use a lower bound on the L2 sample complexity. The argument provided by Ng actually assumes scale-invariance of the learning rule, and is therefore valid only for unregularized linear learning. However, using our results we can easily establish a lower bound of Ω(d) for many specific distributions with ‖X‖∞ ≤ 1 and Y = X [1] ∈ {±1}. For instance, when each coordinate is an independent Bernoulli variable, the distribution is sub-Gaussian with ρ = 1, and k1 = ⌈d/2⌉. Gaps between generative and discriminative learning for a Gaussian mixture. Consider two classes, each drawn from a unit-variance spherical Gaussian in a high dimension Rd and with a large distance 2v >> 1 between the class means, such that d >> v4. Then PD[X |Y = y] = N (yv · e1, Id), where e1 is a unit vector in Rd. For any v and d, we have DX ∈ Dsg1 . For large values of v, we have extremely low margin error at γ = v/2, and so we can hope to learn the classes by looking for a large-margin separator. Indeed, we can calculate kγ = ⌈d/(1 + v 2\n4 )⌉, and conclude that the sample complexity required is Θ̃(d/v2). Now consider a generative approach: fitting a spherical Gaussian model for each class. This amounts to estimating each class center as the empirical average of the points in the class, and classifying based on the nearest estimated class center. It is possible to show that for any constant ǫ > 0, and for large enough v and d, O(d/v4) samples are enough in order to ensure an error of ǫ. This establishes a rather large gap of Ω(v2) between the sample complexity of the discriminative approach and that of the generative one.\nTo summarize, we have shown that the true sample complexity of large-margin learning of a rich family of specific distributions is characterized by the γ-adapted-dimension. This result allows true comparison between this learning algorithm and other algorithms, and has various applications, such as semi-supervised learning and feature construction. The challenge of characterizing true sample complexity extends to any distribution and any learning algorithm. We believe that obtaining answers to these questions is of great importance, both to learning theory and to learning applications."}, {"heading": "Acknowledgments", "text": "The authors thank Boaz Nadler for many insightful discussions, and Karthik Sridharan for pointing out [14] to us. Sivan Sabato is supported by the Adams Fellowship Program of the Israel Academy of Sciences and Humanities. This work was supported by the NATO SfP grant 982480."}, {"heading": "A Proofs for “Tight Sample Complexity of Large-Margin Learning” (S. Sabato, N. Srebro and N. Tishby)", "text": ""}, {"heading": "A.1 Proof of Lemma 3.3", "text": "Proof. The inequality kγ ≤ kαγ is trivial from the definition of kγ . For the other inequality, note first that we can always let EX∼DX [XX\n′] be diagonal by rotating the axes w.l.o.g. . Therefore kγ = min{k | ∑di=k+1 λi ≤ γ2k}. Since kγ ≤ kαγ , we have γ2kγ ≥ ∑d i=kγ+1 λi ≥ ∑d i=kαγ+1 λi. In addition, by the minimality of kαγ , ∑d\nkαγ λi > α\n2γ2(kαγ − 1). Thus ∑d\ni=kαγ+1 λi > α 2γ2(kαγ − 1)−λkαγ . Combining the inequalities we get γ2kγ > α2γ2(kαγ−1)−λkαγ . In addition, if kγ < kαγ then γ2kγ ≥ ∑d i=kαγ λi ≥ λkαγ . Thus, either kγ = kαγ or 2γ2kγ > α2γ2(kαγ − 1).\nA.2 Details omitted from the proof of Theorem 4.2\nThe proof of Theorem 4.2 is complete except for the construction of X̃ and P̃ in the first paragraph, which is disclosed here in full, using the following lemma:\nLemma A.1. Let S = (X1, . . . , Xm) be a sequence of elements in Rd, and let X be a m × d matrix whose rows are the elements of S. If S is γ-shattered, then for every ǫ > 0 there is a column vector r ∈ Rd such that for every y ∈ {±γ}m there is a wy ∈ Bd+11+ǫ such that X̃wy = y, where X̃ = (X r).\nProof. if S is γ-shattered then there exists a vector r ∈ Rd, such that for all y ∈ {±1}m there exists wy ∈ Bd1 such that for all i ∈ [m], yi(〈Xi, wy〉−ri) ≥ γ. For ǫ > 0 define w̃y = (wy , √ ǫ) ∈ B1+ǫ, and r̃ = r/ √ ǫ, and let X̃ = (X r̃). For every y ∈ {±1}m there is a vector ty ∈ Rm such that ∀i ∈ [m], 1γ ty[i]y[i] ≥ 1, and 1γ X̃w̃y = 1γ ty . As in the proof of necessity in Theorem 5.2, it follows that there exists ŵy ∈ B1+ǫ such that 1γ X̃ŵy = y. Scaling y by γ, we get the claim of the theorem.\nNow, Let X be a m × d matrix whose rows are a set of m points in Rd which is γ-shattered. By Lemma A.1, for any ǫ > 0 there exists matrix X̃ of dimensions m × (d + 1) such that the first d columns of X̃ are the respective columns of X , and for all y ∈ {pmγ}m, there is a wy ∈ Bd+11+ǫ such that X̃wy = y. Since X is (B2, k)-limited, there exists an orthogonal projection matrix P of size d × d and rank d − k such that ∀i ∈ [m], ‖X ′iP‖2 ≤ B2. Let P̃ be the embedding of P in a (d + 1) × (d + 1) zero matrix, so that P̃ is of the same rank and projects onto the same subspace. The rest of the proof follows as in the body of the paper."}, {"heading": "A.3 Proof of Theorem 4.4", "text": "Proof of Theorem 4.4. Let Σ = diag(λ1, . . . , λd) be the covariance matrix of DX , where ∀i ∈ [d− 1], λi ≥ λi−1. Define Xα = {x ∈ Rd | ∑d i=kγ (DX)+1 x[i]2 ≤ α}.\nLet {xi}mi=1 be an i.i.d. sample of size m drawn from DX . We will select α such that the probability that the whole sample is contained in Xα is large. P[∀i ∈ [m], xi ∈ Xα] = (1 − P[xi /∈ Xα])m. Let X ∼ DX . Then for all t > 0, P[X /∈ Xα] = P[ ∑d i=kγ+1\nX [i]2 ≥ α] ≤ E[exp(t\n∑d i=kγ+1 X [i]2)] exp(−tα).\nLet λmax = λkγ+1. Define Y ∈ Rd such that Y [i] = X [i] √ λmax λi . Then ∑d i=kγ+1 X [i]2 = ∑d i=kγ+1 λi λmax Y [i]2, and by the definition of kγ , ∑d i=kγ+1 λi λmax ≤ kγλmax . Thus, by Lemma A.2\nE[exp(t\nd∑\ni=kγ+1\nX [i]2)] ≤ max i (E[exp(3tY [i]2)])⌈kγ/λmax⌉.\nFor every i, Y [i] is a sub-Gaussian random variable with moment B = ρ √ λmax. By [12], Lemma 1.1.6, E[exp(3tY [i]2)] ≤ (1− 6ρ2λmaxt)− 12 , for t ∈ (0, (6ρ2λmax)−1). Setting t = 112ρ2λmax ,\nP[X /∈ Xα] ≤ 2kγ/λmax exp(− α\n12ρ2λmax ).\nThus there is a constant C such that for α(γ) , C · ρ2(kγ(DX) + λmax ln mδ ), P[X /∈ Xα(γ)] ≤ 1 − δ2m . Clearly, λmax ≤ kγ(DX), and kγ(Xα(γ)) ≤ α(γ). Therefore, from Theorem 4.2, the γ-fat-shattering dimension of W(Xα(γ)) is O(ρ2kγ(DX) ln mδ ). Define Dγ to be the distribution such that PDγ [(X,Y )] = PDX [(X,Y ) | X ∈ Xα(γ)]. By standard sample complexity bounds [16], for any distribution D over Rd × {±1}, with probability at least 1 − δ2 over samples, ℓm(A, D) ≤ Õ( √ F (γ/8,D) ln 1δ\nm ), where F (γ,D) is the γ-fat-shattering dimension of the class of linear functions\nwith domain restricted to the support of D in Rd. Consider Dγ/8. Since the support of Dγ/8 is Xα(γ/8), F (γ/8, Dγ/8) ≤ O(ρ2kγ/8(DX) ln mδ ). With probability 1 − δ over samples from DX , the sample is drawn from Dγ/8. In addition, the probability of the unlabeled example to be drawn from Xα(γ/8) is larger than 1− 1m . Therefore ℓm(A, D) ≤ Õ( √ ρ2kγ/8(DX ) ln m δ m ). Setting δ = ǫ/2 and bounding the expected error, we get m(ǫ, γ,D) ≤ Õ(ρ 2kγ/8(DX )\nǫ2 ). Lemma 3.3 allows replacing kγ/8 with O(kγ).\nLemma A.2. Let T1, . . . , Td be independent random variables such that all the moments E[T ni ] for all i are non-negative. Let λ1, . . . , λd be real coefficients such that ∑d i=1 λi = L, and λi ∈ [0, 1] for all i ∈ [d]. Then for all t ≥ 0\nE[exp(t\nd∑\ni=1\nλiTi)] ≤ max i∈[d] (E[exp(3tTi)]) ⌈L⌉.\nProof. Let Ti be independent random variables. Then, by Jensen’s inequality,\nE[exp(t\nd∑\ni=1\nλiTi)] =\nd∏\ni=1\nE[exp(tλiTi)] ≤ d∏\ni=1\nE[exp(tTi\nd∑\nj=1\nλj)]\nλi ∑d\nj=1 λj ≤ max\ni∈[d] E[exp(tTi\nd∑\nj=1\nλj)].\nNow, consider a partition Z1, . . . , Zk of [d], and denote Lj = ∑\ni∈Zj λi. Then by the inequality\nabove,\nE[exp(t d∑\ni=1\nλiTi)] = k∏\nj=1\nE[exp(t ∑\ni∈Zj\nλiTi)] ≤ k∏\nj=1\nmax i∈Zj E[exp(tTiLj)].\nLet the partition be such that for all j ∈ [k], Lj ≤ 1. There exists such a partition such that Lj < 12 for no more than one j. Therefore, for this partition L = ∑d i=1 λi = ∑ j∈[k] Lj ≥ 12 (k − 1). Thus k ≤ 2L+ 1. Now, consider E[exp(tTiLj)] for some i and j. For any random variable X\nE[exp(tX)] =\n∞∑\nn=0\ntnE[Xn]\nn! .\nTherefore, E[exp(tTiLj)] = ∑∞\nn=0\ntnLnj E[T n i ]\n(n)! . Since E[T n i ] ≥ 0 for all n, and Lj ≤ 1, it follows\nthat E[exp(tTiLj)] ≤ E[exp(tTi)]. Thus\nE[exp(t\nd∑\ni=1\nλiTi)] ≤ k∏\nj=1\nmax i∈Zj E[exp(tTi)] ≤ max i∈[d] E[exp(t\nk∑\nj=1\nTi[j])],\nwhere Ti[j] are independent copies of Ti.\nIt is easy to see that E[exp[ 1a ∑a i=1 Xi]] ≤ E[exp[ 1b ∑b\ni=1 Xi]], for a ≥ b and X1, . . . , Xa i.i.d. random variables. Since k ≥ ⌈L⌉ it follows that\nE[exp(t d∑\ni=1\nλiTi)] ≤ max i∈[d]\nE[exp(t k∑\nj=1\nTi[j])] ≤ max i∈[d]\nE[exp(t k\n⌈L⌉\n⌈L⌉∑\nj=1\nTi[j])].\nSince k ≤ 2L+ 1 and all the moments of Ti[j] are non-negative, it follows that\nE[exp(t d∑\ni=1\nλiTi)] ≤ max i∈[d]\nE[exp(t(2 + 1 ⌈L⌉ ) ⌈L⌉∑\nj=1\nTi[j])]."}, {"heading": "A.4 Proof of Theorem 5.2", "text": "the following lemma, which allows converting the representation of the Gram-matrix to a different feature space while keeping the separation properties intact. For a matrix M , M+ denotes its pseudo-inverse. If (M ′M) is invertible then M+ = (B′B)−1B′.\nLemma A.3. Let X be an m×d matrix such that XX ′ is invertible, and Y such that XX ′ = Y Y ′. Let r ∈ Rm be some real vector. If there exists a vector w̃ such that Y w̃ = r, then there exists a vector w such that Xw = r and ‖w‖ = ‖Pw̃‖, where P = Y ′Y ′+ = Y ′(Y Y ′)−1Y is the projection matrix onto the sub-space spanned by the rows of Y .\nProof. Denote K = XX ′ = Y Y ′. Set T = Y ′X ′+ = Y ′K−1X . Set w = T ′w̃. We have Xw = XT ′w̃ = XX ′K−1Y w̃ = Y w̃ = r. In addition, ‖w‖ = w′w = w̃′TT ′w̃. By definition of T , TT ′ = Y ′X ′+X+Y = Y ′K+Y = Y ′K−1Y = Y ′(Y Y ′)−1Y = Y ′Y ′+ = P. Since P is a projection matrix, we have P 2 = P . In addition, P = P ′. Therefore TT ′ = PP ′, and so ‖w‖ = w̃′PP ′w̃ = ‖Pw̃‖.\nThe next lemma will allow us to prove that if a set is shattered at the origin, it can be separated with the exact margin.\nLemma A.4. Let R = {ry ∈ Rm | y ∈ {±1}m} such that for all y ∈ {±1}m and for all i ∈ [m], ry[i]y[i] ≥ 1. Then ∀y ∈ {±1}m, y ∈ conv(R).\nProof. We will prove the claim by induction on the dimension m.\nInduction base: For m = 1, we have R = {(a), (b)} where a ≤ −1 and b ≥ 1. Clearly, convR = [a, b], and the two one-dimensional vectors (+1) and (−1) are in [a, b]. Induction step: For a vector t = (t[1], . . . , t[m]) ∈ Rm, denote by t̄ its projection (t[1], . . . , t[m− 1]) on Rm−1. Similarly, for a set of vectors S ⊆ Rm, let S̄ = {s̄ | s ∈ S} ⊆ Rm−1. Define\nY+ = {y ∈ {±1}m | y[m] = +1} Y− = {y ∈ {±1}m | y[m] = −1}.\nLet R+ = {ry | y ∈ Y+}, and similarly for R−. Then R̄+ and R̄− satisfy the assumptions for R when m− 1 is substituted for m. Let y∗ ∈ {±1}m. We wish to prove y∗ ∈ conv(R). From the induction hypothesis we have ȳ∗ ∈ conv(R̄+) and ȳ∗ ∈ conv(R̄−). Thus\nȳ∗ = ∑\ny∈Y+\nαy r̄y = ∑\ny∈Y −\nβy r̄y ,\nwhere αy, βy ≥ 0, ∑\ny∈Y+ αy = 1, and ∑ y∈Y − βy = 1. Let y∗a = ∑ y∈Y+ αyry and y∗b =∑\ny∈Y − αyry . We have that ∀y ∈ Y+, ry[m] ≥ 1, and ∀y ∈ Y−, ry[m] ≤ −1. Therefore, y∗a[m] ≥ 1 and y∗b [m] ≤ −1. In addition, ȳ∗a = ȳ∗b = ȳ. Hence there is γ ∈ [0, 1] such that y∗ = γy∗a+(1−γ)y∗b . Since y∗a ∈ conv(R+) and y∗b ∈ conv(R−), we have y∗ ∈ conv(R).\nProof of Theorem 5.2. Let XX ′ = UΛU ′ be the SVD of XX ′, where U is an orthogonal matrix and Λ is a diagonal matrix. Let Y = UΛ 1 2 . We have XX ′ = Y Y ′. We show that the conditions are sufficient and necessary for the shattering of S.\nSufficient: Assume XX ′ is invertible. Then Λ is invertible, thus Y is invertible. For any y ∈ {±1}m, Let w̃ = Y −1y. We have Y w̃ = y. In addition, ‖w̃‖2 = y′(Y Y ′)−1y = y′(XX ′)−1y ≤ 1. Therefore, by Lemma A.3, there exists a separator w such that Xw = y and ‖w‖ = ‖Pw̃‖ = ‖w̃‖. Necessary: If XX ′ is not invertible then the vectors in S are linearly dependent, thus by standard VC-theory [16] S cannot be shattered using linear separators. The first condition is therefore necessary. We assume S is 1-shattered at the origin and show that the second condition necessarily holds. Let L = {r | ∃w ∈ Bd1, Xw = r}. Since S is shattered, For any y ∈ {±1}m there exists ry ∈ L such that ∀i ∈ [m], ry[i]y[i] ≥ 1. By Lemma A.4, ∀y ∈ {±1}m, y ∈ conv(R) where R = {ry | y ∈ {±1}m}. Since L is convex and R ⊆ L, conv(R) ⊆ L. Thus for all y ∈ {±1}m, y ∈ L, that is there exists wy ∈ Rm such that Xwy = y and ‖wy‖ ≤ 1. From Lemma A.3 we thus have w̃y such that Y w̃y = y and ‖w̃y‖ = ‖Pwy‖ ≤ ‖wy‖ ≤ 1. Y is invertible, hence w̃y = Y −1y. Thus y′(XX ′)−1y = y′(Y Y ′)−1y = ‖w̃y‖ ≤ 1."}, {"heading": "A.5 Proof of Theorem 6.2", "text": "In the proof of Theorem 6.2 we use the fact λm(XX ′) = inf‖x‖2=1 ‖X ′x‖2 and bound the righthand side via an ǫ-net of the unit sphere in Rm, denoted by Sm−1 , {x ∈ Rm | ‖x‖2 = 1}. An ǫ-net of the unit sphere is a set C ⊆ Sm−1 such that ∀x ∈ Sm−1, ∃x′ ∈ C, ‖x − x′‖ ≤ ǫ. Denote the minimal size of an ǫ-net for Sm−1 by Nm(ǫ), and by Cm(ǫ) a minimal ǫ-net of Sm−1, so that Cm(ǫ) ⊆ Sm−1 and |Cm(ǫ)| = Nm(ǫ). The proof of Theorem 6.2 requires several lemmas. First we prove a concentration result for the norm of a matrix defined by sub-Gaussian variables. Then we bound the probability that the squared norm of a vector is small.\nLemma A.5. Let Y be a d × m matrix with m ≤ d, such that Yij are independent sub-Gaussian variables with moment B. Let Σ be a diagonal d × d PSD matrix such that Σ ≤ I . Then for all t ≥ 0 and ǫ ∈ (0, 1),\nP[‖ √ ΣY ‖ ≥ t] ≤ Nm(ǫ) exp(\ntr(Σ) 2 − t 2(1− ǫ)2 4B2 ).\nProof. We have ‖ √ ΣY ‖ ≤ maxx∈Cm(ǫ) ‖ √ ΣY x‖/(1− ǫ), see for instance in [22]. Therefore,\nP[‖ √ ΣY ‖ ≥ t] ≤ ∑\nx∈Cm(ǫ)\nP[‖ √ ΣY x‖ ≥ (1− ǫ)t]. (3)\nFix x ∈ Cm(ǫ). Let V = √ ΣY x, and assume Σ = diag(λ1, . . . , λd). For u ∈ Rd,\nE[exp(〈u, V 〉)] = E[exp( ∑\ni∈[d]\nui √ λi ∑\nj∈[m]\nYijxj)] = ∏\nj,i\nE[exp(ui √ λiYijxj)]\n≤ ∏\nj,i\nexp(u2iλiB 2x2j/2) = exp(\nB2\n2\n∑\ni∈[d]\nu2iλi ∑\nj∈[m]\nx2j )\n= exp( B2\n2\n∑\ni∈[d]\nu2iλi) = exp(〈B2Σu, u〉/2).\nLet s = 1/(4B2). Since Σ ≤ I , we have s ≤ 1/(4B2maxi∈[d] λi). Therefore, by Lemma A.9 (see Section A.6), E[exp(s‖V ‖2)] ≤ exp(2sB2tr(Σ)). By Chernoff’s method, P[‖V ‖2 ≥ z2] ≤ E[exp(s‖V ‖2)]/ exp(sz2). Thus\nP[‖V ‖2 ≥ z2] ≤ exp(2sB2tr(Σ)− sz2) = exp( tr(Σ) 2 − z 2 4B2 ).\nSet z = t(1− ǫ). Then for all x ∈ Sm−1\nP[‖ √ ΣY x‖ ≥ t(1− ǫ)] = P[‖V ‖ ≥ t(1− ǫ)] ≤ exp( tr(Σ)\n2 − t 2(1− ǫ)2 4B2 ).\nTherefore, by Eq. (3),\nP[‖ √ ΣY ‖ ≥ t] ≤ Nm(ǫ) exp(\ntr(Σ) 2 − t 2(1− ǫ)2 4B2 ).\nLemma A.6. Let Y be a d×m matrix with m ≤ d, such that Yij are independent centered random variables with variance 1 and fourth moments at most B. Let Σ be a diagonal d×d PSD matrix such that Σ ≤ I . There exist α > 0 and η ∈ (0, 1) that depend only on B such that for any x ∈ Sm−1\nP[‖ √ ΣY x‖2 ≤ α · (tr(Σ)− 1)] ≤ ηtr(Σ).\nTo prove Lemma A.6 we require Lemma A.7 [20, Lemma 2.2] and Lemma A.8, which extends Lemma 2.6 in the same work.\nLemma A.7. Let T1, . . . , Tn be independent non-negative random variables. Assume that there are θ > 0 and µ ∈ (0, 1) such that for any i, P[Ti ≤ θ] ≤ µ. There are α > 0 and η ∈ (0, 1) that depend only on θ and µ such that P[ ∑n i=1 Ti < αn] ≤ ηn. Lemma A.8. Let Y be a d ×m matrix with m ≤ d, such that the columns of Y are i.i.d. random vectors. Assume further that Yij are centered, and have a variance of 1 and a fourth moment at most B. Let Σ be a diagonal d × d PSD matrix. Then for all x ∈ Sm−1, P[‖ √ ΣY x‖ ≤ √ tr(Σ)/2] ≤ 1− 1/(196B).\nProof. Let x ∈ Sm−1, and Ti = ( ∑m j=1 Yijxj) 2. Let λ1, . . . , λd be the values on the diagonal of Σ, and let TΣ = ‖ √ ΣY x‖2 = ∑di=1 λiTi. First, since E[Yij ] = 0 and E[Yij ] = 1 for all i, j, we\nhave E[Ti] = ∑ i∈[m] x 2 jE[Y 2 ij ] = ‖x‖2 = 1. Therefore E[TΣ] = tr(Σ). Second, since Yi1, . . . , Yim are independent and centered, we have [23, Lemma 6.3]\nE[T 2i ] = E[( ∑\nj∈[m]\nYijxj) 4] ≤ 16Eσ[(\n∑\nj∈[m]\nσjYijxj) 4],\nwhere σ1, . . . , σm are independent uniform {±1} variables. Now, by Khinchine’s inequality [24], Eσ[( ∑\nj∈[m]\nσjYijxj) 4] ≤ 3E[(\n∑\nj∈[m]\nY 2ijx 2 j )\n2] = 3 ∑\nj,k∈[m]\nx2jx 2 kE[Y 2 ij ]E[Y 2 ik].\nNow E[Y 2ij ]E[Y 2 ik] ≤ √ E[Y 4ij ]E[Y 4 ik] ≤ B. Thus E[T 2i ] ≤ 48B ∑ j,k∈[m] x 2 jx 2 k = 48B‖x‖4 = 48B. Thus,\nE[T 2Σ] = E[(\nd∑\ni=1\nλiTi) 2] =\nd∑\ni,j=1\nλiλjE[TiTj]\n≤ d∑\ni,j=1\nλiλj √ E[T 2i ]E[T 2 j ] ≤ 48B( d∑\ni=1\nλi) 2 = 48B · tr(Σ)2.\nBy the Paley-Zigmund inequality [25], for θ ∈ [0, 1]\nP[TΣ ≥ θE[TΣ]] ≥ (1 − θ)2 E[TΣ]\n2 E[T 2Σ] ≥ (1− θ) 2 48B .\nTherefore, setting θ = 1/2, we get P[TΣ ≤ tr(Σ)/2] ≤ 1− 1/(196B).\nProof of Lemma A.6. Let λ1, . . . , λd ∈ [0, 1] be the values on the diagonal ofΣ. Consider a partition Z1, . . . , Zk of [d], and denote Lj = ∑ i∈Zj\nλi. There exists such a partition such that for all j ∈ [k], Lj ≤ 1, and for all j ∈ [k − 1], Lj > 12 . Let Σ[j] be the sub-matrix of Σ that includes the rows and columns whose indexes are in Zj . Let Y [j] be the sub-matrix of Y that includes the rows in Zj . Denote Tj = ‖ √ Σ[j]Y [j]x‖2. Then\n‖ √ ΣY x‖2 = ∑\nj∈[k]\n∑\ni∈Zj\nλi(\nm∑\nj=1\nYijxj) 2 =\n∑\nj∈[k]\nTj .\nWe have tr(Σ) = ∑d i=1 λi ≥ ∑\nj∈[k−1] Lj ≥ 12 (k − 1). In addition, Lj ≤ 1 for all j ∈ [k]. Thus tr(Σ) ≤ k ≤ 2tr(Σ) + 1. For all j ∈ [k − 1], Lj ≥ 12 , thus by Lemma A.8, P[Tj ≤ 1/4] ≤ 1 − 1/(196B). Therefore, by Lemma A.7 there are α > 0 and η ∈ (0, 1) that depend only on B such that\nP[‖ √ ΣY x‖2 < α · (tr(Σ)− 1)] ≤ P[‖ √ ΣY x‖2 < α(k − 1)]\n= P[ ∑\nj∈[k]\nTj < α(k − 1)] ≤ P[ ∑\nj∈[k−1]\nTj < α(k − 1)] ≤ ηk−1 ≤ η2tr(Σ).\nThe lemma follows by substituting η for η2.\nProof of Theorem 6.2. We have √ λm(XX ′) = inf\nx∈Sm−1 ‖X ′x‖ ≥ min x∈Cm(ǫ) ‖X ′x‖ − ǫ‖X ′‖. (4)\nFor brevity, denote L = tr(Σ). Assume L ≥ 2. Let m ≤ L ·min(1, (c −Kǫ)2) where c,K, ǫ are constants that will be set later such that c−Kǫ > 0. By Eq. (4)\nP[λm(XX ′) ≤ m] ≤ P[λm(XX ′) ≤ (c−Kǫ)2L]\n≤ P[ min x∈Cm(ǫ)\n‖X ′x‖ − ǫ‖X ′‖ ≤ (c−Kǫ) √ L] (5)\n≤ P[‖X ′‖ ≥ K √ L] + P[ min\nx∈Cm(ǫ) ‖X ′x‖ ≤ c\n√ L]. (6)\nThe last inequality holds since the inequality in line (5) implies at least one of the inequalities in line (6). We will now upper-bound each of the terms in line (6). We assume w.l.o.g. that Σ is not singular (since zero rows and columns can be removed fromX without changingλm(XX ′)). Define Y , √ Σ−1X ′. Note that Yij are independent sub-Gaussian variables with (absolute) moment ρ. To bound the first term in line (6), note that by Lemma A.5, for any K > 0,\nP[‖X ′‖ ≥ K √ L] = P[‖ √ ΣY ‖ ≥ K √ L] ≤ Nm( 1\n2 ) exp(L(\n1 2 − K\n2\n16ρ2 )).\nBy [19], Proposition 2.1, for all ǫ ∈ [0, 1], Nn(ǫ) ≤ 2m(1 + 2ǫ )m−1. Therefore\nP[‖X ′‖ ≥ K √ L] ≤ 2m5m−1 exp(L(1\n2 − K\n2\n16ρ2 )).\nLet K2 = 16ρ2(32 + ln(5) + ln(2/δ)). Recall that by assumption m ≤ L, and L ≥ 2. Therefore\nP[‖X ′‖ ≥ K √ L] ≤ 2m5m−1 exp(−L(1 + ln(5) + ln(2/δ)))\n≤ 2L5L−1 exp(−L(1 + ln(5) + ln(2/δ))). Since L ≥ 2, we have 2L exp(−L) ≤ 1. Therefore\nP[‖X ′‖ ≥ K √ L] ≤ 2L exp(−L− ln(2/δ)) ≤ exp(− ln(2/δ)) = δ\n2 . (7)\nTo bound the second term in line (6), since Yij are sub-Gaussian with moment ρ, E[Y 4ij ] ≤ 5ρ4 [12, Lemma 1.4]. Thus, by Lemma A.6, there are α > 0 and η ∈ (0, 1) that depend only on ρ such that for all x ∈ Sm−1, P[‖ √ ΣY x‖2 ≤ α(L − 1)] ≤ ηL. Set c = √ α/2. Since L ≥ 2, we have c √ L ≤ √ α(L − 1). Thus\nP[ min x∈Cm(ǫ)\n‖X ′x‖ ≤ c √ L] ≤ ∑\nx∈Cm(ǫ)\nP[‖X ′x‖ ≤ c √ L]\n≤ ∑\nx∈Cm(ǫ)\nP[‖ √ ΣY x‖ ≤ √ α(L − 1)] ≤ Nm(ǫ)ηL.\nLet ǫ = c/(2K), so that c − Kǫ > 0. Let θ = min(12 , ln(1/η) 2 ln(1+2/ǫ) ). Set L◦ such that ∀L ≥ L◦, L ≥ 2 ln(2/δ)+2 ln(L)ln(1/η) . For L ≥ L◦ and m ≤ θL ≤ L/2,\nNm(ǫ)ηL ≤ 2m(1 + 2/ǫ)m−1ηL ≤ L exp(L(θ ln(1 + 2/ǫ)− ln(1/η))) = exp(ln(L) + L(θ ln(1 + 2/ǫ)− ln(1/η)/2)− L ln(1/η)/2) ≤ exp(L(θ ln(1 + 2/ǫ)− ln(1/η)/2) + ln(δ/2)) (8)\n≤ exp(ln(δ/2)) = δ 2 . (9)\nLine (8) follows from L ≥ L◦, and line (9) follows from θ ln(1 + 2/ǫ) − ln(1/η)/2 ≤ 0. Set β = min{(c − Kǫ)2, 1, θ}. Combining Eq. (6), Eq. (7) and Eq. (9) we have that if L ≥ L̄ , max(L◦, 2), then P[λm(XX ′) ≤ m] ≤ δ for all m ≤ βL. Specifically, this holds for all L ≥ 0 and for all m ≤ β(L − L̄). Letting C = βL̄ and substituting δ for 1 − δ we get the statement of the theorem."}, {"heading": "A.6 Lemma A.9", "text": "Lemma A.9. Let X ∈ Rd be a random vector and let B be a PSD matrix such that for all u ∈ Rd, E[exp(〈u, V 〉)] ≤ exp(〈Bu, u〉/2).\nThen for all t ∈ (0, 14λ1(B) ], E[exp(t‖X‖ 2)] ≤ exp(2t · trace(B)).\nProof of Lemma A.9. It suffices to consider diagonal moment matrices: If B is not diagonal, let V ∈ Rd×d be an orthogonal matrix such that V BV ′ is diagonal, and let Y = V X . We have E[exp(t‖Y ‖2)] = E[exp(t‖X‖2)] and tr(V BV ′) = tr(B). In addition, for all u ∈ Rd,\nE[exp(〈u, Y 〉)] = E[exp(〈V ′u,X〉)] ≤\nexp( 1 2 〈BV ′u, V ′u〉) = exp(1 2 〈V BV ′u, u〉).\nThus assume w.l.o.g. that B = diag(λ1, . . . , λd) where λ1 ≥ . . . ≥ λd ≥ 0. We have exp(t‖X‖2) = ∏i∈[d] exp(tX [i]2). In addition, for any t > 0 and x ∈ R, 2 √ Πt · exp(tx2) = ∫∞ −∞ exp(sx− s24t )ds. Therefore, for any u ∈ Rd,\n(2 √ Πt)d · E[exp(t‖X‖2)] = E  ∏\ni∈[d]\n∫ ∞\n−∞\nexp(u[i]X [i]− u[i] 2\n4t )du[i]\n \n= E\n  ∫ ∞\n−∞\n. . .\n∫ ∞\n−∞\n∏\ni∈[d]\nexp(u[i]X [i]− u[i] 2\n4t )du[i]\n \n= E\n  ∫ ∞\n−∞\n. . .\n∫ ∞\n−∞\nexp(〈u,X〉 − ‖u‖ 2 4t ) ∏\ni∈[d]\ndu[i]\n \n=\n∫ ∞\n−∞\n. . .\n∫ ∞\n−∞\nE[exp(〈u,X〉)] exp(−‖u‖ 2 4t ) ∏\ni∈[d]\ndu[i]\nBy the sub-Gaussianity of X , the last expression is bounded by\n≤ ∫ ∞\n−∞\n. . .\n∫ ∞\n−∞\nexp( 1 2 〈Bu, u〉 − ‖u‖ 2 4t ) ∏\ni∈[d]\ndu[i]\n=\n∫ ∞\n−∞\n. . .\n∫ ∞\n−∞\n∏\ni∈[d]\nexp( λiu[i]\n2\n2 − u[i]\n2\n4t )du[i]\n= ∏\ni∈[d]\n∫ ∞\n−∞\nexp(u[i]2( λi 2 − 1 4t ))du[i] = Πd/2\n( ∏\ni∈[d]\n( 1 4t − λi 2 ) )− 1 2 .\nThe last equality follows from the fact that for any a > 0, ∫∞ −∞ exp(−a · s2)ds = √ Π/a, and from\nthe assumption t ≤ 14λ1 . We conclude that\nE[exp(t‖X‖2)] ≤ ( ∏\ni∈[d]\n(1− 2λit))− 1 2 ≤ exp(2t ·\nd∑\ni=1\nλi) = exp(2t · tr(B)),\nwhere the second inequality holds since ∀x ∈ [0, 1], (1− x/2)−1 ≤ exp(x)."}], "references": [], "referenceMentions": [], "year": 2017, "abstractText": "We obtain a tight distribution-specific characterization of the sample complex-<lb>ity of large-margin classification with L2 regularization: We introduce the<lb>γ-adapted-dimension, which is a simple function of the spectrum of a distribu-<lb>tion’s covariance matrix, and show distribution-specific upper and lower bounds<lb>on the sample complexity, both governed by the γ-adapted-dimension of the<lb>source distribution. We conclude that this new quantity tightly characterizes the<lb>true sample complexity of large-margin classification. The bounds hold for a rich<lb>family of sub-Gaussian distributions.", "creator": "LaTeX with hyperref package"}}}