{"id": "1101.4170", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "21-Jan-2011", "title": "The Role of Normalization in the Belief Propagation Algorithm", "abstract": "An important part of problems in statistical physics and computer science can be expressed as the computation of marginal probabilities over a Markov Random Field. The belief propagation algorithm, which is an exact procedure to compute these marginals when the underlying graph is a tree, has gained its popularity as an efficient way to approximate them in the more general case. In this paper, we focus on an aspect of the algorithm that did not get that much attention in the literature, which is the effect of the normalization of the messages. We show in particular that, for a large class of normalization strategies, it is possible to focus only on belief convergence. Following this, we express the necessary and sufficient conditions for local stability of a fixed point in terms of the graph structure and the beliefs values at the fixed point. We also explicit some connexion between the normalization constants and the underlying Bethe Free Energy.", "histories": [["v1", "Fri, 21 Jan 2011 16:11:05 GMT  (23kb)", "http://arxiv.org/abs/1101.4170v1", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["victorin martin", "jean-marc lasgouttes", "cyril furtlehner"], "accepted": false, "id": "1101.4170"}, "pdf": {"name": "1101.4170.pdf", "metadata": {"source": "CRF", "title": null, "authors": [], "emails": [], "sections": [{"heading": null, "text": "ar X\niv :1\n10 1.\n41 70\nv1 [\ncs .L\nG ]"}, {"heading": "1 Introduction", "text": "We are interested in this article in a random Markov field on a finite graph with local interactions, on which we want to compute marginal probabilities. The structure of the underlying model is described by a set of discrete variables x = {xi, i ∈ V} ∈ {1, . . . , q}\nV, where the set V of variables is linked together by so-called “factors” which are subsets a ⊂ V of variables. If F is this set of factors, we consider the set of probability measures of the form\np(x) = ∏\ni∈V\nφi(xi) ∏\na∈F\nψa(xa), (1.1)\n∗This work was supported by the French National Research Agency (ANR) grant Travesti (ANR-08-SYSC-017)\nwhere xa = {xi, i ∈ a}.\nF together with V define the factor graph G (Kschischang et al., 2001), that is an undirected bipartite graph, which will be assumed to be connected. We will also assume that the functions ψa are never equal to zero, which is to say that the Markov random field exhibits no deterministic behavior. The set E of edges contains all the couples (a, i) ∈ F × V such that i ∈ a. We denote da (resp. di) the degree of the factor node a (resp. of the variable node i), and C the number of independent cycles of G.\nExact procedures to compute marginal probabilities of p generally face an exponential complexity problem and one has to resort to approximate procedures. The Bethe approximation, which is used in statistical physics, consists in minimizing an approximate version of the variational free energy associated to (1.1). In computer science, the belief propagation (BP) algorithm (Pearl, 1988) is a message passing procedure that allows to compute efficiently exact marginal probabilities when the underlying graph is a tree. When the graph has cycles, it is still possible to apply the procedure, which converges with a rather good accuracy on sufficiently sparse graphs. However, there may be several fixed points, either stable or unstable. It has been shown that these fixed points coincide with stationary points of the Bethe free energy (Yedidia et al., 2005). In addition (Heskes, 2003; Watanabe and Fukumizu, 2009), stable fixed points of BP are local minima of the Bethe free energy. We will come back to this variational point of view of the BP algorithm in Section 6.\nWe discuss in this paper an aspect of the algorithm that did not get that much attention in the literature, which is the effect of the normalization of the messages on the behavior of the algorithm. Indeed, the justification for normalization is generally that it “improves convergence”. Moreover, different authors use different schemes, without really explaining what are the difference between these definitions.\nThe paper is organized as follows: the BP algorithm and its various normalization strategies are defined in Section 2. Section 3 deals with the effect of different types of messages normalization on the existence of fixed points. Section 4 is dedicated to the dynamic of the algorithm in terms of beliefs and cases where convergence of messages is equivalent to convergence of beliefs; moreover, it is shown that normalization does not change belief dynamic. In Section 5, we show that normalization is required for convergence of the messages, and provide some sufficient conditions. Finally, in Section 6, we tackle the issue of normalization in the variational problem associated to Bethe approximation. New research directions are proposed in Section 7."}, {"heading": "2 The belief propagation algorithm", "text": "The belief propagation algorithm (Pearl, 1988) is a message passing procedure, which output is a set of estimated marginal probabilities, the beliefs ba(xa) (including single nodes beliefs bi(xi)). The idea is to factor the marginal probability at a given site as a product of contributions coming from neighboring factor nodes, which are the messages. With definition (1.1) of the joint probability measure, the updates rules read:\nma→i(xi) ← ∑\nxa\\i\nψa(xa) ∏\nj∈a\\i\nnj→a(xj), (2.1)\nni→a(xi) def = φi(xi)\n∏\na′∋i,a′ 6=a\nma′→i(xi), (2.2)\nwhere the notation ∑\nxs should be understood as summing all the variables\nxi, i ∈ s ⊂ V, from 1 to q. At any point of the algorithm, one can compute the current beliefs as\nbi(xi) def =\n1\nZi(m) φi(xi)\n∏\na∋i\nma→i(xi), (2.3)\nba(xa) def =\n1\nZa(m) ψa(xa)\n∏\ni∈a\nni→a(xi), (2.4)\nwhere Zi(m) and Za(m) are the normalization constants that ensure that\n∑\nxi\nbi(xi) = 1, ∑\nxa\nba(xa) = 1. (2.5)\nThese constants reduce to 1 when G is a tree. In practice, the messages are often normalized so that\nq∑\nxi=1\nma→i(xi) = 1. (2.6)\nHowever, the possibilities of normalization are not limited to this setting. Consider the mapping\nΘai,xi(m) def =\n∑\nxa\\i\nψa(xa) ∏\nj∈a\\i\n[ φj(xj) ∏\na′∋j,a′ 6=a\nma′→j(xj)\n] . (2.7)\nA normalized version of BP is defined by the update rule\nm̃a→i(xi) ← Θai,xi(m̃)\nZai(m̃) . (2.8)\nwhere Zai(m̃) is a constant that depends on the messages and which, in the case of (2.6), reads\nZmessai (m̃) def =\nq∑\nx=1\nΘai,x(m̃). (2.9)\nIn the remaining of this paper, (2.1,2.2) will be referred to as “plain BP” algorithm, to differentiate it from the “normalized BP” of (2.8).\nFollowing Wainwright (2002), it is worth noting that the plain message update scheme can be rewritten as\nma→i(xi) ← Za(m)bi|a(xi)\nZi(m)bi(xi) ma→i(xi), (2.10)\nwhere we use the convenient shorthand notation\nbi|a(xi) def =\n∑\nxa\\i\nba(xa).\nThis suggests a different type of normalization, used in particular by Heskes (2003), namely\nZbelai (m̃) = Za(m̃)\nZi(m̃) , (2.11)\nwhich leads to the simple update rule\nm̃a→i(xi) ← bi|a(xi)\nbi(xi) m̃a→i(xi). (2.12)\nThe following lemma recapitulates some properties shared by all normalization strategies at a fixed point.\nLemma 2.1. Let m̃ be such that\nm̃a→i(xi) = Θai,xi(m̃)\nZai(m̃) .\nThe associated normalization constants satisfy\nZai(m̃) = Za(m̃)\nZi(m̃) , ∀ai ∈ E, (2.13)\nand the following compatibility condition holds.\n∑\nxa\\i\nba(xa) = bi(xi). (2.14)\nIn particular, when Zai ≡ 1 (no normalization), all the Za and Zi are equal to some common constant Z.\nProof. The normalized update rule (2.8), together with (2.3)–(2.4), imply\n∑\nxa\\xi\nba(xa) = ZiZai Za bi(xi).\nBy definition of Za and Zi, ba and bi are normalized to 1, so summing this relation w.r.t xi gives (2.13) and the equation above reduces to (2.14).\nIt is known (Yedidia et al., 2005) that the belief propagation algorithm is an iterative way of solving a variational problem, namely it minimizes over b the Bethe free energy F (b) associated with (1.1).\nF (b) def =\n∑\na,xa\nba(xa) log ba(xa) ψa(xa) + ∑\ni,xi\nbi(xi) log bi(xi)\n1−di\nφi(xi) . (2.15)\nWriting the Lagrangian of the minimization of (2.15) with b subject to the constraints (2.14) and (2.5), one obtains\nL(b, λ, γ) = F (b)+ ∑\ni,a∋i xi\nλai(xi) ( bi(xi)− ∑\nxa/xi\nba(xa) ) − ∑\ni\nγi\n(∑\nxi\nbi(xi)−1 ) .\nThe minima are stationary points of L(b, λ, γ) which correspond to\n   ba(xa) = ψa(xa) e ∏ j∈a ∏ b∋j,b6=a mb→j(xj), ∀a ∈ F bi(xi) = φi(xi) exp( 1\ndi − 1 − γi)\n∏\nb∋i\nma→i(xi), ∀i ∈ V\nwith the (invertible) parametrization\nλai(xi) = log ∏\nb∋i,b6=a\nmb→i(xi),\nEnforcing constraints (2.14) yields the BP fixed points equations with normalization terms γi. We will return to this variational setting in Section 6."}, {"heading": "3 Normalization and existence of fixed points", "text": "We discuss here an aspect of the algorithm that did not get that much attention in the literature, which is the equivalence of the fixed points of the normalized and plain BP flavors.\nIt is not immediate to check that the normalized version of the algorithm does not introduce new fixed points, that would therefore not correspond to true stationary points of the Bethe free energy. We show in Theorem 3.2\nthat the sets of fixed points are equivalent, except possibly when the graph G has one unique cycle.\nAs pointed out by Mooij and Kappen (2007), many different sets of messages can correspond to the same set of beliefs. The following lemma shows that the set of messages leading to the same beliefs is simply constructed through linear mappings.\nLemma 3.1. Two set of messages m and m′ lead to the same beliefs if, and only if, there is a set of strictly positive constants cai such that\nm′a→i(xi) = caima→i(xi).\nProof. The direct part of the lemma is trivial. Concerning the other part, we have from (2.3) and (2.4)\nba(xa)Za(m)\nψa(xa) =\n∏\nj∈a\n∏\nb∋j,b6=a\nmb→j(xj)\nbi(xi)Zi(m)\nφi(xi) =\n∏\na∋i\nma→i(xi).\nAssume the two vectors of messages m and m′ lead to the same set of beliefs b and write ma→i(xi) = cai,xi m ′ a→i(xi). Then, from the relation on bi, the vector c satisfies\n∏\na∋i\ncai,xi = ∏\na∋i\nma→i(xi) m′a→i(xi) = Zi(m) Zi(m′) def = vi. (3.1)\nMoreover, we want to preserve the beliefs ba. Using (3.1), we have\n∏\nj∈a\nma→j(xj) m′a→j(xj) =\n∏\nj∈a\ncaj,xj = Za(m\n′)\nZa(m)\n∏\ni∈a\nvi def = va, (3.2)\nSince vi (resp. va) does not depend on the choice of xi (resp. xa), (3.2) implies the independence of cai,xi with respect to xi. Indeed, if we compare two vectors xa and x ′ a such that, for all i ∈ a \\ j, x ′ i = xi, but x ′ j 6= xj , then caj,xj = caj,x′j , which concludes the proof."}, {"heading": "3.1 From normalized BP to plain BP", "text": "We show that in most cases the fixed points of a normalized BP algorithm (no matter the normalization used) are associated with fixed points of the plain BP algorithm. Recall that C is the number of independent cycles of G.\nTheorem 3.2. A fixed point m̃ of the BP algorithm with normalized messages corresponds to a fixed point of the plain BP algorithm associated to the same beliefs iff one of the two following conditions is satisfied:\n(i) the graph G has either no cycle or more than one (C 6= 1);\n(ii) C = 1, and the normalization constants of the associated beliefs are such that ∏\na∈F\nZa(m̃) ∏\ni∈V\nZi(m̃) 1−di = 1. (3.3)\nProof. Let m̃ be a fixed point of (2.8). Let us find a set of constants cai such that ma→i(xi) = cai m̃a→i(xi) is a non-zero fixed point of (2.1, 2.2). Using Lemma 3.1, we see that m and m̃ correspond to the same beliefs. We have\nΘai,xi(m) =\n[ ∏\nj∈a\\i\n∏\na′∋j,a′ 6=a\nca′j ] Θai,xi(m̃)\n=\n[ ∏\nj∈a\\i\n∏\na′∋j,a′ 6=a\nca′j ] Zai m̃a→i(xi)\n= 1\ncai\n[ ∏\nj∈a\\i\n∏\na′∋j,a′ 6=a\nca′j ] Zaima→i(xi),\nand therefore log cai − ∑\nj∈a\\i\n∑\na′∋j,a′ 6=a\nlog ca′j = logZai.\nThis equation is precisely in the setting of Lemma A.2 given in the Appendix, with xai = log cai and yai = logZai = logZa − logZi. It always has a solution when C 6= 1; when C = 1, the additional condition (A.5) is required, and (3.3) follows.\nThere is in general an infinite number of fixed points m corresponding to each m̃. However, as noted at the beginning of the section, this is not a problem, since all these fixed points correspond to the same set of beliefs. In this sense, normalizing the messages can have the effect of collapsing equivalent fixed points.\nWhen C = 1, it is known (Weiss, 2000) that normalized BP always converges to a fixed point. However, the theorem above states that there may be no basic fixed point m corresponding to a given m̃.\nIt is actually not difficult to see what happens in this case: assume a trivial network with two variables and two factors a = b = {1, 2} and assume for simplicity that φ1 = φ2 = 1. The equations for the BP fixed point boil down to relations like\nma→1(xi) = ∑\nx2\nψa(x1, x2)mb→2(x2),\nor, with a matrix notation,\nma→1 = Ψamb→2 = ΨaΨbma→1.\nTherefore, the matrix ΨaΨb necessarily has 1 as an eigenvalue. Since this is not true in general, there can be no fixed point for basic BP. In the normalized case, Weiss (2000) shows that BP always converges to the Perron vector of this matrix. We know there is an infinite number (not even countable, see Lemma 3.1) set of messages corresponding to the same beliefs.\nIt is possible that the behavior of the algorithm leads to convergence of the beliefs without the convergence of messages as the case C = 1 suggests. Indeed, the plain BP scheme is then a linear dynamical system which can converge to a subspace as described in Hartfiel (1997). We will describe more precisely this kind of behavior in Section 4."}, {"heading": "3.2 From plain BP to normalized BP", "text": "It turns out that there is no general result about whether a plain BP fixed point is mapped to a fixed point by normalization. In this section, we will thus first examine the case of a fairly general family of normalizations, and then look at two other examples.\nDefinition 3.3. A normalization Zai is said to be positive homogeneous when it is of the form Zai = Nai ◦ Θai, with Nai : R\nq 7→ R positive homogeneous functions of order 1 satisfying\nNai(λma→i) = λNai(ma→i),∀λ ≥ 0. (3.4)\nNai(ma→i) = 0 ⇐⇒ ma→i = 0. (3.5)\nThe part ⇐= of (3.5) is obviously implied by (3.4). A particular family of positive homogeneous normalizations is built from all norms Nai on Rq. These contain in particular the normalization Zmessai (m) (2.9) or the maximum of messages\nZ∞ai (m) def = max\nx Θai,x(m).\nIt is actually not necessary to have a proper norm: Watanabe and Fukumizu (2009) use a scheme that amounts to\nZ1ai(m) def = Θai,1(m).\nThe following proposition describes the effect of the above family of normalizations.\nProposition 3.4. All the fixed points of the plain BP algorithm leading to the same set of beliefs correspond to a unique fixed point of a positive homogeneous normalized scheme.\nProof. Let m be a fixed point of the plain BP scheme. Using Lemma 3.1, a fixed point m̃ of the normalized scheme associated with the same beliefs than m is such as\nm̃a→i(xi) = caima→i(xi). (3.6)\nSince Θ is multi-linear,\nΘai,xi(m̃) =\n  ∏\nj∈a\\i\n∏\nd∋j,d6=a\ncdj  Θai,xi(m),\nand, using (3.4),\nZai(m̃) =\n  ∏\nj∈a\\i\n∏\nd∋j,d6=a\ncdj  Zai(m),\nm̃a→i(xi) = Θai,xi(m̃)\nZai(m̃) =\nma→i(xi)\nZai(m) .\nTherefore, m̃ is determined uniquely from m. Since m̃ is clearly invariant for all the set of messages m corresponding to the same beliefs (see Lemma 3.1), the proof is complete.\nIn order to emphasize the result of Proposition 3.4, it is interesting to describe what happens with the belief normalization Zbel (2.11). We know from Lemma 2.1 that, for any normalization, we have at any fixed point\nZai(m) = Za(m)\nZi(m)\ndef = Zbelai (m).\nTherefore, any fixed point of any normalized scheme (even of the plain scheme) is a fixed point of the scheme with normalization Zbel. We see the difference between this kind of normalization and a positive homogeneous one. While the latter collapses families of fixed points to one unique fixed point, Zbel instead conserves all the fixed points of all possible schemes.\nTo conclude this section, we will present an example of a “bad normalization” to illustrate a worst case scenario. Consider the following normalization\nZai(m) =\n∑ xΘai,x(m)\nsupxma→i(x) .\nThis normalization, which is not homogeneous at all, defines a BP algorithm which does not admit any fixed point. Following the proof of Proposition 3.4, let m̃ be a fixed point of normalized BP associated with a plain fixed point m through (3.6), then\nm̃a→i(xi) = Θai,xi(m̃)\nZai(m̃) =\nm̃a→i(xi)\nZai(m)\nIndeed it is easy to check that\nZai(m̃) =\n∏ j∈a\\i ∏ b∋j,b6=a cbj\ncai Zai(m).\nSince for any fixed point m of the plain update we have Zai(m) > 1, no message m̃ can be a fixed point for this normalized scheme. Using Theorem 3.2 we conclude that this scheme admits no fixed point."}, {"heading": "4 Belief dynamic", "text": "We are interested here in looking at the dynamic in terms of convergence of beliefs. At each step of the algorithm, using (2.3) and (2.4), we can compute the current beliefs b(n)i and b (n) a associated with the message m(n). The sequence m(n) will be said to be “b-convergent” when the sequences b(n)i and b (n) a converge. The term “simple convergence” will be used to refer to convergence of the sequence m(n) itself. Simple convergence obviously implies b-convergence. We will first show that for a positive homogeneous normalization, b-convergence and simple convergence are equivalent. We will then conclude by looking at b-convergence in a quotient space introduced in Mooij and Kappen (2007) and we show the links between these two approaches.\nProposition 4.1. For any positive homogeneous normalization Zai with continuous Nai, simple convergence and b-convergence are equivalent.\nProof. Assume that the sequences of beliefs, indexed by iteration n, are such that b(n)a → ba and b (n)\ni → bi as n → ∞. The idea of the proof is first to express the normalized messages m̃(n)a→i at each step in terms of these beliefs, and then to conclude by a continuity argument. Starting from a rewrite of (2.3)–(2.4),\nb(n)i (xi) = φi(xi)\nZi(m̃(n))\n∏\na∋i\nm̃(n)a→i(xi),\nb(n)a (xa) = ψa(xa)\nZa(m̃(n))\n∏\nj∈a\nφj(xj) ∏\nb∋j,b6=a\nm̃(n)b→j(xj),\none obtains by recombination\n∏\nj∈a\nm̃(n)a→j(xj) =\n∏ j∈aZj(m̃ (n))\nZa(m̃(n)) ψa(xa)\n∏ j∈a b (n) j (xj)\nb(n)a (xa)\ndef =\nK(n)ai (xa\\i;xi)\nZ̃ai(m̃) ,\nwhere an arbitrary variable i ∈ a has been singled out and\n1\nZ̃ai(m̃)\ndef =\n∏ j∈a Zj(m̃ (n))\nZa(m̃(n)) .\nAssume now that xa\\i is fixed and consider K (n) ai (xa\\i) def = K(n)ai (xa\\i; ·) as a vector of Rq. Normalizing each side of the equation with a positive homogeneous function Nai yields\nm̃(n)a→i(xi) Nai [ m̃(n)a→i ] = K(n)ai (xa\\i;xi) Nai [ K (n) ai (xa\\i) ] .\nActually Nai [ m̃(n)a→i ] = 1, since m̃(n)a→i has been normalized by Nai and\ntherefore\nm̃(n)a→i(xi) = K(n)ai (xa\\i;xi)\nNai [ K (n) ai (xa\\i) ] .\nThis conclude the proof, since m̃(n)a→i has been expressed as a continuous function of b(n)i and b (n) a , and therefore it converges whenever the beliefs converge.\nWe follow now an idea developed in Mooij and Kappen (2007) and study the behavior of the BP algorithm in a quotient space corresponding to the invariance of beliefs. First we will introduce a natural parametrization for which the quotient space is just a vector space. Then it will be trivial to show that, in terms of b-convergence, the effect of normalization is null.\nThe idea of b-convergence is easier to express with the new parametrization :\nµai(xi) def = logma→i(xi),\nso that the plain update mapping (2.7) becomes\nΛai,xi(µ) = log   ∑\nxa\\i\nψa(xa) exp (∑\nj∈a\\i\n∑\nb∋j b6=a\nµbj(xj) )   .\nWe have µ ∈ N def = R|E|q and we define the vector space W which is the linear span of the following vectors {eai ∈ N}(ai)∈E\n(eai)cj,xj def = 1 {ai=cj}.\nIt is trivial to see that the invariance set of the beliefs corresponding to µ described in Lemma 3.1 is simply the affine space µ + W. So the bconvergence of a sequence µ(n) is simply the convergence of µ(n) in the quotient space N \\W (which is a vector space, see Halmos (1974)). Finally we define the notation [x] for the canonical projection of x on N \\W.\nSuppose that we resolve to some kind of normalization on µ, it is easy to see that this normalization plays no role in the quotient space. The\nnormalization on µ leads to µ+ w with some w ∈ W. We have\nΛai,xi(µ+ w) = log (∑\nj∈a\\i\n∑\nb∋j b6=a\nwbj ) + Λai,xi(µ)\ndef = lai + Λai,xi(µ),\nwhich can be summed up by\n[Λ(µ +W)] = [Λ(µ)], (4.1)\nsince l ∈ W. We conclude by a proposition which is directly implied by (4.1).\nProposition 4.2. The dynamic, i.e. the value of the normalized beliefs at each step, of the BP algorithm with or without normalization is exactly the same.\nWe will come back to this vision in term of quotient space in section 5.3."}, {"heading": "5 Local stability of BP fixed points", "text": "The question of convergence of BP has been addressed in a series of works (Tatikonda and Jordan, 2002; Mooij and Kappen, 2007; Ihler et al., 2005) which establish conditions and bounds on the MRF coefficients for having global convergence. In this section, we change the viewpoint and, instead of looking for conditions ensuring a single fixed point, we examine the different fixed points for a given joint probability and their local properties.\nIn what follows, we are interested in the local stability of a message fixed point m with associated beliefs b. It is known that a BP fixed point is locally attractive if the Jacobian of the relevant mapping (Θ or its normalized version) at this point has a spectral radius strictly smaller than 1 and unstable when the spectral radius is strictly greater than 1. The term “spectral radius” should be understood here as the modulus of the largest eigenvalue of the Jacobian matrix.\nWe will first show that BP with plain messages can in fact never converge when there is more than one cycle (Theorem 5.1), and then explain how normalization of messages improves the situation (Proposition 5.2, Theorem 5.3)."}, {"heading": "5.1 Unnormalized messages", "text": "The characterization of the local stability relies on two ingredients. The first one is the oriented line graph L(G) based on G, which vertices are the elements of E, and which oriented links relate ai to a′j if j ∈ a ∩ a′, j 6= i\nand a′ 6= a. The corresponding 0-1 adjacency matrix A is defined by the coefficients\nAa ′j ai def = 1 {j∈a∩a′, j 6=i, a′ 6=a}. (5.1)\nThe second ingredient is the set of stochastic matrices B(iaj), attached to pairs of variables (i, j) having a factor node a in common, and which coefficients are the conditional beliefs,\nb (iaj) kℓ def = ba(xj = ℓ|xi = k) =\n∑\nxa\\{i,j}\nba(xa) bi(xi) ∣∣∣∣∣xi=k xj=ℓ\nfor all (k, ℓ) ∈ {1, . . . , q}2. Using the representation (2.10) of the BP algorithm, the Jacobian reads at this point:\n∂Θai,xi(m)\n∂ma′→j(xj) =\n∑\nxa\\{i,j}\nba(xa) bi(xi) ma→i(xi) ma′→j(xj) 1 {j∈a\\i}1 {a′∋j,a′ 6=a}\n= bij|a(xi, xj)\nbi(xi)\nma→i(xi)\nma′→j(xj) Aa ′j ai\nTherefore, the Jacobian of the plain BP algorithm is—using a trivial change of variable—similar to the matrix J defined, for any pair (ai, k) and (a′j, ℓ) of E× {1, . . . , q} by the elements\nJa ′j,ℓ ai,k def = b (iaj) kℓ A a′j ai ,\nThis expression is analogous to the Jacobian encountered in Mooij and Kappen (2007). It is interesting to note that it only depends on the structure of the graph and on the belief corresponding to the fixed point.\nSince G is a singly connected graph, it is clear that A is an irreducible matrix. To simplify the discussion, we assume in the following that J is also irreducible. This will be true as long as the ψ are always positive. It is easy to see that to any right eigenvector of A corresponds a right eigenvector of J associated to the same eigenvalue: if v = (vai, ai ∈ E) is such that Av = λv, then the vector v+, defined by coordinates v+a′jℓ def = va′j , for all a′j ∈ E and ℓ ∈ {1, . . . , q}, satisfies Jv = λv. We will say that v+ is a A-based right eigenvector of J . Similarly, if u is a left eigenvector of A, with obvious notations one can define a A-based left eigenvector u+ of J by the following coordinates: u+aik def = uaibi(k).\nUsing this correspondence between the two matrices, we can prove the following result.\nTheorem 5.1. If the graph G has more than one cycle (C > 1), and the matrix J is irreducible, then the plain BP update rules (2.1, 2.2) do not admit any stable fixed point.\nProof. Let π be the right Perron vector of A, which has positive entries, since A is irreducible (Seneta, 2006, Theorem 1.5). The A-based vector π + also has positive coordinates and is therefore the right Perron vector of J (Seneta, 2006, Theorem 1.6); the spectral radius of J is thus equal to the one of A.\nWhen C > 1, Lemma A.1 implies that 1 is an eigenvalue of A associated to divergenceless vectors. However, such vectors cannot be non-negative, and therefore the Perron eigenvalue of A is strictly greater than 1. This concludes the proof of the theorem."}, {"heading": "5.2 Positively homogeneous normalization", "text": "We have seen in Proposition 4.1 that all the continuous positively homogeneous normalizations make simple convergence equivalent to b-convergence. As a result, one expects that local stability of fixed points will again depend on the beliefs structure only. Since all the positively homogeneous normalization share the same properties, we look at the particular case of Zmessai (m), which is both simple and differentiable. We then obtain a Jacobian matrix with more interesting properties. In particular, this matrix depends not only on the beliefs at the fixed point, but also on the messages themselves: for the normalized BP algorithm (2.8 with Zmessai ), the coefficients of the Jacobian at fixed point m with beliefs b read\n∂\n∂m̃a′→j(ℓ) [ Θai,k(m̃)∑q x=1Θai,x(m̃) ]\n= Ja ′j,ℓ\nai,k\nma→i(k) ma′→j(ℓ) −ma→i(k)\nq∑\nx=1\nJa ′j,ℓ\nai,x\nma→i(x) ma′→j(ℓ) ,\nwhich is again similar to the matrix J̃ of general term\nJ̃a ′j,ℓ ai,k def = [ b (iaj) kℓ − q∑\nx=1\nma→i(x)b (iaj) xℓ\n] Aa\n′j ai = J a′j,ℓ ai,k −\nq∑\nx=1\nma→i(x)J a′j,ℓ ai,x . (5.2)\nIt is actually possible to prove that the spectrum of J̃ does not depend on the messages themselves but only of the belief at the fixed point.\nProposition 5.2. The eigenvectors of J are associated to eigenvectors of J̃ with the same eigenvalues, except the A-based eigenvectors of J (including its Perron vector), which belong to the kernel of J̃ .\nProof. The new Jacobian matrix can be expressed from the old one as J̃ = (I−M)J , where M is the matrix whose coefficient at row (ai, k) and column (a′j, ℓ) is 1 {a=a′,i=j}ma′→j(ℓ). Elementary computations yield the following properties of M :\n• M2 = M : M is a projector;\n• J̃M = 0.\nFor any right eigenvector v of J associated to some eigenvalue λ,\nJ̃(v −Mv) = J̃v = (I−M)Jv = λ(v −Mv)\nso that v −Mv is a (right) eigenvector of J̃ associated to λ, unless v is an A-based eigenvector, in which case v = Mv and v is in the kernel of J̃ .\nSimilarly, if u is such that uT J̃ = λuT for λ 6= 0, then λuTM = uT J̃M = 0 and therefore uT J̃ = uT (I−M)J = uTJ = λuT : any non-zero eigenvalue of J̃ is an eigenvalue of J . This proves the last part of the theorem.\nAs a consequence of this proposition, when J is an irreducible matrix, J̃ has a strictly smaller spectral radius: the net effect of normalization is to improve convergence (although it may actually not be enough to guarantee convergence). To quantify this improvement of convergence related to message normalization, we resort to classical arguments used in speed convergence of Markov chains (see e.g. Brémaud (1999)).\nThe presence of the messages in the Jacobian matrix J̃ complicates the evaluation of this effect. However, it is known (see e.g. Furtlehner et al. (2010)) that it is possible to chose the functions φ̂ and ψ̂ as\nφ̂i(xi) def = b̂i(xi), ψ̂a(xa) def = b̂a(xa)∏ i∈a b̂i(xi) , (5.3)\nin order to obtain a prescribed set of beliefs b̂ at a fixed point. Indeed, BP will admit a fixed point with ba = b̂a and bi = b̂i when ma→i(xi) ≡ 1. Since only the beliefs matter here, without loss of generality, we restrict ourselves in the remainder of this section to the functions (5.3). Then, from (5.2), the definition of J̃ rewrites\nJ̃a ′j,ℓ ai,k def = [ b (iaj) kℓ − 1\nq\nq∑\nx=1\nb (iaj) xℓ\n] Aa\n′j ai = J a′j,ℓ ai,k −\n1\nq\nq∑\nx=1\nJa ′j,ℓ\nai,x .\nFor each connected pair (i, j) of variable nodes, we associate to the stochastic kernel B(iaj) a combined stochastic kernel K(iaj) def = B(iaj)B(jai), with coefficients\nK (iaj) kℓ def =\nq∑\nm=1\nb (iaj) km b (jai) mℓ . (5.4)\nSince b(i)B(iaj) = b(j), b(i) is the invariant measure associated to K:\nb(i)K(iaj) = b(i)B(iaj)B(jai) = b(j)B(jai) = b(i)\nand K(iaj) is reversible, since\nb (i) k K (iaj) kℓ =\nq∑\nm=1\nb (jai) mk b (j) m b (jai) mℓ\n=\nq∑\nm=1\nb (jai) mk b (iaj) ℓm b (i) ℓ = b (i) ℓ K (iaj) ℓk .\nLet µ (iaj) 2 be the second largest eigenvalue of K (iaj) and let\nµ2 def = max\nij |µ\n(iaj) 2 | 1 2 .\nThe combined effect of the graph and of the local correlations, on the stability of the reference fixed point is stated as follows.\nTheorem 5.3. Let λ1 be the Perron eigenvalue of the matrix A\n(i) if λ1µ2 < 1, the fixed point of the normalized BP schema (2.8 with Zmessai ) associated to b is stable.\n(ii) condition (i) is necessary and sufficient if the system is homogeneous (B(iaj) = B independent of i, j and a), with µ2 representing the second largest eigenvalue of B.\nProof. See Appendix B\nThe quantity µ2 is representative of the level of mutual information between variables. It relates to the spectral gap (see e.g. Diaconis and Strook (1991) for geometric bounds) of each elementary stochastic matrix B(iaj), while λ1 encodes the statistical properties of the graph connectivity. The bound λ1µ2 < 1 could be refined when dealing with the statistical average of the sum over path in (B.1) which allows to define µ2 as\nµ2 = lim n→∞ max (ai,a′j) { 1 |Γ(n)ai,a′j| ∑\nγ∈Γ (n)\nai,a′j\n( ∏\n(x,y)∈γ\nµ (xy) 2\n) 1 2n } ."}, {"heading": "5.3 Local convergence in quotient space N \\W", "text": "The idea is to make the connexion between local stability of fixed point as described previously and the same notion of local stability but in the quotient space N \\W described in Section 4. Trivial computation based on the results of Section 5.1 gives us the derivatives of Λ.\n∂Λai,xi(µ)\n∂µbj(xj) =\nbij|a(xi, xj)\nbi(xi) Abjai = J bj,xj ai,xi .\nIn terms of convergence in N \\W, the stability of a fixed point is given by the projection of J on the quotient spaceN\\W and we have (Mooij and Kappen, 2007) :\n[J ] def = [∇Λ] = ∇[Λ]\nProposition 5.4. The eigenvalues of [J ] are the eigenvalues of J which are not associated with A-based eigenvectors. The A-based eigenvectors of J belong to the kernel of [J ]\nProof. Let v be an eigenvector of J for the eigenvalue λ, we have\n[Jv] = [λv] = λ[v],\nso [v] is an eigenvector of [J ] with the same eigenvalue λ iff [v] 6= 0. The A-based eigenvectors (see Section 5.1) w of J belongs to W so we have\n[w] = 0.\nIt means that these eigenvectors of J have no equivalent w.r.t [J ] and play no role in belief fixed point stability.\nWe have seen that the normalization Zmessai is equivalent to multiplying the jacobian matrix J by the projection I−M (Proposition 5.2), with\nker(I−M) = W.\nThe projection I −M is in fact a quotient map from N to N \\ W. So the normalization Zmessai is strictly equivalent, when we look at the messages ma→i(xi), to working on the quotient space N \\ W. More generally for any differentiable positively homogeneous normalization we will obtain the same result, the jacobian of the corresponding normalized scheme will be the projection of the jacobian J on the quotient space N \\W, through some quotient map."}, {"heading": "6 Normalization in the variational problem", "text": "Since Proposition 4.2 shows that the choice of normalization has no real effect on the dynamic of BP, it will have no effect on b-convergence either. In this section, we turn to the effect of normalization on the underlying variational problem. It will be assumed here that the beliefs bi and ba are normalized (2.5) and compatible (2.14). If only (2.14) is satisfied, they will be denoted βi and βa. It is quite obvious that imposing only compatibility constraints leads to a unique normalization constant Z\nZ(β) def =\n∑\nxi\nβi(xi) = ∑\nxa\nβa(xa),\nwhich is not a priori related to the constants Za(m) and Zi(m) seen in the previous sections. The quantities βi(xi)/Z(β) and βa(xa)/Z(β) can be denoted as bi(xi) and ba(xa) since (2.5) holds for them.\nThe aim of this section is to explicit the relationship between the minimizations of the Bethe free energy (2.15) with and without normalization constraints (2.5). Generally speaking, we can express them as a minimization problem P(E) on some set E as\nP(E) : argmin β∈E F (β) (6.1)\nwhere E is chosen as follows\n• plain case: E = E1 is the set of positive measures such as (2.14) holds,\n• normalized case: E = E2 E1 has the additional constraint (2.5).\nIt is possible to derive a BP algorithm for the plain problem following the same path as in Section 2. The resulting update equations will be identical, except for the γi terms.\nThe first step is to compare the solutions of (6.1) on E1 and E2. Let ϕ be the bijection between E1 and E2 × R ∗ +,\nϕ :E2 × R ∗ + −→ E1\n(b, Z) −→ bZ.\nThe variational problem P(E1) is equivalent to\n(b̂, Ẑ) = argmin (b,Z)∈E2 F (ϕ(b, Z)),\nwith ϕ(b̂, Ẑ) = b̂Ẑ = β̂ def = argmin\nβ∈E1\nF (β).\nThe next step is to express the Bethe free energy F (β) of an unnormalized positive measure β as a function of the Bethe free energy of the corresponding normalized measure b.\nLemma 6.1. As soon as the factor graph is connected, for any β = Zb ∈ E1 we have\nF (Zb) = Z ( F (b) + (1− C) logZ ) , (6.2)\nwith C being the number of independent cycles of the graph.\nProof.\nF (β) = F (Zb)\n= Z [∑\na,xa\nba(xa) log (Zba(xa) ψa(xa) ) + ∑\ni,xi\nbi(xi) log ((Zbi(xi))1−di\nφi(xi)\n)]\n= Z ( F (b) + (|F|+ |V| − |E|) logZ ) = Z ( F (b) + (1− C) logZ ) ,\nwhere the last equality comes from elementary graph theory (see e.g. Berge (1967)).\nThe quantity 1 − C will be negative in the nontrivial cases (at least 2 cycles). Since all the Zb are equivalent from our point of view, we look at the derivatives of F (Zb) as a function of Z to see what happens in the plain variational problem.\nTheorem 6.2. The normalized beliefs corresponding to the extrema of the plain variational problem P(E1) are exactly the same as the ones of the normalized problem P(E2) as soon as C 6= 1.\nProof. Using Lemma 6.1 we obtain\n∂F (β)\n∂Z = F (b) + (1− C)(logZ + 1),\nthe stationary points are\nẐ = exp ( F (b) C − 1 − 1 ) . (6.3)\nAt these points we can compute the Bethe free energy\nF (β̂) = F (Ẑb) = (C − 1) exp ( F (b) C − 1 − 1 ) = G(F (b)).\nIt is easy to check that, if C 6= 1, G is an increasing function, so the extrema of F (β) are reached at the same normalized beliefs. More precisely, if b1 and b2 are elements of E2 such that F (b1) ≤ F (b2) then F (β̂1 = Ẑ1b1) ≤ F (β̂2 = Ẑ2b2), which allows us to conclude.\nIn other words, imposing a normalization in the variational problem or normalizing after a solution is reached is equivalent as long as C 6= 1. Moreover, in the unnormalized case, the Bethe free energy at the local extremum writes\nF (b) = (C − 1)(log Ẑ + 1). (6.4)\nWe can therefore compare the “quality” of different fixed points by comparing only the normalization constant obtained: the smaller Z is, the better the approximation, modulo the fact that we’re not minimizing a true distance.\nWhen C = 1, it has been shown already in Section 3 that the normalized scheme is always convergent, whereas the plain scheme can have no fixed point. In this case, (6.2) rewrites\nF (β) = F (Zb) = ZF (b).\nThe form of this relationship shows what happens: if the extremum of the normalized variational problem is strictly negative, F (β) is unbounded from\nbelow and Z will diverge to +∞; conversely, if the extremum is strictly positive, Z will go to zero. In the (very) particular case where the minimum of the normalized problem is equal to zero, the problem is still well defined. In fact this condition F (b) = 0 is equivalent to the one of Theorem 3.2 when C = 1.\nTo sum up, as soon as the plain variational problem is well defined, it is equivalent to the normalized one and the normalization constant allows to compute easily the Bethe free energy using (6.4). When this is no longer the case, we still know that the dynamics of both algorithms remain the same (Proposition 4.2) but the plain variational problem (which can still converge in terms of beliefs) will not converge in terms of normalization constant Z, and we have no more easy information on the fixed point free energy.\nAs emphasized previously, the relationship between Ẑ, Za(m) and Zi(m) is not trivial. In the case of the plain BP algorithm, for which Za(m) = Zi(m), an elementary computation yields the following relation at any fixed point\nF (b) = (C − 1) logZa(m),\nwhich seemingly contradicts (6.4). In fact, the algorithm derived from the plain variational problem is not exactly the plain BP scheme. Usually, since one resorts to some kind of normalization, the multiplicative constants of the fixed point equations are discarded (see Yedidia et al. (2005) for more details). Keeping track of them yields\nma→i(xi) = exp\n( di − 2\ndi − 1\n) Θai,xi(m), (6.5)\nβa(xa) = 1\ne ψa(xa)\n∏\nj∈a\nnj→a(xj),\nβi(xi) = φi(xi) exp\n( 1\ndi − 1\n)∏\nb∋i\nmb→i(xi).\nActually, the plain update scheme (2.1,2.2) corresponds to some constant normalization exp ( di−2 di−1 ) . Without any normalization, using (6.5) as update rule, one would obtain\nẐ = Za(m)\ne = Zi(m) exp\n( 1\ndi − 1\n) ."}, {"heading": "7 Conclusion", "text": "This paper motivation was to fill a void in the literature about the effect of normalization on the BP algorithm. What we have learnt can be summarized in a few main points\n• using a normalization in BP can in some rare cases kill or create new fixed points;\n• not all normalizations are created equal when it comes to message convergence, but there is a big category of positive homogeneous normalization that all have the same effect;\n• the user is ultimately concerned with convergence of beliefs, and thankfully the dynamic of normalized beliefs is insensitive to normalization.\nThe messages having no interest by themselves, it is worthy of remark that combining the update rules (2.12) recalled below\nma→i(xi) ← bi|a(xi)\nbi(xi) ma→i(xi),\nand the definition (2.3) and (2.4) of beliefs, one can eliminate the messages and obtain\nbi(xi) ← bi(xi) ∏\na∋i\nbi|a(xi)\nbi(xi) ,\nba(xa) ← ba(xa) ∏\ni∈a\n∏\nc∋i,c 6=a\nbi|c(xi)\nbi(xi) ,\nOne particularity of these update rules is that they do not depend on the functions ψ or φ but only on the graph structure. The dependency on the joint law (1.1) occurs only through the initial conditions. This “product sum” algorithm therefore shares common properties for all models build on the same underlying graph, and the initial conditions should impose the details of the joint law. To our knowledge this algorithm has never been studied and we let it for future work."}, {"heading": "A Spectral properties of the factor graph", "text": "This appendix is devoted to some properties of the matrix A defined in (5.1) that are used in Sections 3 and 5.\nWe consider two types of fields associated to G, namely scalar fields and vector fields. Scalar fields are quantities attached to the vertices of the graph,\nwhile vector fields are attached to its edges. A vector fieldw = {wai, ai ∈ E} is divergenceless if\n∀a ∈ F, ∑\ni∈a\nwai = 0 and ∀i ∈ V, ∑\na∋i\nwai = 0.\nA vector field u = {uai, ai ∈ E} is a gradient if there exists a scalar field {ua, ui, a ∈ F, i ∈ V} such that\n∀ai ∈ E, uai = ua − ui.\nThere is an orthogonal decomposition of any vector field into a divergenceless and a gradient component. Indeed, the scalar product\nwTu = ∑\nai∈E\nwaiuai = ∑\na∈F\nua ∑\ni∈a\nwai − ∑\ni∈V\nui ∑\na∋i\nwai,\nis 0 for all gradient fields u iff w is divergenceless. Dimensional considerations show that any vector field v can be decomposed in this way.\nIn the following, it will be useful to define the Laplace operator ∆ associated to G. For any scalar field u:\n(∆u)a def = daua −\n∑\ni∈a\nui, ∀a ∈ F (A.1)\n(∆u)i def = diui −\n∑\na∋i\nua, ∀i ∈ V. (A.2)\nThe following lemma describes the spectrum of A in terms of a Laplace equation on the graph G.\nLemma A.1. (i) Both gradient and divergenceless vector spaces are Ainvariant and divergenceless vectors are eigenvectors of A with eigenvalue 1. (ii) eigenvectors associated to eigenvalues λ 6= 1 are gradient vectors of a scalar field u which satisfies\n( ∆u ) a = (λ− 1)(da − 1)\nλ ua and\n( ∆u ) i = (1− λ)ui. (A.3)\nand there exists a gradient vector associated to 1 iff G has exactly one cycle (C = 1).\nProof. The action of A on a given vector x reads\n∑\na′j∈E\nAa ′j ai xa′j = ∑\nj∈a\n(∑\na′∋j\nxa′j − xaj ) − ∑\na′∋i\nxa′i + xai,\nThe first two terms in the second member vanish if x is divergenceless. In addition, the first term in parentheses is independent of i while the second\none is independent of a so the first assertion is justified. We concentrate then on solving the eigenvalue equation Ax − λx = 0 for a gradient vector x, with xai = ua − ui. Ax− λx is the gradient of a constant scalar K ∈ R, and by identification we have\n   ( ∆u ) a + ∑ j∈a ( ∆u ) j = (1− λ)ua +K\n( ∆u ) i = (1− λ)ui +K.\nThe Laplacian of a constant scalar is zero, so for λ 6= 1, K may be reabsorbed in u and, combining these two equations with the help of identities (A.1,A.2), yields equation (A.3). For λ = 1, we obtain\n( ∆u ) a = (1− da)K and\n( ∆u ) i = K. (A.4)\nLet D be the diagonal matrix associated to the graph G, whose diagonal entries are the degrees da and di of each node. M = I−D\n−1∆ is a stochastic irreducible matrix, which unique right Perron vector (1, . . . , 1) generates the kernel of ∆. As a result, for K = 0, the solution to (A.4) is ua = ui = cte so that xai = 0.\nFor K 6= 0, there is a solution if the second member of (A.4) is orthogonal (∆ is a symmetric operator) to the kernel. The condition reads\n0 = ∑\na\n(1− da) + ∑\ni\n1 = |F| − |E|+ |V| = 1− C,\nwhere the last equality comes from elementary graph theory (see e.g. Berge (1967)).\nSince 1 is an eigenvalue of A, it is interesting to investigate linear equations involving I−A. Since it is already known that divergenceless vectors are in the kernel of this matrix, we restrict ourselves to the case where the constant term is of gradient type.\nLemma A.2. For a given gradient vector field y, the equation ( I−A ) x = y,\nhas a solution (unique up to a divergenceless vector) iff C 6= 1 or C = 1 and ∑\na∈F\nya + ∑\ni∈V\n(1− di)yi = 0. (A.5)\nProof. We look here only for gradient-type solutions xai = ua−ui and write yai = ya − yi. Owing to the same arguments as in Lemma A.1, there exists a constant K such that\n( ∆u ) a = K(da − 1) + ya − ∑\nj∈a\nyj\n( ∆u ) i = yi −K.\nStating as before the compatibility condition for this equation yields ∑\na∈F\nya + ∑\ni∈V\n(1− di)yi = K(C − 1).\nIt is always possible to find a suitable K as long as C 6= 1 and when C = 1, (A.5) has to hold."}, {"heading": "B Proof of Theorem 5.3", "text": "Let us start with (ii): when the system is homogeneous, J̃ is a tensor product of A with B̃, and its spectrum is therefore the product of their respective spectra. In particular if G has uniform degrees da and di, the condition reads\nµ2(da − 1)(di − 1) < 1.\nIn order to prove part (i) of the theorem, we will consider a local norm on Rq attached to each variable node i,\n‖x‖b(i) def =\n( q∑\nk=1\nx2kb (i) k ) 1 2 and 〈x〉b(i) def = q∑\nk=1\nxkb (i) k ,\nthe local average of x ∈ Rq w.r.t b(i). For convenience we will also consider the somewhat hybrid global norm on Rq×|E|\n‖x‖π,b def =\n∑\na→i\nπai‖xai‖b(i) ,\nwhere π is again the right Perron vector of A, associated to λ1. We have the following useful inequality.\nLemma B.1. For any (xi, xj) ∈ R 2q, such that 〈xi〉b(i) = 0 and xj,ℓb (j) ℓ =∑\nk xi,kb (i) k B (iaj) kℓ ,\n〈xj〉b(j) = 0 and ‖xj‖ 2 b(j) ≤ µ (iaj) 2 ‖xi‖ 2 b(i) .\nProof. By definition (5.4), we have\n‖x(j)‖2 b(j) =\nq∑\nk=1\n1\nb (j) k\n∣∣∣ q∑\nℓ=1\nb (iaj) ℓk b (i) ℓ x (i) ℓ\n∣∣∣ 2\n= ∑\nℓ,m\nx (i) ℓ x (i) m K (iaj) ℓm b (i) ℓ .\nSince K(iaj) is reversible we have from Rayleigh’s theorem\nµ (iaj) 2 def = sup\nx\n{∑ kℓ xkxℓK (iaj) kℓ b\n(i) k∑\nk x 2 kb (i) k\n, 〈x〉b(i) = 0, x 6= 0 } ,\nwhich concludes the proof.\nTo deal with iterations of J , we express it as a sum over paths. ( Jn\n)a′j,ℓ ai,k = ( An )a′j ai ( B(n)ai,a′j ) kℓ ,\nwhere B(n)ai,a′j is an average stochastic kernel,\nB(n)ai,a′j def =\n1\n|Γ(n)ai,a′j |\n∑\nγ∈Γ (n)\nai,a′j\n∏\n(x,y)∈γ\nB(xy). (B.1)\nΓ(n)ai,a′j represents the set of directed path of length n joining ai and a ′j on L(G) and its cardinal is precisely |Γ(n)ai,a′j| = ( An )a′j ai . Lemma B.2. For any (xai, xa′j) ∈ R 2q, such that 〈xi〉b(i) = 0 and\nxa′j,ℓb (j) ℓ =\n∑\nk\nxai,kb (i) k ( B(n)ai,a′j ) kℓ ,\nthe following inequality holds\n‖xa′j‖b(j) ≤ µ n 2‖xai‖b(i) .\nProof. Let xγa′j the contribution to xa′j corresponding to the path γ ∈ Γ (n)\nai,a′j. Using Lemma B.1 recursively yields for each individual path\n‖xγa′j‖b(j) ≤ µ n 2‖xai‖b(i) ,\nand, owing to triangle inequality,\n‖xa′j‖b(j) ≤ 1\n|Γ(n)ai,a′j |\n∑\nγ∈Γ (n)\nai,a′j\n‖xγa′j‖b(j) ≤ µ n 2‖xai‖b(i) .\nIt is now possible to conclude the proof of the theorem.\nProof of Theorem 5.3(i). (i) Let v and v′ two vectors with v′ = vJ̃n = v(I−M)Jn, (M is the projector defined in Proposition 5.2) since J̃M = 0. Recall that the effect of (I−M) is to first project on a vector with zero local sum, ∑ k ( v(I−M) ) ai,k = 0, ∀i ∈ V, so we assume directly v of the form\nvai,k = xai,kb (i) k , with 〈xai〉b(i) = 0.\nAs a result v′ = vJn = v′(I−M) is of the same form. Let x′a′j,ℓ def = v′a′j,ℓ/b (j) ℓ . We have ‖x′‖π,b ≤ ∑\na′→j\nπa′j ∑\na→i\n( An )a′j ai ‖ya′j‖b(j)\nwith ya′j,ℓ b (j) ℓ = ∑ k xai,kb (i) k ( B(n)ai,a′j ) kℓ . From Lemma B.2 applied to ya′j ,\n‖x′‖π,b ≤ ∑\na′→j\nπa′j ∑\na→i\n( An )a′j ai µn2‖xai‖b(i) = λ n 1µ n 2‖x‖π,b,\nsince π is the right Perron vector of A."}], "references": [{"title": "Théorie des graphes et ses applications, volume II of Collection Universitaire des Mathématiques", "author": ["C. Berge"], "venue": "Dunod, 2ème edition,", "citeRegEx": "Berge.,? \\Q1967\\E", "shortCiteRegEx": "Berge.", "year": 1967}, {"title": "Markov chains: Gibbs fields, Monte Carlo simulation and queues", "author": ["P. Brémaud"], "venue": null, "citeRegEx": "Brémaud.,? \\Q1999\\E", "shortCiteRegEx": "Brémaud.", "year": 1999}, {"title": "Geometric bounds for eigenvalues of markov chains", "author": ["P. Diaconis", "D. Strook"], "venue": "Ann. Appl. Probab,", "citeRegEx": "Diaconis and Strook.,? \\Q1991\\E", "shortCiteRegEx": "Diaconis and Strook.", "year": 1991}, {"title": "Learning multiple belief propagation fixed points for real time inference", "author": ["C. Furtlehner", "J.-M. Lasgouttes", "A. Auger"], "venue": "Physica A: Statistical Mechanics and its Applications,", "citeRegEx": "Furtlehner et al\\.,? \\Q2010\\E", "shortCiteRegEx": "Furtlehner et al\\.", "year": 2010}, {"title": "Finite-Dimensional Vector Space", "author": ["P.R. Halmos"], "venue": "Springer-Velag,", "citeRegEx": "Halmos.,? \\Q1974\\E", "shortCiteRegEx": "Halmos.", "year": 1974}, {"title": "System behavior in quotient systems", "author": ["D.J. Hartfiel"], "venue": "Applied Mathematics and Computation,", "citeRegEx": "Hartfiel.,? \\Q1997\\E", "shortCiteRegEx": "Hartfiel.", "year": 1997}, {"title": "Stable fixed points of loopy belief propagation are minima of the Bethe free energy", "author": ["T. Heskes"], "venue": "Advances in Neural Information Processing Systems,", "citeRegEx": "Heskes.,? \\Q2003\\E", "shortCiteRegEx": "Heskes.", "year": 2003}, {"title": "Loopy belief propagation: Convergence and effects of message errors", "author": ["A. Ihler", "J.I. Fischer", "A. Willsky"], "venue": "J. Mach. Learn. Res.,", "citeRegEx": "Ihler et al\\.,? \\Q2005\\E", "shortCiteRegEx": "Ihler et al\\.", "year": 2005}, {"title": "Factor graphs and the sum-product algorithm", "author": ["F.R. Kschischang", "B.J. Frey", "H.A. Loeliger"], "venue": "IEEE Trans. on Inf. Th.,", "citeRegEx": "Kschischang et al\\.,? \\Q2001\\E", "shortCiteRegEx": "Kschischang et al\\.", "year": 2001}, {"title": "Sufficient conditions for convergence of the sum-product algorithm", "author": ["J.M. Mooij", "H.J. Kappen"], "venue": "IEEE Trans. on Inf. Th.,", "citeRegEx": "Mooij and Kappen.,? \\Q2007\\E", "shortCiteRegEx": "Mooij and Kappen.", "year": 2007}, {"title": "Probabilistic Reasoning in Intelligent Systems: Network of Plausible Inference", "author": ["J. Pearl"], "venue": null, "citeRegEx": "Pearl.,? \\Q1988\\E", "shortCiteRegEx": "Pearl.", "year": 1988}, {"title": "Non-negative matrices and Markov chains", "author": ["E. Seneta"], "venue": null, "citeRegEx": "Seneta.,? \\Q2006\\E", "shortCiteRegEx": "Seneta.", "year": 2006}, {"title": "Loopy belief propagation and gibbs measures", "author": ["S. Tatikonda", "M. Jordan"], "venue": "In UAI-02,", "citeRegEx": "Tatikonda and Jordan.,? \\Q2002\\E", "shortCiteRegEx": "Tatikonda and Jordan.", "year": 2002}, {"title": "Stochastic processes on graphs with cycles: geometric and variational approaches", "author": ["M.J. Wainwright"], "venue": "PhD thesis,", "citeRegEx": "Wainwright.,? \\Q2002\\E", "shortCiteRegEx": "Wainwright.", "year": 2002}, {"title": "Graph zeta function in the bethe free energy and loopy belief propagation", "author": ["Y. Watanabe", "K. Fukumizu"], "venue": "In Advances in Neural Information Processing Systems,", "citeRegEx": "Watanabe and Fukumizu.,? \\Q2009\\E", "shortCiteRegEx": "Watanabe and Fukumizu.", "year": 2009}, {"title": "Correctness of local probability propagation in graphical models with loops", "author": ["Y. Weiss"], "venue": "Neural Computation,", "citeRegEx": "Weiss.,? \\Q2000\\E", "shortCiteRegEx": "Weiss.", "year": 2000}, {"title": "Constructing free-energy approximations and generalized belief propagation algorithms", "author": ["J.S. Yedidia", "W.T. Freeman", "Y. Weiss"], "venue": "IEEE Trans. Inform. Theory.,", "citeRegEx": "Yedidia et al\\.,? \\Q2005\\E", "shortCiteRegEx": "Yedidia et al\\.", "year": 2005}], "referenceMentions": [{"referenceID": 8, "context": "F together with V define the factor graph G (Kschischang et al., 2001), that is an undirected bipartite graph, which will be assumed to be connected.", "startOffset": 44, "endOffset": 70}, {"referenceID": 10, "context": "In computer science, the belief propagation (BP) algorithm (Pearl, 1988) is a message passing procedure that allows to compute efficiently exact marginal probabilities when the underlying graph is a tree.", "startOffset": 59, "endOffset": 72}, {"referenceID": 16, "context": "It has been shown that these fixed points coincide with stationary points of the Bethe free energy (Yedidia et al., 2005).", "startOffset": 99, "endOffset": 121}, {"referenceID": 6, "context": "In addition (Heskes, 2003; Watanabe and Fukumizu, 2009), stable fixed points of BP are local minima of the Bethe free energy.", "startOffset": 12, "endOffset": 55}, {"referenceID": 14, "context": "In addition (Heskes, 2003; Watanabe and Fukumizu, 2009), stable fixed points of BP are local minima of the Bethe free energy.", "startOffset": 12, "endOffset": 55}, {"referenceID": 10, "context": "2 The belief propagation algorithm The belief propagation algorithm (Pearl, 1988) is a message passing procedure, which output is a set of estimated marginal probabilities, the beliefs ba(xa) (including single nodes beliefs bi(xi)).", "startOffset": 68, "endOffset": 81}, {"referenceID": 13, "context": "Following Wainwright (2002), it is worth noting that the plain message update scheme can be rewritten as", "startOffset": 10, "endOffset": 28}, {"referenceID": 6, "context": "This suggests a different type of normalization, used in particular by Heskes (2003), namely Z ai (m̃) = Za(m̃) Zi(m̃) , (2.", "startOffset": 71, "endOffset": 85}, {"referenceID": 16, "context": "It is known (Yedidia et al., 2005) that the belief propagation algorithm is an iterative way of solving a variational problem, namely it minimizes over b the Bethe free energy F (b) associated with (1.", "startOffset": 12, "endOffset": 34}, {"referenceID": 9, "context": "As pointed out by Mooij and Kappen (2007), many different sets of messages can correspond to the same set of beliefs.", "startOffset": 18, "endOffset": 42}, {"referenceID": 15, "context": "When C = 1, it is known (Weiss, 2000) that normalized BP always converges to a fixed point.", "startOffset": 24, "endOffset": 37}, {"referenceID": 14, "context": "In the normalized case, Weiss (2000) shows that BP always converges to the Perron vector of this matrix.", "startOffset": 24, "endOffset": 37}, {"referenceID": 5, "context": "Indeed, the plain BP scheme is then a linear dynamical system which can converge to a subspace as described in Hartfiel (1997). We will describe more precisely this kind of behavior in Section 4.", "startOffset": 111, "endOffset": 127}, {"referenceID": 14, "context": "It is actually not necessary to have a proper norm: Watanabe and Fukumizu (2009) use a scheme that amounts to Z ai(m) def = Θai,1(m).", "startOffset": 52, "endOffset": 81}, {"referenceID": 9, "context": "We will then conclude by looking at b-convergence in a quotient space introduced in Mooij and Kappen (2007) and we show the links between these two approaches.", "startOffset": 84, "endOffset": 108}, {"referenceID": 9, "context": "We follow now an idea developed in Mooij and Kappen (2007) and study the behavior of the BP algorithm in a quotient space corresponding to the invariance of beliefs.", "startOffset": 35, "endOffset": 59}, {"referenceID": 4, "context": "So the bconvergence of a sequence μ(n) is simply the convergence of μ(n) in the quotient space N \\W (which is a vector space, see Halmos (1974)).", "startOffset": 130, "endOffset": 144}, {"referenceID": 12, "context": "5 Local stability of BP fixed points The question of convergence of BP has been addressed in a series of works (Tatikonda and Jordan, 2002; Mooij and Kappen, 2007; Ihler et al., 2005) which establish conditions and bounds on the MRF coefficients for having global convergence.", "startOffset": 111, "endOffset": 183}, {"referenceID": 9, "context": "5 Local stability of BP fixed points The question of convergence of BP has been addressed in a series of works (Tatikonda and Jordan, 2002; Mooij and Kappen, 2007; Ihler et al., 2005) which establish conditions and bounds on the MRF coefficients for having global convergence.", "startOffset": 111, "endOffset": 183}, {"referenceID": 7, "context": "5 Local stability of BP fixed points The question of convergence of BP has been addressed in a series of works (Tatikonda and Jordan, 2002; Mooij and Kappen, 2007; Ihler et al., 2005) which establish conditions and bounds on the MRF coefficients for having global convergence.", "startOffset": 111, "endOffset": 183}, {"referenceID": 9, "context": ", q} by the elements J ′j,l ai,k def = b (iaj) kl A a′j ai , This expression is analogous to the Jacobian encountered in Mooij and Kappen (2007). It is interesting to note that it only depends on the structure of the graph and on the belief corresponding to the fixed point.", "startOffset": 121, "endOffset": 145}, {"referenceID": 1, "context": "Brémaud (1999)).", "startOffset": 0, "endOffset": 15}, {"referenceID": 1, "context": "Brémaud (1999)). The presence of the messages in the Jacobian matrix J̃ complicates the evaluation of this effect. However, it is known (see e.g. Furtlehner et al. (2010)) that it is possible to chose the functions φ̂ and ψ̂ as", "startOffset": 0, "endOffset": 171}, {"referenceID": 2, "context": "Diaconis and Strook (1991) for geometric bounds) of each elementary stochastic matrix B(iaj), while λ1 encodes the statistical properties of the graph connectivity.", "startOffset": 0, "endOffset": 27}, {"referenceID": 9, "context": "In terms of convergence in N \\W, the stability of a fixed point is given by the projection of J on the quotient spaceN\\W and we have (Mooij and Kappen, 2007) : [J ] def = [∇Λ] = ∇[Λ] Proposition 5.", "startOffset": 133, "endOffset": 157}, {"referenceID": 0, "context": "Berge (1967)).", "startOffset": 0, "endOffset": 13}, {"referenceID": 16, "context": "Usually, since one resorts to some kind of normalization, the multiplicative constants of the fixed point equations are discarded (see Yedidia et al. (2005) for more details).", "startOffset": 135, "endOffset": 157}, {"referenceID": 0, "context": "Berge (1967)).", "startOffset": 0, "endOffset": 13}], "year": 2013, "abstractText": "An important part of problems in statistical physics and computer science can be expressed as the computation of marginal probabilities over a Markov Random Field. The belief propagation algorithm, which is an exact procedure to compute these marginals when the underlying graph is a tree, has gained its popularity as an efficient way to approximate them in the more general case. In this paper, we focus on an aspect of the algorithm that did not get that much attention in the literature, which is the effect of the normalization of the messages. We show in particular that, for a large class of normalization strategies, it is possible to focus only on belief convergence. Following this, we express the necessary and sufficient conditions for local stability of a fixed point in terms of the graph structure and the beliefs values at the fixed point. We also explicit some connexion between the normalization constants and the underlying Bethe Free Energy.", "creator": "LaTeX with hyperref package"}}}