{"id": "1106.2647", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "14-Jun-2011", "title": "From Causal Models To Counterfactual Structures", "abstract": "Galles and Pearl claimed that \"for recursive models, the causal model framework does not add any restrictions to counterfactuals, beyond those imposed by Lewis's [possible-worlds] framework.\" This claim is examined carefully, with the goal of clarifying the exact relationship between causal models and Lewis's framework. Recursive models are shown to correspond precisely to a subclass of (possible-world) counterfactual structures. On the other hand, a slight generalization of recursive models, models where all equations have unique solutions, is shown to be incomparable in expressive power to counterfactual structures, despite the fact that the Galles and Pearl arguments should apply to them as well. The problem with the Galles and Pearl argument is identified: an axiom that they viewed as irrelevant, because it involved disjunction (which was not in their language), is not irrelevant at all.", "histories": [["v1", "Tue, 14 Jun 2011 09:34:05 GMT  (42kb)", "https://arxiv.org/abs/1106.2647v1", null], ["v2", "Sat, 17 Aug 2013 13:36:57 GMT  (46kb)", "http://arxiv.org/abs/1106.2647v2", "A preliminary version of this paper appears in the Proceedings of the Twelfth International Conference on Principles of Knowledge Representation and Reasoning (KR 2010), 2010.}"]], "reviews": [], "SUBJECTS": "cs.AI", "authors": ["joseph y halpern"], "accepted": false, "id": "1106.2647"}, "pdf": {"name": "1106.2647.pdf", "metadata": {"source": "CRF", "title": "From Causal Models To Counterfactual Structures", "authors": ["Joseph Y. Halpern"], "emails": ["halpern@cs.cornell.edu"], "sections": [{"heading": null, "text": "ar X\niv :1\n10 6.\n26 47\nv2 [\ncs .A\nI] 1\n7 A"}, {"heading": "1 Introduction", "text": "Counterfactual reasoning arises in broad array of fields, from statistics to economics to law. Not surprisingly, there has been a great deal of work on giving semantics to counterfactuals. Perhaps the best-known approach is due to Lewis [1973] and Stalnaker [1968], and involves possible worlds. The idea is that a counterfactual of the form “if A were the case then B would be the case”, typically written A B, is true at a world w if B is true at all the worlds closest to w where A is true. Of course, making this precise requires having some notion of “closeness” among worlds.\nMore recently, Pearl [2000] proposed the use of causal models based on structural equations for reasoning about causality. In causal models, we can examine the effect of interventions, and answer questions of the form “if random variable X were set to x, what would the value of random variable Y be”. This suggests that causal models can also provide semantics for (at least some) counterfactuals.\nThe relationship between the semantics of counterfactuals in causal models and in counterfactual structures (i.e., possible-worlds structures where the semantics of counterfactuals is given in terms of\n∗A preliminary version of this paper appears in the Proceedings of the Twelfth International Conference on Principles of Knowledge Representation and Reasoning (KR 2010), 2010.\n†Supported in part by NSF grants IIS-0534064, IIS-0812045, and IIS-0911036, and by AFOSR grants FA9550-08-1-0438 and FA9550-09-1-0266, and ARO grant W911NF-09-1-0281.\nclosest worlds) was studied by Galles and Pearl [1998]. They argue that the relationship between the two approaches depends in part on whether we consider recursive (i.e., acyclic) models (those without feedback—see Section 2 for details). They reach the following conclusion [Pearl 2000, p. 242].1\nIn sum, for recursive models, the causal model framework does not add any restrictions to counterfactuals beyond those imposed by Lewis’s framework; the very general concept of closest worlds is sufficient. Put another way, the assumption of recursiveness is so strong that it already embodies all other restrictions imposed by structural semantics. When we consider nonrecursive systems, however, we see that reversibility [a particular axiom introduced by Galles and Pearl] is not enforced by Lewis’s framework.\nThis conclusion seems to have been accepted by the community. For example, in the Wikipedia article on “Counterfactual conditional” (en.wikipedia.org/wiki/Counterfactual conditional; Sept., 2009), it says “[The definition of counterfactuals in causal models] has been shown to be compatible with the axioms of possible world semantics.”\nIn this paper I examine these claims and the proofs given for them more carefully, and try to settle once and for all the relationship between causal models and counterfactual structures. The first sentence in the statement above says “for recursive models, the causal model framework does not add any restrictions to counterfactuals beyond those imposed by Lewis’s framework”. It is not clear (at least to me) exactly what this means. Recursive models are a well-defined subclass of causal models. Galles and Pearl themselves show that there are additional axioms that hold in recursive models over and above those that hold in counterfactual structures. Indeed, they show that the reversibility axiom mentioned above is valid in recursive models and is not valid in possible-worlds models. They also show that all the axioms of causal reasoning in the possible-worlds framework that they view as relevant (specifically, axioms that do not mention disjunction, since it is not in their language) hold in recursive causal models. Thus, the only conclusion that can be drawn from their argument is just the opposite to what they claim, namely, that the possible-worlds approach does not add any restrictions to causal reasoning beyond those imposed by causal models, since causal models satisfy all the axioms that counterfactual structures do, and perhaps more.2\nPearl [private communication, 2010] intended the clause “for recursive models” to apply to counterfactual structures as well as to structural models. However, the notion of a recursive counterfactual structure is not defined either by Galles and Pearl [1998] or Pearl [2000]. In fact, in general, the notion of recursive model as defined, for example, in [Pearl 2000, Definition 7.3.4], does not even make sense for counterfactual structures. I show that, if we focus on the language considered by Galles and Pearl and counterfactual structures appropriate for this language, there is a well-defined subclass of counterfactual structures that can justifiably be viewed as recursive (counterfactual) structures. I then show that precisely the same formulas in this language are valid in recursive causal models and recursive counterfactual structures. Put another way, at least as far as Galles and Pearl’s language goes, recursive causal models and recursive counterfactual structures are equally expressive. Thus, by restricting to recursive counterfactual structures (as Pearl intended), the Galles-Pearl claim is, in a sense, correct (although the\n1The discussion in Section 7.4.2 of [Pearl 2000] is taken almost verbatim from [Galles and Pearl 1998]; since the former is more widely available, that is what I cite in this paper.\n2Although it is not relevant to the focus of this paper, I in fact also do not understand the second sentence in the Pearl quote above. As for the third sentence, while it is the case that reversibility does not hold in counterfactual structures in general, reversibility holds in recursive causal structures as well as more general causal structures, as Pearl and Galles themselves show.\nclaim does not follow from their argument—see below). However, it should be noted that Galles and Pearl’s language cannot, for example, express statements with disjunctive antecedents, such as “if he had chosen a different running mate or had spent his campaign funding more wisely then he would have won the election”. The claim applies only to their restricted language.\nGalles and Pearl try to prove their claims by considering axioms; my proof works at the level of structures. Specifically, I show that a recursive causal model satisfying a particular formula can be effectively converted to a recursive counterfactual structures satisfying this formula, and vice versa. It is actually important to work at the level of structures to prove this claim, rather than working at the level of axioms. I show that the argument that Galles and Pearl give for their claim is incorrect in some significant respects. The problem lies with their claim that axioms involving disjunctive antecedents are irrelevant. As I show, they are quite relevant; a proof of a formula not involving disjunction in the antecedent may need to use an axiom that does. This possibility is illustrated by considering a class of models slightly larger than recursive models. In a recursive model, given a context, there is a unique solution to every equation. In earlier work [Halpern 2000], I showed that there are nonrecursive causal models where every equation has a unique solution. Galles and Pearl’s argument applies without change to causal models where the equations have a unique solution. However, as I show here, these models are actually incomparable in expressive power to counterfactual structures. The reversibility axiom remains valid in causal models where the equations have a unique solution. But, as I show by example, there is a formula that does not involve disjunction that is valid in counterfactual structures but is not valid in causal models where the equations have a unique solution. Not surprisingly, proving that this formula is valid from the axioms requires the use of an axiom that involves disjunction.\nThese results show that the quote from Wikipedia is not quite true. While it is true that recursive causal structures are, in a certain sense, compatible with the axioms of possible worlds semantics, the slightly more general class of causal structures with unique solutions to the equations is not. Thus, in general, the semantics of counterfactuals in causal structures cannot be understood in terms of closest worlds.\nThe rest of this paper is organized as follows. In Section 2, I review the causal models and counterfactual structures. The main technical results are in Section 3, which also includes a discussion of the problems with the Galles-Pearl argument. I conclude in Section 4 with some discussion of these results."}, {"heading": "2 Causal models and possible-worlds models: a review", "text": "In this section I review the relevant material on causal models and possible-worlds models."}, {"heading": "2.1 Causal models", "text": "(The following discussion is taken, with minor modifications, from [Halpern 2000].) Causal models describe the world in terms of random variables, some of which have a causal effect on others. It is conceptually useful to split the random variables into two sets, the exogenous variables, whose values are determined by factors outside the model, and the endogenous variables, whose values are ultimately determined by the exogenous variables. The values of the endogenous variables are characterized by a set of structural equations.\nFor example, if we are trying to determine whether a forest fire was caused by lightning or an arsonist, we can take the world to be described by four random variables:\n• FF for forest fire, where FF = 1 if there is a forest fire and FF = 0 otherwise;\n• L for lightning, where L = 1 if lightning occurred and L = 0 otherwise;\n• MD for match dropped (by arsonist), where MD = 1 if the arsonist dropped a lit match, and MD = 0 otherwise;\n• E, which captures the external factors that determine whether the arsonist will drop a match, or whether lightning will strike.\nThe variables FF , L, and MD are endogenous, while E is exogenous. If we want to model the fact that if the arsonist drops a match or lightning strikes then a fire starts, then we would have the equation FF = max(L,MD); that is, the value of the random variable FF is the maximum of the values of the random variables MD and L. This equation says, among other things, that if MD = 0 and L = 1, then FF = 1. Alternatively, if we want to model the fact that a fire requires both a lightning strike and a dropped match (perhaps the wood is so wet that it needs two sources of fire to get going), then the only change in the model is that the equation for FF becomes FF = min(L,MD); the value of FF is the minimum of the values of MD and L. The only way that FF = 1 is if both L = 1 and MD = 1.\nFormally, a signature S is a tuple (U ,V,R), where U is a finite set of exogenous variables, V is a finite set of endogenous variables, and R associates with every variable X ∈ U ∪ V a finite set R(X) of possible values for X (the range of possible values of X). A causal model is a pair T = (S,F), where S is a signature and F associates with each variable X ∈ V a function denoted FX such that FX : (×Z∈(U∪V−{X})R(Z)) → R(X). FX characterizes the value of X given the values of all the other variables in U∪V . Because FX is a function, there is a unique value of X once all the other variables are set. Notice that we have such functions only for the endogenous variables. The exogenous variables are taken as given; it is their effect on the endogenous variables (and the effect of the endogenous variables on each other) that is modeled by the structural equations.\nGiven a causal model T = (S,F), a (possibly empty) vector ~X of variables in V , and a vector ~x of values for the variables in ~X, we can define a new causal model denoted T ~X=~x. Intuitively, this is the causal model that results when the variables in ~X are set to ~x. We can think of setting ~X to ~x as an intervention. For example, if T is the causal model for the forest fire described above, where FF = max(L,MD), then TL=0 is the model where the lightning definitely does not occur, so that there is a forest fire if and only if the arsonist drops a match. If T ′ is the model where FF = min(L,MD), then T ′L=0 is the model where there is no forest fire, since there is no lightning.\nFormally, T ~X=~x = (S,F ~X=~x}), where F ~X=~x is identical to F except that the equation for X is replaced by the equation X = x. The model T ~X=~x describes a possible counterfactual situation; that is, even though, under normal circumstances, setting the exogenous variables to ~u results in the variables ~X having value ~x′ 6= ~x, this submodel describes what happens if they are set to ~x due to some “external action”, the cause of which is not modeled explicitly.\nIn general, given a context ~u, that is, a setting for the exogenous variables, there may not be a unique vector of values that simultaneously satisfies all the equations in T ~X=~x; indeed, there may not be a solution at all. One special case where the equations in a causal model T are guaranteed to have\na unique solution is when there is a total ordering ≺T of the variables in V such that if X ≺T Y , then FX is independent of the value of Y ; that is, FX(. . . , y, . . .) = FX(. . . , y′, . . .) for all y, y′ ∈ R(Y ). In this case, T is said to be recursive or acyclic. Intuitively, if T is recursive, then there is no feedback; if X ≺T Y , then the value of X may affect the value of Y , but the value of Y has no effect on the value of X. It should be clear that if T is a recursive model, then, given a context ~u, there is always a unique solution to the equations in T ~X=~x, for all\n~X and ~x, (We simply solve for the variables in the order given by ≺T .)\nFollowing [Halpern 2000], I consider three successively more general classes of causal models for a given signature S (with a focus on the first two):\n1. Trec(S): the class of recursive causal models over signature S;\n2. Tuniq(S): the class of causal models T over S where, for all ~X ⊆ V , ~x, the equations in T ~X=~x have a unique solution for all contexts ~u;\n3. T (S): the class of all causal models over S .\nI often omit the signature S when it is clear from context or irrelevant, but the reader should bear in mind its important role.\nSyntax and Semantics: In [Halpern 2000], a number of languages for reasoning about causality are considered. The choice of language is significant. As Galles and Pearl already point out, we cannot in any obvious way give a meaning in causal models to counterfactual implications where there is a disjunction on the left-hand side of the implication, that is formulas of the form (A ∨ A′) B. Thus, our results effectively consider a language with no disjunction on the left-hand side of . As mentioned in the introduction, one of the results of this paper have the form “for every recursive causal model, there is a recursive causal structure that satisfies the same formulas”, and vice versa. For this result to have any bite, we must choose a reasonably rich language.\nIn [Halpern 2000], I considered a number of languages appropriate for reasoning about causality in causal models. I briefly review two of them here. The languages are parameterized by the signature S . A basic causal formula is one of the form [Y1 = y1, . . . , Yk = yk]ϕ, where ϕ is a Boolean combination of formulas of the form X = x, Y1, . . . , Yk,X are variables in V , Y1, . . . , Yk are distinct, and x ∈ R(X). I typically abbreviate such a formula as [~Y = ~y]ϕ. The special case where k = 0 is abbreviated as ϕ. A causal formula is a Boolean combination of basic causal formulas. Let L+(S) consist of all causal formulas over the signature S . (Again, I often omit the signature S if it is clear from context or not relevant.)\nRoughly speaking, we can think of L+(S) as the language that results by starting with primitive propositions of the form X = x, where X is a random variable in V and x ∈ R(X), and closing under modal operators of the form [~Y = ~y]. The restriction to primitive propositions of this form is not a major one. Given a propositional language with primitive propositions P1, . . . , Pn, we can define binary random variables X1, . . . ,Xn (i.e., variables whose range is {0, 1}) and identify Xi = 1 with “Pi is true”. That is, as long as we can we define structural equations that characterize how a change in one primitive propositions affects the other primitive propositions, taking the primitive propositions to have the form X = x is not a major restriction.\nThe formula [~Y = ~y]X = x can be interpreted as “in all possible solutions to the structural equations obtained after setting Yi to yi, i = 1, . . . , k, and the exogenous variables to ~u, random variable X has\nvalue x”. This formula is true in a causal model T in a context ~u if in all solutions to the equations in T~Y=~y in context ~u, the random variable X has value x. Note that this formula is trivially true if there are no solutions to the structural equations.\nA formula in L+(S) is true or false in a causal model in T (S), given a context ~u. As usual, we write (T, ~u) |= ϕ if the causal formula ϕ is true in causal model T given context ~u.3 For a basic causal formula [~Y = ~y]ϕ, we define (T, ~u) |= [~Y = ~y]ϕ if ϕ holds in all solutions to the equations F ~Y=~y with the values of the variables in U set to ~u. Thus, for example, if ϕ has the form X1 = x1 ∨X2 = x2, then (T, ~u) |= ϕ iff every vector of values for the endogenous variables that simultaneously satisfies all the equations in F has either X1 = x1 or X2 = x2.4 We define the truth value of arbitrary causal formulas, which are just Boolean combinations of basic causal formulas, in the obvious way:\n• (T, ~u) |= ϕ1 ∧ ϕ2 if (T, ~u) |= ϕ1 and (T, ~u) |= ϕ2\n• (T, ~u) |= ¬ϕ if (T, ~u) 6|= ϕ.\nAs usual, a formula ϕ is said to be valid with respect to a class T ′ of causal models if (T, ~u) |= ϕ for all T ∈ T ′ and contexts ~u in T .\nL+ is the most general language that I consider in [Halpern 2000]. To compare my results to those of GP, who use a more restricted language, I also consider some restrictions of L+. Specifically, let Luniq be the sublanguage of L+ that consists of Boolean combinations of formulas of the form [~Y = ~y](X = x). Thus, the difference between Luniq and L+ is that in Luniq, only X = x is allowed after [~Y = ~y], while in L+, arbitrary Boolean combinations of formulas of the form X = x are allowed. As the following lemma, proved in [Halpern 2000], shows, for reasoning about causality in Tuniq, the language Luniq is adequate, since it is equivalent in expressive power to L+.\nLemma 2.1 [Halpern 2000] In Tuniq and Trec, the language L+ and Luniq are expressively equivalent; for every formula ϕ ∈ L+, we can effectively find a formula ϕ′ ∈ Luniq such that Tuniq |= ϕ ⇔ ϕ′.\nThe equivalence described in Lemma 2.1 no longer holds when reasoning about causality in the more general class T of structures. However, since I focus in this paper on Trec and Tuniq, in the rest of the paper I consider the language Luniq; this suffices to make my points.\n3In [Halpern 2000], following [Galles and Pearl 1998], the context was included in the formula. The definition of (T, ~u) |= X = x given here is intended to be equivalent to that of T |= X(~u) = x. The advantage of having ~u on the left-hand side of |= (which is also the formalism used in [Halpern and Pearl 2005]) is that it enforces the intuition that the context consists of background information that is typically suppressed. It does lead to loss in expressive power, since it is not possible to consider formulas of the form X1(~u1) = x1 ∧X2(~u2) = x2, where ~u1 6= ~u2. But this turns out to be an advantage—see the next footnote.\n4In [Halpern 2000], truth was defined for formulas of the form [~Y = ~y](X = x), and extended in “the obvious way” to Boolean combinations; that is ϕ1 ∨ ϕ2 was taken to be true if either ϕ1 was true or ϕ2 was true. This is equivalent to the approach described above as long as all equations have a unique solution, that is, in Tuniq. However, the two approaches are not equivalent if equations can have more than one solution. The approach suggested here is what is required to make the axioms given in [Halpern 2000] sound in the general case. We do not want to say that X1 = x1 ∨X2 = x2 is true if X1 = x1 is true in all solutions to the equations or X2 = x2 is true in all solutions to the equations; rather, we want either X1 = x1 or X2 = x2 to be true in all solutions. With the approach given above, it is not clear how to give semantics to formulas such as X1(~u1) = x1 ∨X2(~u2) = x2 if ~u1 6= ~u2, which is perhaps another good reason for not allowing such formulas.\nAxiomatizations I briefly recall some standard definitions from logic. An axiom system AX consists of a collection of axioms and inference rules. An axiom is a formula (in some predetermined language L), and an inference rule has the form “from ϕ1, . . . , ϕk infer ψ”, where ϕ1, . . . , ϕk, ψ are formulas in L. A proof in AX consists of a sequence of formulas in L, each of which is either an axiom in AX or follows by an application of an inference rule. A proof is said to be a proof of the formula ϕ if the last formula in the proof is ϕ. We say ϕ is provable in AX, and write AX ⊢ ϕ, if there is a proof of ϕ in AX; similarly, we say that ϕ is consistent with AX if ¬ϕ is not provable in AX.\nAn axiom system AX is said to be sound for a language L with respect to a class T ′ of causal models if every formula in L provable in AX is valid with respect to T ′. AX is complete for L with respect to T ′ if every formula in L that is valid with respect to T ′ is provable in AX.\nConsider the following axioms, taken from [Halpern 2000], modified slightly for the language used here:\nC0. All instances of propositional tautologies in the language Luniq.\nC1. [~Y = ~y](X = x) ⇒ ¬[~Y = ~y](X = x′), if x, x′ ∈ R(X), x 6= x′. (Equality)\nC2. ∨x∈R(X)[~Y = ~y](X = x). (Definiteness)\nC3. ([ ~X = ~x](W = w) ∧ ([ ~X = ~x](Y = y)) ⇒ [ ~X = ~x;W = w](Y = y)). 5 (Composition)\nC4. [X = x; ~W = ~w](X = x). (Effectiveness)\nC5. ([ ~X = ~x;W = w](Y = y) ∧ [ ~X = ~x;Y = y](W = w)) ⇒ [ ~X = ~x](Y = y), if Y 6= W .6 (Reversibility)\nThe key axioms C3–C5 were introduced (and named) by Galles and Pearl [1998]. Perhaps most relevant to this paper is the reversibility axiom, C5. It says that if setting ~X to ~x and W to w results in Y having value y and setting ~X to ~x and Y to y results in W having value w, then Y must already have value y when we set ~X to x (and W must already have value w).\nLet AXuniq(S) consist of C0–C5 and the rule of inference modus ponens (from ϕ and ϕ ⇒ ψ infer ψ).\nTheorem 2.2 ([Halpern 2000]) AXuniq(S) is a sound and complete axiomatization for Luniq(S) with respect to Tuniq(S).\nUsing Lemma 2.1, it is possible to get a complete axiomatization for L+ with respect to Tuniq(S), simply by adding axioms for converting a formula in L+ to an equivalent formula in Luniq. A complete axiomatization for Luniq with respect to Trec(S) is also given in [Halpern 2000]; it requires adding a somewhat complicated axiom called C6 to AXuniq that captures acyclicity. The details are not relevant for our purposes, so I do not discuss C6 further.\n5Galles and Pearl use a stronger version of C3: ([ ~X = ~x](W = w) ⇒ ([ ~X = ~x](Y = y)) ⇔ [ ~X = ~x;W = w](Y = y)). The stronger version follows from the weaker version in the presence of the other axioms. (This is actually shown in the proof of Proposition 3.3.)\n6The assumption that Y 6= W was not made by Galles and Pearl [1998] nor by Halpern [2000], but it is necessary. For example, if W = Y , then one instance of C5 would be ([ ~X = ~x;Y = y](Y = y) ∧ [ ~X = ~x;Y = y](Y = y)) ⇒ [ ~X = ~x](Y = y). The antecedent is true by C4, while the conclusion is not true in general.\nFinally, a complete axiomatization for L+ with respect to T (S), the class of all causal models, is given. The axioms are similar in spirit to those in AXuniq. In particular, there is the following analogue to reversibility (where 〈 ~X = ~x〉ϕ is an abbreviation for ¬[ ~X = ~x]¬ϕ):\n(〈 ~X = ~x;Y = y〉(W = w ∧ ~Z = ~z) ∧ 〈 ~X = ~x;W = w〉(Y = y ∧ ~Z = ~z))\n⇒ 〈 ~X = ~x〉(W = w ∧ Y = y ∧ ~Z = ~z)), where ~Z = V − ( ~X ∪ {W,Y })."}, {"heading": "2.2 Possible-worlds models for counterfactuals", "text": "There have been a number of semantics for counterfactuals. I focus here on one due to Lewis [1973]. Let Φ be a finite set of primitive propositions. A counterfactual structure M is a tuple (Ω, R, π), where Ω is a finite set of possible worlds,7 π is an interpretation that maps each possible world to a truth assignment over Φ, and R is a ternary relation over Ω. Intuitively, (w, u, v) ∈ R if u is as close/preferred/plausible as v when the real world is w. Let u w v be an abbreviation for (w, u, v) ∈ R, and define Ωw = {u : u w v ∈ R for some v ∈ Ω}; thus, the worlds in Ωw are those that are at least as plausible as some world in Ω according to w. Define v ≺w v′ if v w v′ and v′ 6 w v. We require that w ∈ Ωw, that w be reflexive and transitive on Ωw, and that w ≺w u for all u 6= w. Thus, ≺w puts an ordering on worlds that can be viewed as characterizing “closeness to w”, and w is the closest world to itself.\nLet LC(Φ) be the language formed by starting with Φ and closing off under ∧, ¬, and (where denotes counterfactual implication). The language LC allows arbitrary nesting of counterfactual implications. By way of contrast, the language L+ and its sublanguages have only one level of nesting, if we think of [ ~X = ~x]ϕ as ( ~X = ~x) ϕ. Let LC1 be the sublanguage of L\nC consisting of all formulas with no nested occurrence of (including formulas with no occurrence of at all).\nWe can give semantics to formulas in LC (and hence LC1 ) in a counterfactual structures M = (Ω, R, π) as follows. The first few clauses are standard:\n• (M,w) |= p, when p ∈ Φ, if π(w)(p) = true.\n• (M,w) |= ϕ ∧ ψ if (M,w) |= ϕ and (M,w) |= ψ.\n• (M,w) |= ¬ϕ if it is not the case that (M,w) |= ϕ.\nTo give semantics to ϕ ψ, assume inductively that we have already given semantics to ϕ at all worlds in M . Define closestM (w,ϕ) = {v ∈ Ωw : (M,v) |= ϕ and there is no world v′ such that (M,v′) |= ϕ and v′ ≺w v}. Thus, closestM (w,ϕ) is the set of worlds closest to w where ϕ is true. (Notice that if there are no worlds where ϕ holds, then closestM (w,ϕ) = ∅.)\n• (M,w) |= ϕ ψ if (M,v) |= ψ for all v ∈ closestM (w,ϕ).\n7Giving semantics to counterfactual formulas in structures with infinitely many worlds adds an extra level of complexity. As shown by Friedman and Halpern [1994], if a formula in the language I am about to introduce is satisfiable at all, it is satisfiable in a structure with finitely many worlds, so as far as validity goes, there is no loss of generality in restricting to finite structures.\nAxioms: There are a number of well-known sound and complete axiomatizations for counterfactual logic (see, e.g., [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]). Here is one, based on Burgess’s axiomatization, similar in spirit to the well-known KLM properties [Kraus, Lehmann, and Magidor 1990].\nA0. All instances of propositional tautologies in the language LC .\nA1. ϕ ϕ."}, {"heading": "A2. ((ϕ ψ1) ∧ (ϕ ψ2)) ⇒ (ϕ (ψ1 ∧ ψ2)).", "text": ""}, {"heading": "A3. ((ϕ1 ϕ2) ∧ (ϕ1 ψ)) ⇒ ((ϕ1 ∧ ϕ2) ψ).", "text": ""}, {"heading": "A4. ((ϕ1 ψ) ∧ (ϕ2 ψ)) ⇒ ((ϕ1 ∨ ϕ2) ψ).", "text": "A5. ¬(true false)."}, {"heading": "A6. ϕ ⇒ (ψ ⇔ (ϕ ψ)).", "text": "There are three rules of inference: modus ponens, and the following two rules:\nRA1. From ϕ ⇔ ϕ′ infer (ϕ ψ) ⇒ (ϕ′ ψ).\nRA2. From ψ ⇒ ψ′ infer (ϕ ψ) ⇒ (ϕ ψ′).\nA1–A4 and RA1–RA2 correspond to the KLM postulates REF (for reflexivity), AND, CM (cautious monotonicity), OR, LLE (left logical equivalence), and RW (right weakening), respectively. A5 captures the requirement that Ωw is nonempty. Finally, A6 is the axiom that makes a counterfactual operator, and not just a “normality” or “typicality” operator (so that “normally birds have wings” becomes bird wing). Suppose that it is the case that if ϕ were true, then ψ would be true. Then if ϕ is actually true, we would expect ψ to be true. Moreover, if ϕ and ψ are both true, then it seems reasonable to assert that if ϕ were true, then ψ would be true. On the other hand, it is not in general the case that if ϕ and ψ are both true, then ϕ’s are normally or typically ψ’s.\nIn his semantics, Lewis allows there to be more than one world closest to a world w where ϕ is true (except in the special case that ϕ is true at w; in this case, w is the unique world closest to w satisfying ϕ). By way of contrast, Stalnaker [1968] essentially assumes that for each world w and formula ϕ, there is a unique world closest to w satisfying ϕ. The standard approach to getting uniqueness is to require that w be a strict total order (whose least element is w); that is, for all worlds w′ 6= w′′, either w′ ≺w w ′′ or w′′ ≺w w′. This assumption is captured by the following axiom:"}, {"heading": "A7. (ϕ (ψ1 ∨ ψ2)) ⇒ ((ϕ ψ1) ∨ (ϕ ψ2)).", "text": "Let AX be the axiom system consisting of axioms A0–A6 and rules of inference RA1, RA2, and modus ponens; let AX′ be AX together with the axiom A7. Let M(Φ) be the collection of all counterfactual structures over the primitive propositions in Φ (i.e., structures where π interprets formulas in Φ); let M+(Φ) be the subset of M(Φ) consisting of all counterfactual structures where w is a total strict order. As usual, I omit the Φ when it is clear from context or irrelevant.\nTheorem 2.3 [Burgess 1981] AX (resp., AX′) is a sound and complete axiomatization for the language Luniq with respect to M (resp., M+)."}, {"heading": "3 Relating causal models to counterfactual structures", "text": "As the title suggests, in this section I take a closer look at the relationship between causal models and counterfactual structures. On the surface, the two approaches are quite different. Consider the causal model for the forest fire example, discussed in Section 2.1. If we want to capture the forest fire using counterfactual structures, perhaps the most natural way to do it is to have worlds in the counterfactual structure that correspond to the eight possible settings of the three exogenous variables (MD , L, and FF ). We can take primitive propositions that correspond to the settings of these variables as well; that is, the primitive propositions have the form MD = i, L = i, and FF = i, for i = 0, 1. The actual world w is the one where MD = 1∧L = 1∧FF = 1 holds. The closest world relation is described in the obvious way by the equations. For example, if we consider the conjunctive model, where FF = min(MD , L), so that both the match and the lightning are required to start the fire, then the closest world to w where MD = 0 is the one where MD = 0 ∧ L = 1 ∧ FF = 0 holds. On the other hand, in the disjunctive model, where FF = max(MD , L), the closest world to w where MD = 0 holds is the one where MD = 0 ∧ L = 1 ∧ FF = 1 holds. There is a sense in which the causal model and the corresponding counterfactual structure(s) constructed this way satisfy the same formulas. In this section, I make this intuition precise. More generally, I show that to every causal model in Trec, there is a corresponding counterfactual structure that satisfies the same formulas; however, this is not the case for every causal model in Tuniq.\nGiven a signature S = (U ,V,R), consider the set ΦS of primitive propositions of the form X = x for X ∈ V and x ∈ R(x). We restrict to counterfactual structures M = (Ω, R, π) for this set of primitive propositions, where π is such that, for each world w ∈ Ω and variable X ∈ V , exactly one of the formulas X = x is true. Call such structures acceptable. In an acceptable counterfactual structure, a world can be associated with an assignment of values to the random variables. An acceptable structure (Ω, R, π) is full if, for each assignment v of values to variables and all w ∈ Ω, there is a world in Ωw where v is the assignment. (I discuss the consequences of fullness shortly.) Let Ma(ΦS) consist of all acceptable counterfactual structures over S; let Mf (ΦS) consist of all full acceptable counterfactual structures over S; let M+a (ΦS) = Ma(ΦS) ∩M +(ΦS); and let M + f (ΦS) = Mf (ΦS) ∩M +(ΦS).\nAs before, I identify [~Y = ~y](X = x) ∈ Luniq(S) with the formula ~Y = ~y (X = x) ∈ LC1 (ΦS). I abuse notation and use Luniq(S) to denote the sublanguage of LC1 (ΦS) that arises via this identification. The following is easy to show.\nProposition 3.1 C3 and C4 are valid in Ma(ΦS); C2 is valid in M+a (ΦS); C1 is valid in Mf (ϕS).\nNotice that, in Ma(ΦS) (and hence all of its subsets), the following two formula schemes are valid:"}, {"heading": "V1. ∨x∈R(X)X = x", "text": "V2. If x 6= x′, then X = x ⇒ X 6= x′.\nIn Mf (ΦS), the following axiom is valid:\nV3. ¬[ ~X = ~x]false .\nV3 is valid in a structure where, for all worlds w, there is a closest world to w such that ~X = ~x, that is, closestM(w, ~X = ~x) 6= ∅, which is exactly what fullness ensures.8\nWith this background, I can give an “axiomatic” proof of Proposition 3.1:\n• C1 follows easily from A0, A2, A5, and V2.\n• C3 is a special case of A3.\n• C4 follows easily from A1 and RA2.\n• C2 is not provable in AX (and is not valid in Ma(ΦS)), but it is provable in AX′ together with the axiom V1. Indeed, it follows easily from A1, A7, RA2, and V1 (since ϕ ⇒ ∨x∈R(X)X = x is valid in M(ΦS)). The fact that C2 requires A7 is not surprising. C2 is essentially expressing the uniqueness of solutions, which is being captured by the assumption that there is a unique closest world where the antecedent is true, an assumption captured by A7.\nReversibility (C5) is conspicuously absent from this list. Indeed, as the following example shows, C5 is not sound in counterfactual structures.\nExample 3.2 Suppose that V = {X1,X2,X3}, and R(X1) = R(X2) = R(X3) = {0, 1}. Consider a structure (Ω, R, π) ∈ M+f where there is exactly one world in Ω corresponding to each of the 8 possible assignments of values to the variables. Thus, we can identify a world w in Ω with a triple (b1, b2, b3), where, in w, Xi = bi. All that matters about R is that (0, 0, 0) ≺(0,0,0) (1, 0, 0) ≺(0,0,0) (1, 1, 1), with the other 5 worlds being further from (0, 0, 0) than (1, 1, 1). Then it is immediate that\n(M, (0, 0, 0)) |= [X1 = 1;X2 = 1](X3 = 1) ∧ [X1 = 1;X3 = 1](X2 = 1) ∧ [X1 = 1](X2 = 0).\nThus, C5 is violated.\nFor the remainder of this section, fix S = (U ,V,R). Say that a counterfactual structure M = (Ω, R, π) in M+f (ΦS) is recursive if there is a total ordering ≺M of the variables in V such that if W ≺M Y , then for all ~X ⊆ V−{Y,W}, for each world w ∈ Ω, in the closest world to w where ~X = ~x and Y = y, the value of W is the same as in the closest world to w where ~X = ~x. Intuitively, setting Y to y has no further effect on the value of W once ~X is set to ~x. Let Mrec consist of the recursive structures in M+f . It is easy to see that the structure M considered in Example 3.2 is not in Mrec. For if it were, then we would have either X2 ≺M X3 or X3 ≺M X2. If X3 ≺M X2, then the value of X3 would have to be the same in the closest world to (0, 0, 0) where X1 = 1 and X2 = 1 as in the closest world to (0, 0, 0) where X1 = 1. But it is not. The same problem occurs if X2 ≺M X3.\nProposition 3.3 C5 is valid in Mrec.\nProof: Suppose that M = (Ω, R, π) ∈ Mrec, w ∈ Ω, and the antecedent of C5 holds at (M,w). If Y ≺M W , then it is immediate from the fact that (M,w) |= [ ~X = ~x;Y = y](W = w) that we also have (M,w) |= [ ~X = ~x](W = w). Now suppose that W ≺M Y . Then from (M,w) |= [ ~X = ~x;W = w](Y = y) it follows that (M,w) |= [ ~X = ~x](Y = y). Suppose, by way of contradiction,\n8Galles and Pearl did not discuss the axioms V1–V3, but it is clear that they are implicitly assuming that they hold.\nthat (M,w) |= [ ~X = ~x](W = w′) for some w′ 6= w. By C3 (which, by Proposition 3.1, is sound in M ), it follows that (M,w) |= [ ~X = ~x;Y = y](W = w′). This, combined with the fact that (M,w) |= [ ~X = ~x;Y = y](W = w), contradicts C1 (which, by Proposition 3.1, is also sound in M ). (Note that this argument actually shows that the stronger version of C3 used by Galles and Pearl, discussed in Footnote 4, follows from the weaker version used here.)\nNot surprisingly, the proof of Proposition 3.3 is essentially identical to the argument given by Galles and Pearl that reversibility holds in recursive structures. Indeed, it is not hard to show that the axiom C6 that characterizes recursive structures is valid in Mrec, and C5 follows from the other axioms in the presence of C6.\nEven more can be shown. In a precise sense, every causal model in Trec(S) can be identified with a counterfactual structure in Mrec(S) where the same formulas are true. It follows that recursive counterfactual structures are at least as general as recursive causal models. The converse is also true. I now make these claims precise.\nGiven a causal model T = (S,F) ∈ Trec, we construct a model MT = (Ω, R, π) as follows. Let Ω consist of all the assignments of values to the variables in U ∪ V . The interpretation π is defined in the obvious way: X = x is true in w if w assigns X value x. For each context ~u, let ~v~u be the assignment to the variables in V that is forced by the equations. (Since T ∈ Trec, ~v~u is uniquely determined.) More generally, for each assignment ~X = ~x, let ~v\n~u, ~X=~x be the assignment to the variables in V determined\nby the equations F ~X=~x in the context ~u. Let w~u = (~u,~v~u) and let w~u, ~X=~x = (~u,~v~u, ~X=~x). Finally, let R be such that the closest world to w~u where ~X = ~x is wu, ~X=~x, and for all assignments ~u and ~v to the exogenous and endogenous variables, respectively, Ω~u,~v consists of all worlds (~u,~v′) such that ~v′ is an arbitrary assignment to the endogenous variables. This does not uniquely determine R. Indeed, it places no constraints on w if w is not of the form w~u and does not completely determine R even if w does have the form w~u. It is easy to define a relation R that satisfies these constraints such that (1) ≺w~u is a strict total order on Ωw~u and (2) for w not of the form w~u, ≺w is a strict total order on Ωw that satisfies the recursiveness constraint.\nTheorem 3.4 MT ∈ Mrec and, for all formulas ϕ ∈ Luniq(S), we have (T, ~u) |= ϕ iff (MT , w~u) |= ϕ.\nProof: It is easy to see that we can take ≺MT=≺T , so MT ∈ Mrec. Using the definition of R, it is easy to show by induction on the structure of formulas that (T, ~u) |= ϕ iff (MT , w~u) |= ϕ. I leave the details to the reader.\nTheorem 3.4 shows that we can embed Trec in Mrec. I next give an embedding of Mrec in Trec. Now the causal model in Trec depends both on the counterfactual structure and a world in that structure. (I discuss why this is so after Theorem 3.5.) Suppose that M = (Ω, R, π) ∈ Mrec(S) and w ∈ Ω. Suppose that V = {X1, . . . ,Xn} and, without loss of generality, that Xi ≺M Xj iff i < j. Consider the causal model TM,w = (S,F), where FX is defined by induction on the ≺M -ordering. That is, we first define FX1 , since X1 is the ≺-minimal variable, then define FX2 , and so on. Suppose that (M,w) |= X1 = x1. Then define FX1 so that, for all contexts ~u and assignments ~v to the variables in V − {X1}, FX1(~u,~v) = x1. Suppose that we have defined FXi for i ≤ k. Define FXk+1 so that, for all contexts ~u and all assignments ~v to the variables in V − {Xk+1}, we have FXk+1(~u,~v) = x iff (M,w) |= [X1 = v1; . . . ,Xk = vk](Xk+1 = x).\nTheorem 3.5 TM,w ∈ Trec and, for all formulas ϕ ∈ Luniq(S) and all contexts ~u, we have (M,w) |= ϕ iff (TM,w, ~u) |= ϕ.\nProof: It is easy to see that TM,w ∈ Trec; the definition of F guarantees that ≺TM,w=≺M . The definition of FX is independent of the context; it easily follows that for all contexts ~u and ~u′, we have (TM,w, ~u) |= ϕ iff (TM,w, ~u′) |= ϕ. Again, an easy induction on the structure of ϕ shows that, for all contexts ~u, (M,w) |= ϕ iff (TM,w, ~u) |= ϕ.\nIt is easy to modify the construction slightly so that each context ~u corresponds to a different world w ∈ Ω. Thus, if the number of contexts is at least |Ω|, then we can get a closer analogue to Theorem 3.4, where we can associate with each world w ∈ Ω a context ~uw and show that (M,w) |= ϕ iff (T, ~uw) |= ϕ. However, Theorem 3.5 suffices for the following corollary.\nCorollary 3.6 The same formulas in Luniq(ΦS) are valid in both Trec(S) and Mrec(S).\nProof: If ϕ is not valid in Trec, then there is some causal model T ∈ Trec and context ~u such that (T, ~u) |= ¬ϕ. By Theorem 3.4, (MT , w~u) |= ¬ϕ, so ϕ is not valid in Mrec. For the converse, if ϕ is not valid in Mrec, then there is some counterfactual structure M ∈ Mrec and world w such that (M,w) |= ¬ϕ. By Theorem 3.5, (TM,w, ~u) |= ¬ϕ. Thus, the same formulas are satisfiable in both Trec and Mrec, and hence the same formulas are valid.\nWhat happens if we consider Tuniq rather than Trec? Now causal models and counterfactual structures are incomparable. Consider the formula\nϕ =def [X1 = 1](X2 = 1 ∧X3 = 0)∧ [X2 = 1](X3 = 1 ∧X1 = 0)∧ [X3 = 1](X1 = 1 ∧X2 = 0).\nTheorem 3.7 ¬ϕ is valid in Trec and Mf (and hence M + f ), but ϕ is satisfiable in Tuniq.\nProof: The validity of ¬ϕ in Trec follows from its validity in Mf , in light of Corollary 3.6 and the fact that Mrec ⊆ Mf . Nevertheless, I prove the validity of ¬ϕ in Trec first, since the proof is short and gives some insight. Consider a causal model T ∈ Trec, and suppose, by way of contradiction, that (M,w) |= ϕ. Let ≺T be the total ordering on the variables in V in T . One of X1, X2, and X3 must be minimal with respect to ≺T . Suppose it is X1 and that (T, ~u) |= X1 = i. Then we must have (T, ~u) |= [X2 = 1](X1 = i) and (T, ~u) |= [X3 = 1](X1 = i). But since (T, ~u) |= ϕ, it follows that (T, ~u) |= [X2 = 1](X1 = 0) and (T, ~u) |= [X3 = 1](X1 = 1). Thus, X1 cannot be minimal with respect to ≺T . An analogous argument shows that X2 and X3 also cannot be minimal with respect to ≺T . Thus, we have a contradiction.\nI next show that ¬ϕ is valid in Mf . Suppose by way of contradiction that M ∈ Mf and (M,w) |= ϕ. Consider a world w′ closest to w that satisfies X1 = 1 ∨ X2 = 1 ∨ X3 = 1. (Since M ∈ Mf , there is guaranteed to be such a world.) Suppose that (M,w′) |= X1 = 1. Note that w′ must be one of the worlds closest to w that satisfies X1 = 1. Since (M,w) |= [X1 = 1](X2 = 1), we must have (M,w′) |= X2 = 1. Thus, w′ must also be one of the worlds closest to w that satisfies X2 = 1. Since (M,w) |= [X2 = 1](X3 = 1), we must have that (M,w′) |= X3 = 1. On the other hand,\nsince (M,w) |= [X1 = 1](X3 = 0), we must have have that (M,w′) |= X3 = 0. This gives a contradiction. A similar contradiction arises if (M,w′) |= X2 = 1 or if (M,w′) |= X3 = 1. Since (M,w′) |= X1 = 1 ∨X2 = 1 ∨X3 = 1 by construction, this gives a contradiction to the assumption that (M,w) |= ϕ.\nFinally, I must show that there is a causal model T ∈ Tuniq and a context ~u such that (T, ~u) |= ϕ. Let V = {X1,X2,X3} and let U = {U}. Take R(X1) = R(X2) = R(X3) = {0, 1} and R(U) = {0}. In defining F , I write Fi instead of FXi , and omit the U argument (since it is always 0). Thus, F1(0, 0) = 0 means that when X2 = X3 = 0, then X1 = 0. Define\n• F1(0, 0) = 0; F1(0, 1) = 1; F1(1, 0) = 0; F1(1, 1) = 0;\n• F2(0, 0) = 0; F2(0, 1) = 0; F2(1, 0) = 1; F2(1, 1) = 0;\n• F3(0, 0) = 0; F3(0, 1) = 1; F3(1, 0) = 0; F3(1, 1) = 0.\nI must now verify that T = (S,F) ∈ Tuniq, and that (T, 0) |= ϕ. This is straightforward, although tedious. First observe that (0, 0, 0) is the only solution to all the equations in the basic causal model. It is easy to see that (0, 0, 0) is a solution. To see that it is the only solution, observe that (0, 0, 1) cannot be a solution because F3(0, 0) = 0; similarly, (0, 1, 0) and (1, 0, 0) cannot be solutions; (0, 1, 1) cannot be a solution because F2(0, 1) = 0; (1, 1, 0) cannot be a solution because F1(1, 0) = 0; (1, 0, 1) cannot be a solution because F3(1, 0) = 0; finally, (1, 1, 1) cannot be a solution because F1(1, 1) = 0.\nIt is clear that there must be a unique solution if we set two of the three variables (forced by the equation for the third variable); for example, if X1 = 1 and X2 = 0, then the unique solution is (1, 0, 0). If X1, X2, or X3 is set to 0, then one solution is (0, 0, 0). The solution is unique for the same reasons that (0, 0, 0) was the unique solution to the original collection of equations. Finally, if X1 = 1, then (1, 1, 0) is a solution; if X2 = 1, then (0, 1, 1) is a solution; and if X3 = 1, then (1, 0, 1) is a solution. We must show that there are no other solutions in all three cases. If X1 = 1, (1,0,0) is not a solution since F2(1, 0) = 1; (1, 0, 1) is not a solution because F3(1, 0) = 0; and (1, 1, 1) is not a solution because F3(1, 1) = 0. If X2 = 1, (0, 1, 0) is not a solution because F3(0, 1) = 1; (1, 1, 0) is not a solution because F1(1, 0) = 0; (1, 1, 1) is not a solution because F1(1, 1) = 0. Finally, if X3 = 1, (0, 0, 1) is not a solution because F1(0, 1) = 1; (0, 1, 1) is not a solution because F2(0, 1) = 0; and (1, 1, 1) is not a solution because F1(1, 1) = 0. Thus, T ∈ Tuniq.\nIt is now straightforward to check that (T, u) |= ϕ.\nIn Section 2.1, I argued that the choice of language was significant. All the results of this section are stated for the language Luniq. In light of Lemma 2.1, Theorems 3.4 and 3.5 apply without change to the language L+. Moreover, since Tuniq ⊆ T and Luniq ⊆ L+, the formula ¬ϕ from Theorem 3.7 (which is in Luniq, and hence also in L+) continues not to be valid in T , while being valid in counterfactual structures. While C5 is not valid in T , the generalization of C5 mentioned at the end of Section 2.1 is valid in T [Halpern 2000], and is not valid in counterfactual structures. So the full class T of causal models is incomparable in expressive power to counterfactual structures with respect the language L+ (which is the language arguably most appropriate for T ). Formally, we have:\nCorollary 3.8 T is incomparable in expressive power to M with respect to the language L+."}, {"heading": "4 Discussion", "text": "I have shown that the expressive power of causal models as models for counterfactuals is incomparable to that of the Lewis-Stalnaker “closest-world” possible-worlds semantics for counterfactuals; thus, the definition of counterfactuals in causal models is not, in general, compatible with the axioms of possible world semantics, although it is if we restrict to recursive causal models.\nSpecifically, causal models where the equations are recursive can be viewed as defining a strict subclass of the standard possible-worlds semantics. More precisely, a set of structural equation defines a world w (characterized by the unique solution to the equations) and can be implicitly viewed as defining an ordering relation on worlds such that, for every formula ~X = ~x, the solution to the equations when ~X is set to ~x determines a world w ~X=~x that is the world closest to w according to the ordering such that ~X = ~x. Somewhat surprisingly, this is not the case if we go to the larger class of causal models defined by equations that are not recursive, but have a unique solution for all settings ~X = ~x. Of course, it is still the case that there is a world w ~X=~x determined by the equations when\n~X is set to ~x. However, there is, in general, no ordering on worlds such that w ~X=~x is the closest world to w according to the ordering. A closeness ordering on worlds places some restrictions (e.g., those characterized by the formula ¬ϕ in Theorem 3.7) that do not hold in all causal models in Tuniq.\nSo where does this leave us? It is still the case that, in causal models, a formula such as ϕ ψ is true at a world w if ψ is true at some appropriate world w′ satisfying ϕ. However, w′ cannot be viewed as the “closest” world to w satisfying ϕ. This leaves open the question of whether there are other ways of defining “appropriateness” other than “closeness”. I do not have strong intuitions here, but it is a question that is perhaps worth pursuing. My own feeling is that these arguments show that models in Tuniq − Trec are actually not good models for causality. It is quite difficult to verify that a nonrecursive causal model is in Tuniq, as the model T given in Theorem 3.7 satisfying ϕ shows. I am not aware of any interesting real-world situation that is captured by a model in Tuniq − Trec. Further evidence of the “unreasonableness” of models in Tuniq − Trec is given by recent work of Zhang, Lam, and de Clerq [2012]. They show that although the reversibility axiom blocks cycles of counterfactual dependence of length two, it does not block longer cycles. Indeed, they observe that the causal model T of Theorem 3.7 has a cycle of length three.\nDoes this mean that we should restrict to recursive models? There are certainly equations in physics (e.g., those connecting pressure and volume) that exhibit circular dependencies. Perhaps nonrecursive models would be appropriate for them (although once we add time to the picture, we may well be able to use a recursive model to capture any particular scenario). In a general nonrecursive model, there may be several solutions to an intervention (see [Halpern and Pearl 2005, Appendix A.4] for further discussion of this point). But this just corresponds to there being several worlds satisfying a formula ϕ that are closest to a given world, which is certainly allowed in Lewis’s framework. I suspect that there is an interesting class of nonrecursive causal models that can be captured in Lewis’s framework, and that these will turn out to be the models that actually arise in practice.\nZhang [2012] makes some progress on this issue. He proposes two condition on causal models, which he calls solution-ful and solution-conservativeness. The former condition is easy to understand: a causal model T is solution-ful if, for every context ~u, the equations have a solution (not necessarily unique). The second condition is somewhat more complicated. T is solution-conservative if, for every context ~u, if a solution to T ~X=~x is consistent with\n~Y = ~y, then every solution to T ~X=~x∧~Y=~y is a solution to T ~X=~x. Zhang shows that a causal model satisfies these two conditions iff it satisfies analogues of all\nthe axioms in one of Lewis’s axiomatizations of causal counterfactuals [Lewis 1973, p. 973]. Thus, these two conditions are necessary for a causal model to be translatable to a counterfactual structure. They are not sufficient, since they are satisfied by all models in Tuniq. There is clearly more to be done in understanding the connections between causal models and counterfactual structures.\nTurning to a more technical point, it is worth trying to understand in more detail exactly what goes wrong in the Galles-Pearl argument. When making the comparison, Galles and Pearl did not use the axiom system AX. Rather, they used one of Lewis’ axiomatizations of conditional logic from [Lewis 1973]. Nevertheless, the problem with their argument can be understood in terms of AX. Galles and Pearl show that all but one of the axioms in the system they consider follows from C3, C4, and C5. (They actually also implicitly use C1 and C2, but this is a minor point.) The remaining axiom is\n((ϕ1 ∨ ϕ2) ϕ1) ∨ ((ϕ1 ∨ ϕ2) ϕ2)∨ [((ϕ1 ∨ ϕ2) ψ) ⇔ ((ϕ1 ψ) ∨ (ϕ2 ψ))].\nFor this axiom, they say “Because actions in causal models are restricted to conjunctions of literals that is, in the language of this paper, because in a formula in Luniq of the form ϕ ψ, ϕ is a conjunction of formulas of the form X = x], this axiom is irrelevant.” They thus ignore the axiom. Unfortunately, this argument is flawed. If it were true, then it would be the case that the class of causal models in Tuniq would be less general than counterfactual structures since causal models would satisfy more axioms—all the relevant axioms satisfied by counterfactual structures, and, in addition, C5 (reversibility). However, as we have seen, the formula ϕ of Theorem 3.7 is satisfiable in Tuniq, while ¬ϕ is valid in Mf . The formula ¬ϕ is equivalent to\n([X1 = 1](X2 = 1 ∧X3 = 0) ∧ [X2 = 1](X3 = 1 ∧X1 = 0) ⇒ ¬[X3 = 1](X1 = 1 ∧X2 = 0).\nThus, ¬ϕ is a formula whose antecedent and conclusion are both formulas in Luniq. The argument for the validity of ¬ϕ given in the proof of Theorem 3.7 is purely semantic, but, as I show in the appendix, ¬ϕ can also be derived from AX together with V2 and V3. The derivation uses A4 in a crucial way. Note that A4 has disjunctions on the left-hand side of and thus cannot be expressed in Luniq. But it is not irrelevant! Indeed, an easy argument (given in the appendix) shows that ¬ϕ cannot be derived using AX − {A4} together with V2 and V3 if we restrict to formulas in Luniq. Thus, we can start with assumptions in the language Luniq, end up with a conclusion in Luniq, but have a derivation that, along the way, uses A4 and has steps that involve formulas with disjunctions on the left-hand side of . The Galles and Pearl argument ignores this possibility.\nAcknowledgments: Thanks to Franz Huber, Judea Pearl, Jiji Zhang, and the anonymous reviewers of the paper for useful comments."}, {"heading": "A A derivation of ¬ϕ", "text": "In this appendix, I show that the formula\n([X1 = 1](X2 = 1 ∧X3 = 0) ∧ [X2 = 1](X3 = 1 ∧X1 = 0) ⇒ ¬[X3 = 1](X1 = 1 ∧X2 = 0)\ncan be derived from AX together with V2 and V3. To simplify notation, I write ⊢ ϕ′ if the formula ϕ′ can be derived from AX, and ⊢+ ϕ′ if ϕ′ can be derived from AX + {V2, V3}.\nI first need a technical lemma.\nLemma A.1 ⊢ (ϕ1 ϕ2 ∧ ϕ2 ϕ3) ⇒ (ϕ1 ∨ ϕ2) ϕ3.\nProof: By A1, ⊢ ϕ2 ϕ2, and by A4, ϕ1 ϕ2 ∧ ϕ2 ϕ2 ⇒ (ϕ1 ∨ ϕ2) ψ. Thus,\n⊢ (ϕ1 ϕ2) ⇒ (ϕ1 ∨ ϕ2) ϕ2. (1)\nNext observe that it easily follows from A1 and A4 that (a) ⊢ (ϕ1 ∧ ¬ϕ2) (ϕ2 ⇒ ϕ3) (since (ϕ1 ∧ ¬ϕ2) ⇒ (ϕ2 ⇒ ϕ3) is a tautology) and (b) ⊢ (ϕ2 ϕ3) ⇒ ϕ2 (ϕ2 ⇒ ϕ3) (since ϕ3 ⇒ (ϕ2 ⇒ ϕ3) is a tautology). By A4, RA1, and the observation that ((ϕ1∧¬ϕ2)∨ϕ2) ⇔ (ϕ1∨ϕ2) is a tautology, we can conclude that\n⊢ (ϕ2 ϕ3) ⇒ ((ϕ1 ∨ ϕ2) (ϕ2 ⇒ ϕ3)). (2)\nLet ψ be the formula (ϕ1 ϕ2 ∧ ϕ2 ϕ3). From (1) and (2), it follows that\n⊢ ψ ⇒ ((ϕ1 ∨ ϕ2) ϕ2) ∧ (ϕ1 ∨ ϕ2) (ϕ2 ⇒ ϕ3)).\nApplying A2 and RA1, it follows that\n⊢ ψ ⇒ ((ϕ1 ∨ ϕ2) ϕ3,\nas desired.\nNow the proof is easy. By Lemma A.1, it follows that\n⊢ (X1 = 1 X2 = 1) ∧ (X2 = 1 X3 = 1) ⇒ (X1 = 1 ∨X2 = 1) X3 = 1.\nApplying the lemma again, we get that\n⊢ (X1 = 1 ∨X2 = 1) X3 = 1 ∧ (X3 = 1 X1 = 0) ⇒ (X1 = 1 ∨X2 = 1 ∨X3 = 1) X1 = 0.\nLet ψ′ be an abbreviation for X1 = 1∨X2 = 1∨X3 = 1. Thus, ⊢ ϕ ⇒ (ψ′ X1 = 0). An analogous argument shows that ⊢ ϕ ⇒ ψ′ X2 = 0) and ⊢ ϕ ⇒ (ψ′ X3 = 0). By A2, we have that\n⊢ ϕ ⇒ (ψ′ (X1 = 0 ∧X2 = 0 ∧X3 = 0). (3)\nBy V2, we have that ⊢+ ψ′ ⇒ (X1 6= 0 ∨X2 6= 0 ∨X3 6= 0). Thus, by A1 and RA2, we have that\n⊢+ ϕ ⇒ (ψ′ (X1 6= 0 ∧X2 6= 0 ∧X3 6= 0). (4)\nBy A2, RA1, (3), and (4), we have that\n⊢+ ϕ ⇒ (ψ′ false).\nBy V3, it follows that ⊢+ ¬ϕ, as desired.\nNote that all the axioms in AX other than A4 can be expressed using the language Luniq (provided that the formulas ϕ and ψ mentioned in these axioms are taken to be conjunctions of primitive propositions or just single primitive propositions, as appropriate). It is easy to check that all these axioms are valid in Tuniq, as are V2 and V3. Since ϕ is satisfiable in Tuniq, ¬ϕ cannot be proved from (AX − {A4}) ∪ {V2,V3}."}], "references": [{"title": "The logic of nonmonotonicity", "author": ["J. Bell"], "venue": "Artificial Intelligence 41, 365–374.", "citeRegEx": "Bell,? 1989", "shortCiteRegEx": "Bell", "year": 1989}, {"title": "Quick completeness proofs for some logics of conditionals", "author": ["J. Burgess"], "venue": "Notre Dame Journal of Formal Logic 22, 76–84.", "citeRegEx": "Burgess,? 1981", "shortCiteRegEx": "Burgess", "year": 1981}, {"title": "Basic conditional logic", "author": ["B.F. Chellas"], "venue": "Journal of Philosophical Logic 4, 133–153.", "citeRegEx": "Chellas,? 1980", "shortCiteRegEx": "Chellas", "year": 1980}, {"title": "On the complexity of conditional logics", "author": ["N. Friedman", "J.Y. Halpern"], "venue": "Principles of Knowledge Representation and Reasoning: Proc. Fourth International Conference (KR ’94), pp. 202–213.", "citeRegEx": "Friedman and Halpern,? 1994", "shortCiteRegEx": "Friedman and Halpern", "year": 1994}, {"title": "An axiomatic characterization of causal counterfactuals", "author": ["D. Galles", "J. Pearl"], "venue": "Foundation of Science 3(1), 151–182.", "citeRegEx": "Galles and Pearl,? 1998", "shortCiteRegEx": "Galles and Pearl", "year": 1998}, {"title": "Updates and counterfactuals", "author": ["G. Grahne"], "venue": "Principles of Knowledge Representation and Reasoning: Proc. Second International Conference (KR ’91), pp. 269–276.", "citeRegEx": "Grahne,? 1991", "shortCiteRegEx": "Grahne", "year": 1991}, {"title": "Axiomatizing causal reasoning", "author": ["J.Y. Halpern"], "venue": "Journal of A.I. Research 12, 317–337.", "citeRegEx": "Halpern,? 2000", "shortCiteRegEx": "Halpern", "year": 2000}, {"title": "Causes and explanations: A structural-model approach", "author": ["J.Y. Halpern", "J. Pearl"], "venue": "Part I: Causes. British Journal for Philosophy of Science 56(4), 843–887.", "citeRegEx": "Halpern and Pearl,? 2005", "shortCiteRegEx": "Halpern and Pearl", "year": 2005}, {"title": "A unified view of consequence relation, belief revision and conditional logic", "author": ["H. Katsuno", "K. Satoh"], "venue": "Proc. Twelfth International Joint Conference on Artificial Intelligence (IJCAI ’91), pp. 406–412.", "citeRegEx": "Katsuno and Satoh,? 1991", "shortCiteRegEx": "Katsuno and Satoh", "year": 1991}, {"title": "Nonmonotonic reasoning, preferential models and cumulative logics", "author": ["S. Kraus", "D. Lehmann", "M. Magidor"], "venue": "Artificial Intelligence 44, 167–207.", "citeRegEx": "Kraus et al\\.,? 1990", "shortCiteRegEx": "Kraus et al\\.", "year": 1990}, {"title": "Completeness and decidability of three logics of counterfactual conditionals", "author": ["D. Lewis"], "venue": "Theoria 37(1), 74–85.", "citeRegEx": "Lewis,? 1971", "shortCiteRegEx": "Lewis", "year": 1971}, {"title": "Counterfactuals", "author": ["D.K. Lewis"], "venue": "Cambridge, Mass.: Harvard University Press.", "citeRegEx": "Lewis,? 1973", "shortCiteRegEx": "Lewis", "year": 1973}, {"title": "Intensional logics without iterative axioms", "author": ["D.K. Lewis"], "venue": "Journal of Philosophical Logic 3, 457–466.", "citeRegEx": "Lewis,? 1974", "shortCiteRegEx": "Lewis", "year": 1974}, {"title": "Causality: Models, Reasoning, and Inference", "author": ["J. Pearl"], "venue": "New York: Cambridge University Press.", "citeRegEx": "Pearl,? 2000", "shortCiteRegEx": "Pearl", "year": 2000}, {"title": "A semantic analysis of conditional logic", "author": ["R.C. Stalnaker"], "venue": "N. Rescher (Ed.), Studies in Logical Theory, pp. 98–112. Oxford University Press.", "citeRegEx": "Stalnaker,? 1968", "shortCiteRegEx": "Stalnaker", "year": 1968}, {"title": "A Lewisian logic of causal counterfactuals", "author": ["J. Zhang"], "venue": "Minds and Machines. To appear.", "citeRegEx": "Zhang,? 2012", "shortCiteRegEx": "Zhang", "year": 2012}, {"title": "A peculiarity in Pearl’s logic of interventionist counterfactuals", "author": ["J. Zhang", "W.-Y. Lam", "R. de Clercq"], "venue": "Journal of Philosophical Logic. To appear.", "citeRegEx": "Zhang et al\\.,? 2012", "shortCiteRegEx": "Zhang et al\\.", "year": 2012}], "referenceMentions": [{"referenceID": 10, "context": "Perhaps the best-known approach is due to Lewis [1973] and Stalnaker [1968], and involves possible worlds.", "startOffset": 42, "endOffset": 55}, {"referenceID": 10, "context": "Perhaps the best-known approach is due to Lewis [1973] and Stalnaker [1968], and involves possible worlds.", "startOffset": 42, "endOffset": 76}, {"referenceID": 10, "context": "Perhaps the best-known approach is due to Lewis [1973] and Stalnaker [1968], and involves possible worlds. The idea is that a counterfactual of the form “if A were the case then B would be the case”, typically written A B, is true at a world w if B is true at all the worlds closest to w where A is true. Of course, making this precise requires having some notion of “closeness” among worlds. More recently, Pearl [2000] proposed the use of causal models based on structural equations for reasoning about causality.", "startOffset": 42, "endOffset": 421}, {"referenceID": 4, "context": "closest worlds) was studied by Galles and Pearl [1998]. They argue that the relationship between the two approaches depends in part on whether we consider recursive (i.", "startOffset": 31, "endOffset": 55}, {"referenceID": 4, "context": "Galles and Pearl themselves show that there are additional axioms that hold in recursive models over and above those that hold in counterfactual structures. Indeed, they show that the reversibility axiom mentioned above is valid in recursive models and is not valid in possible-worlds models. They also show that all the axioms of causal reasoning in the possible-worlds framework that they view as relevant (specifically, axioms that do not mention disjunction, since it is not in their language) hold in recursive causal models. Thus, the only conclusion that can be drawn from their argument is just the opposite to what they claim, namely, that the possible-worlds approach does not add any restrictions to causal reasoning beyond those imposed by causal models, since causal models satisfy all the axioms that counterfactual structures do, and perhaps more.2 Pearl [private communication, 2010] intended the clause “for recursive models” to apply to counterfactual structures as well as to structural models. However, the notion of a recursive counterfactual structure is not defined either by Galles and Pearl [1998] or Pearl [2000].", "startOffset": 0, "endOffset": 1123}, {"referenceID": 4, "context": "Galles and Pearl themselves show that there are additional axioms that hold in recursive models over and above those that hold in counterfactual structures. Indeed, they show that the reversibility axiom mentioned above is valid in recursive models and is not valid in possible-worlds models. They also show that all the axioms of causal reasoning in the possible-worlds framework that they view as relevant (specifically, axioms that do not mention disjunction, since it is not in their language) hold in recursive causal models. Thus, the only conclusion that can be drawn from their argument is just the opposite to what they claim, namely, that the possible-worlds approach does not add any restrictions to causal reasoning beyond those imposed by causal models, since causal models satisfy all the axioms that counterfactual structures do, and perhaps more.2 Pearl [private communication, 2010] intended the clause “for recursive models” to apply to counterfactual structures as well as to structural models. However, the notion of a recursive counterfactual structure is not defined either by Galles and Pearl [1998] or Pearl [2000]. In fact, in general, the notion of recursive model as defined, for example, in [Pearl 2000, Definition 7.", "startOffset": 0, "endOffset": 1139}, {"referenceID": 13, "context": "2 of [Pearl 2000] is taken almost verbatim from [Galles and Pearl 1998]; since the former is more widely available, that is what I cite in this paper.", "startOffset": 5, "endOffset": 17}, {"referenceID": 4, "context": "2 of [Pearl 2000] is taken almost verbatim from [Galles and Pearl 1998]; since the former is more widely available, that is what I cite in this paper.", "startOffset": 48, "endOffset": 71}, {"referenceID": 6, "context": "In earlier work [Halpern 2000], I showed that there are nonrecursive causal models where every equation has a unique solution.", "startOffset": 16, "endOffset": 30}, {"referenceID": 6, "context": "(The following discussion is taken, with minor modifications, from [Halpern 2000].", "startOffset": 67, "endOffset": 81}, {"referenceID": 6, "context": ") Following [Halpern 2000], I consider three successively more general classes of causal models for a given signature S (with a focus on the first two):", "startOffset": 12, "endOffset": 26}, {"referenceID": 6, "context": "Syntax and Semantics: In [Halpern 2000], a number of languages for reasoning about causality are considered.", "startOffset": 25, "endOffset": 39}, {"referenceID": 6, "context": "In [Halpern 2000], I considered a number of languages appropriate for reasoning about causality in causal models.", "startOffset": 3, "endOffset": 17}, {"referenceID": 6, "context": "L+ is the most general language that I consider in [Halpern 2000].", "startOffset": 51, "endOffset": 65}, {"referenceID": 6, "context": "As the following lemma, proved in [Halpern 2000], shows, for reasoning about causality in Tuniq, the language Luniq is adequate, since it is equivalent in expressive power to L+.", "startOffset": 34, "endOffset": 48}, {"referenceID": 6, "context": "1 [Halpern 2000] In Tuniq and Trec, the language L+ and Luniq are expressively equivalent; for every formula φ ∈ L+, we can effectively find a formula φ′ ∈ Luniq such that Tuniq |= φ ⇔ φ′.", "startOffset": 2, "endOffset": 16}, {"referenceID": 6, "context": "In [Halpern 2000], following [Galles and Pearl 1998], the context was included in the formula.", "startOffset": 3, "endOffset": 17}, {"referenceID": 4, "context": "In [Halpern 2000], following [Galles and Pearl 1998], the context was included in the formula.", "startOffset": 29, "endOffset": 52}, {"referenceID": 7, "context": "The advantage of having ~u on the left-hand side of |= (which is also the formalism used in [Halpern and Pearl 2005]) is that it enforces the intuition that the context consists of background information that is typically suppressed.", "startOffset": 92, "endOffset": 116}, {"referenceID": 6, "context": "In [Halpern 2000], truth was defined for formulas of the form [~ Y = ~y](X = x), and extended in “the obvious way” to Boolean combinations; that is φ1 ∨ φ2 was taken to be true if either φ1 was true or φ2 was true.", "startOffset": 3, "endOffset": 17}, {"referenceID": 6, "context": "The approach suggested here is what is required to make the axioms given in [Halpern 2000] sound in the general case.", "startOffset": 76, "endOffset": 90}, {"referenceID": 6, "context": "Consider the following axioms, taken from [Halpern 2000], modified slightly for the language used here:", "startOffset": 42, "endOffset": 56}, {"referenceID": 4, "context": "The key axioms C3–C5 were introduced (and named) by Galles and Pearl [1998]. Perhaps most relevant to this paper is the reversibility axiom, C5.", "startOffset": 52, "endOffset": 76}, {"referenceID": 6, "context": "2 ([Halpern 2000]) AXuniq(S) is a sound and complete axiomatization for Luniq(S) with respect to Tuniq(S).", "startOffset": 3, "endOffset": 17}, {"referenceID": 6, "context": "A complete axiomatization for Luniq with respect to Trec(S) is also given in [Halpern 2000]; it requires adding a somewhat complicated axiom called C6 to AXuniq that captures acyclicity.", "startOffset": 77, "endOffset": 91}, {"referenceID": 10, "context": "I focus here on one due to Lewis [1973]. Let Φ be a finite set of primitive propositions.", "startOffset": 27, "endOffset": 40}, {"referenceID": 3, "context": "As shown by Friedman and Halpern [1994], if a formula in the language I am about to introduce is satisfiable at all, it is satisfiable in a structure with finitely many worlds, so as far as validity goes, there is no loss of generality in restricting to finite structures.", "startOffset": 12, "endOffset": 40}, {"referenceID": 1, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 0, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 2, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 5, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 8, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 10, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 11, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 12, "context": ", [Burgess 1981; Bell 1989; Chellas 1980; Grahne 1991; Katsuno and Satoh 1991; Lewis 1971; Lewis 1973; Lewis 1974]).", "startOffset": 2, "endOffset": 114}, {"referenceID": 10, "context": "In his semantics, Lewis allows there to be more than one world closest to a world w where φ is true (except in the special case that φ is true at w; in this case, w is the unique world closest to w satisfying φ). By way of contrast, Stalnaker [1968] essentially assumes that for each world w and formula φ, there is a unique world closest to w satisfying φ.", "startOffset": 18, "endOffset": 250}, {"referenceID": 1, "context": "3 [Burgess 1981] AX (resp.", "startOffset": 2, "endOffset": 16}, {"referenceID": 6, "context": "1 is valid in T [Halpern 2000], and is not valid in counterfactual structures.", "startOffset": 16, "endOffset": 30}, {"referenceID": 8, "context": "I have shown that the expressive power of causal models as models for counterfactuals is incomparable to that of the Lewis-Stalnaker “closest-world” possible-worlds semantics for counterfactuals; thus, the definition of counterfactuals in causal models is not, in general, compatible with the axioms of possible world semantics, although it is if we restrict to recursive causal models. Specifically, causal models where the equations are recursive can be viewed as defining a strict subclass of the standard possible-worlds semantics. More precisely, a set of structural equation defines a world w (characterized by the unique solution to the equations) and can be implicitly viewed as defining an ordering relation on worlds such that, for every formula ~ X = ~x, the solution to the equations when ~ X is set to ~x determines a world w ~ X=~x that is the world closest to w according to the ordering such that ~ X = ~x. Somewhat surprisingly, this is not the case if we go to the larger class of causal models defined by equations that are not recursive, but have a unique solution for all settings ~ X = ~x. Of course, it is still the case that there is a world w ~ X=~x determined by the equations when ~ X is set to ~x. However, there is, in general, no ordering on worlds such that w ~ X=~x is the closest world to w according to the ordering. A closeness ordering on worlds places some restrictions (e.g., those characterized by the formula ¬φ in Theorem 3.7) that do not hold in all causal models in Tuniq. So where does this leave us? It is still the case that, in causal models, a formula such as φ ψ is true at a world w if ψ is true at some appropriate world w′ satisfying φ. However, w′ cannot be viewed as the “closest” world to w satisfying φ. This leaves open the question of whether there are other ways of defining “appropriateness” other than “closeness”. I do not have strong intuitions here, but it is a question that is perhaps worth pursuing. My own feeling is that these arguments show that models in Tuniq − Trec are actually not good models for causality. It is quite difficult to verify that a nonrecursive causal model is in Tuniq, as the model T given in Theorem 3.7 satisfying φ shows. I am not aware of any interesting real-world situation that is captured by a model in Tuniq − Trec. Further evidence of the “unreasonableness” of models in Tuniq − Trec is given by recent work of Zhang, Lam, and de Clerq [2012]. They show that although the reversibility axiom blocks cycles of counterfactual dependence of length two, it does not block longer cycles.", "startOffset": 117, "endOffset": 2445}, {"referenceID": 6, "context": "In a general nonrecursive model, there may be several solutions to an intervention (see [Halpern and Pearl 2005, Appendix A.4] for further discussion of this point). But this just corresponds to there being several worlds satisfying a formula φ that are closest to a given world, which is certainly allowed in Lewis’s framework. I suspect that there is an interesting class of nonrecursive causal models that can be captured in Lewis’s framework, and that these will turn out to be the models that actually arise in practice. Zhang [2012] makes some progress on this issue.", "startOffset": 89, "endOffset": 539}, {"referenceID": 11, "context": "Rather, they used one of Lewis’ axiomatizations of conditional logic from [Lewis 1973].", "startOffset": 74, "endOffset": 86}], "year": 2013, "abstractText": "Galles and Pearl [1998] claimed that “for recursive models, the causal model framework does not add any restrictions to counterfactuals, beyond those imposed by Lewis’s [possible-worlds] framework.” This claim is examined carefully, with the goal of clarifying the exact relationship between causal models and Lewis’s framework. Recursive models are shown to correspond precisely to a subclass of (possible-world) counterfactual structures. On the other hand, a slight generalization of recursive models, models where all equations have unique solutions, is shown to be incomparable in expressive power to counterfactual structures, despite the fact that the Galles and Pearl arguments should apply to them as well. The problem with the Galles and Pearl argument is identified: an axiom that they viewed as irrelevant, because it involved disjunction (which was not in their language), is not irrelevant at all.", "creator": "LaTeX with hyperref package"}}}