{"id": "1301.1936", "review": {"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "9-Jan-2013", "title": "Risk-Aversion in Multi-armed Bandits", "abstract": "Stochastic multi-armed bandits solve the Exploration-Exploitation dilemma and ultimately maximize the expected reward. Nonetheless, in many practical problems, maximizing the expected reward is not the most desirable objective. In this paper, we introduce a novel setting based on the principle of risk-aversion where the objective is to compete against the arm with the best risk-return trade-off. This setting proves to be intrinsically more difficult than the standard multi-arm bandit setting due in part to an exploration risk which introduces a regret associated to the variability of an algorithm. Using variance as a measure of risk, we introduce two new algorithms, investigate their theoretical guarantees, and report preliminary empirical results.", "histories": [["v1", "Wed, 9 Jan 2013 18:02:54 GMT  (429kb,D)", "http://arxiv.org/abs/1301.1936v1", "(2012)"]], "COMMENTS": "(2012)", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["amir sani", "alessandro lazaric", "rémi munos"], "accepted": true, "id": "1301.1936"}, "pdf": {"name": "1301.1936.pdf", "metadata": {"source": "CRF", "title": "Risk–Aversion in Multi–armed Bandits", "authors": ["Amir Sani", "Alessandro Lazaric", "Rémi Munos"], "emails": ["amir.sani@inria.fr", "alessandro.lazaric@inria.fr", "remi.munos@inria.fr"], "sections": [{"heading": null, "text": "Stochastic multi–armed bandits solve the Exploration–Exploitation dilemma and ultimately maximize the expected reward. Nonetheless, in many practical problems, maximizing the expected reward is not the most desirable objective. In this paper, we introduce a novel setting based on the principle of risk–aversion where the objective is to compete against the arm with the best risk–return trade–off. This setting proves to be intrinsically more difficult than the standard multi-arm bandit setting due in part to an exploration risk which introduces a regret associated to the variability of an algorithm. Using variance as a measure of risk, we introduce two new algorithms, investigate their theoretical guarantees, and report preliminary empirical results."}, {"heading": "1 Introduction", "text": "The multi–armed bandit [13] elegantly formalizes the problem of on–line learning with partial feedback, which encompasses a large number of real–world applications, such as clinical trials, online advertisements, adaptive routing, and cognitive radio. In the stochastic multi–armed bandit model, a learner chooses among several arms (e.g., different treatments), each characterized by an independent reward distribution (e.g., the treatment effectiveness). At each point in time, the learner selects one arm and receives a noisy reward observation from that arm (e.g., the effect of the treatment on one patient). Given a finite number of n rounds (e.g., patients involved in the clinical trial), the learner faces a dilemma between repeatedly exploring all arms and collecting reward information versus exploiting current reward estimates by selecting the arm with the highest estimated reward. Roughly speaking, the learning objective is to solve this exploration–exploitation dilemma and accumulate as much reward as possible over n rounds. In particular, multi–arm bandit literature typically focuses on the problem of finding a learning algorithm capable of maximizing the expected cumulative reward (i.e., the reward collected over n rounds averaged over all possible observation realizations), thus implying that the best arm returns the highest expected reward. Nonetheless, in many practical problems, maximizing the expected reward is not always the most desirable objective. For instance, in clinical trials, the treatment which works best on average might also have considerable variability; resulting in adverse side effects for some patients. In this case, a treatment which is less effective on average but consistently effective on different patients may be preferable w.r.t. an effective but risky treatment. More generally, some application objectives require an effective trade–off between risk and reward.\nThere is no agreed upon definition for risk. A variety of behaviours result in an uncertainty which might be deemed unfavourable for a specific application and referred to as a risk. For example, a solution with guarantees over multiple runs of an algorithm may not satisfy the desire for a solution with low variability over a single implementation of an algorithm. Two foundational risk modeling paradigms are Expected Utility theory [12] and the historically popular and accessible Mean-Variance paradigm [10]. A large part of decision–making theory focuses on defining and managing risk (see e.g., [9] for an introduction to risk from an expected utility theory perspective).\nar X\niv :1\n30 1.\n19 36\nv1 [\ncs .L\nG ]\n9 J\nan 2\n01 3\nRisk has mostly been studied in on–line learning within the so–called expert advice setting (i.e., adversarial full–information on–line learning). In particular, [8] showed that in general, although it is possible to achieve a small regret w.r.t. to the expert with the best average performance, it is not possible to compete against the expert which best trades off between average return and risk. On the other hand, it is possible to define no–regret algorithms for simplified measures of risk–return. [15] studied the case of pure risk minimization (notably variance minimization) in an on-line setting where at each step the learner is given a covariance matrix and must choose a weight vector that minimizes the variance. The regret is then computed over horizon n and compared to the fixed weights minimizing the variance in hindsight. In the multi–arm bandit domain, the most interesting results are by [5] and [14]. [5] introduced an analysis of the expected regret and its distribution, revealing that an anytime version of UCB [6] and UCB-V might have large regret with some nonnegligible probability.1 This analysis is further extended by [14] who derived negative results which show no anytime algorithm can achieve a regret with both a small expected regret and exponential tails. Although these results represent an important step towards the analysis of risk within bandit algorithms, they are limited to the case where an algorithm’s cumulative reward is compared to the reward obtained by pulling the arm with the highest expectation.\nIn this paper, we focus on the problem of competing against the arm with the best risk–return trade– off. In particular, we refer to the first and most popular measure of risk–return, the mean–variance model introduce by [10]. In Section 2 we introduce notation and define the mean–variance bandit problem. In Section 3 we introduce a confidence–bound algorithm and study its theoretical properties. In Section 5 we report a set of numerical simulations aiming at validating the theoretical results. Finally, in Section 7 we conclude with a discussion on possible extensions. The proofs and additional experiments are reported in the appendix."}, {"heading": "2 Mean–Variance Multi–arm Bandit", "text": "In this section we introduce the main notation used throughout the paper and define the mean– variance multi–arm bandit problem.\nWe consider the standard multi–arm bandit setting withK arms, each characterized by a distribution νi bounded in the interval [0, 1]. Each distribution has a mean µi and a variance σ2i . The bandit problem is defined over a finite horizon of n rounds. We denote by Xi,s ∼ νi the s-th random sample drawn from the distribution of arm i. All arms and samples are independent. In the multi– arm bandit protocol, at each round t, an algorithm selects arm It and observes sample XIt,Ti,t , where Ti,t is the number of samples observed from arm i up to time t (i.e., Ti,t = ∑t s=1 I{It = i}).\nWhile in the standard literature on multi–armed bandits the objective is to select the arm leading to the highest reward in expectation (the arm with the largest expected value µi), here we focus on the problem of finding the arm which effectively trades off between its expected reward (i.e., the return) and its variability (i.e., the risk). Although a large number of models for risk–return trade–off have been proposed, here we focus on the most historically popular and simple model: the mean–variance model proposed by [10],2 where the return of an arm is measured by the expected reward and its risk by its variance.\nDefinition 1. The mean–variance of an arm i with mean µi, variance σ2i and coefficient of absolute risk tolerance ρ is defined as3 MVi = σ2i − ρµi.\nThus it easily follows that the best arm minimizes the mean–variance, that is i∗ = arg mini=1,...,K MVi. We notice that we can obtain two extreme settings depending on the value of risk tolerance ρ. As ρ→∞, the mean–variance of arm i tends to the opposite of its expected value µi and the problem reduces to the standard expected reward maximization traditionally considered in multi–arm bandit problems. With ρ = 0, the mean–variance reduces to minimizing the variance σ2i and the objective becomes variance minimization.\n1Although the analysis is mostly directed to the pseudo–regret, as commented in Remark 2 at page 23 of [5], it can be extended to the true regret.\n2We discuss the limitations of this model and possible extensions to other models of risk in Section 7. 3The coefficient of risk tolerance is the inverse of the more popular coefficient of risk aversion A = 1/ρ.\nGiven {Xi,s}ts=1 i.i.d. samples from the distribution νi, we define the empirical mean–variance of an arm i with t samples as M̂Vi,t = σ̂2i,t − ρµ̂i,t, where\nµ̂i,t = 1\nt\nt∑\ns=1\nXi,s, σ̂ 2 i,t =\n1\nt\nt∑\ns=1\n( Xi,s − µ̂i,t )2 . (1)\nWe now consider a learning algorithm A and its corresponding performance over n rounds. Similar to a single arm i we define its empirical mean–variance as\nM̂Vn(A) = σ̂2n(A)− ρµ̂n(A), (2) where\nµ̂n(A) = 1\nn\nn∑\nt=1\nZt, σ̂ 2 n(A) =\n1\nn\nn∑\nt=1\n( Zt − µ̂n(A) )2 , (3)\nwith Zt = XIt,Ti,t , that is the reward collected by the algorithm at time t. This leads to a natural definition of the (random) regret at each single run of the algorithm as the difference in the mean– variance performance of the algorithm compared to the best arm. Definition 2. The regret for a learning algorithm A over n rounds is defined as\nRn(A) = M̂Vn(A)− M̂Vi∗,n. (4)\nGiven this definition, the objective is to design an algorithm whose regret decreases as the number of rounds increases (in high probability or in expectation).\nWe notice that the previous definition actually depends on unobserved samples. In fact, M̂Vi∗,n is computed on n samples i∗ which are not actually observed when running A. This matches the definition of true regret in standard bandits (see e.g., [5]). Thus, in order to clarify the main components characterizing the regret, we introduce additional notation. Let\nYi,t =    Xi∗,t if i = i∗ Xi∗,t′ with t′ = Ti∗,n + ∑\nj<i,j 6=i∗ Tj,n + t otherwise\nbe a renaming of the samples from the optimal arm, such that while the algorithm was pulling arm i for the t-th time, Yi,t is the unobserved sample from i∗. Then we define the corresponding mean and variance as\nµ̃i,Ti,n = 1\nTi,n\nTi,n∑\nt=1\nYi,t, σ̃ 2 i,Ti,n =\n1\nTi,n\nTi,n∑\nt=1\n( Yi,t − µ̃i,Ti,n )2 . (5)\nGiven these additional definitions, we can rewrite the regret as (see Appendix A.1)\nRn(A) = 1\nn\n∑ i 6=i∗ Ti,n [ (σ̂2i,Ti,n − ρµ̂i,Ti,n)− (σ̃2i,Ti,n − ρµ̃i,Ti,n) ]\n+ 1\nn\nK∑\ni=1\nTi,n ( µ̂i,Ti,n − µ̂n(A) )2 − 1 n K∑\ni=1\nTi,n ( µ̃i,Ti,n − µ̂i∗,n )2 . (6)\nSince the last term is always negative and small 4, our analysis focuses on the first two terms which reveal two interesting characteristics ofA. First, an algorithmA suffers a regret whenever it chooses a suboptimal arm i 6= i∗ and the regret corresponds to the difference in the empirical mean–variance of i w.r.t. the optimal arm i∗. Such a definition has a strong similarity to the standard definition of regret, where i∗ is the arm with highest expected value and the regret depends on the number of times suboptimal arms are pulled and their respective gaps w.r.t. the optimal arm i∗. In contrast to the standard formulation of regret, A also suffers an additional regret from the variance σ̂2n(A), which depends on the variability of pulls Ti,n over different arms. Recalling the definition of the mean\n4More precisely, it can be shown that this term decreases with rateO(K log(1/δ)/n) with probability 1−δ.\nµ̂n(A) as the weighted mean of the empirical means µ̂i,Ti,n with weights Ti,n/n (see eq. 3), we notice that this second term is a weighted variance of the means and illustrates the exploration risk of the algorithm. In fact, if an algorithm simply selects and pulls a single arm from the beginning, it would not suffer any exploration risk (secondary regret) since µ̂n(A) would coincide with µ̂i,Ti,n for the chosen arm and all other components would have zero weight. On the other hand, an algorithm accumulates exploration risk through this second term as the mean µ̂n(A) deviates from any specific arm; where the maximum exploration risk peaks at the mean µ̂n(A) furthest from all arm means. The previous definition of regret can be further elaborated to obtain the upper bound (see App. A.1)\nRn(A) ≤ 1\nn\n∑ i 6=i∗ Ti,n∆̂i + 1 n2 K∑ i=1 ∑ j 6=i Ti,nTj,nΓ̂ 2 i,j , (7)\nwhere ∆̂i = (σ̂2i,Ti,n − σ̃2i,Ti,n) − ρ(µ̂i,Ti,n − µ̃i,Ti,n) and Γ̂2i,j = (µ̂i,Ti,n − µ̂j,Tj,n)2. Unlike the definition in eq. 6, this upper bound explicitly illustrates the relationship between the regret and the number of pulls Ti,n; suggesting that a bound on the pulls is sufficient to bound the regret.\nFinally, we can also introduce a definition of the pseudo-regret.\nDefinition 3. The pseudo regret for a learning algorithm A over n rounds is defined as\nR̃n(A) = 1\nn\n∑ i 6=i∗ Ti,n∆i + 2 n2 K∑ i=1 ∑ j 6=i Ti,nTj,nΓ 2 i,j , (8)\nwhere ∆i = MVi −MVi∗ and Γi,j = µi − µj .\nIn the following, we denote the two components of the pseudo–regret as\nR̃∆n (A) = 1\nn\n∑ i6=i∗ Ti,n∆i, and R̃Γn(A) = 2 n2 K∑ i=1 ∑ j 6=i Ti,nTj,nΓ 2 i,j . (9)\nWhere R̃∆n (A) constitutes the standard regret derived from the traditional formulation of the multiarm bandit problem and R̃Γn(A) denotes the exploration risk. This regret can be shown to be close to the true regret up to small terms with high probability.\nLemma 1. Given definitions 2 and 3,\nRn(A) ≤ R̃n(A) + (5 + ρ) √ 2K log(6nK/δ)\nn + 4 √ 2 K log(6nK/δ) n ,\nwith probability at least 1− δ.\nThe previous lemma shows that any (high–probability) bound on the pseudo–regret immediately translates into a bound on the true regret. Thus, we report most of the theoretical analysis according to R̃n(A). Nonetheless, it is interesting to notice the major difference between the true and pseudo– regret when compared to the standard bandit problem. In fact, it is possible to show in the risk– averse case that the pseudo–regret is not an unbiased estimator of the true regret, i.e., E[Rn] 6= E[R̃n]. Thus, in order to bound the expectation of Rn we build on the high–probability result from Lemma 1."}, {"heading": "3 The Mean–Variance Lower Confidence Bound Algorithm", "text": "In this section we introduce a novel risk–averse bandit algorithm whose objective is to identify the arm which best trades off risk and return. The algorithm is a natural extension of UCB1 [6] and we report a theoretical performance analysis on how well it balances the exploration needed to identify the best arm versus the risk of pulling arms with different means."}, {"heading": "3.1 The Algorithm", "text": "We propose an index–based bandit algorithm which estimates the mean–variance of each arm and selects the optimal arm according to the optimistic confidence–bounds on the current estimates. A sketch of the algorithm is reported in Figure 1. For each arm, the algorithm keeps track of the empirical mean–variance M̂Vi,s computed according to s samples. We can build high–probability confidence bounds on empirical mean–variance through an application of the Chernoff–Hoeffding inequality (see e.g., [1] for the bound on the variance) on terms µ̂ and σ̂2.\nLemma 2. Let {Xi,s} be i.i.d. random variables bounded in [0, 1] from the distribution νi with mean µi and variance σ2i , and the empirical mean µ̂i,s and variance σ̂ 2 i,s computed as in Equation 1, then\nP [ ∃i = 1, . . . ,K, s = 1, . . . , n, |M̂Vi,s −MVi| ≥ (5 + ρ) √ log 1/δ\n2s\n] ≤ 6nKδ,\nThe algorithm in Figure 1 implements the principle of optimism in the face of uncertainty used in many multi–arm bandit algorithms. On the basis of the previous confidence bounds, we define a lower–confidence bound on the mean–variance of arm i when it has been pulled s times as\nBi,s = M̂Vi,s − (5 + ρ) √ log 1/δ\n2s , (10)\nwhere δ is an input parameter of the algorithm. Given the index of each arm at each round t, the algorithm simply selects the arm with the smallest mean–variance index, i.e., It = arg miniBi,Ti,t−1 . We refer to this algorithm as the mean–variance lower–confidence bound (MV-LCB ) algorithm.\nRemark 1. We notice that the algorithm reduces to UCB1 whenever ρ→∞. This is coherent with the fact that for ρ→∞ the mean–variance problem reduces to the maximization of the cumulative reward, for which UCB1 is already known to be nearly-optimal. On the other hand, for ρ = 0, which leads to the problem of cumulative reward variance minimization, the algorithm plays according to a lower–confidence–bound on the variances.\nRemark 2. The MV-LCB algorithm is parameterized by a parameter δ which defines the confidence level of the bounds employed in the definition of the index (10). In Theorem 1 we show how to optimize the parameter when the horizon n is known in advance. On the other hand, if n is not known, it is possible to design an anytime version of MV-LCB by defining a non-decreasing exploration sequence (εt)t instead of the term log 1/δ."}, {"heading": "3.2 Theoretical Analysis", "text": "In this section we report the analysis of the regret Rn(A) of MV-LCB (Fig. 1). As highlighted in eq. 7, it is enough to analyze the number of pulls for each of the arms to recover a bound on the regret. The proofs (reported in the appendix) are mostly based on similar arguments to the proof of UCB.\nWe derive the following regret bound in high probability and expectation.\nTheorem 1. Let the optimal arm i∗ be unique and b = 2(5 + ρ), the MV-LCB algorithm achieves a pseudo–regret bounded as\nR̃n(A) ≤ b2 log 1/δ\nn\n(∑\ni 6=i∗\n1\n∆i + 4\n∑\ni 6=i∗\nΓ2i∗,i ∆2i + 2b2 log 1/δ n\n∑\ni 6=i∗\n∑\nj 6=i j 6=i∗\nΓ2i,j ∆2i∆ 2 j\n) + 5K\nn ,\nwith probability at least 1− 6nKδ. Similarly, if MV-LCB is run with δ = 1/n2 then\nE[R̃n(A)] ≤ 2b2 log n\nn\n(∑\ni 6=i∗\n1\n∆i + 4\n∑\ni 6=i∗\nΓ2i∗,i ∆2i + 4b2 log n n\n∑\ni 6=i∗\n∑\nj 6=i j 6=i∗\nΓ2i,j ∆2i∆ 2 j\n) + (17 + 6ρ) K\nn .\nRemark 1 (the bound). Let ∆min = mini 6=i∗ ∆i and Γmax = maxi |Γi|, then a rough simplification of the previous bound leads to\nE[R̃n(A)] ≤ O ( K\n∆min\nlog n\nn +K2 Γ2max ∆4min log2 n n\n) .\nFirst we notice that the regret decreases as O(log2 n/n), implying that MV-LCB is a consistent algorithm. As already highlighted in Definition 2, the regret is mainly composed by two terms. The first term is due to the difference in the mean–variance of the best arm and the arms pulled by the algorithm, while the second term denotes the additional variance introduced by the exploration risk of pulling arms with different means. In particular, it is interesting to note that this additional term depends on the squared difference in the means of the arms Γ2i,j . Thus, if all the arms have the same mean, this term would be zero.\nRemark 2 (worst–case analysis). We can further study the result of Theorem 1 by considering the worst–case performance of MV-LCB, that is the performance when the distributions of the arms are chosen so as to maximize the regret. In order to illustrate our argument we consider the simple case of K = 2 arms, ρ = 0 (variance minimization), µ1 6= µ2, and σ21 = σ22 = 0 (deterministic arms). 5 In this case we have a variance gap ∆ = 0 and Γ2 > 0. According to the definition of MV-LCB, the index Bi,s would simply reduce to Bi,s = √ log(1/δ)/s, thus forcing the algorithm to pull both arms uniformly (i.e., T1,n = T2,n = n/2 up to rounding effects). Since the arms have the same variance, there is no direct regret in pulling either one or the other. Nonetheless, the algorithm has an additional variance due to the difference in the samples drawn from distributions with different means. In this case, the algorithm suffers a constant (true) regret\nRn(MV-LCB) = 0 + T1,nT2,n n2 Γ2 = 1 4 Γ2,\nindependent from the number of rounds n. This argument can be generalized to multiple arms and ρ 6= 0, since it is always possible to design an environment (i.e., a set of distributions) such that ∆min = 0 and Γmax 6= 0. 6 This result is not surprising. In fact, two arms with the same mean– variance are likely to produce similar observations, thus leading MV-LCB to pull the two arms repeatedly over time, since the algorithm is designed to try to discriminate between similar arms. Although this behavior does not suffer from any regret in pulling the “suboptimal” arm (the two arms are equivalent), it does introduce an additional variance, due to the difference in the means of the arms (Γ 6= 0), which finally leads to a regret the algorithm is not “aware” of. This argument suggests that, for any n, it is always possible to design an environment for which MV-LCB has a constant regret. This is particularly interesting since it reveals a huge gap between the mean–variance problem and the standard expected regret minimization problem and will be further investigated in the numerical simulations presented in Section 5. In fact, in the latter case, UCB is known to have a worst–case regret per round of Ω(1/ √ n) [3], while in the worst case, MV-LCB suffers a constant regret. In the next section we introduce a simple algorithm able to deal with this problem and achieve a vanishing worst–case regret.\n5Note that in this case (i.e., ∆ = 0), Theorem 1 does not hold, since the optimal arm is not unique. 6Notice that this is always possible for a large majority of distributions for which the mean and variance are\nindependent or mildly correlated."}, {"heading": "4 The Exploration–Exploitation Algorithm", "text": "The ExpExp algorithm divides the time horizon n into two distinct phases of length τ and n − τ respectively. During the first phase all the arms are explored uniformly, thus collecting τ/K samples each 7. Once the exploration phase is over, the mean–variance of each arm is computed and the arm with the smallest estimated mean–variance MVi,τ/K is repeatedly pulled until the end.\nThe MV-LCB is specifically designed to minimize the probability of pulling the wrong arms, so whenever there are two equivalent arms (i.e., arms with the same mean–variance), the algorithm tends to pull them the same number of times, at the cost of potentially introducing an additional variance which might result in a constant regret. On the other hand, ExpExp stops exploring the arms after τ rounds and then elicits one arm as the best and keeps pulling it for the remaining n− τ rounds. Intuitively, the parameter τ should be tuned so as to meet different requirements. The first part of the regret (i.e., the regret coming from pulling the suboptimal arms) suggests that the exploration phase τ should be long enough for the algorithm to select the empirically best arm î∗ at τ equivalent to the actual optimal arm i∗ with high probability; and at the same time, as short as possible to reduce the number of times the suboptimal arms are explored. On the other hand, the second part of the regret (i.e., the variance of pulling arms with different means) is minimized by taking τ as small as possible (e.g., τ = 0 would guarantee a zero regret). The following theorem illustrates the optimal trade-off between these contrasting needs.\nTheorem 2. Let ExpExp be run with τ = K(n/14)2/3, then for any choice of distributions {νi} the expected regret is E[R̃n(A)] ≤ 2 Kn1/3 .\nRemark 1 (the bound). We first notice that this bound suggests that ExpExp performs worse than MV-LCB on easy problems. In fact, Theorem 1 demonstrates that MV-LCB has a regret decreasing as O(K log(n)/n) whenever the gaps ∆ are not small compared to n, while in the remarks of Theorem 1 we highlighted the fact that for any value of n, it is always possible to design an environment which leads MV-LCB to suffer a constant regret. On the other hand, the previous bound for ExpExp is distribution independent and indicates the regret is still a decreasing function of n even in the worst case. This opens the question whether it is possible to design an algorithm which works as well as MV-LCB on easy problems and as robustly as ExpExp on difficult problems.\nRemark 2 (exploration phase). The previous result can be improved by changing the exploration strategy used in the first τ rounds. Instead of a pure uniform exploration of all the arms, we could adopt a best–arm identification algorithms such as Successive Reject or UCB-E, which maximize the probability of returning the best arm given a fixed budget of rounds τ (see e.g., [4])."}, {"heading": "5 Numerical Simulations", "text": "In this section we report numerical simulations aimed at validating the main theoretical findings reported in the previous sections. In the following graphs we study the true regret Rn(A) averaged over 500 runs. We first consider the variance minimization problem (ρ = 0) with K = 2 Gaussian\n7In the definition and in the following analysis we ignore rounding effects.\narms set to µ1 = 1.0, µ2 = 0.5, σ21 = 0.05, and σ 2 2 = 0.25 and run MV-LCB 8. In Figure 2 we report the true regret Rn (as in the original definition in eq. 4) and its two components R∆̂n and RΓ̂n (these two values are defined as in eq. 9 with ∆̂ and Γ̂ replacing ∆ and Γ). As expected (see e.g., Theorem 1), the regret is characterized by the regret realized from pulling suboptimal arms and arms with different means (Exploration Risk) and tends to zero as n increases. Indeed, if we considered two distributions with equal means (µ1 = µ2), the average regret coincides with R∆̂n . Furthermore, as shown in Theorem 1 the two regret terms decrease with the same rate O(log n/n).\nA detailed analysis of the impact of ∆ and Γ on the performance of MV-LCB is reported in Appendix D. Here we only compare the worst–case performance of MV-LCB to ExpExp (see Figure 2). In order to have a fair comparison, for any value of n and for each of the two algorithms, we select the pair ∆w,Γw which corresponds to the largest regret (we search in a grid of values with µ1 = 1.5, µ2 ∈ [0.4; 1.5], σ21 ∈ [0.0; 0.25], and σ22 = 0.25, so that ∆ ∈ [0.0; 0.25] and Γ ∈ [0.0; 1.1]). As discussed in Section 4, while the worst–case regret of ExpExp keeps decreasing over n, it is always possible to find a problem for which regret of MV-LCB stabilizes to a constant. For numerical results with multiple values of ρ and 15 arms, please see Appendix D."}, {"heading": "6 Discussion", "text": "In this paper we evaluate the risk of an algorithm in terms of the variability of the sequences of samples that it actually generates. Although this notion might resemble other analyses of UCBbased algorithms (see e.g., the high-probability analysis in [5]), it captures different features of the learning algorithm. Whenever a bandit algorithm is run over n rounds, its behavior, combined with the arms’ distributions, generates a probability distribution over sequences of n rewards. While the quality of this sequence is usually defined by its cumulative sum (or average), here we say that a sequence of rewards is good if it displays a good trade-off between its (empirical) mean and variance. It is important to notice that this notion of risk-return tradeoff does not coincide with the variance of the algorithm over multiple runs.\nLet us consider a simple case with two arms that deterministically generate 0s and 1s respectively, and two different algorithms. Algorithm A1 pulls the arms in a fixed sequence at each run (e.g., arm 1, arm 2, arm 1, arm 2, and so on), so that each arm is always pulled n/2 times. Algorithm A2 chooses one arm uniformly at random at the beginning of the run and repeatedly pulls this arm for n rounds. Algorithm A1 generates sequences such as 010101... which have high variability within each run, incurs a high regret (e.g., if ρ = 0), but has no variance over multiple runs because it always generates the same sequence. On the other hand,A2 has no variability in each run, since it generates sequences with only 0s or only 1s, suffers no regret in the case of variance minimization, but has high variance over multiple runs since the two completely different sequences are generated with equal probability. This simple example demonstrates that an algorithm with a very small standard regret w.r.t. the cumulative reward (e.g., A1), might result in a very high variability in a single run of the algorithm, while an algorithm with small mean-variance regret (e.g., A2) could have a high variance over multiple runs."}, {"heading": "7 Conclusions", "text": "The majority of multi–armed bandit literature focuses on the problem of minimizing the regret w.r.t. the arm with the highest return in expectation. We study the notion of risk associated to the variance over multiple runs and risk of variability associated to a single run of an algorithm. The later case highlights an interesting effect on the regret due to the need to estimate variability within a single sequence of finite random samples before making a risk-averse decision. Further, controling the variance risk over multiple runs does not necessarily control the risk of variability over a single run. In this paper, we introduced a novel multi–armed bandit setting where the objective is to perform as well as the arm with the best risk–return trade–off. In particular, we relied on the mean–variance model introduced in [10] to measure the performance of the arms and define the regret of a learning algorithm. We proposed two novel algorithms to solve the mean–variance bandit problem and we reported their corresponding theoretical analysis. While MV-LCB shows a small regret of order O(log n/n) on “easy” problems (i.e., where the mean–variance gaps ∆ are big w.r.t. n), we showed that it has a constant worst–case regret. On the other hand, we proved that ExpExp has a vanishing\n8Notice that although in the paper we assumed the distributions to be bounded in [0, 1] all the results can be extended to sub-Gaussian distributions.\nworst–case regret at the cost of worse performance on “easy” problems. To the best of our knowledge this is the first work introducing risk–aversion in the multi–armed bandit setting and it opens a series of interesting questions.\nLower bound. In this paper we introduced two algorithms, MV-LCB and ExpExp. As discussed in the remarks of Theorem 1 and Theorem 2, MV-LCB has a regret of order O( √ K/n) on easy prob-\nlems and O(1) on difficult problems, while ExpExp achieves the same regret O(K/n1/3) over all problems. The primary open question is whetherO(K/n1/3) is actually the best possible achievable rate (in the worst–case) for this problem or a better rate is possible. This question is of particular interest since the standard reward expectation maximization problem has a known lower–bound of Ω( √\n1/n), and a minimax rate of Ω(1/n1/3) for the mean–variance problem would imply that the risk–averse bandit problem is intrinsically more difficult than standard bandit problems.\nDifferent measures of return–risk. Considering alternative notions of risk is a straightforward extension to the previous setting. In fact, over the years the mean–variance model has often been criticized. From a point of view of the expected utility theory, the mean–variance model is only justified under a Gaussianity assumption on the arm distributions. It also violates the monotonocity condition due to the different orders of the mean and variance and is not a coherent measure of risk [2]. Furthermore, the variance is a symmetric measure of risk, while it is often the case that only one–sided deviations from the mean are undesirable (e.g., in finance only losses w.r.t. to the expected return are considered as a risk, while any positive deviation is not considered as a real risk). A popular replacement for the mean–variance is to use the α value–at–risk (i.e., the quantile) to measure the risk of a random variable. The main challenge in this case is the estimation of the value–at–risk for each arm. In fact, while the cumulative distribution of a random variable can be reliably estimated (see e.g., [11]), estimating the quantile might be more difficult.\nIn [2] axiomatic rules are listed to define coherent measures of risk. Though α value–at–risk violates these rules, Conditional Value at Risk (otherwise known as average value at risk, tail value at risk, expected shortfall and lower tail risk) passes these rules as a coherent measure of risk. One can easily imagine a lower confidence bound algorithm based on [7] in the same composition as MVLCB which replaces the variance by the conditional value at risk.\nThe notion of optimality in the risk sensitive setting also depends on the selection of a single-period or multi-period risk evaluation. While the single-period risk of an arm is simply the risk of its distribution, in a multi-period evaluation we consider the risk of the sum of rewards obtained by repeatedly pulling the same arm over n rounds. Unlike the variance, for which the variance of a sum of n independent realizations of the same random variable is simply n times its variance, for other measures of risk (e.g., α value–at–risk) this is not necessarily the case. As a result, an arm with the smallest single-period risk might not be the optimal choice over an horizon of n rounds. Therefore, the performance of a learning algorithm should be compared to the smallest risk that can be achieved by any sequence of arms over n rounds, thus requiring a new definition of regret.\nLinear bandits. In linear bandits, each arm is characterized by a marginal distribution with expected value µi and a covariance matrix C. At each step the learner chooses a combination of arms and observes the corresponding combined reward. In this case, the best combination is obtained by solving the mean–variance quadratic program minx(x>Cx− ρx>µ) where x is usually a point in the K-dimensional simplex (e.g., in finance x is in the simplex when no short–selling is allowed). Similar to the multi–arm case, the objective is to define an algorithm able to achieve a mean–variance as small as the best point in the simplex over n rounds.\nSimple regret. Finally, an interesting related problem is the simple regret setting where the learner is allowed to explore over n rounds and it only suffers a regret defined on the solution returned at the end. It is known that it is possible to design algorithm able to effectively estimate the mean of the arms and finally return the best arm with high probability. In the risk-return setting, the objective would be to return the arm with the best risk-return tradeoff.\nAcknowledgments This work was supported by Ministry of Higher Education and Research, NordPas de Calais Regional Council and FEDER through the “contrat de projets état region 2007–2013\", French National Research Agency (ANR) under project LAMPADA n◦ ANR-09-EMER-007, European Community’s Seventh Framework Programme (FP7/2007-2013) under grant agreement n◦ 270327, and PASCAL2 European Network of Excellence."}, {"heading": "A The Regret", "text": "A.1 The True Regret\nWe recall the definition of the (empirical) regret as\nRn(A) = M̂Vn(A)− M̂Vi∗,n.\nGiven the definitions reported in the main paper, we first elaborate on the two mean terms in the regret as\nµ̂i∗,n = 1\nn\nK∑\ni=1\nTi,n∑\nt=1\nYi,t = 1\nn\nK∑\ni=1\nTi,nµ̃i,Ti,n ,\nand\nµ̂n(A) = 1\nn\nK∑\ni=1\nTi,n∑\nt=1\nXi,t = 1\nn\nK∑\ni=1\nTi,nµ̂i,Ti,n .\nSimilarly, the two variance terms can be written as\nσ̂2n(A) = 1\nn\nK∑\ni=1\nTi,n∑\nt=1\n( Xi,t − µ̂n(A) )2\n= 1\nn\nK∑\ni=1\nTi,n∑\nt=1\n( Xi,t − µ̂i,Ti,n )2 + 1\nn\nK∑\ni=1\nTi,n∑\nt=1\n( µ̂i,Ti,n − µ̂n(A) )2 + 2\nn\nK∑\ni=1\nTi,n∑\nt=1\n( Xi,t − µ̂i,Ti,n )( µ̂i,Ti,n − µ̂n(A) )\n= 1\nn\nK∑\ni=1\nTi,nσ̂ 2 i,Ti,n +\n1\nn\nK∑\ni=1\nTi,n ( µ̂i,Ti,n − µ̂n(A) )2 + 0,\nand\nσ2i∗,n = 1\nn\nK∑\ni=1\nTi,n∑\nt=1\n( Yi,t − µ̂i∗,n )2\n= 1\nn\nK∑\ni=1\nTi,n∑\nt=1\n( Yi,t − µ̃i,Ti,n )2 + 1\nn\nK∑\ni=1\nTi,n∑\nt=1\n( µ̃i,Ti,n − µ̂i∗,n )2 + 2\nn\nK∑\ni=1\nTi,n∑\nt=1\n( Yi,t − µ̃i,Ti,n )( µ̃i,Ti,n − µ̂i∗,n )\n= 1\nn\nK∑\ni=1\nTi,tσ̃ 2 i,Ti,n +\n1\nn\nK∑\ni=1\nTi,n ( µ̃i,Ti,n − µ̂i∗,n )2 + 0.\nPutting together these terms, we obtain the regret (see eq. 4)\nRn(A) = 1\nn\n∑ i6=i∗ Ti,n [ (σ̂2i,Ti,n − σ̃2i,Ti,n)− ρ(µ̂i,Ti,n − µ̃i,Ti,n) ]\n+ 1\nn\nK∑\ni=1\nTi,n ( µ̂i,Ti,n − µ̂n(A) )2 − 1 n K∑\ni=1\nTi,n ( µ̃i,Ti,n − µ̂i∗,n )2\nIf we further elaborate the second term, we obtain\n1\nn\nK∑\ni=1\nTi,n ( µ̂i,Ti,n − µ̂n(A) )2 = 1\nn\nK∑\ni=1\nTi,n ( µ̂i,Ti,n − 1\nn\nK∑\nj=1\nTj,nµ̂j,Tj,n\n)2\n= 1\nn\nK∑\ni=1\nTi,n\n( K∑\nj=1\nTj,n n\n(µ̂i,Ti,n − µ̂j,Tj,n) )2\n≤ 1 n\nK∑\ni=1\nTi,n\nK∑\nj=1\nTj,n n (µ̂i,Ti,n − µ̂j,Tj,n)2\n= 1\nn2\nK∑\ni=1\n∑ j 6=i Ti,nTj,n(µ̂i,Ti,n − µ̂j,Tj,n)2.\nUsing the definitions ∆̂i = (σ̂2i,Ti,n − σ̃2i,Ti,n)− ρ(µ̂i,Ti,n − µ̃i,Ti,n) and Γ̂2i,j = (µ̂i,Ti,n − µ̂j,Tj,n)2 we finally obtain an upper–bound on the regret of the form\nRn(A) ≤ 1\nn\n∑ i 6=i∗ Ti,n∆̂i + 1 n2 K∑ i=1 ∑ j 6=i Ti,nTj,nΓ̂ 2 i,j .\nIn the following we refer to the two terms asR∆̂n andRΓ̂n.\nA.2 The Pseudo–Regret\nSimilar to what is done in the standard bandit problem, we can introduce a different notion of regret. Starting from the last equation in the previous section, we define the pseudo–regret\nR̃n(A) = 1\nn\n∑ i 6=i∗ Ti,n∆i + 2 n2 K∑ i=1 ∑ j 6=i Ti,nTj,nΓ 2 i,j ,\nwhere the empirical values ∆̂i and Γ̂i,j are substituted by their corresponding exact values 9. In the following we show that the true and pseudo regrets different for values that tend to zero with high probability.\nProof. (Lemma 1)\nWe define a high–probability event in which the empirical values and the true values only differ for small quantities E = { ∀i = 1, . . . ,K, ∀s = 1, . . . , n, ∣∣µ̂i,s − µi ∣∣ ≤ √ log 1/δ\n2s and\n∣∣σ̂2i,s − σ2i ∣∣ ≤ 5\n√ log 1/δ\n2s\n} .\nUsing Chernoff–Hoeffding inequality and a union bound over arms and rounds, we have that P[EC ] ≤ 6nKδ. Under this event we rewrite the empirical ∆̂i as\n∆̂i = ∆i − (σ2i − σ2i∗) + ρ(µi − µi∗) + (σ̂2i,Ti,n − σ̃2i,Ti,n)− ρ(µ̂i,Ti,n − µ̃i,Ti,n)\n≤ ∆i + 2(5 + ρ) √ log 1/δ\n2Ti,n .\nSimilarly, Γ̂i,j is upper–bounded as\n|Γ̂i,j | = |Γi,j − µi + µj + µ̂i,Ti,n − µ̂j,Tj,n |\n≤ |Γi,j |+ √ log 1/δ\n2Ti,n +\n√ log 1/δ\n2Tj,n .\n9Notice that the factor 2 in front of the second term is due to a rough upper bounding used in the proof of Lemma 1.\nThus the regret can be written as\nRn(A) ≤ 1\nn ∑ i 6=i∗ Ti,n ( ∆i + 2(5 + ρ)\n√ log 1/δ\n2Ti,n\n) + 1\nn2 K∑ i=1 ∑ j 6=i Ti,nTj,n ( |Γi,j |+\n√ log 1/δ\n2Ti,n +\n√ log 1/δ\n2Tj,n )2 ≤ 1 n ∑ i 6=i∗ Ti,n∆i + 5 + ρ n ∑ i 6=i∗ √ 2Ti,n log 1/δ + 2 n2 K∑ i=1 ∑ j 6=i Ti,nTj,nΓ 2 i,j\n+ 2 √ 2\nn2 K∑ i=1 ∑ j 6=i Tj,n log 1/δ + 2 √ 2 n2 K∑ i=1 ∑ j 6=i Ti,n log 1/δ\n≤ 1 n ∑ i 6=i∗ Ti,n∆i + 2 n2 K∑ i=1 ∑ j 6=i Ti,nTj,nΓ 2 i,j + (5 + ρ)\n√ 2K log 1/δ\nn + 4 √ 2 K log 1/δ n .\nwhere in the next to last passage we used Jensen’s inequality for concave functions and rough upper bounds on other terms (K − 1 < K, ∑i 6=i∗ Ti,n ≤ n). By recalling the definition of R̃n(A) we finally obtain\nRn(A) ≤ R̃n(A) + (5 + ρ) √ 2K log 1/δ\nn + 4 √ 2 K log 1/δ n ,\nwith probability 1−6nKδ. Thus we can conclude that any upper bound on the pseudo–regret R̃n(A) is a valid upper bound for the true regretRn(A), up to a decreasing term of order O( √ K/n).\nB MV-LCB Theoretical Analysis\nIn order to simplify the notation in the following we use b = 2(5 + ρ).\nProof. (Theorem 1)\nWe begin by defining a high–probability event E as\nE = { ∀i = 1, . . . ,K, ∀s = 1, . . . , n, ∣∣µ̂i,s − µi ∣∣ ≤ √ log 1/δ\n2s and\n∣∣σ̂2i,s − σ2i ∣∣ ≤ 5\n√ log 1/δ\n2s\n} .\nUsing Chernoff–Hoeffding inequality and a union bound over arms and rounds, we have that P[EC ] ≤ 6nKδ. We now introduce the definition of the algorithm. Consider any time t when arm i 6= i∗ is pulled (i.e., It = i). By definition of the algorithm in Figure 1, i is selected if its corresponding index Bi,Ti,t−1 is bigger than for any other arm, notably the best arm i\n∗. By recalling the definition of the index and the empirical mean–variance at time t, we have\nσ̂2i,Ti,t−1 − ρµ̂i,Ti,t−1 − (5 + ρ) √ log 1/δ\n2Ti,t−1 = Bi,Ti,t−1 ≤\n≤ Bi∗,Ti∗,t−1 = σ̂2i∗,Ti∗,t−1 − ρµ̂i∗,Ti∗,t−1 − (5 + ρ) √ log 1/δ\n2Ti∗,t−1 .\nOver all the possible realizations, we now focus on the realizations in E . In this case, we can rewrite the previous condition as\nσ2i − ρµi − 2(5 + ρ) √ log 1/δ\n2Ti,t−1 ≤ Bi,Ti,t−1 ≤ Bi∗,Ti∗,t−1 ≤ σ2i∗ − ρµi∗ .\nLet time t be the last time when arm i is pulled until the final round n, then Ti,t−1 = Ti,n − 1 and\nTi,n ≤ 2(5 + ρ)2\n∆2i log\n1 δ + 1,\nwhich suggests that the suboptimal arms are pulled only few times with high probability. Plugging the bound in the regret in eq. 8 leads to the final statement\nR̃n(A) ≤ 1\nn\n∑\ni 6=i∗\nb2 log 1/δ\n∆i +\n1\nn\n∑\ni 6=i∗\n4b2 log 1/δ\n∆2i Γ2i∗,i +\n1\nn2\n∑\ni 6=i∗\n∑\nj 6=i j 6=i∗\n2b4(log 1/δ)2\n∆2i∆ 2 j\nΓ2i,j + 5K\nn ,\nwith probability 1− 6nKδ. We now move from the previous high–probability bound to a bound in expectation. The pseudo– regret is (roughly) bounded as R̃n(A) ≤ 2 + ρ (by bounding ∆i ≤ 1 + ρ and Γ ≤ 1), thus\nE[R̃n(A)] = E [ R̃n(A)I{E} ] + E [ R̃n(A)I{EC} ] ≤ E [ R̃n(A)I{E} ] + (2 + ρ)P [ EC ] .\nBy using the previous high–probability bound and recalling that P[EC ] ≤ 6nKδ, we have\nE[R̃n(A)] ≤ 1\nn\n∑\ni 6=i∗\nb2 log 1/δ\n∆i +\n1\nn\n∑\ni 6=i∗\n4b2 log 1/δ\n∆2i Γ2i∗,i +\n1\nn2\n∑\ni 6=i∗\n∑\nj 6=i j 6=i∗\n2b4(log 1/δ)2\n∆2i∆ 2 j\nΓ2i,j\n+ 5K\nn + (2 + ρ)6nKδ.\nThe final statement of the lemma follows by tuning the parameter δ = 1/n2 so as to have a regret bound decreasing with n.\nWhile a high–probability bound forRn can be immediately obtained from Lemma 1, the expectation ofRn is reported in the next corollary.\nProof. Since the mean–variance−ρ ≤ M̂V ≤ 1/4, the regret is bounded by−1/4−ρ ≤ Rn(A) ≤ 1/4 + ρ. Thus we have\nE[Rn(A)] =≤ uP[Rn(A) ≤ u] + (1 4 + ρ ) P[Rn(A) > u].\nBy taking u equal to the previous high–probability bound and recalling that P[EC ] ≤ 6nKδ, we have\nE[Rn(A)] ≤ 1\nn\n∑\ni 6=i∗\nb2 log 1/δ\n∆i +\n1\nn\n∑\ni 6=i∗\n4b2 log 1/δ\n∆2i Γ2i∗,i +\n1\nn2\n∑\ni 6=i∗\n∑\nj 6=i j 6=i∗\n2b4(log 1/δ)2\n∆2i∆ 2 j\nΓ2i,j\n+ 5K\nn + b\n√ K log 1/δ\n2n + 4 √ 2 K log 1/δ n + (1 4 + ρ ) 6nKδ.\nThe final statement of the lemma follows by tuning the parameter δ = 1/n2 so as to have a regret bound decreasing with n."}, {"heading": "C Exp–Exp Theoretical Analysis", "text": "During the exploitation phase the algorithm pulls arm î∗ with the smallest empirical variance estimated during the exploration phase of length τ . As a result, the number of pulls of each arm is\nTi,n = τ K + (n− τ)I{i = î∗} (11)\nWe analyze the two terms of the regret separately.\nR̃∆n = 1\nn\n∑\ni 6=i∗\n( τ K + (n− τ)I{i = î∗} ) ∆i = τ nK ∑\ni 6=i∗ ∆i +\nn− τ n\n∑ i 6=i∗ ∆iI{i = î∗}︸ ︷︷ ︸\n(a)\n.\nWe notice that the only random variable in this formulation is the best arm î∗ at the end of the exploration phase. We thus compute the expected value of R̃∆n .\nE[(a)] = P[i = î∗]∆i = P[∀j 6= i, σ̂2i,τ/K ≤ σ̂2j,τ/K ]∆i ≤ P[σ̂2i,τ/K ≤ σ̂2i∗,τ/K ]∆i = P [ (σ̂2i,τ/K − σ2i ) + (σ2i∗ − σ̂2i∗,τ/K) ≤ ∆i ] ∆i\n≤ 2∆i exp ( − τ K ∆2i )\nThe second term in the regret can be bounded as follows.\nR̃Γn = 1\nn2\nK∑\ni=1\n∑\nj 6=i\n( τ K + (n− τ)I{i = î∗} )( τ K + (n− τ)I{j = î∗} ) Γ2i,j\n= 1\nn2\nK∑\ni=1\n∑\nj 6=i\n( τ2 K2 + (n− τ)2I{i = î∗}I{j = î∗}+ τ K (n− τ)I{j = î∗}+ τ K (n− τ)I{i = î∗} ) Γ2i,j\n= τ2\nn2K2\nK∑\ni=1\n∑ j 6=i Γ2i,j + 2 (n− τ)τ Kn2 K∑ i=1 ∑ j 6=i Γ2i,jI{i = î∗}\n≤ τ n2 + 2 (n− τ)τ n2 ≤ 2 τ n\nGrouping all the terms, ExpExp has an expected regret bounded as\nE[R̃n(A)] ≤ 2 τ\nn + 2\n∑ i 6=i∗ ∆i exp ( − τ K ∆2i )\nWe can now move to the worst–case analysis of the regret. Let f(∆i) = ∆i exp ( − τK∆2i ) , the “adversarial” choice of the gap is determined by maximizing the regret, which corresponds to\nf ′(∆i) = exp ( − τ K ∆2i ) + ∆i\n( − 2 τ\nK ∆i exp ( − τ K ∆2i\n))\n= (\n1− 2 τ K ∆2i\n) exp ( − τ K ∆2i ) = 0,\nand leads to a worst–case choice for the gap of\n∆i =\n√ K\n2τ .\nThe worst–case regret is then\nE[R̃n(A)] ≤ 2 τ\nn + (K − 1)\n√ 2K\n1√ τ exp(−0.5) ≤ 2 τ n +K3/2 1√ τ\nWe can now choose the parameter τ minimizing the worst–case regret. Taking the derivative of the regret w.r.t. τ we obtain\ndE[R̃n(A)] dτ = 2 n − 1 2 (K τ )3/2 = 0,\nthus leading to the optimal parameter τ = (n/4)2/3K. The final regret is thus bounded as\nE[R̃n(A)] ≤ 3 K\nn1/3 ."}, {"heading": "D Additional Simulations", "text": "D.1 Comparison between MV-LCB and ExpExp with K = 2\nWe consider the variance minimization problem (ρ = 0) with K = 2 Gaussian arms with different means and variances. In particular, we consider a grid of values with µ1 = 1.5, µ2 ∈ [0.4; 1.5], σ21 ∈ [0.0; 0.25], and σ22 = 0.25, so that ∆ ∈ [0.0; 0.25] and Γ ∈ [0.0; 1.1] and number of rounds n ∈ [50; 2.5× 105]. Figures 3 and 4 report the mean regret for different values of n. The colors are renormalized in each plot so that dark blue corresponds to the smallest regret and red to the largest regret. The results confirm the theoretical findings of Theorem 1 and 2. In fact, for simple problems (large gaps ∆) MV-LCB converges to a zero–regret faster than ExpExp, while for ∆ close to zero (i.e., equivalent arms), MV-LCB has a constant regret which does not decrease with n and the regret of ExpExp slowly decreases to zero.\nD.2 Risk tolerance sensitivity\nIn Section 5 we report numerical results demonstrating the composition of the regret and performance of algorithms with only 2 arms in the case of variance minimization. Here we report results for a wide range of risk tolerance ρ ∈ [0.0; 10.0] and K = 15 arms. We set the mean and variance for each of the 15 arms so that a subset of arms is always dominated (i.e., for any ρ, MVρi > MV ρ i∗ρ\n) demonstrating the effect of different ρ values on the position of the optimal arm i∗ρ.\nIn Figure 2 we arranged the true values of each arm along the red fronteir and the ρ-directed performance of the algorithms in a standard deviation–mean plot. The green and blue lines show the standard deviation and mean for the performance of each algorithm for a specific ρ setting and fi-\nnite time n, where each point represents the resulting mean–standard deviation of the sequence of pulls on the arms by the algorithm with that specific value of ρ. The gap between the ρ specific performance of the algorithm and the corresponding optimal arm along the red frontier represents the regret for the specific ρ value. Accordingly, the gap between the algorithm performance curves represents the gap in performance with regard to MV-LCB versus ExpExp. Where a lot of arms have big gaps (e.g., all the dominated arms have a large gap for any value of ρ), MV-LCB tends to perform better than ExpExp. The series of plots represent increasing values of n and demonstrate the relative algorithm performance versus the optimal red frontier. The set of plots represent the two settings reported in Figure 5. We chose the values of the arms so as to have configurations with different complexities. In particular, configuration 1 corresponds to “easy” problems for MV-LCB since the arms all have quite large gaps (for different values of ρ) and this should allow it to perform well. On the other hand, the second configuration has much smaller gaps and, thus, higher complexity. According to the bounds for MV-LCB we know that a good proxy for its learning complexity is represented by the term ∑ i 1/∆ 2 i,ρ. In Figure 5 we report such complexity for different values of ρ and, as it can be noticed, configuration 2 has always a higher complexity than configuration 1.\nAs we notice, in both configurations the performance of MV-LCB and ExpExp approach one of the optimal arms i∗ρ for each specific ρ as n increases. Nonetheless, in configuration 1 the large number of suboptimal arms (e.g., arms with large gaps) allows MV-LCB to outperform ExpExp and converge faster to the optimal arm (and thus zero regret). On the other hand, in configuration 2 there are more arms with similar performance and for some values of ρ ExpExp eventually achieves better performance than MV-LCB."}], "references": [{"title": "Active learning in heteroscedastic noise", "author": ["András Antos", "Varun Grover", "Csaba Szepesvári"], "venue": "Theoretical Computer Science,", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 2010}, {"title": "Coherent measures of risk", "author": ["P Artzner", "F Delbaen", "JM Eber", "D Heath"], "venue": "Mathematical finance,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 1999}, {"title": "Regret bounds and minimax policies under partial monitoring", "author": ["Jean-Yves Audibert", "Sébastien Bubeck"], "venue": "Journal of Machine Learning Research,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 2010}, {"title": "Best arm identification in multiarmed bandits", "author": ["Jean-Yves Audibert", "Sébastien Bubeck", "Rémi Munos"], "venue": "In Proceedings of the Twenty-third Conference on Learning Theory (COLT’10),", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 2010}, {"title": "Exploration-exploitation trade-off using variance estimates in multi-armed bandits", "author": ["Jean-Yves Audibert", "Rémi Munos", "Csaba Szepesvári"], "venue": "Theoretical Computer Science,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 1902}, {"title": "Finite-time analysis of the multi-armed bandit problem", "author": ["Peter Auer", "Nicolò Cesa-Bianchi", "Paul Fischer"], "venue": "Machine Learning,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2002}, {"title": "Large deviations bounds for estimating conditional value-at-risk", "author": ["David B. Brown"], "venue": "Operations Research Letters,", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2007}, {"title": "Risk-sensitive online learning", "author": ["Eyal Even-Dar", "Michael Kearns", "Jennifer Wortman"], "venue": "In Proceedings of the 17th international conference on Algorithmic Learning Theory (ALT’06),", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 2006}, {"title": "The Economics of Risk and Time", "author": ["Christian Gollier"], "venue": null, "citeRegEx": "9", "shortCiteRegEx": "9", "year": 2001}, {"title": "Portfolio selection", "author": ["Harry Markowitz"], "venue": "The Journal of Finance,", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 1952}, {"title": "The tight constant in the dvoretzky-kiefer-wolfowitz inequality", "author": ["Pascal Massart"], "venue": "The Annals of Probability,", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 1990}, {"title": "Theory of games and economic behavior", "author": ["J Neumann", "O Morgenstern"], "venue": "Princeton University,", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 1947}, {"title": "Some aspects of the sequential design of experiments", "author": ["Herbert Robbins"], "venue": "Bulletin of the AMS,", "citeRegEx": "13", "shortCiteRegEx": "13", "year": 1952}, {"title": "Deviations of stochastic bandit regret", "author": ["Antoine Salomon", "Jean-Yves Audibert"], "venue": "In Proceedings of the 22nd international conference on Algorithmic learning theory (ALT’11),", "citeRegEx": "14", "shortCiteRegEx": "14", "year": 2011}], "referenceMentions": [{"referenceID": 12, "context": "1 Introduction The multi–armed bandit [13] elegantly formalizes the problem of on–line learning with partial feedback, which encompasses a large number of real–world applications, such as clinical trials, online advertisements, adaptive routing, and cognitive radio.", "startOffset": 38, "endOffset": 42}, {"referenceID": 11, "context": "Two foundational risk modeling paradigms are Expected Utility theory [12] and the historically popular and accessible Mean-Variance paradigm [10].", "startOffset": 69, "endOffset": 73}, {"referenceID": 9, "context": "Two foundational risk modeling paradigms are Expected Utility theory [12] and the historically popular and accessible Mean-Variance paradigm [10].", "startOffset": 141, "endOffset": 145}, {"referenceID": 8, "context": ", [9] for an introduction to risk from an expected utility theory perspective).", "startOffset": 2, "endOffset": 5}, {"referenceID": 7, "context": "In particular, [8] showed that in general, although it is possible to achieve a small regret w.", "startOffset": 15, "endOffset": 18}, {"referenceID": 4, "context": "In the multi–arm bandit domain, the most interesting results are by [5] and [14].", "startOffset": 68, "endOffset": 71}, {"referenceID": 13, "context": "In the multi–arm bandit domain, the most interesting results are by [5] and [14].", "startOffset": 76, "endOffset": 80}, {"referenceID": 4, "context": "[5] introduced an analysis of the expected regret and its distribution, revealing that an anytime version of UCB [6] and UCB-V might have large regret with some nonnegligible probability.", "startOffset": 0, "endOffset": 3}, {"referenceID": 5, "context": "[5] introduced an analysis of the expected regret and its distribution, revealing that an anytime version of UCB [6] and UCB-V might have large regret with some nonnegligible probability.", "startOffset": 113, "endOffset": 116}, {"referenceID": 13, "context": "1 This analysis is further extended by [14] who derived negative results which show no anytime algorithm can achieve a regret with both a small expected regret and exponential tails.", "startOffset": 39, "endOffset": 43}, {"referenceID": 9, "context": "In particular, we refer to the first and most popular measure of risk–return, the mean–variance model introduce by [10].", "startOffset": 115, "endOffset": 119}, {"referenceID": 0, "context": "We consider the standard multi–arm bandit setting withK arms, each characterized by a distribution νi bounded in the interval [0, 1].", "startOffset": 126, "endOffset": 132}, {"referenceID": 9, "context": "Although a large number of models for risk–return trade–off have been proposed, here we focus on the most historically popular and simple model: the mean–variance model proposed by [10],2 where the return of an arm is measured by the expected reward and its risk by its variance.", "startOffset": 181, "endOffset": 185}, {"referenceID": 4, "context": "Although the analysis is mostly directed to the pseudo–regret, as commented in Remark 2 at page 23 of [5], it can be extended to the true regret.", "startOffset": 102, "endOffset": 105}, {"referenceID": 4, "context": ", [5]).", "startOffset": 2, "endOffset": 5}, {"referenceID": 5, "context": "The algorithm is a natural extension of UCB1 [6] and we report a theoretical performance analysis on how well it balances the exploration needed to identify the best arm versus the risk of pulling arms with different means.", "startOffset": 45, "endOffset": 48}, {"referenceID": 0, "context": ", [1] for the bound on the variance) on terms μ̂ and σ̂.", "startOffset": 2, "endOffset": 5}, {"referenceID": 0, "context": "random variables bounded in [0, 1] from the distribution νi with mean μi and variance σ i , and the empirical mean μ̂i,s and variance σ̂ 2 i,s computed as in Equation 1, then P [ ∃i = 1, .", "startOffset": 28, "endOffset": 34}, {"referenceID": 2, "context": "In fact, in the latter case, UCB is known to have a worst–case regret per round of Ω(1/ √ n) [3], while in the worst case, MV-LCB suffers a constant regret.", "startOffset": 93, "endOffset": 96}, {"referenceID": 3, "context": ", [4]).", "startOffset": 2, "endOffset": 5}, {"referenceID": 4, "context": ", the high-probability analysis in [5]), it captures different features of the learning algorithm.", "startOffset": 35, "endOffset": 38}, {"referenceID": 9, "context": "In particular, we relied on the mean–variance model introduced in [10] to measure the performance of the arms and define the regret of a learning algorithm.", "startOffset": 66, "endOffset": 70}, {"referenceID": 0, "context": "On the other hand, we proved that ExpExp has a vanishing Notice that although in the paper we assumed the distributions to be bounded in [0, 1] all the results can be extended to sub-Gaussian distributions.", "startOffset": 137, "endOffset": 143}, {"referenceID": 1, "context": "It also violates the monotonocity condition due to the different orders of the mean and variance and is not a coherent measure of risk [2].", "startOffset": 135, "endOffset": 138}, {"referenceID": 10, "context": ", [11]), estimating the quantile might be more difficult.", "startOffset": 2, "endOffset": 6}, {"referenceID": 1, "context": "In [2] axiomatic rules are listed to define coherent measures of risk.", "startOffset": 3, "endOffset": 6}, {"referenceID": 6, "context": "One can easily imagine a lower confidence bound algorithm based on [7] in the same composition as MVLCB which replaces the variance by the conditional value at risk.", "startOffset": 67, "endOffset": 70}, {"referenceID": 0, "context": "References [1] András Antos, Varun Grover, and Csaba Szepesvári.", "startOffset": 11, "endOffset": 14}, {"referenceID": 1, "context": "[2] P Artzner, F Delbaen, JM Eber, and D Heath.", "startOffset": 0, "endOffset": 3}, {"referenceID": 2, "context": "[3] Jean-Yves Audibert and Sébastien Bubeck.", "startOffset": 0, "endOffset": 3}, {"referenceID": 3, "context": "[4] Jean-Yves Audibert, Sébastien Bubeck, and Rémi Munos.", "startOffset": 0, "endOffset": 3}, {"referenceID": 4, "context": "[5] Jean-Yves Audibert, Rémi Munos, and Csaba Szepesvári.", "startOffset": 0, "endOffset": 3}, {"referenceID": 5, "context": "[6] Peter Auer, Nicolò Cesa-Bianchi, and Paul Fischer.", "startOffset": 0, "endOffset": 3}, {"referenceID": 6, "context": "[7] David B.", "startOffset": 0, "endOffset": 3}, {"referenceID": 7, "context": "[8] Eyal Even-Dar, Michael Kearns, and Jennifer Wortman.", "startOffset": 0, "endOffset": 3}, {"referenceID": 8, "context": "[9] Christian Gollier.", "startOffset": 0, "endOffset": 3}, {"referenceID": 9, "context": "[10] Harry Markowitz.", "startOffset": 0, "endOffset": 4}, {"referenceID": 10, "context": "[11] Pascal Massart.", "startOffset": 0, "endOffset": 4}, {"referenceID": 11, "context": "[12] J Neumann and O Morgenstern.", "startOffset": 0, "endOffset": 4}, {"referenceID": 12, "context": "[13] Herbert Robbins.", "startOffset": 0, "endOffset": 4}, {"referenceID": 13, "context": "[14] Antoine Salomon and Jean-Yves Audibert.", "startOffset": 0, "endOffset": 4}], "year": 2013, "abstractText": "Stochastic multi–armed bandits solve the Exploration–Exploitation dilemma and ultimately maximize the expected reward. Nonetheless, in many practical problems, maximizing the expected reward is not the most desirable objective. In this paper, we introduce a novel setting based on the principle of risk–aversion where the objective is to compete against the arm with the best risk–return trade–off. This setting proves to be intrinsically more difficult than the standard multi-arm bandit setting due in part to an exploration risk which introduces a regret associated to the variability of an algorithm. Using variance as a measure of risk, we introduce two new algorithms, investigate their theoretical guarantees, and report preliminary empirical results.", "creator": "LaTeX with hyperref package"}}}