{"id": "1312.0144", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "30-Nov-2013", "title": "Knowing Whether", "abstract": "Knowing whether a proposition is true means knowing that it is true or knowing that it is false. In this paper, we study logics with a modal operator Kw for knowing whether but without a modal operator K for knowing that. This logic is not a normal modal logic, because we do not have that Kw phi -&gt; Kw psi and Kw phi implies Kw psi. Knowing whether logic cannot define many common frame properties, and its expressive power less than that of basic modal logic over classes of models without reflexivity. These features make axiomatizing knowing whether logics non-trivial. We axiomatize knowing whether logic over various frame classes. We also present an extension of knowing whether logic with public announcement operators and we give corresponding reduction axioms for that. We compare our work in detail to two recent similar proposals.", "histories": [["v1", "Sat, 30 Nov 2013 19:18:49 GMT  (27kb)", "https://arxiv.org/abs/1312.0144v1", null], ["v2", "Wed, 11 Dec 2013 13:19:33 GMT  (30kb)", "http://arxiv.org/abs/1312.0144v2", null], ["v3", "Thu, 12 Dec 2013 10:02:26 GMT  (30kb)", "http://arxiv.org/abs/1312.0144v3", null]], "reviews": [], "SUBJECTS": "cs.AI", "authors": ["jie fan", "yanjing wang", "hans van ditmarsch"], "accepted": false, "id": "1312.0144"}, "pdf": {"name": "1312.0144.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["Jie Fan", "Yanjing Wang", "Hans van Ditmarsch"], "emails": [], "sections": [{"heading": null, "text": "ar X\niv :1\n31 2.\n01 44\nv3 [\ncs .A\nI] 1\n2 D\nec 2\nKeywords: non-normal modal logic, completeness, public announcement, expressivity, epistemic logic"}, {"heading": "1 Introduction", "text": "The work entitled ‘Logics of public communication’ by Plaza [Pla89]1 is mainly known as one of the founding publications, if not the founding publication, of public announcement logic. However, it also treats two other topics worthy of investigation, namely ‘knowing value’ modal operators and their binary variant ‘knowing whether’ modal operators. You know the pincode of your bankcard if you know the value of it. You know whether p if you know that p is true or you know that p is false. Plaza demonstrates the use of these operators in his discussion of Sum-and-Product puzzle, and poses as an open question what the axiomatization would be of public announcement logic with these operators [Pla89, p.13]. In [WF13], the authors investigate knowing value operators in depth and give a complete axiomatization of the logic with knowing value and public announcement, where the knowing value modality behaves quite differently from a modality in a normal modal logic, such as the standard knowledge modality. Unlike the knowing value modality, knowing whether is definable in terms of knowing that. But it still seems interesting to investigate a logic with a knowing whether operator but without the usual knowledge operator, and this motivates this paper.\nKnowing whether operators have been discussed in other settings in the logical literature. [HHS96] uses ‘knowing whether’ operator to establish a continuum of knowledge states in a very neat fashion, which demonstrates that ‘knowing whether’ is more convenient to use than ‘knowing that’ in certain contexts, as argued also in [HS93]. In natural language ‘knowing whether’ is frequently used instead of ‘knowing that’. You say: “I know whether it is raining outside,” but you do not say: “I know that it is raining outside or I know that it is not raining outside.” We often only need to know whether\n∗Corresponding author 1Reprinted as [Pla07] with comments by [vD07].\nsomeone knows the truth value of something, rather than the truth value itself. For example, a conference organizer needs to make sure that he knows whether the invited participants will come: it is fine for him as long as a definitive confirmation is given. An analysis in inquisitive semantics of such natural expressions is found in [AEJ13]. For another example, consider the Muddy Children Puzzle [MDH86]. By iterating the announcement of the formula “nobody knows whether he or she is muddy,” this formula will finally become false, i.e., the muddy children will finally learn that they are muddy. This can be succinctly said in a logic with knowing whether and public announcements as primitives. Finally, consider gossip protocols [HHL88], wherein processors (or ‘agents’) exchange information by one-to-one communications (‘calls’) wherein they exchange the value of their local state. We can assume the information to be exchanged are propositional secrets which have binary values. If p describes the secret of agent 1, then after agent 2 calls agent 1, both 1 and 2 know whether p. Whether the value is true or false is irrelevant for the design of such protocols.\nThe logic of knowing whether has also appeared in a different form in prior literature, namely as the logic of ignorance [vdHL03, vdHL04, Ste08]: you are ignorant about a proposition iff you do not know whether the proposition is true. An axiomatization of the logic of ignorance over the class of arbitrary frames is given in [vdHL03, vdHL04]. The authors suggest that it is hard to repeat this exercise for other frame classes. In this work, we advance the study of knowing whether logic by systematically axiomatizing knowing whether logic over various common frame classes. We discuss in detail the difference between [vdHL03, vdHL04, Ste08] and our results.\nKnowing whether logic is not a normal modal logic, it cannot define common frame properties, and it is less expressive than the basic modal logic, although equally expressive on reflexive models. We give a complete axiomatization, and also various extensions for special frame classes, and an addition of the logic with public announcements.\nIn Section 2 we define the language and semantics of the logic of knowing whether. Section 3 deals with expressivity over models and frames, and Section 4 presents our new axiomatization of the logic over the class of arbitrary frames and proves its completeness. Then, in Section 5 we give axiomizations for other frame classes—highly non-trivial in this setting, as frame properties are not definable, unlike in standard modal logic. In Section 6 we extend knowing whether logic with public announcements, and in Section 7 we discuss the literature on the logic of ignorance in relation to our results."}, {"heading": "2 Syntax and semantics of the logic of knowing whether", "text": "We define the logical language in a more general setting including knowing whether but also knowledge. However, we will focus on the language with only knowing whether.\nDefinition 1 (Logical languages PLKwK, PLKw and EL). Let a set P of propositional variables and a set I of agents be given. The logical language PLKwK(P, I) is defined as:\nϕ ::= ⊤ | p | ¬ϕ | (ϕ ∧ ϕ) | Kwiϕ | Kiϕ\nwhere p ∈ P and i ∈ I. Without the Kiϕ construct, we have the language PLKw(P, I) of knowing whether logic. Without the Kwiϕ construct, we have the language EL(P, I) of epistemic logic.\nWe typically omit the parameters P and I from the notations for these languages. The formula Kiϕ stands for ‘agent i knows that ϕ,’ although we do not restrict ourselves to an epistemic context. The formula Kwiϕ stands for ‘agent i knows whether ϕ’. As usual, we define ⊥, (ϕ ∨ ψ), (ϕ → ψ),\n(ϕ ↔ ψ) as the abbreviations of, respectively, ¬⊤, ¬(¬ϕ∧¬ψ), (¬ϕ∨ψ), and ((ϕ → ψ)∧(ψ → ϕ)). We omit parentheses from formulas unless confusion results. In particular, we assume that ∧ and ∨ bind stronger than → and ↔. For ϕ1 ∧ · · · ∧ ϕm we write ∧m j=1 ϕj , and for ϕ1 ∨ · · · ∨ ϕm we write ∨m j=1 ϕj .\nDefinition 2 (Model). A model is a triple M = 〈S, {→i| i ∈ I}, V 〉 where S is a non-empty set of possible worlds, →i is a binary relation over S for each i ∈ I, and V is a valuation function assigning a set of worlds V (p) ⊆ S to each p ∈ P. Given a world s ∈ S, a pair (M, s) is a pointed model. A frame is a pair F = 〈S, {→i| i ∈ I}〉, i.e., a model without a valuation. We will refer to special classes of models or frames using the notation below. A binary relation is partial-functional iff it corresponds to a partial function, i.e., every world has at most one successor.\nNotation Frame Property K — D seriality T reflexivity B symmetry 4 transitivity 5 euclidicity 45 transitivity, euclidicity S4 reflexivity, transitivity S5 reflexivity, euclidicity PF partial functionality\nWe will omit parenthesis around pointed models (M, s) whenever convenient. The non-standard notion of partial functionality plays a special role in knowing whether logics.\nDefinition 3 (Semantics). Given a model M = 〈S, {→i| i ∈ I}, V 〉, the semantics of PLKwK is defined as follows:\nM, s ⊤ ⇔ always M, s p ⇔ s ∈ V (p) M, s ¬ϕ ⇔ M, s 2 ϕ M, s ϕ ∧ ψ ⇔ M, s ϕ and M, s ψ M, s Kwiϕ ⇔ for all t1, t2 such that s →i t1, s →i t2 : (M, t1 ϕ ⇔ M, t2 ϕ) M, s Kiϕ ⇔ for all t such that s →i t : M, t ϕ\nIf M, s ϕ we say that ϕ is true in (M, s), and sometimes write s ϕ if M is clear; if for all s in M we have M, s ϕ we say that ϕ is valid on M and write M ϕ; if for all M based on F with M ϕ we say that ϕ is valid on F and write F ϕ; if for all F with F ϕ, ϕ is valid and we write ϕ. Given Φ ⊆ PLKwK, M, s |= Φ stands for ‘for all ϕ ∈ Φ, M, s |= ϕ,’ and similarly for model/frame validity, and validity. If there exists an (M, s) such that M, s ϕ, then ϕ is satisfiable.\nIntuitively, Kwiϕ is true at s if and only if ϕ has the same truth value on the worlds that i thinks possible. Knowing whether logic is not normal, because Kwi(ϕ → ψ) → (Kwiϕ → Kwiψ) is invalid (and, in relation to that, ϕ → ψ does not imply Kwiϕ → Kwiψ). In the countermodel M1 below we have that M1, s Kwi(p → q) and M1, s Kwip, but M1, s 2 Kwiq.\nM1 : s : ¬p,¬q\n// ¬p, q\nWe use ϕ[ψ/p] to denote a uniform substitution of ϕ, i.e., the formula obtained by replacing all occurrences of p in ϕ (if there is any) with ψ. It can be shown that uniform substitution preserves the validity of PLKw-formulas.\nProposition 4. For any ψ,ϕ ∈ PLKw, any p ∈ P: if ϕ, then ϕ[ψ/p].\nProof. We show the contrapositive, namely that 2 ϕ[ψ/p] implies 2 ϕ. Assume a pointed model (M, s) such that M, s 2 ϕ[ψ/p], where M = 〈S, {→i| i ∈ I}, V 〉. Consider model M′ that is as M but with valuation V ′, where V ′(p) = {t ∈ S | M, t |= ψ}. We show that for all χ and for all s in the domain of M: M, s χ[ψ/p] iff M′, s χ, by induction on χ. The only non-trivial case is Kwiχ.\nM, s Kwiχ[ψ/p] iff for all s1, s2 such that s →i s1, s →i s2 : M, s1 χ[ψ/p] iff M, s2 χ[ψ/p] iff (by induction) for all s1, s2 such that s →i s1, s →i s2 : M′, s1 χ iff M′, s2 χ iff M′, s Kwiχ\nTherefore, from M, s 2 ϕ[ψ/p] follows M′, s 2 ϕ, and therefore 2 ϕ, as desired."}, {"heading": "3 Expressivity and frame correspondence", "text": "In this section we compare the relative expressivity of knowing whether logic and epistemic logic, and we give some negative results for frame correspondence for knowing whether logic."}, {"heading": "3.1 Expressivity", "text": "We adopt the definition of expressivity in [vDvdHK07, Def.8.2].\nDefinition 5 (Expressive). Given two logical languages L1 and L2 that are interpreted in the same class of models,\n• L2 is at least as expressive as L1, notation L1 L2, if and only if for every formula ϕ1 ∈ L1 there is a formula ϕ2 ∈ L2 such that ϕ1 ⇔ ϕ2 (i.e., ϕ1 and ϕ2 are logically equivalent).\n• L1 and L2 are equally expressive, notation L1 ≡ L2, if and only if L1 L2 and L2 L1.\n• L1 is less expressive than L2, notation L1 ≺ L2, if and only if L1 L2 and L2 6 L1.\nProposition 6. PLKw is less expressive than EL on the class of K models, D-models, 4-models, 5-models.\nProof. This is a truth-preserving translation t from PLKw to EL:\nt(p) = p t(¬ϕ) = ¬t(ϕ) t(ϕ ∧ ψ) = t(ϕ) ∧ t(ψ) t(Kwiϕ) = Kit(ϕ) ∨ Ki¬t(ϕ)\nTherefore EL is at least as expressive as PLKw. But PLKw is not at least as expressive as EL: even the simplest EL formula Kip does not have an equivalent PLKw correspondent. The pointed\nmodels (M, s) and (N , t) below, which are distinguished by Kip, cannot be distinguished by a PLKw formula.\nM : s : p // p\nN : t : p // ¬p\nNote that M and N are serial, transitive, and Euclidean. By induction we prove that M, s and N , t are modally equivalent in PLKw. The non-trivial case is ϕ = Kwiψ. Note that s and t can only see one point. Therefore, M, s Kwiψ and N , t Kwiψ, so also, as required, M, s Kwiψ iff N , t Kwiψ.\nProposition 7. PLKw is less expressive than EL on the class of B-models.\nProof. Consider the following B-models (M′, s′) and (N ′, t′). Again, they are distinguished by Kip, but are modally equivalent in PLKw (by a similar argument as in Prop. 6).\nM′ : s′ : p // poo N ′ : t′ : p // ¬poo\nHowever, on the class of T -models, PLKw and EL are equally expressive.\nProposition 8. PLKw and EL are equally expressive on the class of T -models.\nProof. Consider translation t′ : EL → PLKw:\nt′(p) = p t′(¬ϕ) = ¬t′(ϕ) t′(ϕ ∧ ψ) = t′(ϕ) ∧ t′(ψ) t′(Kiϕ) = t′(ϕ) ∧ Kwit′(ϕ)\nThis translation t′ is truth preserving (elementary, by induction on ϕ in t′(ϕ)). This demonstrates that EL PLKw. As we already had PLKw EL, by way of translation t defined in the proof of Proposition 6, we get that EL ≡ PLKw on T .\nThis result applies to any model class contained in T , such as S4 and S5.\nWe close this section on expressivity with a curious observation related to (although not strictly about) expressivity. We now know that knowledge cannot be defined in terms of knowing whether on K, but that knowledge can be defined in terms of knowing whether on T . It is therefore interesting to observe that under slightly stronger conditions, knowledge can still be ‘defined’ (in a different technical sense) in terms of knowing whether on K, namely, given a model, in a world of that model wherein the agent is ignorant about something. Ignorant means ‘not knowing whether’, so this implies that knowledge is definable in a world from where there are at least two accessible worlds.\nProposition 9. Assume that M, s ¬Kwiψ for some ψ. Then: M, s Ki¬ϕ if and only if there exists a χ such that M, s Kwiϕ ∧ Kwi(ϕ → χ) ∧ ¬Kwiχ.\nProof. Suppose that M, s ¬Kwiψ for some ψ. We need to show the equivalence. First, assume there exists χ: M, s Kwiϕ ∧ Kwi(ϕ → χ) ∧ ¬Kwiχ. Suppose towards contradiction that M, s 2 Ki¬ϕ, then there exists t such that s →i t and t ϕ. Moreover, since M, s ¬Kwiχ, it follows for some t1, t2 with s →i t1, s →i t2 and t1 χ, t2 ¬χ. By the fact that s Kwiϕ, s →i t, s →i t1 and t ϕ, we get t1 ϕ, similarly we can get t2 ϕ, and thus t1 ϕ → χ but t2 2 ϕ → χ, contradicting the assumption that M, s Kwi(ϕ → χ), as desired.\nFor the converse, assume M, s Ki¬ϕ. Then for all t such that s →i t : M, t ¬ϕ, thus M, t ϕ → ψ. Therefore M, s Kwiϕ and M, s Kwi(ϕ → ψ). It is clear M, s ¬Kwiψ from the supposition. Then we can conclude that there exists χ: M, s Kwiϕ∧Kwi(ϕ → χ)∧¬Kwiχ.\nIntuitively, we can ‘define’ knowledge (the Ki¬ϕ in the proposition) in a given world s, iff there is some PLKw formula ψ that agent i is ignorant about in s (iff ¬Kwiψ is true in s), in other words, iff for any proposition whatsoever (ψ) there are two accessible worlds from s with different values for it.\nThe property formulated in Prop. 9 is important. It motivates the canonical model construction for knowing whether logic, as we will see in Section 4."}, {"heading": "3.2 Frame correspondence", "text": "Standard modal logic formulas can be used to capture frame properties, e.g., Kp → p corresponds to the reflexivity of frames. It is therefore remarkable that in knowing whether logic there is no such correspondence for most of the basic frame properties. The authors of [vdHL03] already demonstated that reflexivity is undefinable in the language of ignorance (which is equally expressive as PLKw, see Section 7). In this section we extend their result to other frame properties.\nDefinition 10 (Frame definability). Let Φ be a set of PLKw-formulas and F a class of frames. We say that Φ defines F if for all frames F , F is in F if and only if F Φ. In this case we also say Φ defines the property of F. If Φ is a singleton (e.g. ϕ), we usually write F ϕ rather than F {ϕ}. A class of frames (or the corresponding frame property) is definable in PLKw if there is a set of PLKw-formulas that defines it.\nProposition 11. Let F be a partial-functional frame and ϕ ∈ PLKw. Then F |= Kwiϕ.\nProof. Given F = 〈S, {→i| i ∈ I}〉, let V be a valuation on F and s ∈ S. Because s has at most one successor, the semantics of knowing whether gives us that F , V, s |= Kwiϕ. (See also the countermodels used in the proof of Prop. 6.)\nConsequently, we can view Kwiϕ formulas as ⊤ on partial-functional frames. Therefore the only PLKw validities on partial-functional frames are essentially instantiations of tautologies which are the same on partial-functional models. A moment of reflection should confirm:\nCorollary 12. For any partial-functional frames F ,F ′ and any ϕ ∈ PLKw: F |= ϕ iff F ′ |= ϕ.\nProposition 13. The frame properties of seriality, reflexivity, transitivity, symmetry, and Euclidicity are not definable in PLKw.\nProof. Consider the following frames:\nF1 : s1 // t // u F2 : s2\nAll two frames are partial-functional. So we have that, for any Φ ⊆ PLKw: F1 |= Φ iff F2 |= Φ. Now observe that:\n• F2 is reflexive but F1 is not reflexive.\n• F2 is serial but F1 is not serial.\n• F2 is transitive but F1 is not transitive.\n• F2 is symmetric but F1 is not symmetric.\n• F2 is Euclidean but F1 is not Euclidean.\nThe argument now goes as follows. Consider the first item, reflexivity: If Φ were to define reflexivity, then, as F2 is reflexive, we have F2 |= Φ. But as F2 and F1 satisfy the same frame validities, we also have that F1 |= Φ. However, F1 is not reflexive. Therefore such a Φ does not exist. Therefore, reflexivity is not frame definable in knowing whether logic.\nThe argument is similar for the other cases, using the other items in the list above. (Observe that F1 is indeed not Euclidean, because s1 → t and s1 → t, but it is not the case that t → t.)\nAs a consequence of this result, the axiomatizations of knowing whether logics over special frame classes, such as the class of reflexive frames, cannot be shown by the standard method of adding the corresponding frame axioms to the axiomatization of PLKw. This will be addressed in Section 5."}, {"heading": "4 Axiomatization", "text": "In this section we give a complete Hilbert-style proof system for the logic PLKw on the class of all frames."}, {"heading": "4.1 Proof system and soundness", "text": "Definition 14 (Proof system PLKW). The proof system PLKW consists of the following axiom schemas and inference rules.\nTAUT all instances of tautologies KwCon Kwi(χ → ϕ) ∧ Kwi(¬χ → ϕ) → Kwiϕ KwDis Kwiϕ → Kwi(ϕ → ψ) ∨ Kwi(¬ϕ → χ) Kw↔ Kwiϕ ↔ Kwi¬ϕ MP From ϕ and ϕ → ψ infer ψ NECKw From ϕ infer Kwiϕ REKw From ϕ ↔ ψ infer Kwiϕ ↔ Kwiψ\nA derivation is a finite sequence of PLKw formulas such that each formula is either the instantiation of an axiom or the result of applying a inference rule to prior formulas in the sequence. A formula ϕ ∈ PLKw is called derivable, or a theorem, notation ⊢ ϕ, if it occurs in a derivation.\nIntuitively, KwCon means if an agent knows whether a formula is implied not only by some formula but by its negation, then the agent also knows whether the formula holds; KwDis means if an agent knows whether a formula holds, then either the agent knows this formula holds, in which case the agent knows whether its negation implies any formula, or the agent knows it does not hold, in which case the agent knows whether it implies any formula; Kw↔ means knowing whether a formula holds is same as knowing whether the formula does not hold.\nProposition 15. The proof system PLKW is sound with respect to the class of all frames.\nProof. The soundness of PLKW follows immediately from the validity of three crucial axioms. The other axioms and the derivation rules are obviously valid. We prove that:\n1. KwCon is valid: Kwi(χ → ϕ) ∧ Kwi(¬χ → ϕ) → Kwiϕ\n2. KwDis is valid: Kwiϕ → Kwi(ϕ → ψ) ∨ Kwi(¬ϕ → χ)\n3. Kw↔ is valid: Kwiϕ ↔ Kwi¬ϕ\nProof:\n1. Assume towards a contradiction that for some (M, s) such that M, s Kwi(χ → ϕ), M, s Kwi(¬χ → ϕ) but M, s ¬Kwiϕ, then there exist t1, t2 such that s →i t1, s →i t2 and t1 ϕ, t2 ¬ϕ. Clearly, with t1 ϕ we get t1 χ → ϕ and t1 ¬χ → ϕ. Thus from the fact that s Kwi(χ → ϕ), s →i t1, s →i t2 and t1 χ → ϕ we get t2 χ → ϕ. Similarly, by using t1 ¬χ → ϕ we can get t2 ¬χ → ϕ. Now we obtain t2 χ → ϕ and t2 ¬χ → ϕ, therefore t2 ϕ. Contradiction.\n2. Let (M, s) be an arbitrary model. Suppose via contraposition that M, s ¬Kwi(ϕ → ψ) and M, s ¬Kwi(¬ϕ → χ), we only need to show M, s ¬Kwiϕ. By supposition, there exist t1, t2 such that s →i t1, s →i t2 and t1 ϕ → ψ, t2 ¬(ϕ → ψ) and, there exist u1, u2 such that s →i u1, s →i u2 and u1 ¬ϕ → χ, u2 ¬(¬ϕ → χ), respectively. From t2 ¬(ϕ → ψ) and u2 ¬(¬ϕ → χ) it follows t2 ϕ and u2 ¬ϕ respectively. So far we have shown s →i t2, s →i u2 and t2 ϕ, u2 ¬ϕ, therefore we conclude that M, s ¬Kwiϕ, as desired.\n3. This is immediate from the semantics of Kwi.\nProposition 16. Consider the inference rule Substitution of equivalents:\nSub From ϕ ↔ ψ, infer χ[ϕ/p] ↔ χ[ψ/p]\nSubstitution of equivalents is admissible in PLKW.\nProof. By induction on the structure of χ. The non-trivial case is Kwiχ. Suppose ⊢ ϕ ↔ ψ. By inductive hypothesis we have ⊢ χ[ϕ/p] ↔ χ[ψ/p]. Then, using REKw, we get ⊢ Kwi(χ[ϕ/p]) ↔ Kwi(χ[ψ/p]), i.e. ⊢ Kwiχ[ϕ/p] ↔ Kwiχ[ψ/p].\nThe inference rule REKw in the system PLKW is crucial. Consider again the schema\nK Kwi(ϕ → ψ) → (Kwiϕ → Kwiψ)\nWe have already shown in Section 2 that K is invalid. This axiom is typically used to prove Sub, but is lacking in PLKW. Without REKw (see the proof above) Sub is not admissable in PLKW.\nWe will now first derive a PLKW theorem (Proposition 19) that will play an important part in the completeness proof. To structure the derivation we employ two lemmas deriving PLKW theorems.\nLemma 17. ⊢ ( Kwiχ ∧ Kwi(¬χ → ϕ) ∧ ¬Kwiϕ ∧ Kwi(χ → ψ) ) → Kwiψ\nProof.\n(i) Kwi(¬χ → ϕ) ∧ ¬Kwiϕ → ¬Kwi(χ → ϕ) KwCon,TAUT (ii) Kwiχ → Kwi(χ → ϕ) ∨ Kwi(¬χ → ψ) KwDis (iii) Kwi(χ → ψ) ∧ Kwi(¬χ → ψ) → Kwiψ KwCon (iv) (Kwiχ ∧ Kwi(¬χ → ϕ) ∧ ¬Kwiϕ) → Kwi(¬χ → ψ) TAUT, (i), (ii) (v) (Kwiχ ∧ Kwi(¬χ → ϕ) ∧ ¬Kwiϕ ∧ Kwi(χ → ψ)) → Kwiψ TAUT, (iii), (iv)\nLemma 18.\n⊢ ( Kwi(ϕ ∧ ¬ψ → χ) ∧ Kwiψ ∧ Kwi(ψ → δ) ∧ ¬Kwiδ ) → Kwi(ϕ → χ)\nProof.\n(i) (Kwiψ ∧ Kwi(¬ψ → (ϕ → χ)) ∧ ¬Kwi(ϕ → χ) ∧ Kwi(ψ → δ)) → Kwiδ Lemma 17 (ii) (Kwi(¬ψ → (ϕ → χ)) ∧ Kwiψ ∧ Kwi(ψ → δ) ∧ ¬Kwiδ) → Kwi(ϕ → χ) TAUT, (i) (iii) (ϕ ∧ ¬ψ → χ) ↔ (¬ψ → (ϕ → χ)) TAUT (iv) Kwi(ϕ ∧ ¬ψ → χ) ↔ Kwi(¬ψ → (ϕ → χ)) REKw, (iii) (v) (Kwi(ϕ ∧ ¬ψ → χ) ∧ Kwiψ ∧ Kwi(ψ → δ) ∧ ¬Kwiδ) → Kwi(ϕ → χ) Sub, (ii), (iv)\nProposition 19. For all k ≥ 1:\n⊢\n\n\nk ∧\nj=1\nKwiχj ∧ Kwi( k ∧\nj=1\n¬χj → ϕ) ∧ ¬Kwiϕ ∧ k ∧\nj=1\nKwi(χj → ψj)\n  → k ∨\nj=1\nKwiψj\nProof. The proof is by induction on k. The base step k = 1 is clear from Lemma 17. For the inductive step, assume by inductive hypothesis (IH) that the proposition holds for k = m. We now show that:\n⊢\n\n\nm+1 ∧\nj=1\nKwiχj ∧ Kwi( m+1 ∧\nj=1\n¬χj → ϕ) ∧ ¬Kwiϕ ∧ m+1 ∧\nj=1\nKwi(χj → ψj)\n  → m+1 ∨\nj=1\nKwiψj\nThe proof is as follows.\n1 ( ∧m j=1 Kwiχj ∧ Kwi( ∧m\nj=1 ¬χj → ϕ) ∧ ¬Kwiϕ ∧ ∧m\nj=1 Kwi(χj → ψj)) → ∨m\nj=1 Kwiψj IH 2 (Kwi( ∧m j=1 ¬χj ∧ ¬χm+1 → ϕ) ∧ Kwiχm+1 ∧ Kwi(χm+1 → ψm+1)\n∧¬Kwiψm+1) → Kwi( ∧m\nj=1 ¬χj → ϕ) Lemma 18 3 (Kwi( ∧m+1 j=1 ¬χj → ϕ) ∧ Kwiχm+1 ∧ Kwi(χm+1 → ψm+1)\n∧¬Kwiψm+1) → Kwi( ∧m j=1 ¬χj → ϕ) REKw, 2\n4 (Kwi( ∧m+1 j=1 ¬χj → ϕ) ∧ ∧m+1 j=1 Kwiχj ∧ ∧m+1\nj=1 Kwi(χj → ψj) ∧¬Kwiψm+1 ∧ ¬Kwiϕ) → ( ∧m j=1 Kwiχj ∧ Kwi( ∧m j=1 ¬χj → ϕ) ∧¬Kwiϕ ∧ ∧m\nj=1 Kwi(χj → ψj)) 3 5 (Kwi( ∧m+1 j=1 ¬χj → ϕ) ∧ ∧m+1 j=1 Kwiχj\n∧ ∧m+1 j=1 Kwi(χj → ψj) ∧ ¬Kwiψm+1 ∧ ¬Kwiϕ) → ∨m\nj=1 Kwiψj 1, 4 6 (\n∧m+1 j=1 Kwiχj ∧ Kwi( ∧m+1 j=1 ¬χj → ϕ) ∧ ¬Kwiϕ\n∧ ∧m+1 j=1 Kwi(χj → ψj)) → ∨m+1 j=1 Kwiψj 5"}, {"heading": "4.2 Completeness", "text": "We proceed with the completeness of the proof system PLKW. The completeness of the logic is shown via a canonical model construction.\nDefinition 20 (Canonical model). The canonical model Mc of PLKW is the tuple 〈Sc, {→ci | i ∈ I}, V c〉, where:\n• Sc = {s | s is a maximal consistent set of PLKW}.\n• s →ci t iff\n1. there exists χ such that ¬Kwiχ ∈ s and\n2. for all ϕ and ψ: Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ¬Kwiψ ∈ s implies ¬ϕ ∈ t.\n• V c(p) = {s ∈ Sc | p ∈ s}.\nWe observe that every consistent set of PLKW can be extended to a maximal consistent set of PLKW (Lindenbaum Lemma) in the standard way. The binary relations between worlds in the canonical model are special. The definition is inspired by the canonical relation where s →ci t iff for all ϕ: Kiϕ ∈ s implies ϕ ∈ t, and the observation of Proposition 9, the ‘almost definability’ of knowledge. We also use the contrapositive this condition:\nFor every i ∈ I, s →ci t iff (1.) there exists χ such that ¬Kwiχ ∈ s and (2.) for all ϕ and ψ: if ϕ ∈ t then at least one of Kwiϕ, Kwi(ϕ → ψ) and ¬Kwiψ is not in s.\nLemma 21 (Truth Lemma). For any PLKw formula ϕ, Mc, s ϕ iff ϕ ∈ s.\nProof. By induction on ϕ. The only non-trivial case is Kwiϕ. “⇐”: Assume towards contradiction that Kwiϕ ∈ s but M, s ¬Kwiϕ, namely there are t1 and t2 such that s →ci t1 and s → c i t2 and M\nc, t1 ϕ and Mc, t2 ¬ϕ. From Mc, t1 ϕ and Mc, t2 ¬ϕ, and the induction hypothesis, we infer that ϕ ∈ t1 and ¬ϕ ∈ t2, respectively. From s →ci t1 and (1.) we infer that there is a χ1 such that ¬Kwiχ1 ∈ s. From that, the assumption Kwiϕ ∈ s and (2.) follows that Kwi(ϕ → χ1) 6∈ s, i.e., ¬Kwi(ϕ → χ1) ∈ s. Similarly, from s →ci t2 we derive that there is a χ2 such that ¬Kwi(¬ϕ → χ2) ∈ s. From ¬Kwi(ϕ → χ1),¬Kwi(¬ϕ → χ2) ∈ s and Axiom KwDis we now have ¬Kwiϕ ∈ s. Contradiction.\n“⇒”: Assume that Kwiϕ /∈ s. To show that s 2 Kwiϕ, we need to construct two points t1, t2 ∈ Sc\nsuch that s →ci t1, s → c i t2 and ϕ ∈ t1,¬ϕ ∈ t2. First we have to show:\n1. {¬χ | Kwiχ ∧ Kwi(χ → ψ) ∧ ¬Kwiψ ∈ s for some ψ} ∪ {¬ϕ} is consistent.\n2. {¬χ | Kwiχ ∧ Kwi(χ → ψ′) ∧ ¬Kwiψ′ ∈ s for some ψ′} ∪ {ϕ} is consistent.\nWe prove item 1. Suppose the set is inconsistent. Then there exist χ1, · · · , χn and ψ1, · · · , ψn such that ⊢ ¬χ1 ∧ · · · ∧ ¬χn → ϕ and Kwiχk ∧ Kwi(χk → ψk) ∧ ¬Kwiψk ∈ s for all k ∈ [1, n]. From NECKw, we have Kwi(( ∧n k=1 ¬χk) → ϕ) ∈ s. Now since Kwiϕ /∈ s, from the maximal consistency of s we get ¬Kwiϕ ∈ s. Then, from Proposition 19 we infer that ∨n\nk=1 Kwiψk ∈ s. And this contradicts that ¬Kwiψk ∈ s for all k ∈ [1, n].\nFrom item 1, the definition of the canonical relation, and the observation that every consistent set has a maximal consistent extension (Lindenbaum Lemma), we conclude that there exists a t2 ∈ Sc such that s →ci t2 and ¬ϕ ∈ t2. The proof of item 2 is similar to item 1, but we need to use Kw↔, and similarly, from item 2 we derive that there exists a t1 ∈ Sc such that s →ci t1 and ϕ ∈ t1.\nTheorem 22 (Completeness). PLKW is complete with respect to the class K of all frames. That is, for every ϕ ∈ PLKw, ϕ implies ⊢ ϕ.\nProof. Suppose 0 ϕ, then ¬ϕ is PLKW-consistent. By Lindenbaum-Lemma there exists s ∈ Sc such that ¬ϕ ∈ s, and thus Mc, s ¬ϕ by Truth Lemma, therefore 2 ϕ.\nGiven the translation from PLKw to EL (i.e. the translation t in the proof of Proposition 6), and the decidability of EL, the (satisfiability problem of) knowing whether logic is obviously decidable.\nProposition 23 (Decidability of PLKw). The logic PLKw is decidable."}, {"heading": "5 Axiomatization: extensions", "text": "In this section we will give extensions of PLKW w.r.t. various classes of frames, and prove their completeness. Definition 24 shows the extra axiom schemas and corresponding systems, with on the right-hand side in the table the frame classes for which we will demonstrate completeness.\nDefinition 24 (Extensions of PLKW).\nNotation Axiom Schemas Systems Frames KwT Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ϕ → Kwiψ PLKWT = PLKW+ KwT T Kw4 Kwiϕ → Kwi(Kwiϕ ∨ ψ) PLKW4 = PLKW+ Kw4 4 Kw5 ¬Kwiϕ → Kwi(¬Kwiϕ ∨ ψ) PLKW5 = PLKW+ Kw5 5 wKw4 Kwiϕ → KwiKwiϕ PLKWS4 = PLKW+ KwT+ wKw4 S4 wKw5 ¬Kwiϕ → Kwi¬Kwiϕ PLKWS5 = PLKW+ KwT+ wKw5 S5\nProposition 25.\n• KwT is valid on the class of all T -frames;\n• Kw4 is valid on the class of all 4-frames;\n• Kw5 is valid on the class of all 5-frames.\nProof.\n• Given any M = 〈S, {→i| i ∈ I}, V 〉 based on a reflexive frame and an s ∈ S, suppose M, s Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ϕ. Towards a contradiction assume M, s 2 Kwiψ, then there exist t, t′ such that s →i t, s →i t′ and t ψ, t′ ¬ψ. From the reflexivity of s it follows that s →i s, and thus t ϕ, t′ ϕ by the facts that s Kwiϕ ∧ ϕ, s →i t, s →i t′. Then it is easy to get t ϕ → ψ but t′ 2 ϕ → ψ, which contradicts the supposition s Kwi(ϕ → ψ).\n• Given any M = 〈S, {→i| i ∈ I}, V 〉 based on a transitive frame and an s ∈ S, suppose that M, s Kwiϕ. Towards a contradiction assume M, s 2 Kwi(Kwiϕ∨ψ) for some ψ, then there exist t, t′ such that s →i t, s →i t′ and t Kwiϕ ∨ ψ, t′ ¬Kwiϕ ∧ ¬ψ. From t′ ¬Kwiϕ it follows that for some u, u′ such that t′ →i u, t′ →i u′ and u ϕ, u′ ¬ϕ. From transitivity it follows that s →i u, s →i u′ due to the facts that s →i t′, t′ →i u and t′ →i u′. Therefore s 2 Kwiϕ, contradicting the assumption.\n• Given any M = 〈S, {→i| i ∈ I}, V 〉 based on an Euclidean frame and an s ∈ S, suppose that M, s ¬Kwiϕ. Towards a contradiction assume M, s 2 Kwi(¬Kwiϕ ∨ ψ). Then there exist t, t′ such that s →i t, s →i t′ and t ¬Kwiϕ ∨ ψ, t′ Kwiϕ ∧ ¬ψ. Moreover, it follows that for some u, u′ such that s →i u, s →i u′ and u ϕ, u′ ¬ϕ from the supposition. Since M is Euclidean, t′ →i u and t′ →i u′ based on the facts that s →i t′, s →i u, s →i u′. Therefore t′ 2 Kwiϕ because u ϕ, u′ ¬ϕ, contradicting t′ Kwiϕ.\nTo prove the soundness of the novel proof systems we only need to refer to the soundness of the axioms KwT, Kw4, and Kw5, as demonstrated in Proposition 25. Before we proceed to demonstrate the completeness of these systems, let us first give some intuitions and motivation to explain the form of the axioms. The reader might have expected a more familiar connection between frame classes and axioms instead:\n• For reflexive frames: why not Kwiϕ → ϕ instead of Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ϕ → Kwiψ?\n• For transitive frames: why not Kwiϕ → KwiKwiϕ instead of Kwiϕ → Kwi(Kwiϕ ∨ ψ)?\n• For Euclidean frames: why not ¬Kwiϕ → Kwi¬Kwiϕ instead of ¬Kwiϕ → Kwi(¬Kwiϕ∨ψ)?\nFirst, we recall the reader that none of these frame classes are definable by knowing whether formulas (Prop. 13). So, the axioms in the proof systems defined above fulfil a different role, there is no correspondence in the standard modal logical sense. Second, the three ‘familiar’ formula schemas tentatively stipulated above could of course still be valid. But are they? Sometimes yes, at other times no. Concerning Kwiϕ → ϕ: this is of course not valid in knowing whether logic (you may know whether p because you know that p is false). Further, trying to obtain an interesting validity by translating axiom Kiϕ → ϕ from epistemic logic into PLKw (according to the translation defined in Prop. 8) does not lead anywhere: we get ϕ∧Kwiϕ → ϕ, a tautology. Concerning Kwiϕ → KwiKwiϕ: this is valid on transitive frames. It is also derivable in the proof system PLKW4 defined above: it is essentially an instantiation of axiom Kw4 for ψ = ⊥.2 But just this principle wKw4 on top of PLKW was not enough to obtain completeness (Prop. 27 below), we do need the stronger version Kw4. However, in the presence of KwT, wKw4 is sufficient to demonstrate completeness for PLKWS4 (Prop. 35), since we can actually derive Kw4 in the system based on wKw4 and KwT (Prop. 26). A similar story goes for wKw5 and Kw5: PLKW+wKw5 is not complete w.r.t. Euclidean frames but PLKWS5 = PLKW+ KwT+ wKw5 is complete w.r.t. S5-frames (Prop. 28 and Prop. 36).\nThe following proposition says that Kw4 and Kw5 are derivable in PLKWS4 and PLKWS5 respectively, which are crucial in the proofs of Theorem 35 and Theorem 36, respectively.\nProposition 26. 1. ⊢PLKWS4 Kwiϕ → Kwi(Kwiϕ ∨ ψ)\n2. ⊢PLKWS5 ¬Kwiϕ → Kwi(¬Kwiϕ ∨ ψ)\n2Note that Kwiϕ ∨ ⊥ is equivalent to Kwiϕ and we can apply the substitution of equivalents principle Sub (this is admissable as well in all defined extensions of PLKW).\nProof. 1. The following is a derivation in PLKWS4:\n(i) Kwiϕ → (Kwiϕ ∨ ψ) TAUT (ii) Kwi(Kwiϕ → (Kwiϕ ∨ ψ)) NECKw, (i) (iii) KwiKwiϕ ∧ Kwi(Kwiϕ → (Kwiϕ ∨ ψ)) ∧ Kwiϕ → Kwi(Kwiϕ ∨ ψ) KwT (iv) KwiKwiϕ ∧ Kwiϕ → Kwi(Kwiϕ ∨ ψ) (ii), (iii) (v) Kwiϕ → KwiKwiϕ wKw4 (vi) Kwiϕ → Kwi(Kwiϕ ∨ ψ) (iv), (v)\n2. Similar to 1, by using Axiom wKw5.\nBefore the completeness results, we first show two negative results which demonstrate that only adding wKw4 (resp. wKw5) on top of PLKW is not enough for completeness of PLKw over transitive (resp. Euclidean) frames.\nProposition 27. PLKW+ wKw4 is incomplete with respect to the class of transitive frames.\nProof. Recall that Kwip → Kwi(Kwip ∨ q) is an instance of Kw4 and it is valid on the class of all transitive frames (Prop.25). We will show that this formula is not a theorem of PLKW+ wKw4. For this, we construct a model M such that PLKW+ wKw4 is sound with respect to validity on M (i.e. for any PLKw formula ϕ, ⊢PLKW+wKw4 ϕ implies M ϕ), but M 2 Kwip → Kwi(Kwip ∨ q). Therefore 0PLKW+wKw4 Kwip → Kwi(Kwip ∨ q). Since Kwip → Kwi(Kwip ∨ q) is not provable in PLKW+ wKw4 but it is valid over transitive frames, PLKW+ wKw4 is not complete w.r.t. the class of all transitive frames.\nConsider the following model M (w.l.o.g. let us assume P = {p, q}):\nu1 : p, q t1 : p, q\nu : p,¬q\ngg◆◆◆◆◆◆◆◆◆◆◆◆\nww♣♣♣ ♣♣ ♣♣ ♣♣ ♣♣ ♣\nt : p, q\n88qqqqqqqqqq\n&&▼ ▼▼\n▼▼ ▼▼\n▼▼ ▼\nu2 : ¬p,¬q s : p, q\n99tttttttttt ee▲▲▲▲▲▲▲▲▲▲ t2 : ¬p,¬q\nFirst, remember that all the axioms of PLKW are valid on the class of all frames (Prop.15), thus they are also valid on M. As for the inference rules, their validities on M do not follow immediately from the fact that these rules are valid on the class of all frames. However, it is not hard to check that MP,NECKw and REKw are indeed valid on M, i.e., if the premise is valid on M then the conclusion is also valid on M.\nSecond, wKw4 is valid on M: by the construction of M, it is not hard to show by induction on the structure of ϕ ∈ PLKw that: for any ϕ, t1 ϕ iff u1 ϕ, and t2 ϕ iff u2 ϕ (∗). As none of worlds t1, t2, u1, u2 has any successor, then all of them satisfy KwiKwiϕ, thus also satisfy wKw4 (Kwiϕ → KwiKwiϕ). Also, since t1 and t2 both satisfy Kwiϕ for any ϕ, t KwiKwiϕ for any ϕ too, and thus t Kwiϕ → KwiKwiϕ. Similarly, we can show that u Kwiϕ → KwiKwiϕ for any ϕ. Now from (∗) we can see t Kwiϕ iff u Kwiϕ, which implies s KwiKwiϕ, and thus s Kwiϕ → KwiKwiϕ. In sum, wKw4 is valid on M.\nFinally, it is clear that M, s 2 Kwip → Kwi(Kwip∨q), thus M 2 Kwip → Kwi(Kwip∨q). Since PLKW+ wKw4 is sound w.r.t. M then we have 0PLKW+wKw4 Kwip → Kwi(Kwip ∨ q).\nProposition 28. PLKW+ wKw5 is incomplete with respect to the class of Euclidean frames.\nProof. The strategy is similar to the one in the proof of Theorem 27. Recall that the formula ¬Kwip → Kwi(¬Kwip ∨ q) is valid on the class of all Euclidean frames (Prop. 25). We only need to show that this formula is not a theorem of PLKW + wKw5. For this, we construct a model N such that PLKW+wKw5 is sound with respect to N (i.e., all the theorems of PLKW+wKw5 are valid on N ), but N 2 ¬Kwip → Kwi(¬Kwip ∨ q).\nConsider the following model N (again, let us assume P = {p, q}):\nt : p, q\ns : p, q\n88qqqqqqqqqqq\n&&◆◆ ◆◆\n◆◆ ◆◆\n◆◆ ◆\nu : ¬p,¬q\nAs in the previous proof, the axioms and inference rules of PLKW are valid on N . Now we show wKw5 is valid on N : by the construction of N , neither t nor u has successor, then they both satisfy Kwi¬Kwiϕ, and thus satisfy wKw5 (¬Kwiϕ → Kwi¬Kwiϕ). Also, t Kwiϕ and u Kwiϕ, then s Kwi¬Kwiϕ, and thus s ¬Kwiϕ → Kwi¬Kwiϕ.\nIt is clear that N , s 2 ¬Kwip → Kwi(¬Kwip ∨ q), thus N 2 ¬Kwip → Kwi(¬Kwip ∨ q).\nWe now continue with the completeness proofs for the extended proof systems. We first address the completeness of PLKWT. In the canonical model construction of Def. 20 it is unclear whether the canonical relation is reflexive. To ensure that the relations are reflexive, we take the reflexive closure of the canonical relation.\nDefinition 29 (Canonical model of PLKWT). The canonical model Mc of PLKWT is the same as Mc in Def. 20, except that Sc consists of all maximal consistent sets of PLKWT, and that →ci is the reflexive closure of the canonical relation defined in Def. 20.\nAs before, we use an equivalent definition of the canonical relation: s →ci t iff s = t or (there exists a χ such that ¬Kwiχ ∈ s, and for all ϕ and ψ: ϕ ∈ t implies that at least one of Kwiϕ, Kwi(ϕ → ψ) and ¬Kwiψ is not in s).\nLemma 30 (Truth Lemma for PLKWT). For any PLKw formula ϕ, Mc, s ϕ iff ϕ ∈ s.\nProof. By induction on ϕ. We consider the non-trivial case for Kwiϕ. Left-to-right: This is similar to the corresponding proof in Lemma 21. Observe that all pairs in the canonical relation in Def. 20 are also in the relation →ci from Def. 29. Right-to-left: Assume towards contradiction that Kwiϕ ∈ s but Mc, s ¬Kwiϕ, namely there are distinct states t1 and t2 such that s →ci t1 and s → c i t2 and M, t1 ϕ and M, t2 ¬ϕ. By induction hypothesis, ϕ ∈ t1 and ¬ϕ ∈ t2. As →ci is reflexive, we need to consider two cases (s = t1 and s = t2 is impossible, because t1 6= t2):\n• s 6= t1 and s 6= t2. Then the proof is same as the corresponding one in Lemma 21. And finally we can get a contradiction.\n• s = t1 or s = t2. We may as well consider the case s = t1 and s 6= t2. Since ¬ϕ ∈ t2, Kwiϕ ∈ s, and s →ci t2, by the equivalent definition of →c, there exists χ such that ¬Kwiχ ∈ s and ¬Kwi(¬ϕ → χ) ∈ s. By ϕ ∈ s and Kwiϕ ∈ s and Axiom KwT, we get Kwi(ϕ → χ) → Kwiχ ∈ s. Since ¬Kwiχ ∈ s, ¬Kwi(ϕ → χ) ∈ s. Now ¬Kwi(¬ϕ → χ) ∈ s and ¬Kwi(ϕ → χ) ∈ s, thus by Axiom KwDis we conclude that ¬Kwiϕ ∈ s. Contradiction.\nBased on the above lemma, it is routine to show the following.\nTheorem 31. PLKWT is complete with respect to the class of all T -frames.\nNow let us look at the completeness for PLKW4 and PLKW5. In these cases we do not need to revise the canonical relations.\nTheorem 32. PLKW4 is complete with respect to the class of all 4-frames.\nProof. Define Mc as in Def. 20 w.r.t. PLKW4. We only need to show that →ci is transitive. Given s, t, u ∈ Sc. Assume that s →ci t and t → c i u. From s → c i t it follows that there exist χ such that ¬Kwiχ ∈ s. To show s →ci u, by the definition of the canonical relation, we need to prove that for all ϕ and ψ: Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ¬Kwiψ ∈ s implies ¬ϕ ∈ u. From now on, let us fix two formulas ϕ and ψ such that Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ¬Kwiψ ∈ s. We need to show ¬ϕ ∈ u. From t →ci u it follows that there is a χ\n′ such that ¬Kwiχ′ ∈ t. Now according to the definition of →ci again, if we can show that Kwiϕ ∧ Kwi(ϕ → χ\n′) ∈ t, then by t →ci u, we have ¬ϕ ∈ u. We first show that Kwiϕ ∈ t: As Kwiϕ ∈ s, first, by wKw4 and Kw↔ we get Kwi¬Kwiϕ ∈ s; second, by Axiom Kw4 we get Kwi(Kwiϕ ∨ ψ) ∈ s, i.e. Kwi(¬Kwiϕ → ψ) ∈ s. Now we obtain Kwi¬Kwiϕ ∈ s, Kwi(¬Kwiϕ → ψ) ∈ s, and ¬Kwiψ ∈ s. By s →ci t we have Kwiϕ ∈ t.\nWe now show that Kwi(ϕ → χ′) ∈ t: Since Kwi(ϕ → ψ) ∧ ¬Kwiψ ∈ s, it follows from Axiom KwCon that ¬Kwi(¬ϕ → ψ) ∈ s. Since Kwiϕ ∈ s, Kwi(ϕ → χ′) ∨ Kwi(¬ϕ → ψ) ∈ s by KwDis, thus Kwi(ϕ → χ′) ∈ s. Using wKw4 and Kw↔, we get Kwi¬Kwi(ϕ → χ′) ∈ s; with Axiom Kw4, we get Kwi(Kwi(ϕ → χ′) ∨ ψ) ∈ s, i.e. Kwi(¬Kwi(ϕ → χ′) → ψ) ∈ s. Now Kwi¬Kwi(ϕ → χ′) ∧ Kwi(¬Kwi(ϕ → χ′) → ψ) ∧ ¬Kwiψ ∈ s. From s →ci t we conclude that Kwi(ϕ → χ′) ∈ t, as desired.\nTheorem 33. PLKW5 is complete with respect to the class of all 5-frames.\nProof. Define Mc as in Def. 20 w.r.t. PLKW5. We only need to show that →ci is Euclidean. Let s, t, u ∈ Sc be given, and assume s →ci t and s → c i u. We then need to show that t → c i u, that is to say:\n• There exists a χ such that ¬Kwiχ ∈ t (†)\n• For all ϕ and ψ: Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ¬Kwiψ ∈ t implies ¬ϕ ∈ u. (‡)\n(†): from the assumption s →ci t it follows that there exists χ1 such that ¬Kwiχ1 ∈ s. In the following we prove ¬Kwiχ1 ∈ t. Using s →ci t again, if we can show KwiKwiχ1 ∧ Kwi(Kwiχ1 → χ1) ∧ ¬Kwiχ1 ∈ s then we are done. By ¬Kwiχ1 ∈ s, wKw5 and Kw↔, we have KwiKwiχ1 ∈ s. Using ¬Kwiχ1 ∈ s again and ⊢ ¬Kwiχ1 → Kwi(¬Kwiχ1 ∨ χ1) (an instance of Axiom Kw5), we get Kwi(¬Kwiχ1 ∨ χ1) ∈ s, and thus Kwi(Kwiχ1 → χ1) ∈ s from TAUT and REKw. Hence KwiKwiχ1 ∧ Kwi(Kwiχ1 → χ1) ∧ ¬Kwiχ1 ∈ s, and therefore ¬Kwiχ1 ∈ t by s →ci t.\n(‡): Now fixing two formulas ϕ,ψ such that Kwiϕ∧Kwi(ϕ → ψ)∧¬Kwiψ ∈ t, we need to show ¬ϕ ∈ u. By the similar strategy as in the proof of Thm. 32, if we can prove Kwiϕ∧Kwi(ϕ → χ1) ∈ s, then by ¬Kwiχ1 ∈ s and s →ci u, we get ¬ϕ ∈ u.\nWe first show Kwiϕ ∈ s: if not, i.e. ¬Kwiϕ ∈ s, then first, by wKw5 and Kw↔ we get KwiKwiϕ ∈ s; second, by Axiom Kw5 we get Kwi(¬Kwiϕ ∨ χ1) ∈ s, i.e. Kwi(Kwiϕ → χ1) ∈ s. Remember that ¬Kwiχ1 ∈ s, thus we have shown KwiKwiϕ ∧ Kwi(Kwiϕ → χ1) ∧ ¬Kwiχ1 ∈ s. Then, by s →ci t we get ¬Kwiϕ ∈ t, a contradiction.\nWe now show Kwi(ϕ → χ1) ∈ s: if not, i.e. ¬Kwi(ϕ → χ1) ∈ s, then first, by wKw5 and Kw↔ we get KwiKwi(ϕ → χ1) ∈ s; second, by Axiom Kw5 we get Kwi(¬Kwi(ϕ → χ1) ∨ χ1) ∈ s, i.e. Kwi(Kwi(ϕ → χ1) → χ1) ∈ s. Now KwiKwi(ϕ → χ1)∧Kwi(Kwi(ϕ → χ1) → χ1)∧¬Kwiχ1 ∈ s, then by s →ci t we get ¬Kwi(ϕ → χ1) ∈ t. Moreover, by supposition Kwi(ϕ → ψ)∧¬Kwiψ ∈ t and Axiom KwCon we derive ¬Kwi(¬ϕ → ψ) ∈ t. Then from ¬Kwi(ϕ → χ1) ∧ ¬Kwi(¬ϕ → ψ) ∈ t and Axiom KwDis it follows that ¬Kwiϕ ∈ t, contradiction.\nCorollary 34. PLKW45 is complete with respect to the class of all 45-frames.\nProof. This follows directly from Thm. 32 and Thm. 33. The canonical model w.r.t. PLKW45 is both transitive and Euclidean.\nTheorem 35. PLKWS4 is complete with respect to the class of all S4-frames.\nProof. Define Mc as Def. 29 w.r.t. PLKWS4. Given Thm. 31, we only need to show that →ci is transitive. Now given s, t, u ∈ Sc, and assume s →ci t and t → c i u, we need to show s → c i u. If s = t or t = u or s = u, then by the assumption and the fact that →ci is reflexive, we get s → c i u. Thus we consider the case s 6= t, t 6= u and s 6= u. The proof for this case is the same as Thm. 32, as we can use Kw4 due to Prop. 26.\nTheorem 36. PLKWS5 is complete with respect to the class of all S5-frames.\nProof. Define Mc as Def. 29 w.r.t. PLKWS5. Given Thm. 31, we only need to show that →ci is Euclidean. Now given s, t, u ∈ Sc, and assume s →ci t and s → c i u, we need to show t → c i u. If s 6= t, t 6= u and s 6= u, then the proof is the same as in Thm. 33, as we can use Kw5 due to Prop. 26. If s = t or t = u, then by the assumption and the fact that →ci is reflexive, we get t → c i u. If s = u and t 6= u, we need to show t →ci u. This can be proved by using Axiom KwT instead of the assumption that s →ci u in the corresponding proof of Thm. 33."}, {"heading": "6 Knowing whether logic with announcements", "text": "In the muddy children puzzle, children learn their status by repeating the announcement “nobody knows whether he or she is muddy.” In this section we add public announcement modalities to knowing whether logic. We will first give the language and its semantics, and then propose an axiomatization that can be shown to be complete because all formulas with announcements are provably equivalent to formulas without announcement (the proof system defines a rewrite procedure).\nDefinition 37 (Language PLKwA). The language of PLKwA is obtained by adding an inductive clause [ϕ]ϕ to the construction of the language PLKw (see Def. 1).\nThe formula [ϕ]ψ says that “after public announcement of ϕ, ψ holds.”\nDefinition 38. Let M = 〈S, {→′i| i ∈ I}, V 〉 be a model and ϕ,ψ ∈ PLKwA. The semantics of public announcement is as follows."}, {"heading": "M, s [ϕ]ψ ⇔ M, s ϕ implies M|ϕ, s ψ", "text": "where M|ϕ = 〈S′, {→′i| i ∈ I}, V ′〉 is such that S′ = {s ∈ S | M, s ϕ}, →′i = →i ∩ (S ′ × S′), and V ′(p) = V (p) ∩ S′.\nUnlike PLKw, the logic PLKwA is not closed under uniform substitution. For instance, p → [q]p is valid, but ¬Kwiq → [q]¬Kwiq is not valid, as demonstrated by the following example, wherein M, s 6|= ¬Kwiq → [q]¬Kwiq.\nq\nM : s : q\n99sssssssssss\n%%❑ ❑❑\n❑❑ ❑❑\n❑❑ ❑\n=⇒!q M ′ : s : q // q\n¬q\nThis is the reason that the proof system below must contain formula variables (schematic formulas) instead of propositional variables, and also for that reason we have presented the proof system PLKW in the same way.\nDefinition 39 (Proof system PLKWA). The proof system PLKWA is the extension of PLKW (Def. 14) with the following reduction axioms for announcements.\n!ATOM [ϕ]p ↔ (ϕ → p) !NEG [ϕ]¬ψ ↔ (ϕ → ¬[ϕ]ψ) !COM [ϕ](ψ ∧ χ) ↔ ([ϕ]ψ ∧ [ϕ]χ) !! [ϕ][ψ]χ ↔ [ϕ ∧ [ϕ]ψ]χ !Kw [ϕ]Kwiψ ↔ (ϕ → (Kwi[ϕ]ψ ∨ Kwi[ϕ]¬ψ))\nProposition 40 (Soundness). PLKWA is sound with respect to the class of all frames.\nProof. We only consider the non-trivial axiom schema !Kw. Left-to-right: Given any model M = 〈S, {→i| i ∈ I}, V 〉 based on a frame and s ∈ S, assume that M, s [ϕ]Kwiψ. We now need to show that M, s ϕ → (Kwi[ϕ]ψ ∨ Kwi[ϕ]¬ψ). For this, suppose M, s ϕ, to show M, s Kwi[ϕ]ψ ∨ Kwi[ϕ]¬ψ. By reductio ad absurdum we suppose M, s 2 Kwi[ϕ]ψ ∨ Kwi[ϕ]¬ψ. Then M, s 2 Kwi[ϕ]ψ and M, s 2 Kwi[ϕ]¬ψ. That is to say, there exist t, t′ ∈ S such that s →i t, s →i t′ and t [ϕ]ψ, t′ ¬[ϕ]ψ and, there exist u, u′ ∈ S such that s →i u, s →i u′ and u [ϕ]¬ψ, u′ ¬[ϕ]¬ψ. It follows that M, t′ ϕ and M|ϕ, t′ ¬ψ from t′ ¬[ϕ]ψ, and M, u′ ϕ and M|ϕ, u′ ψ from u′ ¬[ϕ]¬ψ, where M|ϕ is defined as Definition 38. Moreover, we have s →′i t ′, s →′i u ′ in M|ϕ because M, s ϕ,M, t′ ϕ,M, u′ ϕ and s →i t′, s →i u′. Then M|ϕ, s 2 Kwiψ, contradicting the assumption M, s [ϕ]Kwiψ and M, s ϕ.\nRight-to-left: Assume M, s ϕ. First consider the case that M, s Kwi[ϕ]ψ. Then, either for all t with s →i t we have M, t [ϕ]ψ or for all t with s →i t we have M, t ¬[ϕ]ψ. In the first case, with M, s ϕ, we get for all t with s →′i t, M|ϕ, t ψ. In the second case, with M, s ϕ, we get for all t with s →′i t, M|ϕ, t ¬ψ. In either subcase we both get M|ϕ, s Kwiψ. Now consider the case that M, s Kwi[ϕ]¬ψ. Similarly, in this case we can also get M|ϕ, s Kwiψ. Therefore we can conclude that M, s [ϕ]Kwiψ.\nThe logic PLKwA is equally expressive as knowing whether logic, as the axiomatization induces a rewrite procedure. By defining a suitable complexity, we can rewrite every formula in PLKwA as a logically equivalent formula of PLKw of lower complexity, and thus the completeness for PLKWA follows from the completenes of PLKW (see [vDvdHK07, WC13] for this reduction technique).\nTheorem 41 (Completeness of PLKWA). For every ϕ ∈ PLKwA, ϕ implies ⊢ ϕ.\nAs axiomatization PLKWA gives a translation of PLKwA into PLKw, and PLKw is decidable (Prop. 23), the logic of knowing whether with announcements is also decidable.\nProposition 42. PLKwA is decidable.\nWe can also consider the logic of knowing whether with announcement on other frame classes, where our main interest is the class of S5 frames. The expressivity of knowing whether logics for other frame classes also does not change by adding the announcement operator, as the reduction axioms and rules still allow every formula to be rewritten to an equivalent expression without announcements (so, a fortiori, this also holds for theorems of those logics).\nTheorem 43. Consider the proof system PLKWAS5 that extends PLKWA with KwT and wKw5. PLKWAS5 is complete with respect to the class of S5-frames."}, {"heading": "7 Comparison with the literature", "text": "In [vdHL03, vdHL04], the authors give a complete axiomatization of a logic of ignorance with primitive modal construct Iϕ, for ‘the agent is ignorant about ϕ’. If an agent is ignorant about ϕ, she does not know whether ϕ, so Iϕ is definable as ¬Kwϕ. Their axiomatization Ig is shown in Def. 44, wherein we have replaced I by ¬Kw. It is different from ours. Now it is of course a matter of taste whether one prefers the system PLKW over PLKw (page 7) or the one below, but we tend to find ours simpler, e.g. with respect to the axioms I3 and I4 below.\nDefinition 44 (Axiomatization Ig [vdHL03, vdHL04]).\nI0 All instances of propositional tautologies I1 ¬Kwiϕ ↔ ¬Kwi¬ϕ I2 ¬Kwi(ϕ ∧ ψ) → ¬Kwiϕ ∨ ¬Kwiψ I3 (Kwiϕ ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) ∧ ¬Kwi(χ2 ∧ (ϕ → ψ))) → Kwiψ ∧ ¬Kwi(χ1 ∧ ψ) I4 Kwiψ ∧ ¬Kwiχ → ¬Kwi(χ ∧ ψ) ∨ ¬Kwi(χ ∧ ¬ψ) RI From ϕ infer Kwiϕ ∧ (¬Kwiχ → ¬Kwi(χ ∧ ϕ)) MP Modus Ponens Sub Substitution of equivalents\nSince both systems are complete, their axioms and inference rules are derivable in our system PLKW, and we show precisely how to do it: i.e., we will derive in PLKW axioms I2, I3, and I4, and the rules RI and Sub. This lengthy exercise is reported in Appendix A. PLKW can also be derived from Ig due to the completeness of Ig.\nProposition 45. All the axioms of Ig are derivable in PLKW and all the rules of Ig are admissible in PLKW, and vice versa.\nThe proof system Ig is also extended with an axiom G4, which we present in terms of Kw:\n¬Kwiχ → ( Kwiϕ∧¬Kwi(ϕ∧χ) → Kwi(Kwiϕ∧¬Kwi(χ∧ϕ))∧¬Kwi(Kwiϕ∧¬Kwi(ϕ∧χ)∧χ) )\nIt is then claimed that Ig + G4 is a complete axiomatization of the logic of ignorance over transitive frames [vdHL04, Lemma 4.2]. Unfortunately, we think that G4 is invalid, thus the system is not sound. Consider this countermodel M\nt1 : p, q\nt : p, q\n88qqqqqqqqqq\n&&▼ ▼▼\n▼▼ ▼▼\n▼▼ ▼\nM : s : p, q\n77♥♥♥♥♥♥♥♥♥♥♥\n((PP PP\nPP PP\nPP PP\nP\n..\n11 t2 : ¬p, q\nu : ¬p, q\nand the formula\n¬Kwip → (Kwiq ∧ ¬Kwi(q ∧ p) → Kwi(Kwiq ∧ ¬Kwi(p ∧ q)) ∧ ¬Kwi(Kwiq ∧ ¬Kwi(q ∧ p) ∧ p))\nObserve s ¬Kwip and s Kwiq ∧ ¬Kwi(q ∧ p). Then, note that s 6 Kwi(Kwiq ∧ ¬Kwi(p ∧ q)) (take u and t as two witnesses), thus s 6 Kwi(Kwiq∧¬Kwi(p∧ q))∧¬Kwi(Kwiq∧¬Kwi(q∧p)∧p). Therefore, this formula is false in state s of this model M, which invalidates G4.3\nIn this paper, we advanced the research beyond [vdHL04] by proving expressivity results and more undefinability results. And more importantly, apart from correctly axiomatizing knowing whether logic over transitive frames (the system PLKW4), we also axiomatized PLKw on various other frame classes, which was considered hard in [vdHL04]. Further, we extended knowing whether logic with public announcements, and gave a complete axiomatization for that extension.\nAnother recent work on a logic of ignorance is [Ste08]. The author gives a topological semantics for the logic of ignorance and completely axiomatizes it by the following proof system LB (we have replaced in [Ste08] by Kw):\nDefinition 46 (Axiomatization LB).\nTAUT All instances of propositional tautologies N Kwi⊤ ↔ ⊤ Z Kwiϕ ↔ Kwi¬ϕ R Kwiϕ ∧ Kwiψ → Kwi(ϕ ∧ ψ) WM From Kwiϕ ∧ ϕ → ψ infer Kwiϕ ∧ ϕ → Kwiψ ∧ ψ MP Modus Ponens Sub Substitution of equivalents\nThis proof system is equivalent to our system PLKWS4 for PLKw over S4-frames in the following sense.\n3Confirmed by the authors of [vdHL04] by personal communication.\nProposition 47. All the axioms of LB are derivable in PLKWS4 and all the rules of LB are admissible in PLKWS4, and vise versa.\nAppendix B contains the proof. Unlike Proposition 45, Proposition 47 cannot be obtained using the completeness of both systems, since the semantics of the two logics are different. Compared to PLKWS4, the axioms of LB are simpler, while the rules are more complicated (WM is clearly a complex derivation rule, and in PLKWS4 the rule Sub is admissable instead). It is again a matter of taste which system is preferable. Nevertheless, the above result also shows that the topological semantics in [Ste08] is equivalent to our Kripke semantics over S4-frames, modulo validity."}, {"heading": "8 Conclusions and further research", "text": "We first summarize our contributions.\n• We gave complete axiomatizations of PLKw over the frame classes K,T , 4, 5, 45,S4, and S5.\n• PLKw cannot define the frame classes D,T ,B, 4, and 5.\n• PLKw is less expressive than EL over model classes K,D,B, 4, and 5. It is equally expressive as EL over T (and classes contained in T , such as S4 and S5).\n• We axiomatized the logic of knowing whether with public announcements, PLKwA, and demonstrated that it is equally expressive as PLKw.\n• The axiomatization PLKW for knowing whether logic is equivalent to Ig of [vdHL03], and the axiomatization PLKWS4 for knowing whether logic over transitive frames is equivalent to LB of [Ste08].\nWe continue with ideas on further research.\n• To complete the axiomatization spectrum, we want to axiomatize PLKw over D- and B-frames. We expect similar techniques as in the case of PLKWT to work, while finding the right axioms may be hard.\n• As said, knowing whether seems a natural modality and able to express statements succinctly. To make this intuition concrete, we conjecture that PLKw over reflexive models is exponentially more succinct than EL if there are at least two agents. The computational complexity of knowing whether logics is also left for future work.\n• The comparison with [Ste08] demonstrates that the same logic may be obtained by different semantics based on different models. The undefinability of frame properties suggests that the Kripke semantics may not be the best semantics for knowing whether logic. We intend to investigate neighbourhood semantics and other weaker semantics for PLKw.\n• We consider adding group operators for knowing whether (or ignorance) to the language. There are various options to define such group operators. Is a group G ignorant of ϕ if, when defining the accessibility relation for G as the transitive closure of the union of all relations, both a state where ϕ is true and a state where ϕ is false are group-accessible? Or should all agents consider states possible where ϕ is true and where ϕ is false, and then we ‘simply’ take Kleene-iteration of that? There are yet other ways to define group ignorance, and the notion of group ignorance is under close scrutiny in formal epistemology [Han11, Hen10].\n• We consider adding arbitrary announcement operators [BBvD+08] to knowing whether logic. One can then express, for example, that after any announcement agent i remains ignorant: ¬Kwiϕ. This addition becomes more challenging if one then removes the announcement operators from the logical language and defines the arbitrary announcement by modally definable model restrictions."}, {"heading": "A Comparison with [vdHL03]", "text": "We first derive auxiliary theorems that will be used in the derivations of the axioms and rules of the system Ig.\nLemma 48. ⊢PLKW Kwi(χ ∧ ϕ) ∧ Kwi(¬χ ∧ ϕ) → Kwiϕ.\nProof.\n(i) (χ ∧ ϕ) ↔ ¬(χ → ¬ϕ) TAUT (ii) Kwi(χ ∧ ϕ) ↔ Kwi¬(χ → ¬ϕ) REKw, (i) (iii) Kwi(χ → ¬ϕ) ↔ Kwi¬(χ → ¬ϕ) Kw↔ (iv) Kwi(χ ∧ ϕ) ↔ Kwi(χ → ¬ϕ) Sub, (ii), (iii) (v) (¬χ ∧ ϕ) ↔ ¬(¬χ → ¬ϕ) TAUT (vi) Kwi(¬χ ∧ ϕ) ↔ Kwi(¬χ → ¬ϕ) (v), Similar to (i)− (iv) (vii) Kwi(χ → ¬ϕ) ∧ Kwi(¬χ → ¬ϕ) → Kwi¬ϕ KwCon (viii) Kwi(χ ∧ ϕ) ∧ Kwi(¬χ ∧ ϕ) → Kwi¬ϕ Sub, (vii), (iv), (vi) (ix) Kwiϕ ↔ Kwi¬ϕ Kw↔ (x) Kwi(χ ∧ ϕ) ∧ Kwi(¬χ ∧ ϕ) → Kwiϕ Sub, (viii), (ix)\nLemma 49. ⊢PLKW Kwiϕ → Kwi(ϕ ∧ ψ) ∨ Kwi(¬ϕ ∧ χ)\nProof.\n(i) (ϕ ∧ ψ) ↔ ¬(ϕ → ¬ψ) TAUT (ii) Kwi(ϕ ∧ ψ) ↔ Kwi¬(ϕ → ¬ψ) REKw, (i) (iii) Kwi(ϕ → ¬ψ) ↔ Kwi¬(ϕ → ¬ψ) Kw↔ (iv) Kwi(ϕ ∧ ψ) ↔ Kwi(ϕ → ¬ψ) Sub, (ii), (iii) (v) (¬ϕ ∧ χ) ↔ ¬(¬ϕ → ¬χ) TAUT (vi) Kwi(¬ϕ ∧ χ) ↔ Kwi(¬ϕ → ¬χ) (v), Similar to (i)− (iv) (vii) Kwiϕ → Kwi(ϕ → ¬ψ) ∨ Kwi(¬ϕ → ¬χ) KwDis (viii) Kwiϕ → Kwi(ϕ ∧ ψ) ∨ Kwi(¬ϕ ∧ χ) Sub, (vii), (iv), (vi)\nUsing these lemmas, we now derive I2, I3, I4 and the rules RI, and Sub in PLKW.\nProposition 50. Axiom I2 is derivable in PLKW.\nProof. We derive the equivalent equivalent proposition:\n⊢PLKW Kwiϕ ∧ Kwiψ → Kwi(ϕ ∧ ψ)\n(i) Kwiϕ → Kwi(ϕ ∧ ψ) ∨ Kwi(¬ϕ ∧ ¬(ϕ ∧ ψ)) Lemma 49 (ii) Kwiψ → Kwi(ψ ∧ ϕ) ∨ Kwi(¬ψ ∧ ϕ) Lemma 49 (iii) Kwi(ϕ ∧ ψ) ↔ Kwi(ψ ∧ ϕ) TAUT,REKw (iv) Kwiψ → Kwi(ϕ ∧ ψ) ∨ Kwi(¬ψ ∧ ϕ) Sub, (ii), (iii) (v) (¬ψ ∧ ϕ) ↔ ϕ ∧ ¬(ϕ ∧ ψ) TAUT (vi) Kwi(¬ψ ∧ ϕ) ↔ Kwi(ϕ ∧ ¬(ϕ ∧ ψ)) REKw, (v) (vii) Kwiψ → Kwi(ϕ ∧ ψ) ∨ Kwi(ϕ ∧ ¬(ϕ ∧ ψ)) Sub, (iv), (vi) (viii) Kwi(ϕ ∧ ¬(ϕ ∧ ψ)) ∧ Kwi(¬ϕ ∧ ¬(ϕ ∧ ψ)) → Kwi¬(ϕ ∧ ψ) Lemma 48 (ix) Kwi(ϕ ∧ ψ) ↔ Kwi¬(ϕ ∧ ψ) Kw↔ (x) Kwi(ϕ ∧ ¬(ϕ ∧ ψ)) ∧ Kwi(¬ϕ ∧ ¬(ϕ ∧ ψ)) → Kwi(ϕ ∧ ψ) Sub, (viii), (ix) (xi) Kwiϕ ∧ Kwiψ → Kwi(ϕ ∧ ψ) ∨ (Kwi(ϕ ∧ ¬(ϕ ∧ ψ)) ∧ Kwi(¬ϕ ∧ ¬(ϕ ∧ ψ))) (i), (vii) (xii) Kwiϕ ∧ Kwiψ → Kwi(ϕ ∧ ψ) (x), (xi)\nProposition 51. Axiom I3 is derivable in PLKW.\nProof. First, we prove that ⊢PLKW Kwiϕ ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) → Kwiψ (⋆).\n(i) ¬(χ1 ∧ ϕ) ↔ (ϕ → ¬χ1) TAUT (ii) Kwi¬(χ1 ∧ ϕ) ↔ Kwi(ϕ → ¬χ1) REKw, (i) (iii) Kwi(χ1 ∧ ϕ) ↔ Kwi¬(χ1 ∧ ϕ) Kw↔ (iv) Kwi(χ1 ∧ ϕ) ↔ Kwi(ϕ → ¬χ1) Sub, (ii), (iii) (v) Kwiϕ → Kwi(ϕ → ¬χ1) ∨ Kwi(¬ϕ → (χ1 ∧ ϕ)) KwDis (vi) Kwiϕ ∧ ¬Kwi(ϕ → ¬χ1) → Kwi(¬ϕ → (χ1 ∧ ϕ)) (v) (vii) Kwiϕ ∧ ¬Kwi(χ1 ∧ ϕ) → Kwi(¬ϕ → (χ1 ∧ ϕ)) Sub, (iv), (vi) (viii) Kwiϕ ∧ Kwi(¬ϕ → (χ1 ∧ ϕ)) ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) → Kwiψ Lemma 17 (ix) Kwiϕ ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) → Kwiψ (vii), (viii)\nNext, we prove that\n⊢PLKW Kwiϕ ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) ∧ ¬Kwi(χ2 ∧ (ϕ → ψ)) → ¬Kwi(χ1 ∧ ψ).\n(i) Kwiϕ ∧ Kwiψ → Kwi(ϕ ∧ ψ) I2 (ii) Kwi(ϕ ∧ ψ) ∧ Kwi(χ1 ∧ ψ) → Kwi(ψ ∧ ϕ ∧ χ1) I2 (iii) Kwiϕ ∧ Kwiψ ∧ Kwi(χ1 ∧ ψ) → Kwi(ψ ∧ ϕ ∧ χ1) (i), (ii) (iv) Kwi(ψ ∧ ϕ ∧ χ1) ∧ Kwi(¬ψ ∧ ϕ ∧ χ1) → Kwi(ϕ ∧ χ1) Lemma 48 (v) Kwiϕ ∧ Kwiψ ∧ Kwi(χ1 ∧ ψ) ∧ Kwi(¬ψ ∧ ϕ ∧ χ1) → Kwi(ϕ ∧ χ1) (iii), (iv) (vi) Kwi(ϕ → ψ) → Kwi((ϕ → ψ) ∧ χ2) ∨ Kwi(¬(ϕ → ψ) ∧ χ1) Lemma 49 (vii) Kwi(ϕ → ψ) ∧ ¬Kwi((ϕ → ψ) ∧ χ2) → Kwi(¬(ϕ → ψ) ∧ χ1) (vi) (viii) Kwi(¬ψ ∧ ϕ ∧ χ1) ↔ Kwi(¬(ϕ → ψ) ∧ χ1) TAUT,REKw (ix) Kwi(ϕ → ψ) ∧ ¬Kwi((ϕ → ψ) ∧ χ2) → Kwi(¬ψ ∧ ϕ ∧ χ1) (vii), (viii) (x) Kwiϕ ∧ Kwiψ ∧ Kwi(χ1 ∧ ψ) ∧ Kwi(ϕ → ψ) ∧ ¬Kwi((ϕ → ψ) ∧ χ2) → Kwi(ϕ ∧ χ1) (v), (ix) (xi) Kwiϕ ∧ Kwiψ ∧ ¬Kwi(ϕ ∧ χ1) ∧ Kwi(ϕ → ψ) ∧ ¬Kwi((ϕ → ψ) ∧ χ2) → ¬Kwi(χ1 ∧ ψ) (x) (xii) Kwi(χ1 ∧ ϕ) ↔ Kwi(ϕ ∧ χ1) TAUT,REKw (xiii) Kwi(χ2 ∧ (ϕ → ψ)) ↔ Kwi((ϕ → ψ) ∧ χ2) TAUT,REKw (xiv) Kwiϕ ∧ Kwiψ ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) ∧ ¬Kwi(χ2 ∧ (ϕ → ψ)) → ¬Kwi(χ1 ∧ ψ) (xi), (xii), (xiii) (xv) Kwiϕ ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) → Kwiψ (⋆) (xvi) Kwiϕ ∧ ¬Kwi(χ1 ∧ ϕ) ∧ Kwi(ϕ → ψ) ∧ ¬Kwi(χ2 ∧ (ϕ → ψ))\n→ ¬Kwi(χ1 ∧ ψ) (xiv), (xv)\nAxiom I3 now follows from the two derived theorems by propositional reasoning.\nProposition 52. Axiom I4 is derivable in PLKW.\nProof. A stronger result\n⊢PLKW ¬Kwiχ → ¬Kwi(χ ∧ ψ) ∨ ¬Kwi(χ ∧ ¬ψ)\nfollows directly from Prop. 48.\nProposition 53. Inference rule RI is admissible in PLKW.\nProof. Suppose that ⊢ ϕ. By NECKw we get ⊢ Kwiϕ. We only need to show ⊢ ¬Kwiχ → ¬Kwi(χ ∧ ϕ), equivalently, ⊢ Kwi(χ ∧ ϕ) → Kwiχ. From the supposition ⊢ ϕ, it follows ⊢ ¬ϕ → ¬χ. Then using NECKw again, we get ⊢ Kwi(¬ϕ → ¬χ). By Axiom KwCon, we have ⊢ Kwi(¬ϕ → ¬χ) ∧ Kwi(ϕ → ¬χ) → Kwi¬χ, thus by MP we get ⊢ Kwi(ϕ → ¬χ) → Kwi¬χ. Note ⊢ Kwi(χ ∧ ϕ) ↔ Kwi(ϕ → ¬χ) and ⊢ Kwiχ ↔ Kwi¬χ can follow from Kw↔. Therefore ⊢ Kwi(χ ∧ ϕ) → Kwiχ, as desired.\nProposition 54. Sub is admissible in PLKW.\nProof. Similar to the proof of Prop. 16."}, {"heading": "B Comparison with [Ste08]", "text": "We prove that our PLKWS4 and Steinsvold’s LB are equivalent. We first show that the axioms and rules of the system LB are all derivable or admissible in PLKWS4. We also use that Kwiϕ∧Kwiψ → Kwi(ϕ ∧ ψ) is derivable in PLKW (see Prop. 50).\nProposition 55. N, Z, R are derivable in PLKWS4.\nProof. By TAUT, NECKw, Kw↔ and Prop. 50.\nProposition 56. WM is admissible in PLKWS4.\nProof. Suppose that ⊢ Kwiϕ ∧ ϕ → ψ. From the supposition and NECKw, we have ⊢Kwi(Kwiϕ ∧ ϕ → ψ). By ⊢ Kwi(Kwiϕ ∧ ϕ → ψ) ∧ Kwi(Kwiϕ ∧ ϕ) ∧ (Kwiϕ ∧ ϕ) → Kwiψ (Axiom KwT), we get ⊢ Kwi(Kwiϕ ∧ ϕ) ∧ (Kwiϕ ∧ ϕ) → Kwiψ. Besides, from Axiom wKw4 we infer that ⊢ Kwiϕ → KwiKwiϕ∧Kwiϕ. With Prop. 50 we have ⊢ KwiKwiϕ∧Kwiϕ → Kwi(Kwiϕ∧ϕ). Now we conclude that ⊢ Kwiϕ ∧ ϕ → Kwiψ, as desired.\nNow we will prove that LB can derive PLKWS4. Comparing the two systems, we only need to show that the axioms KwCon, KwDis, KwT, and wKw4, and the rules NECKw and REKw can be derived in LB. In the following derivation by ⊢ we mean ⊢LB.\nLemma 57. If ⊢ Kwiϕ ∧ ϕ → ψ, then ⊢ Kwiϕ ∧ ϕ → Kwiψ.\nProof. This is immediate from the rule WM.\nProposition 58. KwCon is derivable in LB.\nProof.\n(i) ((χ → ϕ) ∧ (¬χ → ϕ)) ↔ ϕ TAUT (ii) Kwi((χ → ϕ) ∧ (¬χ → ϕ)) ↔ Kwiϕ Sub, (i) (iii) Kwi(χ → ϕ) ∧ Kwi(¬χ → ϕ) → Kwi((χ → ϕ) ∧ (¬χ → ϕ)) R (iv) Kwi(χ → ϕ) ∧ Kwi(¬χ → ϕ) → Kwiϕ Sub, (ii), (iii)\nProposition 59. KwDis is derivable in LB.\nProof.\n(i) ϕ → (¬ϕ → χ) TAUT (ii) Kwiϕ ∧ ϕ → (¬ϕ → χ) (i) (iii) Kwiϕ ∧ ϕ → Kwi(¬ϕ → χ) Lemma 57, (ii) (iv) ¬ϕ → (ϕ → ψ) TAUT (v) Kwi¬ϕ ∧ ¬ϕ → Kwi(ϕ → ψ) (iv), Similar to (i)− (iii) (vi) Kwiϕ ∧ ¬ϕ → Kwi(ϕ → ψ) (v),Z (vii) Kwiϕ → Kwi(ϕ → ψ) ∨ Kwi(¬ϕ → χ) (iii), (vi)\nProposition 60. KwT is derivable in LB.\nProof.\n(i) ϕ ∧ (ϕ → ψ) → ψ TAUT (ii) Kwi(ϕ ∧ (ϕ → ψ)) ∧ (ϕ ∧ (ϕ → ψ)) → ψ (i) (iii) Kwi(ϕ ∧ (ϕ → ψ)) ∧ (ϕ ∧ (ϕ → ψ)) → Kwiψ Lemma 57, (ii) (iv) Kwiϕ ∧ Kwi(ϕ → ψ) → Kwi(ϕ ∧ (ϕ → ψ)) R (v) Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ϕ ∧ (ϕ → ψ) → Kwiψ (iii), (iv) (vi) ¬(ϕ → ψ) → ¬ψ TAUT (vii) Kwi¬(ϕ → ψ) ∧ ¬(ϕ → ψ) → Kwi¬ψ (vi), Similar to (i) − (iii) (viii) Kwi(ϕ → ψ) ∧ ¬(ϕ → ψ) → Kwiψ (vii),Z (ix) Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ϕ ∧ ¬(ϕ → ψ) → Kwiψ (viii) (x) Kwiϕ ∧ Kwi(ϕ → ψ) ∧ ϕ → Kwiψ (v), (ix)\nProposition 61. wKw4 is derivable in LB.\nProof. (i) Kwiϕ ∧ ϕ → Kwiϕ TAUT (ii) Kwiϕ ∧ ϕ → KwiKwiϕ Lemma 57, (i) (iii) Kwi¬ϕ ∧ ¬ϕ → Kwi¬ϕ TAUT (iv) Kwi¬ϕ ∧ ¬ϕ → Kwiϕ (iii),Z (v) Kwi¬ϕ ∧ ¬ϕ → KwiKwiϕ Lemma 57, (iv) (vi) Kwiϕ ∧ ¬ϕ → KwiKwiϕ (v),Z (vii) Kwiϕ → KwiKwiϕ (ii), (vi)\nProposition 62. NECKw is admissible in LB.\nProof. Suppose that ⊢ ϕ, we need to show ⊢ Kwiϕ. From the supposition follows that ⊢ ϕ ↔ ⊤, then by Sub we get ⊢ Kwiϕ ↔ Kwi⊤. By N and TAUT, we have ⊢ Kwi⊤, and hence we conclude that ⊢ Kwiϕ.\nProposition 63. REKw is admissible in LB.\nProof. Immediate from Sub."}], "references": [{"title": "Knowing whether A or B", "author": ["M. Aloni", "P. Égré", "T. Jager"], "venue": "Synthese, 190(14):2595– 2621", "citeRegEx": "AEJ13", "shortCiteRegEx": null, "year": 2013}, {"title": "H", "author": ["P. Balbiani", "A. Baltag"], "venue": "van Ditmarsch, A. Herzig, T. Hoshi, and T. De Lima. ‘Knowable’ as ‘known after an announcement’. Review of Symbolic Logic, 1(3):305–334", "citeRegEx": "BBvD08", "shortCiteRegEx": null, "year": 2008}, {"title": "A logic toolbox for modeling knowledge and information in multi-agent systems and social epistemology", "author": ["J.U. Hansen"], "venue": "PhD thesis, Roskilde University", "citeRegEx": "Han11", "shortCiteRegEx": null, "year": 2011}, {"title": "Knowledge transmissibility and pluralistic ignorance: A first stab", "author": ["V.F. Hendricks"], "venue": "Metaphilosophy, 41:279–291", "citeRegEx": "Hen10", "shortCiteRegEx": null, "year": 2010}, {"title": "A survey of gossiping and broadcasting in communication networks", "author": ["S.M. Hedetniemi", "S.T. Hedetniemi", "A.L. Liestman"], "venue": "Networks, 18:319–349", "citeRegEx": "HHL88", "shortCiteRegEx": null, "year": 1988}, {"title": "Knowing whether", "author": ["S. Hart", "A. Heifetz", "D. Samet"], "venue": "knowing that, and the cardinality of state spaces. Journal of Economic Theory, 70(1):249–256", "citeRegEx": "HHS96", "shortCiteRegEx": null, "year": 1996}, {"title": "Universal Partition Structures", "author": ["A. Heifetz", "D. Samet"], "venue": "Working paper (Israel Institute of business research). Tel Aviv University", "citeRegEx": "HS93", "shortCiteRegEx": null, "year": 1993}, {"title": "Cheating husbands and other stories: a case study in knowledge", "author": ["Y.O. Moses", "D. Dolev", "J.Y. Halpern"], "venue": "action, and communication. Distributed Computing, 1(3):167– 176", "citeRegEx": "MDH86", "shortCiteRegEx": null, "year": 1986}, {"title": "Logics of public communications", "author": ["J.A. Plaza"], "venue": "Proc. of the 4th ISMIS, pages 201– 216. Oak Ridge National Laboratory", "citeRegEx": "Pla89", "shortCiteRegEx": null, "year": 1989}, {"title": "Synthese", "author": ["J.A. Plaza. Logics of public communications"], "venue": "158(2):165–179,", "citeRegEx": "Pla07", "shortCiteRegEx": null, "year": 2007}, {"title": "A note on logics of ignorance and borders", "author": ["C. Steinsvold"], "venue": "Notre Dame J. Formal Logic, 49(4):385–392", "citeRegEx": "Ste08", "shortCiteRegEx": null, "year": 2008}, {"title": "Comments to ‘Logics of public communications", "author": ["H. van Ditmarsch"], "venue": "Synthese, 158(2):181–187,", "citeRegEx": "vD07", "shortCiteRegEx": null, "year": 2007}, {"title": "of 2nd AAMAS", "author": ["W. van der Hoek", "A. Lomuscio. Ignore at your peril - towards a logic for ignorance. In Proc"], "venue": "pages 1148–1149. ACM,", "citeRegEx": "vdHL03", "shortCiteRegEx": null, "year": 2003}, {"title": "Electronic Notes in Theoretical Computer Science", "author": ["W. van der Hoek", "A. Lomuscio. A logic for ignorance"], "venue": "85(2)(2):117–133,", "citeRegEx": "vdHL04", "shortCiteRegEx": null, "year": 2004}, {"title": "volume 337 of Synthese Library", "author": ["H. van Ditmarsch", "W. van der Hoek", "B. Kooi. Dynamic Epistemic Logic"], "venue": "Springer,", "citeRegEx": "vDvdHK07", "shortCiteRegEx": null, "year": 2007}, {"title": "On axiomatizations of public announcement logic", "author": ["Y. Wang", "Q. Cao"], "venue": "Synthese,", "citeRegEx": "WC13", "shortCiteRegEx": null, "year": 2013}, {"title": "Knowing that", "author": ["Y. Wang", "J. Fan"], "venue": "knowing what, and public communication: Public announcement logic with Kv operators. In Proc. of 23rd IJCAI, pages 1147–1154", "citeRegEx": "WF13", "shortCiteRegEx": null, "year": 2013}], "referenceMentions": [{"referenceID": 8, "context": "The work entitled ‘Logics of public communication’ by Plaza [Pla89]1 is mainly known as one of the founding publications, if not the founding publication, of public announcement logic.", "startOffset": 60, "endOffset": 67}, {"referenceID": 16, "context": "In [WF13], the authors investigate knowing value operators in depth and give a complete axiomatization of the logic with knowing value and public announcement, where the knowing value modality behaves quite differently from a modality in a normal modal logic, such as the standard knowledge modality.", "startOffset": 3, "endOffset": 9}, {"referenceID": 5, "context": "[HHS96] uses ‘knowing whether’ operator to establish a continuum of knowledge states in a very neat fashion, which demonstrates that ‘knowing whether’ is more convenient to use than ‘knowing that’ in certain contexts, as argued also in [HS93].", "startOffset": 0, "endOffset": 7}, {"referenceID": 6, "context": "[HHS96] uses ‘knowing whether’ operator to establish a continuum of knowledge states in a very neat fashion, which demonstrates that ‘knowing whether’ is more convenient to use than ‘knowing that’ in certain contexts, as argued also in [HS93].", "startOffset": 236, "endOffset": 242}, {"referenceID": 9, "context": "∗Corresponding author Reprinted as [Pla07] with comments by [vD07].", "startOffset": 35, "endOffset": 42}, {"referenceID": 11, "context": "∗Corresponding author Reprinted as [Pla07] with comments by [vD07].", "startOffset": 60, "endOffset": 66}, {"referenceID": 0, "context": "An analysis in inquisitive semantics of such natural expressions is found in [AEJ13].", "startOffset": 77, "endOffset": 84}, {"referenceID": 7, "context": "For another example, consider the Muddy Children Puzzle [MDH86].", "startOffset": 56, "endOffset": 63}, {"referenceID": 4, "context": "Finally, consider gossip protocols [HHL88], wherein processors (or ‘agents’) exchange information by one-to-one communications (‘calls’) wherein they exchange the value of their local state.", "startOffset": 35, "endOffset": 42}, {"referenceID": 12, "context": "The authors of [vdHL03] already demonstated that reflexivity is undefinable in the language of ignorance (which is equally expressive as PLKw, see Section 7).", "startOffset": 15, "endOffset": 23}, {"referenceID": 13, "context": "3 In this paper, we advanced the research beyond [vdHL04] by proving expressivity results and more undefinability results.", "startOffset": 49, "endOffset": 57}, {"referenceID": 13, "context": "And more importantly, apart from correctly axiomatizing knowing whether logic over transitive frames (the system PLKW4), we also axiomatized PLKw on various other frame classes, which was considered hard in [vdHL04].", "startOffset": 207, "endOffset": 215}, {"referenceID": 10, "context": "Another recent work on a logic of ignorance is [Ste08].", "startOffset": 47, "endOffset": 54}, {"referenceID": 10, "context": "The author gives a topological semantics for the logic of ignorance and completely axiomatizes it by the following proof system LB (we have replaced in [Ste08] by Kw):", "startOffset": 152, "endOffset": 159}, {"referenceID": 13, "context": "Confirmed by the authors of [vdHL04] by personal communication.", "startOffset": 28, "endOffset": 36}, {"referenceID": 10, "context": "Nevertheless, the above result also shows that the topological semantics in [Ste08] is equivalent to our Kripke semantics over S4-frames, modulo validity.", "startOffset": 76, "endOffset": 83}, {"referenceID": 12, "context": "• The axiomatization PLKW for knowing whether logic is equivalent to Ig of [vdHL03], and the axiomatization PLKWS4 for knowing whether logic over transitive frames is equivalent to LB of [Ste08].", "startOffset": 75, "endOffset": 83}, {"referenceID": 10, "context": "• The axiomatization PLKW for knowing whether logic is equivalent to Ig of [vdHL03], and the axiomatization PLKWS4 for knowing whether logic over transitive frames is equivalent to LB of [Ste08].", "startOffset": 187, "endOffset": 194}, {"referenceID": 10, "context": "• The comparison with [Ste08] demonstrates that the same logic may be obtained by different semantics based on different models.", "startOffset": 22, "endOffset": 29}, {"referenceID": 1, "context": "• We consider adding arbitrary announcement operators [BBvD08] to knowing whether logic.", "startOffset": 54, "endOffset": 62}], "year": 2013, "abstractText": "Knowing whether a proposition is true means knowing that it is true or knowing that it is false. In this paper, we study logics with a modal operator Kw for knowing whether but without a modal operator K for knowing that. This logic is not a normal modal logic, because we do not have Kw(φ → ψ) → (Kwφ → Kwψ). Knowing whether logic cannot define many common frame properties, and its expressive power is less than that of basic modal logic over classes of models without reflexivity. These features make axiomatizing knowing whether logics non-trivial. We axiomatize knowing whether logic over various frame classes. We also present an extension of knowing whether logic with public announcement operators and we give corresponding reduction axioms for that. We compare our work in detail to two recent similar proposals.", "creator": "LaTeX with hyperref package"}}}