{"id": "1503.02578", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "9-Mar-2015", "title": "Modeling State-Conditional Observation Distribution using Weighted Stereo Samples for Factorial Speech Processing Models", "abstract": "This paper investigates the role of factorial speech processing models in noise-robust automatic speech recognition tasks. Factorial models can embed non-stationary noise models using Markov chains as one of its source chain. The paper proposes a modeling scheme for modeling state-conditional observation distribution of factorial models based on weighted stereo samples. This scheme is an extension to previous single pass retraining for ideal model compensation and here we used it to construct ideal state-conditional observation distributions. Experiments of this paper over the set A of the Aurora 2 dataset shows that by considering noise models with multiple states, system performance can be improved especially in low SNR conditions up to 4% absolute word recognition performance. In addition to its power in accurate representation of state-conditional observation distribution, it has an important advantage over previous methods by providing the opportunity to independently select feature spaces for both source and corrupted features. This opens a new window for seeking better feature spaces appropriate for noise-robust tasks independent from clean speech feature space.", "histories": [["v1", "Mon, 9 Mar 2015 17:40:08 GMT  (731kb)", "http://arxiv.org/abs/1503.02578v1", null], ["v2", "Wed, 5 Oct 2016 12:05:10 GMT  (882kb)", "http://arxiv.org/abs/1503.02578v2", "Updated version of the first submission. Several clarifications are added to previous version. One experiment is added to the experiments, Circuits Syst Signal Process, Apr. 2016"]], "reviews": [], "SUBJECTS": "cs.LG cs.AI cs.SD", "authors": ["mahdi khademian", "mohammad mehdi homayounpour"], "accepted": false, "id": "1503.02578"}, "pdf": {"name": "1503.02578.pdf", "metadata": {"source": "CRF", "title": "Modeling State-Conditional Observation Distribution using Weighted Stereo Samples for Factorial Speech Processing Models", "authors": ["Mahdi Khademian", "Mohammad Mehdi Homayounpour"], "emails": [], "sections": [{"heading": null, "text": "This paper investigates the role of factorial speech processing models in noise-robust automatic speech recognition tasks. Factorial models can embed non-stationary noise models using Markov chains as one of its source chain. The paper proposes a modeling scheme for modeling state-conditional observation distribution of factorial models based on weighted stereo samples. This scheme is an extension to previous single pass retraining for ideal model compensation and here we used it to construct ideal state-conditional observation distributions. Experiments of this paper over the set A of the Aurora 2 dataset shows that by considering noise models with multiple states, system performance can be improved especially in low SNR conditions up to 4% absolute word recognition performance. In addition to its power in accurate representation of state-conditional observation distribution, it has an important advantage over previous methods by providing the opportunity to independently select feature spaces for both source and corrupted features. This opens a new window for seeking better feature spaces appropriate for noise-robust tasks independent from clean speech feature space.\nKeywords: factorial speech processing models, state-conditional observation distribution, stereo samples"}, {"heading": "1. Introduction", "text": "Despite long term efforts and great successes in automatic speech recognition (ASR) systems, rapid degradation of performance in the presence of noise and other competing sources remains the Achilles Heel of these systems [1]. While some feature enhancement and model adaptation techniques loosely use noise source characteristics to increase performance of speech recognition systems, model based methods try to use as much as information they can acquire from noise sources [2]. Such information ranges from static distortion occurred in the extracted features of noisy signals to dynamic information of cyclo-stationary noises.\nFactorial speech processing models [3]–[5] are extension of Hidden Markov Models (HMM) which model audio sources and the way that these sources are combined in a generative manner. They model each of audio sources separately; this can include modeling dynamic changes of audio sources by hidden Markov models. Additionally factorial models, model how these audio sources are combined to produce output or distorted features. Because of this, factorial models can use noise characteristics for improving system performance.\nFrom modeling point of view, factorial models are powerful modeling tools for speech processing applications. They can be used for speech enhancement, noise-robust speech recognition, multi-talker speech recognition, and robust speaker identification. These models perform well in the specific application of multi-talker speech recognition where the sound sources have significant dynamic information and there are two or more competing speakers speaking simultaneously. Recent researches achieve higher performance even than human in the multi-talker speech recognition challenge by use of factorial models of speech processing in some specific conditions [6], [7]. Despite their successes in the mentioned challenge and their modeling power, factorial models are not widely used for real noise-robust speech processing applications [8]; their computational demand for inference and difficulties in representing their central conditional probability distribution (CPD) are the two main reasons for this lack of use [2].\nFigure 1 shows a generic HMM for conventional acoustic modeling in speech recognition and a factorial model for noise robust speech recognition expressed in the Probabilistic Graphical Models (PGM) language. HMM is extended in the two ways for creating factorial model of speech processing. The first one is that factorial models have multiple state chains which are useful for modeling systems with multiple underlying independent processes [9], i.e. two audio sources with their corresponding temporal models (in Figure 1.b 𝑠𝑡 𝑛 and 𝑠𝑡 𝑥 are noise and speech source state variables). The second one is the interaction model, [2]; CPD of the observed signal features conditioned on features of its corresponding sources, 𝑝(𝒚𝑡|𝒙𝑡 , 𝒏𝑡) in Figure 1.b. This CPD in its deterministic form is called mismatch function [10], [11].\nEach of the two extensions imposes its own complexity to the basic HMM during learning and inference. On the one hand, multiple state sequence increases computational complexity of inference (which is also required for learning) to 𝑂(𝑇𝑆𝐾) in which 𝑇 is inference window or lag, 𝐾 is number of underlying chain, and 𝑆 is maximum number of states in the chains [12], [13]. In comparison with standard HMM with 𝑂(𝑇𝑆2) as its required calculations for inference, we see exponential growth of calculations by increasing the number of audio sources.\nOn the other hand, accurate modeling of probabilistic relationship between the observed features and their sources is not always possible in speech recognition applications [2]. Several approximations are used for developing mismatch functions so far. Ignoring phase difference between spectral features of audio sources or use of pseudo inverse of DCT matrix for transforming features from Cepstral domain back to log-spectral domain are two examples of these approximations. Moreover, the interaction model is not directly used in the inference. Inference on factorial models requires State-Conditional Observation Distribution (SCOD); i.e. observed feature distribution conditioned on states of the source chains, 𝑝(𝒚𝑡|𝑠 𝑥, 𝑠𝑛). This distribution is directly calculated by marginalizing-out source features variables (𝒙, 𝒏); i.e. ∬ 𝑝(𝒚, 𝒙, 𝒏|𝑠𝑥, 𝑠𝑛)𝑑𝒙𝑑𝒏. The direct calculation of SCOD causes more challenges in the use of factorial models which necessitates additional approximations. As a result, having more accurate interaction models leads to more approximations in calculation of SCOD and doing exact SCOD calculations forced us to use approximate interaction models.\nThis paper focuses on the second challenge of factorial models by incorporating the idea of single-pass retraining [10], [14] for ideal SCOD modeling to be used in factorial speech processing models. We want to evaluate whether these models are effective against non-stationary noises as good as they are in multi-talker tasks. In addition it presents a modified expectation maximization (EM) algorithm for parametric modeling of this ideal SCOD. Next section briefly reviews previous methods for modeling the SCOD by starting with description of the commonly used environment model and the most useful mismatch function inference especially in speech recognition. Then it shows how the previous VTS based and IDPMC techniques can be used for the SCOD modeling. Finally it presents the way we perform inference in factorial models based on the SCOD models and an extended Viterbi algorithm. The proposed method of SCOD modeling is proposed in section 3; this section first describes the way that combined features are sampled and become weighted and then the extension of the EM algorithm for parametric modeling of SCODs is described. Section 4 describes experiments by providing the block diagram of the proposed method for SCOD modeling and then presents the results; we used the Aurora 2 dataset for this evaluation. Finally section 5 concludes the paper."}, {"heading": "2. Background", "text": "In the model based noise-robust ASR methods, the following relation is considered between speech and noise\nsignals in an assumed environment for generation of distorted speech signals [3], [15]:\n𝑦 = 𝑥 ∗ ℎ + 𝑛 (1)\nwhere 𝑥 and 𝑛 are speech and noise signals and ℎ is the channel model of the speech capturing environment. In the power spectrum domain by short-term discrete Fourier transform we have:\n|𝒚𝑡| 2 = |𝒙𝑡𝒉| 2 + |𝒏𝑡| 2 + 2|𝒙𝑡𝒉||𝒏𝑡| cos(𝝓𝑡) (2)\nin which 𝝓𝑡 is vector of phase difference between frequency bins of 𝒙𝑡𝒉 and 𝒏𝑡 complex vectors. In (2), frequency index is omitted since variables are written in vector form. Additionally, time index will be removed in subsequent expressions for brevity. While (2) provides a mismatch function useful for speech enhancement applications, power\nspectrum is not appropriate for speech recognition. By applying filterbank, taking logarithm and use of truncated DCT\nmatrix, the following interaction model is derived for MFCC features [11]:\n𝑝(𝒚𝑐|𝒙𝑐, 𝒉𝑐 , 𝒏𝑐) = 𝛿 (𝒚𝑐 − 𝐂 𝐥𝐨𝐠 (𝐞𝐱𝐩(𝐂−𝟏(𝒙𝑐 + 𝒉𝑐)) + 𝐞𝐱𝐩(𝐂−𝟏𝒏𝑐) + 𝝐(𝒙𝑐 , 𝒉𝑐 , 𝒏𝑐))) (3)\nwhere its residual equals to:\n𝝐(𝒙, 𝒉, 𝒏) = 2𝜶 𝐞𝐱𝐩(𝐂−𝟏(𝒙 + 𝒉 + 𝒏)/2) (4)\nThis residual reflects the effects of the phase difference of (2) and by considering uniform distribution for phase difference, 𝜶 in this residual becomes stochastic; its properties is investigated in [16]. Interaction models useful for speech recognition applications contain this residual. The interaction model is usually approximated by removing the residual [8] or considering its 𝜶 as constant; same value for all frequency bins [17]. Based on these interaction models (or mismatch functions) most of model compensation techniques were developed before."}, {"heading": "2.1. State-conditional observation distribution", "text": "The interaction model (or mismatch function) is not directly used in inference of factorial models. Instead by\nmarginalizing source features as follows, the SCOD is used during the inference:\n𝑝(𝒚|𝑠𝑥 , 𝑠𝑛) = ∬ 𝑝(𝒚, 𝒙, 𝒏|𝑠𝑥, 𝑠𝑛)𝑑𝒙𝑑𝒏 = ∬ 𝑝(𝒚|𝒙, 𝒏)𝑝(𝒙|𝑠𝑥)𝑝(𝒏|𝑠𝑛)𝑑𝒙𝑑𝒏 (5)\nDirect calculation of (5) was performed for simple feature domains and by approximations in the mismatch function.\nTwo examples are max and soft-max approximation for log-power-spectral features [2], [18]. But this domain is not\nappropriate for speech recognition applications. Therefore, instead of direct calculation, the SCOD model is extracted by transforming the source models or use of Monte Carlo methods.\nThree categories of approaches are used for SCOD modeling. Approaches in the first set, by making an assumption\nthat the SCOD is Gaussian in specific feature domains, estimate approximate Gaussian parameters. Parallel model combination (PMC) is an example of this group [19]. Methods in the second set, approximate the non-linear mismatch\nfunctions by its linearization around an expansion point with Taylor series. Then transform source model parameters by applying this approximation. Several variations of these methods were developed, depending on linearization point,\nsupport of dynamic coefficients order of approximation, and compensation of channel effect. A successful and\ncomplete VTS based compensation is presented in [17]. The third set, uses conditional samples of observation distribution for estimating parameters of the SCOD model which is usually modeled by Gaussian Mixture Models\n(GMM). Samples are generated by forward sampling and consequent use of mismatch function. Developed methods in this set are known as variations of data-driven PMC [10]. Next sub-sections describe VTS and DPMC based SCOD\nmodeling adopted for factorial speech processing models. Most of the previous works consider stationary noises and\ntherefore consider only one noise state in their SCOD models. Actually in this case, clean source models are replaced with their corresponding SCODs, which means plugging new observation models into the original HMMs. This is the\nreason for naming this kind of robust speech recognition, “model compensation” [11]."}, {"heading": "2.1.1. VTS based SCOD models", "text": "In the VTS based methods, mismatch function is approximated by the first order Taylor series expanded around\n(𝒙0, 𝒉0, 𝒏0). For example for mismatch function of (3) in the form of 𝒚 = 𝒇(𝒙, 𝒉, 𝒏), we have:\n𝒚 ≈ 𝒇(𝒙0, 𝒉0, 𝒏0) + 𝝏𝒇\n𝝏𝒙 (𝒙 − 𝒙0) +\n𝝏𝒇 𝝏𝒉 (𝒉 − 𝒉0) + 𝝏𝒇 𝝏𝒏 (𝒏 − 𝒏0) (6)\nBy considering the above approximation as transformation of source models, and assuming that the source\ndistribution remains Gaussian after corruption, we can transform source model parameters to obtain SCOD parameters. With selection of conditional source distribution means as the expansion point, we have:\n𝑝(𝒚|𝑠𝑥 = 𝑖, 𝑠𝑛 = 𝑗)~𝒩(𝒚; 𝝁𝑖 + 𝝁ℎ + 𝒈(𝝁𝑖, 𝝁ℎ , 𝝁𝑛), 𝐆𝚺𝑖𝐆 𝑇 + 𝐅𝚺𝑗𝐅 𝑇) (7)\nwhere 𝒈(𝒙, 𝒉, 𝒏) = 𝐂 𝐥𝐨𝐠 (𝐞𝐱𝐩(𝐂−𝟏(𝒙 + 𝒉)) + 𝐞𝐱𝐩(𝐂−𝟏𝒏) + 𝝐(𝒙, 𝒉, 𝒏)), 𝐆 = 𝝏𝒇\n𝝏𝒙 , and 𝐅 =\n𝝏𝒇 𝝏𝒏 . For source models\nwith GMM observation distribution, the SCOD can be conditioned on each source component distribution.\nAdditionally for delta and delta-delta coefficient SCOD parameters are extracted as follows:\n𝑝(𝒚Δ|𝑠 𝑥 = 𝑖, 𝑠𝑛 = 𝑗)~𝒩(𝒚Δ; 𝐆𝝁Δ𝑖 + 𝐅𝝁Δ𝑗 , 𝐆𝚺Δ𝑖𝐆 𝑇 + 𝐅𝚺Δ𝑗𝐅 𝑇) (8)\n𝑝(𝒚ΔΔ|𝑠 𝑥 = 𝑖, 𝑠𝑛 = 𝑗)~𝒩(𝒚ΔΔ; 𝐆𝝁ΔΔ𝑖 + 𝐅𝝁ΔΔ𝑗 , 𝐆𝚺ΔΔ𝑖𝐆 𝑇 + 𝐅𝚺ΔΔ𝑗𝐅 𝑇) (9)\nDetail derivation of these expressions for single state noise models can be found in [11], [17]; extending them for\nmultiple noise sates is straightforward."}, {"heading": "2.1.2. DPMC based SCOD models", "text": "In data-driven PMC methods, by use of forward sampling, state-conditional observed feature samples are used for SCOD modeling. First, source states are fixed; i.e. 〈𝑠𝑥 = 𝑖, 𝑠𝑛 = 𝑗〉. Then based on fixed states and use of source models, conditional source features are generated. Now by use of appropriate mismatch function, observed features are extracted from source features (𝒚𝑙|𝑖,𝑗 = 𝒇(𝒙𝑙|𝑖,𝑗 , 𝒏𝑙|𝑖,𝑗)). These samples can represent empirical SCOD as follows:\n𝑝(𝒚|𝑠𝑥 = 𝑖, 𝑠𝑛 = 𝑗) = 1\n𝐿 ∑ 𝛿(𝒚𝑙|𝑖,𝑗 − 𝒚)\n𝐿 𝑙=1 (10)\nwhere 𝐿 is the number of samples and 𝛿 is Dirac delta function. At this step, parametric model of SCOD can be trained by use of state-conditional samples. This model may consist of single Gaussian or multiple Gaussians where the\nmethod is named DPMC or IDPMC respectively [10], [11]."}, {"heading": "2.2. Inference", "text": "In factorial models with multiple hidden Markov chains such as models that are used in multi-talker speech recognition and robust speech recognition tasks, the objective of inference is to find the most probable source states given the observation feature vectors:\n𝑠1:𝑇 ∗𝑥,𝑛 = argmax\n𝑠1:𝑇 𝑥,𝑛\n𝑝(𝑠1:𝑇 𝑥,𝑛|𝒚1:𝑇) (11)\nSince in robust speech recognition tasks, noise states are not important, so they are discarded. Finding the most probable states conditioned on observation vectors is done by two-dimensional Viterbi search. Naïve implementation requires likelihood evaluation of (𝑆𝑥𝑆𝑛)𝑇 different paths among source states. By creating a mega-state HMM from FHMM, the number of operations reduces to 𝑂(𝑇(𝑆𝑥𝑆𝑛)2). In mega-state HMM a new state variable is defined equals to Cartesian product of source states. Thus, similar to HMM, decoding requires 𝑂(𝑇𝑆2) operations, where 𝑆 = 𝑆𝑥𝑆𝑛. But by using two-dimensional Viterbi search, this reduces to 𝑂(𝑇𝑆2𝑥𝑆𝑛). The following recursions are used in two-dimensional Viterbi search to find the most probable speech states:\n𝜏𝑡(𝑠𝑡 𝑥 , 𝑠𝑡+1 𝑛 ) = max 𝑠𝑡 𝑛 𝑃(𝑠𝑡+1 𝑛 |𝑠𝑡 𝑛)𝑝(𝒚𝑡|𝑠𝑡 𝑥 , 𝑠𝑡 𝑛)𝜏𝑡−1(𝑠𝑡 𝑥 , 𝑠𝑡 𝑛) (12)\n𝜏𝑡(𝑠𝑡+1 𝑥 , 𝑠𝑡+1 𝑛 ) = max 𝑠𝑡 𝑥 𝑃(𝑠𝑡+1 𝑥 |𝑠𝑡 𝑥) 𝜏𝑡(𝑠𝑡 𝑥 , 𝑠𝑡+1 𝑛 ) (13)\nin which 𝑃(𝑠𝑡+1 𝑛 |𝑠𝑡 𝑛) and 𝑃(𝑠𝑡+1 𝑥 |𝑠𝑡 𝑥) are transition probabilities in source Markov chains and 𝑝(𝒚𝑡|𝑠𝑡 𝑥 , 𝑠𝑡 𝑛) is stateconditional observation distribution. It is noteworthy that the role of SCOD in inference here is similar to the observation model in HMMs; like 𝑏𝑖(𝑜𝑡) according to notations of [20]. Recursions start with:\n𝜏0(𝑠1 𝑥, 𝑠1 𝑛) = 𝑃(𝑠1 𝑥)𝑃(𝑠1 𝑛) (14)\nSimilar to conventional Viterbi algorithm, in each step, a back-pointer is used to determine target state sequence:\n𝜙𝑡(𝑠𝑡 𝑥 , 𝑠𝑡+1 𝑛 ) = argmax 𝑠𝑡 𝑛 𝑃(𝑠𝑡+1 𝑛 |𝑠𝑡 𝑛)𝑝(𝒚𝑡|𝑠𝑡 𝑥 , 𝑠𝑡 𝑛)𝜏𝑡−1(𝑠𝑡 𝑥 , 𝑠𝑡 𝑛) (15)\n𝜙𝑡(𝑠𝑡+1 𝑥 , 𝑠𝑡+1 𝑛 ) = argmax 𝑠𝑡 𝑥 𝑃(𝑠𝑡+1 𝑥 |𝑠𝑡 𝑥) 𝜏𝑡(𝑠𝑡 𝑥, 𝑠𝑡+1 𝑛 ) (16)\nFor more details on the two chain models or general cases of using the algorithm, the reader is referred to [6] or [9, Ch. 8], [12] respectively. In fact, here, dynamic programming is run also within time-slices in addition to standard Viterbi algorithm which only runs between time-slices. This is the reason for the reduction of calculations by a factor of 𝑆𝑛."}, {"heading": "3. The proposed method", "text": "The proposed method solves the problem of modeling state-conditional observation distribution in a way different from previous methods which are based on interaction model or mismatch functions. It models State-Conditional\nObservation Distribution using samples where the samples are not generated by forward sampling and use of mismatch function as in the data-driven PMC methods. Sampling of corrupted feature distribution, is started from source signals\nin time domain. At the first step, segments of source signals are combined together by the freely assumed environment model (such as (1)) to make the corrupted speech in time domain, 𝑦[𝑡]. Then, the corresponding features are extracted from these time domain signals; i.e. 𝒙𝑙, 𝒏𝑙 and 𝒚𝑙 are 𝑙th sources and corrupted features. These feature vectors are known as stereo features [8], [21]. We also called them “stereo” due to one to one mapping between these features but here three sets of features are related together.\nSource features are then examined in their corresponding source models to compute their state-conditional likelihoods, (𝑝(𝒙𝑙|𝑖) and 𝑝(𝒏𝑙|𝑗)). Finally, the time domain segments and source feature vectors are discarded. Samples of 𝒚 and their source state-conditional likelihoods will be used for modeling later."}, {"heading": "3.1. Empirical distribution", "text": "Since we have no restriction of source states, samples of 𝒚 are extracted from non-conditional observation distribution rather than SCOD. Therefore these samples cannot be used directly for SCOD modeling. We use importance sampling scheme [22] to correct bias occurred by non-conditional samples for modeling the SCOD using\nparticle weights which indicates association of particle weights to states. Particle weights are calculated in each source spaces as follows:\n𝑤𝑙|𝑖 = 𝑝(𝒙𝑙|𝑖) 𝑝(𝒙𝑙)⁄ = 𝑝(𝒙𝑙|𝑖) ∑ 𝑝(𝒙𝑙|𝑖)𝑝(𝑖)𝑖⁄ (17)\n𝑤𝑙|𝑗 = 𝑝(𝒏𝑙|𝑗) 𝑝(𝒏𝑙)⁄ = 𝑝(𝒏𝑙|𝑗) ∑ 𝑝(𝒏𝑙|𝑗)𝑝(𝑗)𝑗⁄ (18)\nBy assuming source features independence (which is true for many additive noise environments), we have:\n𝑤𝑙|𝑗 = 𝑤𝑙|𝑖𝑤𝑙|𝑗 (19)\nNow the combined conditional speech distribution can be modeled empirically by the weighted particles as follows:\n𝑝(𝒚|𝑖, 𝑗) = ∑ 𝑤𝑙|𝑖,𝑗𝛿(𝒚𝑙 − 𝒚) 𝐿 𝑙=1 (20)\nwhere 𝒚𝑙 is the particle sampled from 𝑝(𝒚) and 𝑤𝑙|𝑖,𝑗 is its adjusting weight for 𝑝(𝒚|𝑖, 𝑗).\nBy iterating 𝑖 and 𝑗 through their corresponding random variable support set and calculating their 𝑤𝑙|𝑖,𝑗, the\nSCOD is extracted for all source states."}, {"heading": "3.2. Parametric distribution", "text": "The empirical distribution cannot be used directly in the recognition application and we need parametric model of\nthe SCOD. Parameter estimation of single Gaussian models can be done by maximum weighted likelihood estimators [23] as:\nargmax 𝜃\n∏ 𝑝𝑤𝑙|𝑖,𝑗(𝒚𝑙; 𝜃) 𝐿 𝑙=1 (21)\nTherefore Gaussian parameters are estimated by weighted samples as follows:\n\ud835̂\udf41𝑖,𝑗 = (∑ 𝑤𝑙|𝑖,𝑗𝒚𝑙 𝐿 𝑙=1 ) 𝑤𝑖,𝑗⁄ (22)\n\ud835̂\udf2e𝑖,𝑗 = (∑ 𝑤𝑙|𝑖,𝑗(𝒚𝑙 − \ud835̂\udf41𝑖,𝑗)(𝒚𝑙 − \ud835̂\udf41𝑖,𝑗) 𝑇𝐿 𝑙=1 ) 𝑤𝑖,𝑗⁄ (23)\nin which 𝑤𝑖,𝑗 = ∑ 𝑤𝑙|𝑖,𝑗 𝐿 𝑙=1 . Depending on feature spaces, single-component Gaussian may not be an appropriate candidate for SCOD modeling. In these cases, GMM is used as a more flexible modeling tool. While the EM algorithm is used for training GMMs, the standard algorithm does not support weighted samples. Because of this, the standard EM algorithm is extended to support weighted samples.\nConsider the following 𝑄-function as the expected value of weighted complete-data log likelihood in which the expectation is taken over the latent variable posterior for supporting weighted samples (state indices are omitted for brevity of notation):\n𝒬(𝜃, 𝜃′) = 𝔼𝑧|𝒚;𝜃′[ln ℒ(𝒚1:𝐿 , 𝑤1:𝐿 , 𝑧1:𝐿; 𝜃)] = ∑ 𝑤𝑙𝔼[ln 𝑝(𝒚𝑙 , 𝑧𝑙; 𝜃)] 𝐿 𝑙=1 (24)\nFor mixture of Gaussians with 𝜃 = (𝝁1:𝐾 , 𝚺1:𝐾 , 𝝅) in which 𝜋𝑘 is the component’s prior, the 𝑄-function becomes:\n∑ 𝑤𝑙 ∑ 𝛾𝑙(𝑘)[ln 𝑝(𝒚𝑙; 𝝁𝑘 , 𝚺𝑘) + ln 𝜋𝑘] 𝐾 𝑘=1 𝐿 𝑙=1 (25)\nin which 𝑘 is index of Gaussian component in the mixture and 𝛾𝑙(𝑘) is defined as the 𝑘th component responsibility to the 𝑙th sample based on old parameters (𝜃′) as follows:\n𝛾𝑙(𝑘) ≝ 𝑃(𝑧 = 𝑘|𝒚𝑙; 𝜃 ′) (26)\nin fact, this posterior is outcome of E-step of the EM algorithm (calculation of component responsibilities is provided in the appendix A). Equation (24) is weighted version of the standard EM 𝑄-function for supporting weighted samples. This 𝑄-function must be optimized with respect to 𝜃, new parameter set, during the M-step of the EM algorithm. Optimizing the 𝑄-function with respect to new parameters leads to the following parameter update equations (detailed derivation is provided in the paper appendix A):\n𝝁𝑘 = (∑ 𝑤𝑙𝛾𝑙(𝑘)𝒚𝑙 𝐿 𝑙=1 ) 𝑊𝑘⁄ (27)\n𝚺𝑘 = (∑ 𝑤𝑙𝛾𝑙(𝑘)(𝒚𝑙 − 𝝁𝑘)(𝒚𝑙 − 𝝁𝑘) 𝑇𝐿 𝑙=1 ) 𝑊𝑘⁄ (28)\n𝜋𝑘 = 𝑊𝑘 𝑊⁄ (29)\nin which 𝑊𝑘 = ∑ 𝑤𝑙𝛾𝑙(𝑘) 𝐿 𝑙=1 and 𝑊 = ∑ 𝑤𝑙 𝐿 𝑙=1 . By applying the extended EM algorithm, weighted “stereo” samples are used to model the SCOD for all source states."}, {"heading": "4. Experiments", "text": "The Aurora 2 task [24] for recognizing utterances of digit series corrupted by additive and convolutive noises is selected for evaluating the effectiveness of the proposed method for handling noise models with multiple noise states\nin SCOD modeling in factorial models. This task has three test sets A, B and C and our method is evaluated using set A. Set A is designed to test robustness of recognition methods against additive noises considering this point that\nthe noise information could be used during the training phase and in our experiment we assume that we have noise\ndistribution and signals before test. In this test set, four noises are artificially added to 8440 clean utterances. Corrupted utterances are used during the training phase for multi-condition training scenarios and in this set, the same noises are\nused for creation of corrupted test utterances. The four noises are Subway, Babble, Car and Exhibition which are artificially added to clean utterances in different SNRs varying from 20 dB to -5 dB in 5 dB steps\nBefore describing the details of the conducted experiments, the whole procedure of the proposed method for noise-\nrobust ASR applications is described first. Figure 2 shows the block diagram of SCOD modeling using weighted “stereo” samples and decoding test utterances using the factorial speech processing models. Output of each step is\nspecified in its block. In source modeling step, speech and noise source models are trained from clean speech utterances and noise signals. Speech models are usually HMMs trained for triphones or whole word depending on the\ntask. For stationary noises, a multivariate Gaussian distribution may be used as the noise model and for non-stationary\nnoise GMMs and HMMs may be used. For non-stationary noises with some patterns in state dynamics, transition matrix of HMMs represents state dynamics (Details of source and SCOD modeling for our experiments is provided\nin the next sub-section). In the next step, SCOD models are trained based on weighted “stereo” samples where the\nobserved feature samples are initially extracted from non-conditional observation distribution and are weighted according to their corresponding source samples and source models. Then the SCOD models are trained by weighted\n“stereo” samples using the extended EM method. Finally in the test phase, features of the test utterance are extracted and state-conditional observation likelihoods are calculated to perform decoding using two-dimensional Viterbi\nalgorithm."}, {"heading": "4.1. Source modeling", "text": "Speech source models are created by the Aurora 2 standard recognition scripts [24] in clean condition training mode using HTK toolkit [14] except that for the front-end we use feature extraction functions of the Voicebox toolbox [25]. Framing and windowing are done similar to the standard Aurora 2 recognition scripts. Despite the fact that the proposed method for SCOD modeling allows us independently select feature spaces of source and observed features, but for comparing the performance of the ideal SCOD models to other methods, we limit ourselves to Mel-Frequency Cepstral Coefficients (MFCC) with an specific configuration which is supported by the mismatch functions. Since second order derivatives of MFCCs provide no significant improvements in the experiments we only use first order derivatives. Instead of log energy of frame, zero order coefficient of MFCC features is used. In addition, the applied filterbank to power spectrum only contains 13 filters which enables us to use full DCT matrix in feature extraction and normal inverse of DCT matrix in the mismatch functions. Feature spaces of speech, noise and corrupted signal are selected to be the same with 26 coefficients (MFCC_0_D(26)).\nFor each digit of the dataset, a sixteen states HMM model is trained by the Aurora 2 standard scripts. In addition for silence and short pause models, three and one state HMMs are used. Observation models of digits consist of three component GMMs while silence and short pause models use six component GMMs. All GMMs have diagonal covariance matrices.\nTwo sets of noise models are used in the experiments. In the first set, noise models have only one component multivariate Gaussians for each noise while in the second set, an HMM with optimized number of states are trained. Noise models of the second set are created by STACS tool [26] and noise modeling is done for each noise separately. This tool starts with single sate model and increases HMM states while train new models in an efficient manner to find best model selected by the BIC criterion. Each state has a multivariate Gaussian as its observation distribution with a diagonal covariance matrix. Trained models for Subway, Babble, Car, and Exhibition noises contain 3, 8, 4 and 4 states accordingly. These models are used in VTS, IDPMC and the proposed WSS SCOD modeling experiments."}, {"heading": "4.2. Modeling state-conditional observation distributions", "text": "For the IDPMC SCOD modeling, generated samples are extracted from source state GMMs while for VTS, SCOD models are conditioned for source states and GMM components of speech state. Therefore IDPMC SCOD models are conditioned on joint speech and noise sates while VTS SCOD models are additionally conditioned on component of each speech state. Additionally VTS based SCOD models are trained by two alpha values (see (4)). At first effect of phase difference is ignored by setting the alpha value to zero. Then second alpha value is set to 2.5 which provides the best results in [17] experiments.\nFor the proposed method, different SCOD models are trained for each noise types by introducing all four types of set A noises by using environment model of (1) except that we ignore the effect of channel distortion. About 17000 speech utterances from train set of dataset are used for creating “stereo” features. Gain coefficient is adjusted to simulate SNRs from -5 dB to 20 dB including infinity. Voice activity detection and speech energy determination is done by the tools provided in the Voicebox, based on ITU recommendation P.56 (similar to Aurora 2 test sets). Moreover, in our experiments, number of mixture components for modeling of SCOD is determined experimentally and is set to three for GMMs with full covariance matrices. Model selection techniques can be used here to select the best models for each speech-noise state SCOD."}, {"heading": "4.3. Results", "text": "In the first experiment, performance of compensated system (single noise state factorial model) based on IDPMC and VTS based SCODs for two selected alpha values are compared. Average word recognition accuracy for four noises of set A against different SNRs for two selected alpha values are plotted in Figure 3.\nAs mentioned in [17] selecting alpha to invalid constant 2.5 (invalid regarding to its support set which is [−1, 1]), provides better result than ignoring it, both in VTS and IDPMC SCOD models but with less effect in the IDPMC case.\nAdditionally we observed that IDPMC based SCOD models yields higher recognition rate than VTS based models.\nTherefore alpha is set to be 2.5 for further experiments.\nNow the proposed method for training ideal SCOD models for single noise state and multiple noise states is compared to VTS and IDPMC based SCOD models. Figure 4-left shows this comparison by average word recognition accuracy over four noises in single noise state mode. In addition Figure 4-right, shows absolute improvement in average recognition accuracy for these three methods when multiple noise states are used.\nTable 1 shows detailed recognition accuracy for this case. As we can see use of multiple noise states improves recognition accuracy in all cases and more improvement is achieved in low level SNRs. Additionally while IDPMC based factorial models gain more from using multiple state noise models but WSS based factorial models achieve the best results. This is due to this fact that “stereo” data provides frame-level mapping between the clean speech noise\nsignal and corrupted utterances, hence better implicit mapping of actual corrupted features to clean speech and noise signal features. While the other methods establish this relationship using approximated mismatch functions.\nFigure 4-left depicts the performance of multi-conditioned trained system against three compensation schemes. This\nshows that even for one noise state, the performance of compensated system is greater than multi-conditioned trained\nsystem especially in low SNR conditions. Additionally since all SCOD models are trained based on clean trained source models, recognition performance of clean trained system is also provided in Figure 4-left."}, {"heading": "5. Conclusion", "text": "In this paper, a modeling method based on weighted “stereo” samples for creating state-conditional observation distribution to be used in factorial speech processing models is proposed. In fact the idea behind this method is similar to single pass retraining scheme presented in [10] for model compensation. We present this method with different formulation in addition to its support for non-stationary noises. As it is shown in our experiments, using multiple noise-states increases recognition accuracy especially in low SNR conditions. Due to the use of “stereo” data, the proposed method cannot be used directly in many real applications because this data is not available always. But similar to the ideal compensated models in the single pass retrained systems, we are able to train ideal SCOD models here to assess capabilities of other useful modeling techniques. The purpose for presenting this method is to provide a way to investigate whether increasing the number of noise states in noise models is useful for non-stationary noises in order to improve the overall system performance. As the result, increasing system performance in our experiments encourages researchers for developing methods capable of handling non-stationary noises to be used in factorial speech processing models. Moreover the proposed method is still applicable in noise specific environments where noise information is available in advance in the training phase and it performs far better than multi-condition trained systems."}, {"heading": "Appendix A", "text": "Extending the EM algorithm for modeling mixture of Gaussians based on weighted samples\nIn the E-step of the EM algorithm for weighted particles, particle weights have no effect on the component responsibility equations. By considering particle weights as the replicating order of the particles (similar to (21)), this replication has no effect on the component responsibilities to each particle. Therefore component responsibilities are calculated without considering particle weights by the old parameter set as in E-step of the standard EM algorithm for GMMs:\n𝛾𝑙(𝑘) ∝ 𝜋𝑘 ′ 𝒩(𝒚𝑙; 𝝁𝑘 ′ , 𝚺𝑘 ′ ) (30)\nwhere the normalization constant is ∑ 𝜋𝑘 ′ 𝒩(𝒚𝑙 ; 𝝁𝑘 ′ , 𝚺𝑘 ′ )𝐾𝑘=1 .\nFor the M-step, the following optimization problem must be solved:\n𝜃𝑛𝑒𝑤 = argmax 𝜃 𝒬(𝜃, 𝜃′)\n𝑠𝑡: ∑ 𝜋𝑘 𝐾 𝑘=1 = 1\n(31)\nUsing the method of Lagrange multiplier for satisfying the constraint for component priors, we have the\nfollowing objective function for optimization:\n𝑔(𝝁, 𝚺, 𝝅) = ∑ 𝑤𝑙 ∑ 𝛾𝑙(𝑘)[ln 𝑝(𝒚𝑙; 𝝁𝑘 , 𝚺𝑘) + ln 𝜋𝑘] 𝐾 𝑘=1 𝐿 𝑙=1 + 𝜆(∑ 𝜋𝑘 𝐾 𝑘=1 − 1) (32)\nTaking the derivative 𝑔 with respect to 𝝁𝑘 results in:\n𝜕𝑔 𝜕𝝁𝑘⁄ = 2 ∑ 𝑤𝑙𝛾𝑙(𝑘)[𝚺𝑘 −1(𝒚𝑙 − 𝝁𝑘)] 𝐿 𝑙=1 (33)\nNow (27) is easily obtained for updating 𝝁𝑘 by setting this derivative to zero. For estimating 𝚺𝑘 , according to [27] the derivative takes the following form:\n𝜕𝑔 𝜕𝚺𝑘⁄ = − 1\n2 ∑ 𝑤𝑙𝛾𝑙(𝑘)[𝚺𝑘\n−1 − 𝚺𝑘 −1(𝒚𝑙 − 𝝁𝑘)(𝒚𝑙 − 𝝁𝑘) 𝑇𝚺𝒌 −𝟏]𝐿𝑙=1 (34)\nin which the 𝝁𝑘 is estimated by (27). Setting it to zero, we obtain:\n∑ 𝑤𝑙𝛾𝑙(𝑘)(𝒚𝑙 − 𝝁𝑘)(𝒚𝑙 − 𝝁𝑘) 𝑇𝚺𝑘 −1𝐿 𝑙=1 = ∑ 𝑤𝑙𝛾𝑙(𝑘) 𝐿 𝑙=1 (35)\nThen (28) is obtained for estimating 𝚺𝑘 in which when the number of samples are significant, there is no need for adjusting the estimator for bias.\nFinally for 𝜋𝑘 we have:\n𝜕𝑔 𝜕𝜋𝑘⁄ = ∑ (𝑤𝑙𝛾𝑙(𝑘)) 𝜋𝑘⁄ 𝐿 𝑙=1 + 𝜆 = 0 (36)\nby using the assumption ∑ 𝜋𝑘 𝐾 𝑘=1 = 1 and considering 𝛾𝑙(𝑘) as a valid conditional probability mass function, 𝜆 is calculated by:\n𝜆 = − ∑ 𝑤𝑙 𝐿 𝑙=1 (37)\nNow we can eliminate 𝜆 from (36) by (37) which leads to (29) for updating 𝜋𝑘 ."}], "references": [{"title": "Developments and directions in speech recognition and understanding, Part 1 [DSP Education", "author": ["J. Baker", "L. Deng", "J. Glass", "S. Khudanpur", "C. Lee", "N. Morgan", "D. O’Shaughnessy"], "venue": "IEEE Signal Process. Mag., vol. 26, no. 3, pp. 75 –80, May 2009.", "citeRegEx": "1", "shortCiteRegEx": null, "year": 2009}, {"title": "Factorial Models for Noise Robust Speech Recognition", "author": ["J.R. Hershey", "S.J. Rennie", "J. Le Roux"], "venue": "Techniques for Noise Robustness in Automatic Speech Recognition, T. Virtanen, R. Singh, and B. Raj, Eds. John Wiley & Sons, Ltd, 2012, pp. 311–345.", "citeRegEx": "2", "shortCiteRegEx": null, "year": 2012}, {"title": "ALGONQUIN: Iterating Laplace’s method to remove multiple types of acoustic distortion for robust speech recognition", "author": ["B.J. Frey", "L. Deng", "A. Acero", "T. Kristjansson"], "venue": "presented at the EUROSPEECH 2001, 2001, pp. 901–904.", "citeRegEx": "3", "shortCiteRegEx": null, "year": 2001}, {"title": "Factorial Hidden Markov Models for Speech Recognition: Preliminary Experiments", "author": ["B. Logan", "P.J. Moreno"], "venue": "Cambridge Research Laboratory, Cambridge, Massachusetts, 1997.", "citeRegEx": "4", "shortCiteRegEx": null, "year": 1997}, {"title": "Factorial models and refiltering for speech separation and denoising", "author": ["S.T. Roweis"], "venue": "Eighth European Conference on Speech Communication and Technology, 2003.", "citeRegEx": "5", "shortCiteRegEx": null, "year": 2003}, {"title": "Super-human multi-talker speech recognition: A graphical modeling approach", "author": ["J.R. Hershey", "S.J. Rennie", "P.A. Olsen", "T.T. Kristjansson"], "venue": "Comput. Speech Lang., vol. 24, no. 1, pp. 45–66, Jan. 2010.", "citeRegEx": "6", "shortCiteRegEx": null, "year": 2010}, {"title": "Single-Channel Multitalker Speech Recognition", "author": ["S.J. Rennie", "J.R. Hershey", "P.A. Olsen"], "venue": "IEEE Signal Process. Mag., vol. 27, no. 6, pp. 66–80, Nov. 2010.", "citeRegEx": "7", "shortCiteRegEx": null, "year": 2010}, {"title": "An Overview of Noise-Robust Automatic Speech Recognition", "author": ["J. Li", "L. Deng", "Y. Gong", "R. Haeb-Umbach"], "venue": "IEEEACM Trans. Audio Speech Lang. Process., vol. 22, no. 4, pp. 745–777, Apr. 2014.", "citeRegEx": "8", "shortCiteRegEx": null, "year": 2014}, {"title": "Model-Based Techniques for Noise Robust Speech Recognition", "author": ["M.J.F. Gales"], "venue": "Ph.D. Thesis, University of Cambridge, 1995.", "citeRegEx": "10", "shortCiteRegEx": null, "year": 1995}, {"title": "Statistical models for noise-robust speech recognition", "author": ["R.C. Van Dalen"], "venue": "Ph.D. Thesis, Cambridge, 2011.", "citeRegEx": "11", "shortCiteRegEx": null, "year": 2011}, {"title": "Factorial Hidden Markov Models", "author": ["Z. Ghahramani", "M.I. Jordan"], "venue": "Mach. Learn., vol. 29, no. 2, pp. 245– 273, 1997.", "citeRegEx": "12", "shortCiteRegEx": null, "year": 1997}, {"title": "Dynamic bayesian networks: representation, inference and learning", "author": ["K.P. Murphy"], "venue": "Ph.D. Thesis, University of California, 2002.", "citeRegEx": "13", "shortCiteRegEx": null, "year": 2002}, {"title": "The HTK book", "author": ["S. Young", "G. Evermann", "D. Kershaw", "G. Moore", "J. Odell", "D. Ollason", "V. Valtchev", "P. Woodland"], "venue": "Camb. Univ. Eng. Dep., vol. 3, 2002.", "citeRegEx": "14", "shortCiteRegEx": null, "year": 2002}, {"title": "Enhancement of log Mel power spectra of speech using a phase-sensitive model of the acoustic environment and sequential estimation of the corrupting noise", "author": ["L. Deng", "J. Droppo", "A. Acero"], "venue": "IEEE Trans. Speech Audio Process., vol. 12, no. 2, pp. 133 – 143, Mar. 2004.", "citeRegEx": "15", "shortCiteRegEx": null, "year": 2004}, {"title": "An analytic derivation of a phase-sensitive observation model for noise robust speech recognition", "author": ["V. Leutnant", "R. Haeb-Umbach"], "venue": "INTERSPEECH, 2009, pp. 2395–2398.", "citeRegEx": "16", "shortCiteRegEx": null, "year": 2009}, {"title": "A unified framework of HMM adaptation with joint compensation of additive and convolutive distortions", "author": ["J. Li", "L. Deng", "D. Yu", "Y. Gong", "A. Acero"], "venue": "Comput. Speech Lang., vol. 23, no. 3, pp. 389–405, Jul. 2009.", "citeRegEx": "17", "shortCiteRegEx": null, "year": 2009}, {"title": "Single-Channel Speech Separation Using Soft Mask Filtering", "author": ["M.H. Radfar", "R.M. Dansereau"], "venue": "IEEE Trans. Audio Speech Lang. Process., vol. 15, no. 8, pp. 2299 –2310, Nov. 2007.", "citeRegEx": "18", "shortCiteRegEx": null, "year": 2007}, {"title": "Robust continuous speech recognition using parallel model combination", "author": ["M.J.F. Gales", "S.J. Young"], "venue": "IEEE Trans. Speech Audio Process., vol. 4, no. 5, pp. 352–359, Sep. 1996.", "citeRegEx": "19", "shortCiteRegEx": null, "year": 1996}, {"title": "A tutorial on hidden Markov models and selected applications in speech recognition", "author": ["L.R. Rabiner"], "venue": "Proc. IEEE, vol. 77, no. 2, pp. 257–286, 1989.", "citeRegEx": "20", "shortCiteRegEx": null, "year": 1989}, {"title": "Stereo-Based Stochastic Mapping for Robust Speech Recognition", "author": ["M. Afify", "X. Cui", "Y. Gao"], "venue": "IEEE Trans. Audio Speech Lang. Process., vol. 17, no. 7, pp. 1325–1334, Sep. 2009.", "citeRegEx": "21", "shortCiteRegEx": null, "year": 2009}, {"title": "Introduction to Monte Carlo Methods", "author": ["D.J.C. Mackay"], "venue": "Learning in Graphical Models, vol. 89, M. I. Jordan, Ed. Springer Netherlands, 1998, pp. 175–204.", "citeRegEx": "22", "shortCiteRegEx": null, "year": 1998}, {"title": "Maximum weighted likelihood estimation", "author": ["S.X. Wang"], "venue": "Ph.D. Thesis, University of British Columbia, Vancouver, Canada, 2001.", "citeRegEx": "23", "shortCiteRegEx": null, "year": 2001}, {"title": "The Aurora experimental framework for the performance evaluation of speech recognition systems under noisy conditions", "author": ["H.G. Hirsch", "D. Pearce"], "venue": "ASR2000-Automatic Speech Recognition: Challenges for the new Millenium ISCA Tutorial and Research Workshop (ITRW), 2000.", "citeRegEx": "24", "shortCiteRegEx": null, "year": 2000}, {"title": "VOICEBOX: Speech Processing Toolbox for MATLAB", "author": ["M. Brookes"], "venue": "Imperial College, Exhibition Road,", "citeRegEx": "25", "shortCiteRegEx": "25", "year": 1997}, {"title": "Fast state discovery for HMM model selection and learning", "author": ["S.M. Siddiqi", "G.J. Gordon", "A.W. Moore"], "venue": "International Conference on Artificial Intelligence and Statistics, 2007, pp. 492–499.", "citeRegEx": "26", "shortCiteRegEx": null, "year": 2007}, {"title": "Some Applications of Matrix Derivatives in Multivariate Analysis", "author": ["P.S. Dwyer"], "venue": "J. Am. Stat. Assoc., vol. 62, no. 318, pp. 607–625, Jun. 1967.", "citeRegEx": "27", "shortCiteRegEx": null, "year": 1967}], "referenceMentions": [{"referenceID": 0, "context": "Despite long term efforts and great successes in automatic speech recognition (ASR) systems, rapid degradation of performance in the presence of noise and other competing sources remains the Achilles Heel of these systems [1].", "startOffset": 222, "endOffset": 225}, {"referenceID": 1, "context": "While some feature enhancement and model adaptation techniques loosely use noise source characteristics to increase performance of speech recognition systems, model based methods try to use as much as information they can acquire from noise sources [2].", "startOffset": 249, "endOffset": 252}, {"referenceID": 2, "context": "Factorial speech processing models [3]–[5] are extension of Hidden Markov Models (HMM) which model audio sources and the way that these sources are combined in a generative manner.", "startOffset": 35, "endOffset": 38}, {"referenceID": 4, "context": "Factorial speech processing models [3]–[5] are extension of Hidden Markov Models (HMM) which model audio sources and the way that these sources are combined in a generative manner.", "startOffset": 39, "endOffset": 42}, {"referenceID": 5, "context": "Recent researches achieve higher performance even than human in the multi-talker speech recognition challenge by use of factorial models of speech processing in some specific conditions [6], [7].", "startOffset": 186, "endOffset": 189}, {"referenceID": 6, "context": "Recent researches achieve higher performance even than human in the multi-talker speech recognition challenge by use of factorial models of speech processing in some specific conditions [6], [7].", "startOffset": 191, "endOffset": 194}, {"referenceID": 7, "context": "Despite their successes in the mentioned challenge and their modeling power, factorial models are not widely used for real noise-robust speech processing applications [8]; their computational demand for inference and difficulties in representing their central conditional probability distribution (CPD) are the two main reasons for this lack of use [2].", "startOffset": 167, "endOffset": 170}, {"referenceID": 1, "context": "Despite their successes in the mentioned challenge and their modeling power, factorial models are not widely used for real noise-robust speech processing applications [8]; their computational demand for inference and difficulties in representing their central conditional probability distribution (CPD) are the two main reasons for this lack of use [2].", "startOffset": 349, "endOffset": 352}, {"referenceID": 1, "context": "The second one is the interaction model, [2]; CPD of the observed signal features conditioned on features of its corresponding sources, p(yt|xt , nt) in Figure 1.", "startOffset": 41, "endOffset": 44}, {"referenceID": 8, "context": "This CPD in its deterministic form is called mismatch function [10], [11].", "startOffset": 63, "endOffset": 67}, {"referenceID": 9, "context": "This CPD in its deterministic form is called mismatch function [10], [11].", "startOffset": 69, "endOffset": 73}, {"referenceID": 10, "context": "On the one hand, multiple state sequence increases computational complexity of inference (which is also required for learning) to O(TS) in which T is inference window or lag, K is number of underlying chain, and S is maximum number of states in the chains [12], [13].", "startOffset": 256, "endOffset": 260}, {"referenceID": 11, "context": "On the one hand, multiple state sequence increases computational complexity of inference (which is also required for learning) to O(TS) in which T is inference window or lag, K is number of underlying chain, and S is maximum number of states in the chains [12], [13].", "startOffset": 262, "endOffset": 266}, {"referenceID": 1, "context": "On the other hand, accurate modeling of probabilistic relationship between the observed features and their sources is not always possible in speech recognition applications [2].", "startOffset": 173, "endOffset": 176}, {"referenceID": 8, "context": "This paper focuses on the second challenge of factorial models by incorporating the idea of single-pass retraining [10], [14] for ideal SCOD modeling to be used in factorial speech processing models.", "startOffset": 115, "endOffset": 119}, {"referenceID": 12, "context": "This paper focuses on the second challenge of factorial models by incorporating the idea of single-pass retraining [10], [14] for ideal SCOD modeling to be used in factorial speech processing models.", "startOffset": 121, "endOffset": 125}, {"referenceID": 2, "context": "In the model based noise-robust ASR methods, the following relation is considered between speech and noise signals in an assumed environment for generation of distorted speech signals [3], [15]:", "startOffset": 184, "endOffset": 187}, {"referenceID": 13, "context": "In the model based noise-robust ASR methods, the following relation is considered between speech and noise signals in an assumed environment for generation of distorted speech signals [3], [15]:", "startOffset": 189, "endOffset": 193}, {"referenceID": 9, "context": "By applying filterbank, taking logarithm and use of truncated DCT matrix, the following interaction model is derived for MFCC features [11]:", "startOffset": 135, "endOffset": 139}, {"referenceID": 14, "context": "This residual reflects the effects of the phase difference of (2) and by considering uniform distribution for phase difference, α in this residual becomes stochastic; its properties is investigated in [16].", "startOffset": 201, "endOffset": 205}, {"referenceID": 7, "context": "The interaction model is usually approximated by removing the residual [8] or considering its α as constant; same value for all frequency bins [17].", "startOffset": 71, "endOffset": 74}, {"referenceID": 15, "context": "The interaction model is usually approximated by removing the residual [8] or considering its α as constant; same value for all frequency bins [17].", "startOffset": 143, "endOffset": 147}, {"referenceID": 1, "context": "Two examples are max and soft-max approximation for log-power-spectral features [2], [18].", "startOffset": 80, "endOffset": 83}, {"referenceID": 16, "context": "Two examples are max and soft-max approximation for log-power-spectral features [2], [18].", "startOffset": 85, "endOffset": 89}, {"referenceID": 17, "context": "Parallel model combination (PMC) is an example of this group [19].", "startOffset": 61, "endOffset": 65}, {"referenceID": 15, "context": "A successful and complete VTS based compensation is presented in [17].", "startOffset": 65, "endOffset": 69}, {"referenceID": 8, "context": "Developed methods in this set are known as variations of data-driven PMC [10].", "startOffset": 73, "endOffset": 77}, {"referenceID": 9, "context": "This is the reason for naming this kind of robust speech recognition, “model compensation” [11].", "startOffset": 91, "endOffset": 95}, {"referenceID": 9, "context": "Detail derivation of these expressions for single state noise models can be found in [11], [17]; extending them for multiple noise sates is straightforward.", "startOffset": 85, "endOffset": 89}, {"referenceID": 15, "context": "Detail derivation of these expressions for single state noise models can be found in [11], [17]; extending them for multiple noise sates is straightforward.", "startOffset": 91, "endOffset": 95}, {"referenceID": 8, "context": "This model may consist of single Gaussian or multiple Gaussians where the method is named DPMC or IDPMC respectively [10], [11].", "startOffset": 117, "endOffset": 121}, {"referenceID": 9, "context": "This model may consist of single Gaussian or multiple Gaussians where the method is named DPMC or IDPMC respectively [10], [11].", "startOffset": 123, "endOffset": 127}, {"referenceID": 18, "context": "It is noteworthy that the role of SCOD in inference here is similar to the observation model in HMMs; like bi(ot) according to notations of [20].", "startOffset": 140, "endOffset": 144}, {"referenceID": 5, "context": "For more details on the two chain models or general cases of using the algorithm, the reader is referred to [6] or [9, Ch.", "startOffset": 108, "endOffset": 111}, {"referenceID": 10, "context": "8], [12] respectively.", "startOffset": 4, "endOffset": 8}, {"referenceID": 7, "context": "These feature vectors are known as stereo features [8], [21].", "startOffset": 51, "endOffset": 54}, {"referenceID": 19, "context": "These feature vectors are known as stereo features [8], [21].", "startOffset": 56, "endOffset": 60}, {"referenceID": 20, "context": "We use importance sampling scheme [22] to correct bias occurred by non-conditional samples for modeling the SCOD using particle weights which indicates association of particle weights to states.", "startOffset": 34, "endOffset": 38}, {"referenceID": 21, "context": "Parameter estimation of single Gaussian models can be done by maximum weighted likelihood estimators [23] as:", "startOffset": 101, "endOffset": 105}, {"referenceID": 22, "context": "The Aurora 2 task [24] for recognizing utterances of digit series corrupted by additive and convolutive noises is selected for evaluating the effectiveness of the proposed method for handling noise models with multiple noise states in SCOD modeling in factorial models.", "startOffset": 18, "endOffset": 22}, {"referenceID": 22, "context": "Source modeling Speech source models are created by the Aurora 2 standard recognition scripts [24] in clean condition training mode using HTK toolkit [14] except that for the front-end we use feature extraction functions of the Voicebox toolbox [25].", "startOffset": 94, "endOffset": 98}, {"referenceID": 12, "context": "Source modeling Speech source models are created by the Aurora 2 standard recognition scripts [24] in clean condition training mode using HTK toolkit [14] except that for the front-end we use feature extraction functions of the Voicebox toolbox [25].", "startOffset": 150, "endOffset": 154}, {"referenceID": 23, "context": "Source modeling Speech source models are created by the Aurora 2 standard recognition scripts [24] in clean condition training mode using HTK toolkit [14] except that for the front-end we use feature extraction functions of the Voicebox toolbox [25].", "startOffset": 245, "endOffset": 249}, {"referenceID": 24, "context": "Noise models of the second set are created by STACS tool [26] and noise modeling is done for each noise separately.", "startOffset": 57, "endOffset": 61}, {"referenceID": 15, "context": "5 which provides the best results in [17] experiments.", "startOffset": 37, "endOffset": 41}, {"referenceID": 15, "context": "As mentioned in [17] selecting alpha to invalid constant 2.", "startOffset": 16, "endOffset": 20}, {"referenceID": 8, "context": "In fact the idea behind this method is similar to single pass retraining scheme presented in [10] for model compensation.", "startOffset": 93, "endOffset": 97}, {"referenceID": 25, "context": "For estimating Σk , according to [27] the derivative takes the following form: ∂g ∂Σk ⁄ = − 1 2 ∑ wlγl(k)[Σk −1 − Σk (yl − μk)(yl − μk) Σk ] l=1 (34)", "startOffset": 33, "endOffset": 37}], "year": 2015, "abstractText": "This paper investigates the role of factorial speech processing models in noise-robust automatic speech recognition tasks. Factorial models can embed non-stationary noise models using Markov chains as one of its source chain. The paper proposes a modeling scheme for modeling state-conditional observation distribution of factorial models based on weighted stereo samples. This scheme is an extension to previous single pass retraining for ideal model compensation and here we used it to construct ideal state-conditional observation distributions. Experiments of this paper over the set A of the Aurora 2 dataset shows that by considering noise models with multiple states, system performance can be improved especially in low SNR conditions up to 4% absolute word recognition performance. In addition to its power in accurate representation of state-conditional observation distribution, it has an important advantage over previous methods by providing the opportunity to independently select feature spaces for both source and corrupted features. This opens a new window for seeking better feature spaces appropriate for noise-robust tasks independent from clean speech feature space.", "creator": "Microsoft® Word 2013"}}}