{"id": "1506.00529", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "1-Jun-2015", "title": "Desirability and the birth of incomplete preferences", "abstract": "We establish an equivalence between two seemingly different theories: one is the traditional axiomatisation of incomplete preferences on horse lotteries based on the mixture independence axiom; the other is the theory of desirable gambles developed in the context of imprecise probability. The equivalence allows us to revisit incomplete preferences from the viewpoint of desirability and through the derived notion of coherent lower previsions. On this basis, we obtain new results and insights: in particular, we show that the theory of incomplete preferences can be developed assuming only the existence of a worst act---no best act is needed---, and that a weakened Archimedean axiom suffices too; this axiom allows us also to address some controversy about the regularity assumption (that probabilities should be positive---they need not), which enables us also to deal with uncountable possibility spaces; we show that it is always possible to extend in a minimal way a preference relation to one with a worst act, and yet the resulting relation is never Archimedean, except in a trivial case; we show that the traditional notion of state independence coincides with the notion called strong independence in imprecise probability---this leads us to give much a weaker definition of state independence than the traditional one; we rework and uniform the notions of complete preferences, beliefs, values; we argue that Archimedeanity does not capture all the problems that can be modelled with sets of expected utilities and we provide a new notion that does precisely that. Perhaps most importantly, we argue throughout that desirability is a powerful and natural setting to model, and work with, incomplete preferences, even in case of non-Archimedean problems. This leads us to suggest that desirability, rather than preference, should be the primitive notion at the basis of decision-theoretic axiomatisations.", "histories": [["v1", "Mon, 1 Jun 2015 15:22:34 GMT  (87kb)", "http://arxiv.org/abs/1506.00529v1", null]], "reviews": [], "SUBJECTS": "cs.AI", "authors": ["marco zaffalon", "enrique miranda"], "accepted": false, "id": "1506.00529"}, "pdf": {"name": "1506.00529.pdf", "metadata": {"source": "CRF", "title": "Desirability and the birth of incomplete preferences", "authors": ["Marco Zaffalona", "Enrique Mirandab"], "emails": [], "sections": [{"heading": null, "text": "ar X\niv :1\n50 6.\n00 52\n9v 1\n[ cs\n.A I]\n1 J\nun 2\n01 5\nWe establish an equivalence between two seemingly different theories: one is the traditional axiomatisation of incomplete preferences on horse lotteries based on the mixture independence axiom; the other is the theory of desirable gambles (bounded random variables) developed in the context of imprecise probability, which we extend here to make it deal with vector-valued gambles. The equivalence allows us to revisit incomplete preferences from the viewpoint, and with the tools, of desirability and through the derived notion of coherent lower previsions (i.e., lower expectation functionals). On this basis, we obtain new results and insights: in particular, we show that the theory of incomplete preferences can be developed assuming only the existence of a worst act—no best act is needed—, and that a weakened Archimedean axiom suffices too; this axiom allows us also to address some controversy about the regularity assumption (that probabilities should be positive—they need not), which enables us also to deal with uncountable possibility spaces; we show that it is always possible to extend in a minimal way a preference relation to one with a worst act, and yet the resulting relation is never Archimedean, except in a trivial case; we show that the traditional notion of state independence coincides with the notion called strong independence in imprecise probability (stochastic independence in the case of complete preferences)—this leads us to give much a weaker definition of state independence than the traditional one; we rework and uniform the notions of complete preferences, beliefs, values; we argue that Archimedeanity does not capture all the problems that can be modelled with sets of expected utilities and we provide a new notion that does precisely that. Perhaps most importantly, we argue throughout that desirability is a powerful and natural setting to model, and work with, incomplete preferences, even in the case of non-Archimedean problems. This leads us to suggest that desirability, rather than preference, should be the primitive notion at the basis of decision-theoretic axiomatisations.\nKeywords: Incomplete preferences, decision theory, expected utility, desirability, convex cones, imprecise probability."}, {"heading": "1. Introduction", "text": "Strand one\nIt seems natural to found a theory of rational decision making on the notion of preference; after all, what is deciding other than choosing between alternatives?\nThis must have been the idea behind the early works on the subject, starting from von Neumann and Morgenstern’s [32], to the analytical framework of Anscombe and Aumann [1] and to that of Savage [26]. They show that a rational decision maker, let us call him Thomas,1 can be regarded as an agent with beliefs about the world, in the form of probabilities, and values of consequences, in the form of utilities. And moreover that Thomas can be regarded as taking decisions by maximising his expected utility. This view has had a tremendous impact in many fields of research, not last on Bayesian statistics, which some see to draw its justification from Savage’s work.\n∗Corresponding author Email addresses: zaffalon@idsia.ch (Marco Zaffalon), mirandaenrique@uniovi.es (Enrique Miranda) 1A homage to Bayes.\nYet, many authors, including von Neumann, Morgenstern and Anscombe themselves, have soon recognised that it is not realistic to assume that Thomas can always compare alternatives; in some cases he may just not know which one to prefer—even only because he lacks information about them. In this case we talk of incomplete, or partial, preferences. Axiomatisations of rational decision making with incomplete preferences came much later, though, through the works of Bewley [3], Seidenfeld et al. [28], Nau [21], and, more recently, Ok et al. [22], and Galaabaatar and Karni [12]. These works build upon the analytical framework of Anscombe and Aumann so as to represent rational (or coherent) preferences through sets of expected utilities; the disagreeing decisions these may lead to account for the incomplete nature of preferences.\nThe picture that comes out of these works is not entirely clear. The axioms employed are not always the same. This is the case of the continuity axiom, called Archimedean, which is necessary to obtain a representation in terms of expected utilities; but it is also the case for the state-independence axioms that enable one to decompose the set of expected utilities into separate sets of probabilities and utilities. The cardinality of the spaces involved also changes in different works, and the treatment of infinite spaces turns out to be quite technical while not void of problems.\nMoreover, the overall impression is that directly stretching the axioms of Anscombe and Aumann, so as to deal with incomplete preferences, shows some limits, and that clarity risks getting lost in the process.\nStrand two\nIn parallel, other researchers were getting, through another path, to a theory of imprecise probability. It started from de Finetti’s interpretation of expectation as a subject’s fair price for a gamble, that is, a bounded random variable. Let us call this subject Matilda, or Thilda, to stress that she is Thomas’ counterpart. De Finetti’s next bright move was to deduce probability by imposing a single axiom of self-consistency on Thilda’s fair prices for different gambles [10]. Smith suggested that de Finetti’s approach could be extended to account for the case that probabilities are indeterminate or not precisely specified [31]. Williams made Smith’s ideas precise, by giving an axiomatisation that is again based on a notion of self-consistency, which is called coherence since then [34].\nIt is important to stop for a moment on this notion, which will be also central to the present work. Williams developed his theory starting from a setup more primitive than de Finetti’s. Rather than asking Thilda to assess her prices for gambles, he only requires Thilda to state whether a gamble is desirable (or acceptable) for her,2 in the sense that she would commit herself to accept whatever reward or loss it will eventually lead to. The core notion in Williams’ theory is then a set of so-called desirable gambles. One such set is said coherent when it satisfies a few axioms of rationality. Lower and upper expectations, which are called previsions in Williams’ theory, and their properties, are derived from the set of gambles, and are shown to be equivalent to sets of probabilities. Eventually, we can also recover de Finetti’s theory as a special case from sets of gambles called maximal, or complete. But the important point is that coherent sets of desirable gambles can be conditioned, marginalised, extended to bigger spaces, and so on, without ever needing to talk about (sets of) probabilities. This is even more remarkable as coherent sets of desirable gambles are more expressive than probabilities; for instance, we can condition a set on an event of zero probability without making any conceptual or technical issue arise. In fact, sets of probabilities are equivalent to a special type of desirability, the one made of so-called strictly desirable gambles. We take care to introduce desirability and coherent lower previsions in a self-contained way, and as pedagogically as possible in a research paper, in Section 2. We do so since we are aware that it is not a formalism that is as well known as that of preference relations (these are briefly introduced in Section 3).\nWilliams’ fundamental work went largely unnoticed until Walley used it as the basis for his theory of imprecise probability [33]. At the very essence, Walley’s theory can be regarded as Williams’ theory with an additional axiom to account for conglomerability. Conglomerability [9] is a property that a finitely additive model may or may not satisfy, and that makes a difference when the space of possibilities is infinite. In fact, if the possibility space is finite, William’s and Walley’s theory essentially coincide.\nWalley’s theory has been influential, originating a number of further developments as well as specialisations and applications (see [2] for a recent collection of related works). Most importantly, along the years, the core notion of desirability underlying both Williams’ and Walley’s theories, has resisted thorough analysis and has proven to be a very solid and general foundation for a behavioural theory of uncertainty. On the other hand, let us note that both\n2These are also called favourable gambles in [27].\nWilliams’ and Walley’s theories are developed for the case of a linear utility scale, and the utility itself is assumed precisely specified.\nEquivalence\nWhat stroke us at first is that the same mathematical structure is at the basis of both the axiomatisations of incomplete preferences and the theory of desirability in imprecise probability: that of convex cones.\nIn the former case, cones are made of scaled differences of horse lotteries. If we call Ω the possibility space and X the set of possible outcomes, or prizes, then a horse lottery, or act, p : Ω × X → [0, 1] is a nested, or compound, lottery that returns a simple lottery p(ω, ·) on X for each possible realisation of ω ∈ Ω. In this paper we take X to be finite—whereas Ω is unconstrained—, so p(ω, ·) is simply a mass function on X . The convex cone associated with a (strict, as we take it) coherent preference relation ≻ between horse lotteries is given by C := {λ(p−q) : λ > 0, p ≻ q}. Note that C is made of objects that are neither acts nor preferences—strictly speaking.\nOn the other hand, a coherent set of desirable gambles turns out to be again a convex cone, this time made of gambles. In the traditional formulation of desirability, a gamble is a bounded function f from the space of possibility Ω to the real numbers R; f(ω) represents the (possibly negative) reward one gets, in a linear utility scale, in case ω ∈ Ω occurs.\nObviously, the two representations are very close. Cannot they just be the same? The answer is yes: in Section 4 we show that desirability cones and cones arising from incomplete preferences are equivalent representations. Two conditions must be met for this to be the case:\n◦ One is very specific: the preference relation must have a worst act, that is, an act w such that p ≻ w for all p 6= w. This is almost universally assumed in the literature, together with the presence of a best act. In this paper we need not have the best act, the worst act suffices to develop all the theory. Moreover, we show that we can assume without loss of generality that the worst act w is degenerate on an element z ∈ X for all ω ∈ Ω. In other words, that set X has a worst outcome z. Whence we denote by z both the worst outcome and the worst act. Accordingly, we shall use Xz to denote a set of prizes with worst outcome and X a set of prizes without it (or something that is not specified).\n◦ The second condition is that desirability must be extended to make it deal with vector-valued gambles. As we shall see in Remark 4, this is surprisingly simple to do. It is enough to define a gamble as a function f : Ω × X → R. The interpretation is that once ω ∈ Ω occurs, gamble f returns a vector of rewards, one for each different type of prize in X . And yet, we eventually, and mathematically, treat the gamble as if the possibility space were the product Ω × X . Therefore the desirability axioms are unchanged, they are simply applied to gambles defined on Ω × X . All the theory is applied unchanged to gambles on the product space. The consequence are, however, stunning.\nThey follow in particular because then we can go from a problem of incomplete preferences to an equivalent one of desirability by simply dropping z from Xz and hence from all acts. Immediately, cone C becomes in that way a coherent set R of desirable gambles on Ω × X . And we can go the other way around: we start from a coherent set of desirable gambles on Ω × X and by appending a worst outcome to X , and to all the acts, we create an equivalent cone C, with the associated coherent preference relation ≻. What is striking is that the equivalence holds also for the corresponding notions of Archimedeanity: an Archimedean preference relation originates a coherent set of strictly desirable gambles, and vice versa. And in desirability there are well-consolidated tools to derive, and work with, lower previsions (expectations); these tools now become available to the decision-theoretic investigator.\nOn the other hand, our standpoint is that the fundamental tool to model incomplete preferences is coneR: it is more expressive that the sets of probabilities we can derive from it: it allows us to model and work with non-Archimedean problems besides Archimedean ones. And we can do this with well-established tools that apply directly to the cone, without any need to go through a probability-utility representation. This remarkably widens the set of problems we can handle.\nOffsprings\nA variety of results and insights follow from the mentioned equivalence. We list them in the order they appear in the paper.\n◦ We show in Section 4 that the traditional Archimedean axiom conflicts with the possibility to represent a maximally uninformative, or vacuous, relation. Thanks to the worst outcome, we define a weak Archimedean condition, which is like the original one but restricted to a subset of non-trivial preferences. This solves the problem and still suffices to obtain a representation in terms of sets of expected utilities.\nWeak Archimedeanity enables us also to address the long-term controversy about the regularity assumption, that is, whether or not a probabilistic model should be allowed to assign probability zero to events: probabilities can be zero in our model and yet we can have a meaningful representation of a strict partial order in terms of a set of expected utilities.\nFinally, weak Archimedeanity allows the probabilistic models derived in our representation to be meaningfully defined on uncountable sets, unlike in the case of the traditional Archimedean axiom. This is remarked in Section 5.\n◦ Still in Section 5 we discuss how desirable gambles might be taken as the primitive notion at the basis of preference, with an opportune interpretation.\nWe illustrate also how our representation in terms of expectations is naturally based on objects that we can interpret as joint probability-utility functions (e.g., joint mass functions in the finite case). This enables us to use tools from probability theory to deal with, and reinterpret, operations with utility, in a uniform way.\n◦ Given that the presence of the worst act is important for this paper, we investigate in Section 6 whether one can extend, in a least-committal way, a coherent preference relation that has no worst act, into one that has it. It turns out that it is always possible to find such a minimal extension, but there is a catch: the extension is never (weakly) Archimedean irrespectively of the preference relation we start from—apart from the trivial empty relation; moreover, that the notion of minimal extension is ill-defined for Archimedean extensions: given any Archimedean extension, it is always possible to find a smaller one.\nThen we dive deeper into this problem, and define a strong Archimedean condition, which is indeed stronger than the traditional one. We show that the weak, strong and traditional Archimedean conditions are all essentially3 equivalent in case a relation has a worst outcome. When it has not, and restricting the attention to the case of finite spaces (in particular finite Ω), we show that the strong Archimedean condition leads to an Archimedean extension and that the traditional does not suffice. Moreover, we show that strong Archimedeanity is equivalent to the topological openness of cone C.\n◦ Starting from Section 7, we assume that the worst outcome exists and we take advantage of the desirability representation of incomplete preferences to revisit a number of traditional notions.\nInitially we discuss the cases of state dependence and independence directly for the case of desirable gambles. We show that there are much weaker (and arguably, more intuitive) notions than the traditional ones we can employ to model state independence.\nSomething similar happens with the case of complete preferences. The definition in the case of desirability is straightforward and of great generality.\n◦ In Section 8, we see what happens of these notions when we move down to the level of coherent lower previsions, that is, sets of expected utilities. Also in this case, we provide weaker notions than the traditional ones that are very direct.\nFor the case of complete preferences, we give a number of equivalent conditions to impose them, thus also simplifying the traditional conditions, and showing that we can use the very same condition both for the case of complete beliefs and incomplete values and for the opposite one (the so-called Knightian uncertainty).\n◦ In Section 9 we consider two axioms used in the literature to impose state independence in the case of a multiprior expected multiutility representation. After quite an involved analysis, we show that imposing those axioms is equivalent to model state independence with sets of expectations using the strong product. In other\n3For the weak one this is only partly true.\nwords, for complete preferences, state independence simply turns out to be stochastic independence in our setting; and to a set of stochastically independent models in the case of incomplete preferences. In fact, when we say, as above, that there are weaker ways to model state independence, this is because it is well known with sets of probabilities that there are much weaker ways to model irrelevance and independence than the strong product.\n◦ In Section 10 we argue that the Archimedean condition is inadequate to capture all the problems that can be tackled using sets of expected utilities. In particular, there are problems that can be modelled using collections of sets of expected utilities that are not Archimedean according to the common definition. We give a new definition of full Archimedeanity that captures all and only the problems that can be expressed with collections of sets of expected utilities, and of which the Archimedean condition is a special case.\nComparing\nIn Section 11 we compare our work with some previous ones that have dealt with incomplete preferences. We consider the work by Nau [21] in the light of the connection we make to desirability, showing how some of his notions map into ours and vice versa. Nau’s work is based on weak preference relations; this also gives us the opportunity to discuss how the present approach can be adapted to that case.\nThe work by Galaabaatar and Karni [12] is particularly interesting to compare as it has been a source of inspiration for ours, and because it is actually quite close in spirit, even though it misses the connection to desirability.\nFinally, we consider the work by Seidenfeld, Schervish and Kadane [28]. This work is interesting to compare especially for the different type of setting it is based on, compared to ours and to the former ones. In particular, they use a special type of Archimedean condition with a topological structure. The paper is also based on quite technical mathematical tools. Moreover, they work with sets of expected utilities that need not be open or closed, thus gaining generality compared to the former approaches. Interestingly, they also consider the problem of extending a preference relation to a worst (and a best) act and come to conclusions that seem to be clashing with ours.\nWe clarify the difference with Seidenfeld et al.’s work by mapping their concepts in our language of desirability. By doing so we show that there is no contradiction between their results and ours, and we argue that the type of generality they get to can be achieved more naturally and simply using convex cones of gambles rather than sets of expected utilities.\nSummarising\nIn summary, we present a very general approach to axiomatise, and work with, incomplete preferences, which to us appears simpler and with a great potential to clarify previous notions and to unify them under a single viewpoint. It is based on a shift of paradigm: regarding desirability as the underlying and fundamental concept at the basis of preference.\nThere are limitations in our current work, like the finiteness ofX , and other challenges left to address. We comment on these and other issues in the Conclusions. The Appendix collects the proofs of our results."}, {"heading": "2. Desirability and coherent lower previsions", "text": ""}, {"heading": "2.1. Foundations of desirability", "text": "Let Ω denote the set of possible outcomes of an experiment. In this paper we let the cardinality of Ω be general, so Ω can be infinite. We call Ω the space of possibilities. A gamble f : Ω → R is a bounded, real-valued, function of Ω. It is interpreted as an uncertain reward in a linear utility scale: in particular, f(ω) is the amount of utiles a subject receives if ω ∈ Ω eventually happens to be the outcome of the experiment. Let us name this subject Thilda.\nWe can model Thilda’s uncertainty about Ω through the set of gambles she is willing to accept. We say also that those are her acceptable or desirable gambles (we use the two terms interchangeably). Accepting a gamble f means that Thilda commits herself to receive f(ω) whatever ω occurs. Since f(ω) can be negative, Thilda can lose utiles and hence the desirability of a gamble depends on Thilda’s beliefs about Ω.\nDenote by L(Ω) the set of all the gambles on Ω and by L+(Ω) := {f ∈ L(Ω) : f 0} its subset of the positive gambles: the non-negative non-zero ones (the set of negative gambles is similarly given by {f ∈ L(Ω) : f 0}). We\ndenote these sets also by L and L+, respectively, when there can be no ambiguity about the space involved. Thilda examines a set of gambles Q ⊆ L and comes up with the subset K of the gambles in Q that she finds desirable. How can we characterise the rationality of the assessments represented by K?\nWe can follow the procedure adopted in similar cases in logic, where first of all we need to introduce a notion of deductive closure: that is, we first characterise the set of gambles that Thilda must find desirable as a consequence of having desired K in the first place. This is easy to do since Thilda’s utility scale is linear, whence those gambles are the positive linear combinations of gambles in K:\nposi(K) :=    r∑\nj=1\nλjfj : fj ∈ K, λj > 0, r ≥ 1    .\nOn the other hand, we must consider that any gamble in L+ must be desirable as well, given that it may increase Thilda’s utiles without ever decreasing them. Stated differently, the set L+ plays the role of the tautologies in logic. This means that the actual deductive closure we are after is given by the following:\nDefinition 1. (Natural extension for gambles) Given a set K of desirable gambles, its natural extension R is the set of gambles given by\nR := posi(K ∪ L+). (1)\nNote that R is the smallest convex cone that includes K ∪ L+. The rationality of the assessments is characterised through the natural extension by the following:\nDefinition 2. (Avoiding partial loss for gambles) A set K of desirable gambles is said to avoid partial loss if 0 /∈ R.\nThis condition is the analog of the notion of consistency in logic. The irrationality of a natural extension that incurs partial loss depends on the fact (as it is possible to show) that it must contain a negative gamble f , that is, one that cannot increase utiles and can possibly decrease them. In contradistinction, a set that avoids partial loss does not contain negative gambles.\nThere is a final notion that is required to make a full logical theory of desirability. This is the logical notion of a theory, that is, a set of assessments that is consistent and logically closed, in the sense that the consistent assessments coincide with their deductive closure in the examined domain Q. This means that Thilda is fully aware of the implications of her assessments on other assessments in Q. The logical notion of a theory goes in desirability under the name of coherence:\nDefinition 3 (Coherence for gambles). Say that K is coherent relative to Q if K avoids partial loss and Q ∩R ⊆ K (and hence Q ∩R = K). In case Q = L then we simply say that K is coherent.\nThis definition alone, despite its conceptual simplicity, makes up all the theory of desirable gambles: in principle, every property of the theory can be derived from it. Moreover, the definition gives the theory a solid logical basis and in particular guarantees that the inferences one draws are always coherent with one another. At the same time, the theory is very powerful: as we have seen, it can be defined on any space of possibility Ω and any domain Q ⊆ L (in this sense, it is not affected by measurability problems); and, as we shall make precise later on in this section, it can handle both precise and imprecise assessments, as well as model both Archimedean and non-Archimedean problems.\nSets of desirable gambles are uncertainty models and as such we can define a notion of conditioning for them. As usual, we consider an event B ⊆ Ω. We adopt de Finetti’s convention to denote by B both the subset of Ω and its indicator function IB (that equals one in B and zero elsewhere). Using this convention, we can multiply B and a gamble f obtaining the new gamble Bf given by\nBf(ω) =\n{ f(ω) if ω ∈ B\n0 otherwise\nfor all ω ∈ Ω. Recall the interpretation of a gamble as an uncertain reward. Since gamble Bf cannot change Thilda’s wealth outside B, we can as well interpret Bf as a gamble that is called off unless the outcome ω of the experiment belongs to B: we say that Bf is a gamble contingent, or conditional, on B. This leads to the following:\nDefinition 4 (Conditioning for gambles). Let R be a coherent set of desirable gambles on L and B be a non-empty subset of Ω. The set of desirable gambles conditional on B derived from R is defined as R|B := {f ∈ R : f = Bf}.\nR|B is a set of desirable gambles coherent relative to Q := {f ∈ L : f = Bf}. Note that there is a natural correspondence between Bf and the restriction of f to B, whence we can also put R|B in relation with R⌋B := {fB ∈ L(B) : BfB ∈ R|B}, and show that this is a coherent set of desirable gambles in L(B). The point here is that R|B and R⌋B are equivalent representations of the conditional set; yet, there can be some mathematical convenience in using one over the other depending on the situation at hand. For these reasons, and in the attempt to avoid a cumbersome notation, from now on—with few exceptions—we shall use notation R|B for the conditional set, even though, on occasions, what we shall actually mean and use is R⌋B. This abuse should not be problematic as the specific set we shall use will be clear from the context. For analogous reasons, in the following we shall sometimes abuse terminology by just saying that R|B is coherent, without specifying ‘relative to Q’.\nFinally, it is useful to consider the operation of marginalisation for a coherent set of desirable gambles.\nDefinition 5 (Marginalisation for gambles). Let R be a coherent set of desirable gambles in the product space Ω×Ω′, where Ω,Ω′ are two logically independent sets. The marginal set of desirable gambles on L(Ω × Ω′) induced by R is defined as RΩ := {f ∈ R : (∀ω ∈ Ω)(∀ω′1, ω ′ 2 ∈ Ω ′)f(ω, ω′1) = f(ω, ω ′ 2)}. The marginal on L(Ω\n′) is defined analogously.\nRΩ is a coherent set of desirable gambles relative to QΩ := {f ∈ L(Ω ×Ω′) : (∀ω ∈ Ω)(∀ω′1, ω ′ 2 ∈ Ω ′)f(ω, ω′1) = f(ω, ω′2)}. QΩ collects all gambles that depend only on elements of Ω; we also say they are the Ω-measurable gambles. Since RΩ is made of Ω-measurable gambles, we can establish a correspondence between RΩ and R′Ω := {g ∈ L(Ω) : (∃f ∈ R)(∀ω ∈ Ω)(∀ω′ ∈ Ω′)g(ω) = f(ω, ω′)}. R′Ω is a coherent set of gambles in L(Ω). Similarly to the discussion made above in the case of conditioning, there is no real difference in representing the marginal information via RΩ or R′Ω , so from now on we shall stick to notation RΩ for the marginal set, even when we shall actually mean R′Ω ."}, {"heading": "2.2. Coherent sets of desirable gambles and coherent lower previsions", "text": "When we restrict the attention to the case where Q = L, coherence can by characterised by four simple conditions:\nTheorem 1. R is a coherent set of desirable gambles on L if and only if it satisfies the following conditions:\nD1. L+ ⊆ R [Accepting Partial Gains];\nD2. 0 /∈ R [Avoiding Null Gain];\nD3. f ∈ R, λ > 0 ⇒ λf ∈ R [Positive Homogeneity];\nD4. f, g ∈ R ⇒ f + g ∈ R [Additivity].\nThis result goes back to Williams [34] and Walley [33] (for a recent proof, see [17, Proposition 2].) It shows, somewhat more explicitly than Definition 3, that a coherent set of desirable gambles is a convex cone (D3, D4) that excludes the origin (D2) and that contains the positive gambles (D1).\nA coherent set of desirable gambles implicitly defines a probabilistic model for Ω. The way to see this is to consider gambles of the form f − µ, where µ is a real value used as a constant gamble here, and f is any gamble. Say that Thilda is willing to accept the gamble f − µ. We can reinterpret this by saying that she is willing to buy gamble f at price µ. Focusing on the supremum price for which this happens leads us to the following:\nDefinition 6 (Coherent lower and upper previsions). Let R be a coherent set of desirable gambles on L. For all f ∈ L, let\nP (f) := sup{µ ∈ R : f − µ ∈ R}; (2)\nit is called the lower prevision of f . The conjugate value given by P (f) := −P (−f) is called the upper prevision of f . The functionals P , P : L → R are respectively called a coherent lower prevision and a coherent upper prevision.\nIt is not difficult to see that an upper prevision can be written also as\nP (f) := inf{µ ∈ R : µ− f ∈ R},\nwhich makes it clear that it is Thilda’s infimum selling price for gamble f . That buying and selling prices for some goods usually do not coincide is a matter of fact in real problems; this shows that the ability to represent such a situation is important if we aim at doing realistic applications of probability. In case they do coincide, instead, what we get are linear previsions:\nDefinition 7 (Linear prevision). Let R be a coherent set of desirable gambles on L and P , P the induced coherent lower and upper previsions. If P (f) = P (f) for some f ∈ L, then we call the common value the prevision of f and we denote it by P (f). If this happens for all f ∈ L then we call the functional P a linear prevision.\nNow we would like to give a word of caution and of clarification: before proceeding, it should be crystal clear that linear previsions are nothing else but expectations. In particular, they are expectations with respect to the probability that is the restriction of P to events: the probability of an event B ⊆ Ω is just P (IB) = P (B). Traditionally, one takes probability as the primitive concept, which is created on top of some structure such as a σ-algebra, and then computes the expectation of a measurable gamble (i.e., a measurable bounded random variable) f . Here instead probability is derived from expectation that is derived from a coherent set of desirable gambles. Among other advantages of this approach, one is that we do not need structures as σ-algebras to do our analysis since the probability underlying P can be finitely additive; whence one can in principle also compute the prevision (expectation) of a non-measurable gamble. In this sense P is more general and fundamental than a traditional expectation; it is actually an expectation in de Finetti’s sense; it seems worth remarking this by using de Finetti’s name for it: that of prevision, and to use symbol P to denote it. Besides this, using symbol P is mathematically accurate once probability is defined as the prevision of indicator functions, and it avoids us to keep on switching, in a needless way, between symbols E and P .\nIn turn, coherent lower and upper previsions are just lower and upper expectation functionals. Consider a coherent lower prevision P . We can associate it with a set of probabilities by considering all the linear previsions that dominate P :\nM(P ) := {P linear prevision : (∀f ∈ L)P (f) ≥ P (f)},\nthat turns out to be closed4 and convex. Since each linear prevision is in a one-to-one correspondence with a finitely additive probability, we can regard M(P ) also as a set of probabilities, which is called a credal set. Moreover, P is the lower envelope of the previsions in M(P ):\nP (f) = inf{P (f) : P ∈ M(P )}. (3)\nIn fact, coherent lower previsions are in a one-to-one correspondence with closed and convex sets of probabilities, such as M(P ). The coherent upper prevision P is, not surprisingly, the upper envelope of the same previsions; as a consequence, it follows that P (f) ≤ P (f) for all f ∈ L. In any case, and even if it is convenient sometimes to work with coherent upper previsions, let us remark that it is enough to work with coherent lower previsions in general, thanks to the conjugacy relation between them.\nIt is well known that a functional P : L(Ω) → R is a coherent lower prevision if and only if it satisfies the following three conditions for all f ∈ L(Ω) and all real λ > 0:\nC1. P (f) ≥ inf f ;\nC2. P (λf) = λP (f);\nC3. P (f + g) ≥ P (f) + P (g).\n(When condition C3 holds with equality for every f, g ∈ L(Ω ×X ), then P is actually a linear prevision.) Therefore one can understand these three conditions also as the axioms of coherent lower previsions, thus disregarding the more primitive notion of desirability. Still, it is useful to know that coherent lower previsions are in a one-to-one correspondence with a special class of desirable gambles:\nDefinition 8 (Strict desirability). A coherent set of gambles R is said strictly desirable if it satisfies the following condition:\nD0. f ∈ R \\ L+ ⇒ (∃δ > 0)f − δ ∈ R [Openness].\n4In the weak* topology, which is the smallest topology for which all the evaluation functionals given by f(P ) := P (f), where f ∈ L, are continuous.\nStrict desirability5 is a condition of openness: it means that the part of cone represented by R \\ L+ does not contain the topological border. By an abuse of terminology, R is said to be open too.\nThe correspondence mentioned above holds in particular because we can start with a coherent lower prevision P satisfying C1–C3 and induce the following set of desirable gambles:\nR := {f ∈ L : f 0 or P (f) > 0}. (4)\nThis set is coherent and in particular strictly desirable and moreover it induces P through Eq. (2)."}, {"heading": "2.3. Conditional lower previsions and non-Archimedeanity", "text": "We have just seen that coherent lower previsions and coherent sets of strictly desirable gambles are equivalent models. This means also that coherent sets of desirable gambles are more general than coherent lower previsions, given that the general case of desirability does not impose any constraint on the topological border (such as openness). We can rephrase this by saying that coherent sets of desirable gambles can model also non-Archimedean problems, that is, problems that cannot be modelled by probabilities (and in particular through a coherent lower prevision).\nThere are two main avenues where non-Archimedeanity can show up in desirability and both are related to gambles with zero prevision. The first has to do with the much debated problem about the way to deal with conditioning in case of zero-probability events. To see this, it is useful first to define a conditional coherent lower prevision.\nDefinition 9 (Conditional coherent lower and upper previsions). Let R be a coherent set of desirable gambles on L(Ω) and B a non-empty subset of Ω. For all f ∈ L(Ω), let\nP (f |B) := sup{µ ∈ R : B(f − µ) ∈ R} (5)\nbe the conditional lower prevision of f given B. The conjugate value given by P (f |B) := −P (−f |B) is called the conditional upper prevision of f . The functionals P (·|B), P (·|B) : L(Ω) → R are respectively called a conditional coherent lower prevision and a conditional coherent upper prevision.\nNote that Eq. (2) is the special case of Eq. (5) obtained when B = Ω, whence for all matters we can stick to Eq. (5) as the general procedure to obtain (conditional) coherent lower previsions from coherent sets of desirable gambles. Note, on the other hand, that P (f |B) = sup{µ ∈ R : B(f − µ) ∈ R} = sup{µ ∈ R : B(f − µ) ∈ R|B} = sup{µ ∈ R : fB − µ ∈ R⌋B} =: P (fB); here we have denoted by fB ∈ L(B) the restriction of f to B and by P (fB) its unconditional lower prevision obtained from set R⌋B. The equality of the two lower previsions implies that P (·|B) is equivalent to a set of probabilities and that it satisfies conditions similar to C1–C3 for all f ∈ L(Ω) and all real λ > 0:\nCC1. P (f |B) ≥ infB f ;\nCC2. P (λf |B) = λP (f |B);\nCC3. P (f + g|B) ≥ P (f |B) + P (g|B),\nin addition to the condition, specific to the conditional case, that P (B|B) = 1 (this could be removed by formulating everything using P (fB) rather than P (f |B)). As in the unconditional case, one could take these four requirements as axioms of coherent conditional lower previsions, thus disregarding desirability. And also in this case, if we do start from a coherent conditional lower prevision P (·|B), we can then induce its associated set of strictly desirable gambles through\nR|B := {f ∈ L+ : f = Bf} ∪ {B(f − (P (f |B)− ε)) : ε > 0, f ∈ L}. (6)\nNote that, according to Definition 4, R|B is made of gambles that are zero outsideB. For the rest, the above expression simply states what is desirable underP (·|B): either the positive gambles or the net gains originated by buying a gamble f at price P (f |B)− ε, which Thilda regards as convenient since the price is less than her supremum acceptable one.\n5A note of caution to prevent confusion in the reader: the adjective ‘strict’ denotes two unrelated things in desirability and in preferences. In preferences it characterises irreflexive (i.e., non-weak) relations, while in desirability it formalises an Archimedean condition as it will become clear in Section 4. We are keeping the same adjective in both cases for historical reasons and given that there should be no possibility to create ambiguity by doing so.\nEq. (5) tells us how to create coherent conditional lower previsions from a coherent set of desirable gambles. If we apply it in particular to a coherent set of strictly desirable gambles R, then, thanks to its equivalence to a coherent lower prevision P , we obtain a conditioning rule defined directly for coherent lower previsions:\nDefinition 10 (Conditional natural extension). Let P be a coherent lower prevision and B a non-empty subset of Ω. The conditional natural extension of P given B is the real-valued functional\nP (f |B) :=\n{ infB f if P (B) = 0,\nmin{P (f |B) : P ≥ P} otherwise (7)\ndefined for every f ∈ L(Ω), where P (f |B) := P (Bf)/P (B) is a conditional linear prevision defined by Bayes’ rule.\nIn other words,P (f |B) is obtained by conditioning all the linear previsions in M(P ) by Bayes’ rule, when P (B) > 0, and then taking their lower envelope. When P (B) = 0, P (f |B) is instead vacuous, and the interval [P (f |B), P (f |B)] is equal to [infB f, supB f ] for all f ∈ L, whence it is completely uninformative about Thilda’s beliefs when the conditioning event has zero lower probability. This is just a limitation of an Archimedean model such as a coherent lower prevision.\nIn contrast, it is known that the conditional lower prevision P (f |B) obtained from a coherent set of non-strictly desirable gambles can be informative, and actually for every pairP , P (·|B) with P (B) = 0 that are coherent with each other in Walley’s sense, we can find a coherent set of desirable gambles that induces them both (see [33, Appendix F4]). This is to say that conditioning with events of zero probability does not pose any problem in the framework of desirability. This happens thanks to the rich modelling capabilities offered by the border of the cone, which is excluded from consideration in the case of strictly desirable sets. Note that there are many common situations that we would like to model where B is assigned zero lower probability and posterior beliefs are not vacuous: just think of a bivariate normal density function over R× R; it assigns zero probability to each real number but conditional on a real number it is again Gaussian, whence non-vacuous. These cases fall in the area of general desirability.\nThe previous question, related to conditioning on an event of probability zero, has illustrated the first type of non-Archimedeanity that a coherent set of desirable gambles can address. Still, it is possible to model the same case through probabilities: the key is to use a collection of coherent lower previsions as the basic modelling tool, such as the pair P , P (·|B), rather than a single unconditional one. However, there is another, somewhat purer, type of nonArchimedeanity that cannot be modelled by collections either and that can instead be modelled through desirability. Here is an example (taken from [36, Example 13]):\nExample 1. Two people express their beliefs about a fair coin using coherent sets of desirable gambles. The possibility space Ω := {h, t}, represents the two possible outcomes of tossing the coin, i.e., heads and tails. For the first person, the desirable gambles f are characterised by f(h) + f(t) > 0; for the second person, a gamble f is desirable if either f(h) + f(t) > 0 or f(h) = −f(t) < 0. Call R1 and R2 the set of desirable gambles for the first and the second person, respectively. It can be verified that both sets are coherent. Moreover, they originate the same unconditional and conditional lower previsions through Eqs. (2) and (5). In the unconditional case we obtain P (f) = f(h)+f(t)2 ; this corresponds, correctly, to assigning probability 12 to both heads and tails. In the conditional case, we again correctly obtain that each person would assign probability 1 to either heads or tails assuming that one of them indeed occurs: P (f |{h}) = f(h), P (f |{t}) = f(t). This exhausts the conditional and unconditional lower previsions that we can obtain from R1 and R2, given that Ω has only two elements. It follows that R1 and R2 are indistinguishable as far as probabilistic statements are concerned. But now consider the gamble f := (−1, 1), which yields a loss of 1 unit of utility if the coin lands heads and a gain of 1 unit otherwise: whereas f is not desirable for the first person, it is actually so for the second. This distinction of the two persons’ behaviour cannot be achieved through probabilities—and in fact gamble f lies in the border of each of the two sets, given that P (f) = 0. ♦\nThe same example can be rephrased in the language of preferences (see [17, Example 10]). It shows that coherent sets of desirable gambles can determine a preference also when the lower expectation of the related gamble, in the case above (−1, 1), is zero, which is a clear case of a non-Archimedean preference. Again, the extra expressive power of general desirability compared to strict desirability is made possible by the modelling capabilities offered by the border of the involved cones.\nAll the discussion above on non-Archimedeanity shows in particular that with coherent sets of desirable gambles we need not enter the controversy as to whether or not we should use the regularity assumption, which prescribes that probabilities of possible events should be positive. It is instructive to track the origin of this assumption: it goes back to an important article by Shimony [30]. In the language of this paper, Shimony argued—correctly, in our view— that de Finetti’s framework could lead to the questionable non-acceptance of a positive gamble in case zero probabilities where present, given that the prevision (expectation) of such a gamble could be zero. This led Shimony and a number of later authors, among whom Carnap and Skyrms, to advocate strengthening de Finetti’s theory by requiring regularity. But it has originated also much controversy given the very constraining nature of regularity on probabilistic models. Between requiring regularity or dropping the acceptability of positive gambles, it eventually emerged a third option: that of using non-Archimedean models, which can keep both desiderata together. Unfortunately, this idea has not been the subject of much development in mainstream probability. But there are signs that something is changing and that there could be a renewed interest in non-Archimedean models (see for instance Pedersen’s very recent interesting work [23]). In this light, it is remarkable that Williams has elegantly solved these problems by desirability as long as 40 years ago: in fact, by including the positive gambles in the natural extension, no matter what Thilda’s assessments are, as in Eq. (1), we make sure that they, and their implications, are always desirable; and we do this without compromising the presence of zero probabilities, therefore not requiring regularity. What we get is a theory, very much in the spirit of de Finetti’s, that is very powerful, so much that it can smoothly deal with non-Archimedeanity too.\nAn important difference between de Finetti’s theory and desirability is that the former is developed for precise probabilistic assessments. We can restrict desirability to precise models by an additional simple axiom of maximality:\nDefinition 11 (Maximal coherent set of gambles). A coherent set of desirable gambles R is called maximal if\n(∀f ∈ L \\ {0})f /∈ R ⇒ −f ∈ R.\nRequiring maximality is a tantamount to assuming that Thilda has complete preferences. The logic counterpart of maximality is also called the completeness of a theory. It is interesting to consider that logic has discovered long ago the inevitability of incomplete theories, after Gödel’s celebrated theorem, and this has led logicians to eventually appreciate their modelling power. Mainstream (Bayesian) probability and statistics, on the other hand, for the most part seem to be still stuck on precise probabilistic models; and yet these are complete logical theories too.\nGeometrically, a coherent maximal, or complete, set of desirable gambles R is a cone degenerated into a hyperplane. It induces, via Eq. (1), a linear prevision P ; this, in turn, induces through Eq. (4) a coherent set of strictly desirable gambles that corresponds to the interior of R.6 Therefore there is a one-to-one correspondence between the interiors of maximal coherent sets and linear previsions. This connects again to the question of Archimedeanity. A maximal coherent set of gambles is a richer model than the associated coherent lower prevision, given that the former can profit from the border of the cone. Therefore, for example, it can yield a non-vacuous conditional linear prevision even when the conditioning event has precise zero probability; in contrast, the linear prevision that corresponds to the interior of the set will lead to a vacuous conditional model in that case."}, {"heading": "2.4. Conglomerability and marginal extension", "text": "Finally, it is important for this paper to say something also about conglomerability. In fact, conditions D1–D4 essentially make up Williams’ theory of desirability [34]. The competing theory by Walley [33] adds them a fifth condition that depends on the choice of a partition B of the possibility space:\nD5. (∀B ∈ B)Bf ∈ R ∪ {0} ⇒ f ∈ R ∪ {0} [Conglomerability],7\nThis axiom follows from additivity when B is finite. The rationale behind D5 is that if Thilda is willing to accept gamble f conditional on B, and this holds for all B ∈ B, then she should also be willing to accept f unconditionally.\nDespite the innocuous-looking nature of D5, conglomerability has originated almost a century-long controversy after de Finetti discovered it [8]. De Finetti described conglomerability in the case of previsions and it can be shown\n6Remember that by an abuse of terminology we say that a coherent set of strictly desirable gambles is open; for this same reason we refer to the union of L+ with the interior of R \\ L+ as ‘the interior’ of R.\n7Note that we should call it B-conglomerability, but we drop B given that in this paper we shall always consider only one partition of the space.\nthat D5 reduces to such a formulation when we induce a linear prevision from a coherent and conglomerable set of desirable gambles. The controversy concerns whether or not conglomerability should be imposed as a rationality axiom. De Finetti rejects this idea; others, like Walley, support it. In some recent work we have shown that there are cases where conglomerability is necessary for a probabilistic theory to make coherent inferences in time [36]. In any case, it is not our intention to enter the controversy in this paper and actually we shall try to avoid having to deal with questions of conglomerability as much as possible.\nThe natural extension of a set of gambles K that avoids partial loss is the smallest superset that is coherent according to D1–D4. We can proceed similarly in the case of conglomerability:\nDefinition 12 (Conglomerable natural extension). The conglomerable natural extension of a set of gambles K, in case it exists, is the smallest coherent and conglomerable superset according to D1–D5.\nThe conglomerable natural extension plays the role of the deductive closure for a conglomerable theory of probability. Although the natural extension is easy to compute [33], this is not necessarily the case for the conglomerable natural extension [20, 19]. However, it will be simple in the context of this paper.\nIn fact, we shall use conglomerability jointly with a special type of hierarchical information: we shall consider a marginal coherent set of gambles RΩ and conditional coherent sets R|{ω} for all ω ∈ Ω. It is an interesting fact then that the conglomerable natural extension of the given marginal and conditional information always exists and can easily be represented as follows (for a proof, see [20, Proposition 29]):\nProposition 2 (Marginal extension). Let RΩ be a marginal coherent set of gambles in L(Ω × Ω′) and R|{ω}, for all ω ∈ Ω, be conditional coherent sets. Let\nR|Ω := {h ∈ L(Ω ×Ω′) : (∀ω ∈ Ω)h(ω, ·) ∈ R|{ω} ∪ {0}} \\ {0}\nbe a set that conglomerates all the conditional information along the partition {{ω}×Ω′ : ω ∈ Ω} of Ω×Ω′ that we denote, by an abuse of notation, as Ω too. Then the Ω-conglomerable natural extension of RΩ and R|{ω} (ω ∈ Ω) is called their marginal extension and is given by\nR̂ := {g + h : g ∈ RΩ ∪ {0}, h ∈ R|Ω ∪ {0}} \\ {0}.\nThe marginal extension is a generalisation of the law of total expectation to desirable gambles. It was initially defined for lower previsions in [33, Section 7.7.2] and later extended to deal with more than two spaces in [16]; in the previous form for desirable gambles it has appeared in [20, Section 7.1]. Representing marginal extension through desirability allows one to take advantage of the increased expressiveness of the model; we can for instance condition our marginal extension on an event with zero (lower or upper) probability and obtain an informative model.\nAs we have said, the marginal extension can be defined also for lower previsions. To this end, we first need to introduce a way to conglomerate the conditional lower previsions defined over a partition of Ω:\nDefinition 13 (Separately coherent conditional lower prevision). Let B be a partition of Ω and P (·|B) a coherent lower prevision conditional on B for all B ∈ B. Then we call\nP (·|B) := ∑\nB∈B\nBP (·|B)\na separately coherent conditional lower prevision.\nFor every gamble f , P (f |B) is the gamble on Ω that equals P (f |B) for ω ∈ B; so it is a B-measurable gamble. Secondly, we introduce the notion of marginalisation for coherent lower previsions similarly to the case of desirability:\nDefinition 14 (Marginal coherent lower prevision). Let P be a coherent lower prevision on L(Ω × Ω′). Then the Ω-marginal coherent lower prevision it induces is given by\nPΩ(f) := P (f)\nfor all f ∈ L(Ω ×Ω′) that are Ω-measurable. The definition of PΩ′ is analogous.\nIn other words, the Ω-marginal is simply the restriction of P to the subset of gambles in L(Ω ×Ω′) that only depend on elements of Ω. For this reason, and analogously to the case of desirability, we can represent the Ω-marginal in an equivalent way also through the corresponding lower prevision P ′Ω defined on L(Ω). In the following we shall not distinguish between PΩ and P ′ Ω and rather use the former notation in both cases.\nWe are ready to define the marginal extension:\nDefinition 15 (Marginal extension for lower previsions). Consider the possibility space Ω × Ω′ and its partition {{ω} × Ω′ : ω ∈ Ω}. We shall denote this partition by Ω and its elements by {ω}, with an abuse of notation. Let PΩ be a marginal coherent lower prevision and let P (·|Ω) be a separately coherent conditional lower prevision on L(Ω ×Ω′). Then the marginal extension of PΩ, P (·|Ω) is the lower prevision P given by\nP (f) := PΩ(P (f |Ω))\nfor all f ∈ L(Ω ×Ω′).\nThe marginal extension is the least-committal coherent lower prevision with marginalPΩ that is coherent with P (·|Ω), in the sense that there is a coherent and conglomerable set of desirable gambles R that induces both P and P (·|Ω) via Eq. (5).\nRemark 1 (On dynamic consistency). It is useful to observe that the marginal extension is tightly related to the question of dynamic consistency in decision problems (analogous considerations hold for marginal extension in the case of sets of desirable gambles). This is a concept originally highlighted by Machina [15] and also related to the work of Hammond [13]. Loosely speaking, a decision problem is dynamically consistent if the optimal strategy does not change from the normal to the extensive form. In the context of this paper, an uncertainty model is understood as dynamically consistent if it coincides with the least-committal (that is, weakest) combination of the marginal and conditional information it induces.\nFor example, assume that we have a joint model on the product space Ω ×Ω′ given by a credal set M. We derive from M a set of marginal previsions MΩ on Ω, and a family of sets of conditional previsions {M(·|{ω}) : ω ∈ Ω}, one for each element of Ω. Then dynamic consistency means that we can recover M by taking the closed convex hull of set\n{PΩ(P (·|Ω)) : PΩ ∈ MΩ, (∀ω ∈ Ω)P (·|{ω}) ∈ M(·|{ω})}. (8)\nThis seems to be what Epstein and Schneider called ‘rectangularity’ in [11]. Note in particular that both the marginal linear prevision and each conditional linear prevision are free to vary in their respective sets in (8) irrespectively of the other linear previsions; in other words, there are no ‘logical’ ties between linear previsions in different credal sets. This is the essential feature that characterises a dynamically consistent model. In terms of lower previsions, if we let P, PΩ, P (·|Ω) be the coherent lower previsions determined by the sets M,MΩ, {M(·|{ω}) : ω ∈ Ω} by means of lower envelopes, as in (3), dynamic consistency means that we should have P = PΩ(P (·|Ω)), that is, P should correspond to a procedure of marginal extension.\nNote that dynamic consistency, as described above, depends on the notion of ‘weakest combination’ of marginal and conditional information. This notion may vary, thus yielding different dynamically consistent models, even though they induce the same marginal and conditional information. For instance, when independence enters the picture, the form of the weakest combination may depend on the notion of independence adopted. We shall discuss more about this point in Section 8.1 (see Remark 5). ♦"}, {"heading": "3. Preference relations", "text": "Let Ω denote, as before, the space of possibilities. In order to deal with preferences, we introduce now another set X of outcomes, or prizes. While the cardinality of Ω is unrestricted, in this paper we take X to be a finite set. Moreover, we assume that all the pairs of element in Ω × X are possible or, which is equivalent, that Ω and X are logically independent.\nThe treatment of preferences relies on the basic notion of a horse lottery:\nDefinition 16 (Horse lottery). We define a horse lottery as a functional p : Ω × X such that p(ω, ·) is a probability mass function on X for all ω ∈ Ω.\nLet us denote by H(Ω × X ) the set of all horse lotteries on Ω × X . Horse lotteries will also be called acts for short. In the following we shall use the notation H for the set of all the acts in case there is no possibility of ambiguity. An act p for which it holds that p(ω1, ·) = p(ω2, ·) for all ω1, ω2 ∈ Ω is called a von Neumann-Morgenstern lottery; moreover, if such a p(ω, ·) is degenerate on an element x ∈ X , then it is called a constant von Neumann-Morgenstern lottery and is denoted by the symbol x: that is, x(ω, x) = 1 for all ω ∈ Ω.\nA horse lottery p is usually regarded as a pair of nested lotteries: at the outer level, the outcome ω ∈ Ω of an experiment is employed to select the simple lottery p(ω, ·); this is used at the inner level to determine a reward x ∈ X . Horse lotteries can be related to a behavioural interpretation through a notion of preference. The idea is that a subject, that this time we shall name Thomas, who aims at receiving a prize from X , will prefer some acts over some others; this will depend on his knowledge about the experiment originating an ω ∈ Ω, as well as on his attitude towards the elements of X . We consider the following well-known axioms of coherent preferences.\nDefinition 17 (Coherent preference relation). A preference relation ≻ over horse lotteries is a subset of H ×H. It is said coherent if it satisfies the next two axioms:\nA1. (∀p, q, r ∈ H)p ⊁ p and p ≻ q ≻ r ⇒ p ≻ r [Strict Partial Order];\nA2. (p, q ∈ H)p ≻ q ⇔ (p, q ∈ H)(∀r ∈ H)(∀α ∈ (0, 1])αp+(1−α)r ≻ αq+(1−α)r [Mixture Independence].\nIf also the next axiom is satisfied, then we say that the coherent preference relation is Archimedean.\nA3. (p, q, r ∈ H)p ≻ q ≻ r ⇒ (∃α, β ∈ (0, 1))αp+ (1− α)r ≻ q ≻ βp+ (1 − β)r [Archimedeanity].\nNext, we recall a few results that we shall use in the paper. We omit their proofs, which are elementary.\nProposition 3. Suppose that for given p, q, r, s ∈ H it holds that α(p − q) = (1 − α)(r − s) for some α ∈ (0, 1). Then for any coherent preference relation ≻ it holds that\np ≻ q ⇔ r ≻ s.\nNote that using the previous proposition one can also easily show that\np ≻ q and r ≻ s ⇒ αp+ (1− α)r ≻ αq + (1− α)s.\nLet the set of scaled differences of horse lotteries be defined by\nA(H) := {λ(p− q) : p, q ∈ H, λ > 0}. (9)\nWe shall also denote this set simply by A in the following, if there is not a possibility of confusion. Preference relation ≻ is characterised by the following subset of A:\nC := {λ(p− q) : p, q ∈ H, λ > 0, p ≻ q}, (10)\nas the next proposition remarks:\nProposition 4. Let ≻ be a coherent preference relation. Then for all p, q ∈ H and λ > 0, it holds that\np ≻ q ⇔ λ(p− q) ∈ C.\nMoreover, C has a specific geometrical structure:\nProposition 5. Let ≻ be a coherent preference relation. Then C is a convex cone that excludes the origin; it is empty if and only if so is ≻.\nIt turns out that cones and coherent preference relations are just two ways of looking at the same thing.\nProposition 6. There is a one-to-one correspondence between coherent preference relations and convex cones in A \\ {0}."}, {"heading": "4. Equivalence of desirability and preference", "text": "In this section we shall show how coherent preferences on acts can equivalently be represented through coherent sets of desirable gambles and vice versa. The key to establish the relation is the notion of worst outcome."}, {"heading": "4.1. Worst act, worst outcome", "text": "It is customary in the literature to assume that a coherent preference relation comes with a best and a worst act, which are defined as follows:\nDefinition 18 (Best and worst acts). Let ≻ be a coherent preference relation and p ∈ H. The relation has a best act b if b ≻ p for all p 6= b and, similarly, it has a worst act w if p ≻ w for all p 6= w.\nIn this paper, however, we shall not be concerned with the best act. A special type of worst act is one that is degenerate on the same element z ∈ X for all ω ∈ Ω (it is therefore a constant von Neumann-Morgenstern lottery). We call it the worst outcome and we denote it by z as well:\nDefinition 19 (Worst outcome). Let ≻ be a coherent preference relation. The relation has a worst outcome z ∈ X if p ≻ z for all p 6= z.\nNow we wonder whether it is restrictive to assume that a coherent relation has a worst outcome compared to assuming that it has a worst act. To this end, we start by characterising the form of the worst act:\nLemma 7. Let ≻ be a coherent preference relation with worst act w. Then for each ω ∈ Ω, there is xω ∈ X such that w(ω, xω) = 1.\nIn other words, a worst act has to be surprisingly similar to a worst outcome: a worst act tells us that for each ω ∈ Ω there is always an element xω ∈ X that is the worst possible; the difference is that such a worst element is not necessarily the same for all ω ∈ Ω as it happens with the worst outcome. But at this point it is clear that we can reformulate the representation in such a way that we can work with relation ≻ as if it had a worst outcome (we omit the trivial proof):\nProposition 8. Consider a coherent preference relation ≻ with a worst act w. Let z be any element in X . Define the bijection σ : H → H that, for all ω ∈ Ω, does nothing if xω = z and otherwise swaps the probabilities of outcomes xω and z:\nσ(p)(ω, x) :=    p(ω, z) if x = xω, p(ω, xω) if x = z,\np(ω, x) otherwise,\nfor all p ∈ H. Application σ induces a relation ≻σ by:\np ≻σ q ⇔ σ −1(p) ≻ σ−1(q).\nThen it holds that ≻σ is a coherent preference relation for which z is the worst outcome. Moreover, relation ≻σ is Archimedean if so is relation ≻.\nIn other words, if our original relation ≻ has a worst act w, we can always map it to a new relation, on the same product space Ω × X , for which z is the worst outcome and such that we can recover the original preferences from those of the new relation. This means that there is no loss of generality in assuming right from the start that w = z.\nIn the rest of the paper (with the exception of Section 6) we shall indeed assume that a coherent preference relation has a worst outcome. This will turn out to be enough to develop all the theory.\nRemark 2 (Notation for the worst outcome). Given the importance of the worst outcome for this paper, it is convenient to define some notation that is tailored to it. In particular, when we want to specify that the set of acts contains z, then we shall denote it by Xz; otherwise we shall simply denote it by X . In the latter case, it can either be that the set does not contain it or that the statements we do hold irrespectively of that. The distinction will be clear from the context. Note in particular that when the two sets are used together, the relation between them will always be that Xz = X ∪ {z}. Moreover, we let Hz := H(Ω,Xz), besides the usual H := H(Ω,X ), and we use them accordingly. ♦\nRemark 3 (Assumption about the worst outcome). Note, in addition, that if Xz = {z}, then it is necessary that Hz = {z} and hence the only possible relation on Hz ×Hz is the empty one. We skip this trivial case in the paper by assuming throughout that Xz contains at least two elements. ♦"}, {"heading": "4.2. Equivalence", "text": "When relation ≻ has the worst outcome, we can associate C with another, equivalent, set. As it turns out, the new set will be one of desirable gambles. To this end, we first define the projection operator that drops the z-components from an act:\nDefinition 20 (Projection operator). Consider a set of outcomes Xz that includes z. The projection operator is the functional\nπ : L(Ω ×Xz) → L(Ω ×X )\ndefined by π(h)(ω, x) := h(ω, x), for all (ω, x) ∈ Ω ×X and all h ∈ L(Ω ×Xz).\nIn this paper, we are going to use this operator to project horse lotteries in Hz , or scaled differences of them, into gambles on Ω × X . Although π is not injective in general, both these restrictions, which we shall denote by π1, π2, are. As a consequence, we shall denote by π1 the restriction of the projection operator to Hz , and then define its inverse\nπ−11 (f) : Ω ×Xz → R\n(ω, x) 7→\n{ f(ω, x) if x 6= z\n1− ∑\nx∈X f(ω, x) if x = z.\nSimilarly, we shall denote by π2 the restriction of π to A(Hz), and define its inverse as\nπ−12 (f) : Ω ×Xz → R\n(ω, x) 7→\n{ f(ω, x) if x 6= z\n− ∑\nx∈X f(ω, x) if x = z.\nIt is then an easy step to show the following:\nProposition 9. Let ≻ be a coherent preference relation on Hz ×Hz and R be defined by\nR := {λπ(p− q) : p ≻ q, λ > 0} = π(C). (11)\nThen:\n(i) R is a coherent set of desirable gambles on L(Ω ×X ).\n(ii) p− q ∈ C ⇔ π(p− q) ∈ R.\nRemark 4 (On preference through desirability). Despite this is a technically simple result, it has important consequences; it is worth stopping here one moment to consider them. Proposition 9 gives us tools to analyse, and draw inferences about, preference by means of desirability. Nowadays desirability is well understood as a tool for uncertain modelling more primitive than probability. This offers us the opportunity to take a fresh new look at preference from the perspective of desirability. We shall exploit such an opportunity in the rest of the paper.\nOn another side, let us stress that it is important to correctly interpret the set of desirable gambles in (11). Set R is made of gambles from L(Ω ×X ); but only Ω is actually a space of possibilities here, that is, the set made up of all the possible outcome of an uncertain experiment. This marks a significant departure from the traditional definition of a set of desirable gambles, which would require in this case that Ω×X , and not just Ω, was the space of possibilities. The way to interpret an element f of R is then as a vector-valued gamble: for each ω ∈ Ω, f(ω, ·) is the vector of associated rewards. We shall detail this interpretation in Section 5. In any case, we shall omit the specification ‘vector-valued’ from now on and refer more simply to the elements of L(Ω ×X ) as gambles. ♦\nThe projection operator π gives us also the opportunity to define a notion of the preferences on which any rational subject should agree and that for this reason we call objective:\nDefinition 21 (Objective preference). Given acts p, q ∈ Hz we say that p is objectively preferred to q if π(p) ≥ π(q) and π(p) 6= π(q). We denote objective preference by p⊲ q.\nThe idea is that p is objectively preferred to q because the probability p assigns to outcomes, except for the outcome z (which is not one any subject actually wants), is always not smaller than that of q while being strictly greater somewhere. An objective preference is indeed a preference:\nProposition 10. Let ≻ be a coherent preference relation on Hz ×Hz and p, q ∈ Hz . Then p⊲ q ⇒ p ≻ q.\nThis proposition remarks in a formal way that objective preferences are those every rational subject expresses. These preferences are therefore always belonging to any coherent preference relation. If they are the only preferences in the relation, then we call the relation vacuous because Thomas is expressing only a non-informative, or trivial, type of preferences.\nAs surprising as it may seem, the vacuity of the coherent preference relation turns out to be incompatible with the Archimedean axiom, except in trivial cases:\nProposition 11. Let ≻ be the vacuous preference relation on Hz × Hz , so that p ≻ z ⇔ p 6= z. Then ≻ is Archimedean if and only if |Ω| = 1 and |Xz | = 2.\nIt is important to remark that this incompatibility is not something we have to live with: for it is possible to define a weaker version of the Archimedean axiom that does not lead to such an incompatibility and that is based on restricting the attention to non-trivial preferences—that is, to non-objective ones. We can also simplify the axiom by focusing only on ternary relations such as p ≻ q ≻ z, which enables us also to skip the usual symmetrised version of the axiom. The result is the following:\nDefinition 22 (Weak Archimedean condition). Let ≻ be a coherent preference relation on Hz ×Hz . We say that the relation is weakly Archimedean if it satisfies\nwA3. (p, q ∈ Hz)p ≻ q, p⋫ q ⇒ (∃α ∈ (0, 1))αp+ (1− α)z ≻ q [weak Archimedeanity].\nThe relation between the traditional Archimedean condition and the weak one is best seen through the following:\nProposition 12. Let ≻ be a coherent preference relation on Hz ×Hz . Consider the following condition:\nA3′. (p, q, r ∈ Hz)p ≻ q ≻ r, p⋫ q ⇒ (∃α ∈ (0, 1))αp+ (1− α)r ≻ q.\nThen:\n(i) Condition A3′ implies that\n(p, q, r ∈ Hz)p ≻ q ≻ r, q⋫ r ⇒ (∃β ∈ (0, 1))q ≻ βp+ (1 − β)r.\n(ii) Relation ≻ satisfies wA3 ⇔ relation ≻ satisfies A3′.\nIn other words, wA3 retains the overall structure of the traditional condition A3, while focusing only on the non-trivial preferences. We shall discuss more about the weak Archimedean condition and its importance for the expressive power of a decision-theoretic representation in Section 5.3.1.\nNext we detail the relation between the weak Archimedean condition for preferences and strict desirability for gambles.\nTheorem 13. Let ≻ be a coherent preference relation on Hz × Hz satisfying wA3. Then the corresponding set R obtained through (11) is a coherent set of strictly desirable gambles.\nThe following result completes the picture: it turns out that coherent sets of desirable gambles and coherent preferences are just two equivalent representations, and this is true even when Archimedeanity is taken into consideration.\nTheorem 14. (i) Let A(Hz) be given by Eq. (9). For any gamble f ∈ L(Ω ×Xz) it holds that\nf ∈ A(Hz) ⇔ (∀ω ∈ Ω) ∑\nx∈Xz\nf(ω, x) = 0.\n(ii) There is a one-to-one correspondence between elements of A(Hz) and gambles in L(Ω ×X ).\n(iii) Let R be a coherent set of desirable gambles on Ω ×X . Then R defines a convex cone C that is equivalent to a coherent preference relation ≻ on Hz ×Hz for which z is the worst outcome. Moreover, if R is a set of strictly desirable gambles, then the relation is weakly Archimedean."}, {"heading": "5. What happened?", "text": "It is useful to consider in retrospect what we have achieved so far."}, {"heading": "5.1. Desirability foundations of rational decision making", "text": "The analysis in the previous sections can be summarised by the following:\nTheorem 15. There is a one-to-one correspondence between coherent preference relations on Hz ×Hz for which z is the worst outcome and coherent sets of desirable gambles on Ω×X . Moreover the relation is weakly Archimedean if and only if the set of gambles is strictly desirable. In this case they give rise to the same representation in terms of a set of linear previsions.\nIn other words, from the mathematical point of view, it is completely equivalent to use coherent sets of desirable gambles on Ω × X in order to represent coherent preference relations on Hz × Hz . Or, to say it differently, we have come to realise that there is no need to distinguish two subjects, Thomas and Thilda, to make our exposition; accordingly, from now on we shall refer to the subject that makes the assessments more simply as ‘you’. That the two theories are just the same is even more the case if we consider that we can define a notion of preference directly on top of a coherent set of desirable gambles [33, Section 3.7.7]:\nDefinition 23 (Coherent preference relation for gambles). Given a coherent set of desirable gamblesR on L(Ω×X ) and gambles f, g, we say that f is preferred to g in R if f − g ∈ R, and denote this by f ≻ g.\nIn other words, f ≻ g if you are willing to give away g in order to have f . It is trivial to show that the notion of preference we have just described is equivalent to the preference relation on horse lotteries that corresponds to R: this means that f ≻ g if and only if p ≻ q for all p, q ∈ Hz such that p− q = π(λ(f − g)) for some λ > 0. This is also the reason why we use the same symbol in both cases.\nAll this suggests that we can think of establishing the foundations of rational decision making using the desirability of gambles as our primitive conceptual tool, rather than regarding it as derived from preferences over horse lotteries. In this new conceptual setting, you would be asked to evaluate which gambles you desires in L(Ω × X ) and then we would judge the rationality of your assessments by checking whether or not the related set of gambles is coherent according to D1–D4. This appears to be utterly natural and straightforward, and yet to make this procedure possible, it is essential that the numbers making up a gamble are given a clear interpretation, so as to put you in the conditions to make meaningful and accurate assessments of desirability."}, {"heading": "5.2. Interpretation", "text": "Remember that any gamble f ∈ L(Ω × X ) is such that f = π(λ(p − q)), for some p, q ∈ Hz and λ > 0. Therefore for all ω ∈ Ω and x ∈ X , f(ω, x) is a number proportional to the increase (or decrease if it is negative) of the probability to win prize x in state ω as a consequence of exchanging q for p. We can use this idea to interpret f(ω, x) more directly, without having to rely on horse lotteries, in the following way.\nImagine that there is a simple lottery with possible prizes x ∈ X , all of them with the same, large, number of available tickets.8 Tickets are sequentially numbered irrespectively of their type. Eventually only one number will be\n8It is possible to assume that lottery tickets are infinitely divisible so as to cope with non-integer numbers; we shall neglect these technicalities in the description and just assume that their number is very large to make things simpler.\ndrawn according to a uniform random sampling; and this you know. Therefore the (objective, or physical) probability ρx that you win prize x is proportional to the number of x-tickets you own. This implies that your utility scale is linear in the number of x-tickets for all x ∈ X . You can increase, but also decrease, the number of your lottery tickets by taking gambles on an unrelated experiment, with possible outcomes in Ω, about which you are uncertain: by accepting gamble f ∈ L(Ω × X ), you commit yourself to accept f(ω, ·) in case ω occurs; this is a vector proportional to the number of lottery tickets you will receive for each x ∈ X (this means also to have to give away x-tickets when f(ω, x) is negative).9 In case you accept more than one gamble (and in any case finitely many of them), the reasoning is analogous; it is enough to take into account that the tickets received or given away will be proportional to the sum of the accepted gambles.\nStated differently, a gamble is interpreted as an uncertain reward in lottery tickets. Since lottery tickets eventually determine the probability to win prizes, such a probability is treated here as a currency. The idea of a ‘probability currency’ appears to go back to Savage [26] and Smith [31] and has already been used also to give an interpretation of gambles in Walley’s theory [33, Section 2.2.2]. The difference between the traditional idea of probability currency and the one we give here rests on the possible presence of more than one prize, which is allowed in the present setting. That the traditional concept of probability currency can be extended to our generalised setting is ensured by Theorem 15.\nWith this interpretation in mind, it is possible to state and deal with a decision-theoretic problem only in terms of gambles on Ω ×X . This has a number of implications:\n◦ One is that we can profit now from all the theory already developed for desirable gambles in order to study decision-theoretic problems in quite a generality. We shall actually do so in the rest of the paper.\n◦ Another is that we should be careful to interpret gambles properly, as we said already in Remark 4; in particular, despite our gambles are on Ω × X , only Ω is the space of possibilities—which is something that marks a departure from the original theory of desirable gambles. The most important consequence here is that it is meaningless to think of the element of X as events that may occur; only elements of Ω can. As a consequence, we can still use conditioning as an updating rule, under the usual interpretations and restrictions; but we can do so only conditional on subsets of Ω. Note, on the other hand, that in the current framework we can update both beliefs and values.\n◦ Finally, our results so far appear to have considerable implications for Williams’ and Walley’s behavioural theories of probability and statistics: in fact, the current reach of these, otherwise very powerful and wellfounded, theories is limited to precise and linear utility. By extending gambles so as to make them deal with multiple prizes, we are de facto laying the foundations for their extension to imprecise non-linear utility. This should allow, with time, a whole new range of problems to be addressed in a principled way by those theories."}, {"heading": "5.3. A new way to represent utility (values)", "text": "There is a feature of our proposed representation of decision-theoretic problems that is worth discussing even only to make the question explicit, as it seems to be different from past approaches.\nLet us start by considering the simplest setup to make things very clear: consider finite Ω (as well as X , as usual) and assume that the assessments eventually yield a coherent set of strictly desirable gambles R corresponding to the interior of a maximal set. This means that R is in a one-to-one correspondence with a joint mass function Π on Ω×X that is the restriction of a linear prevision to the elements of the product space. Π is a joint mass function in the sense that Π(ω, x) ≥ 0 for all (ω, x) ∈ Ω ×X and ∑ (ω,x)∈Ω×X Π(ω, x) = 1. Now, if we assume that Π(ω, x) > 0 for all (ω, x) ∈ Ω ×X , then Π becomes an equivalent representation of R. Moreover, we can rewrite Π using total probability (marginal extension) as the product of the marginal mass function on Ω and of the conditional mass function on X given ω ∈ Ω:\nΠ(ω, x) = Π(ω)Π(x|ω) (12)\n9Thanks to the linearity of your utility scale, we can assume without loss of generality that you initially own a positive number of x-tickets for all x ∈ X ; for the same reason, the size of the positive proportionality constant is irrelevant. It follows that we can reduce the number of tickets you receive or give away so as to keep all your probabilities of winning prizes between 0 and 1.\nfor all (ω, x) ∈ Ω × X . Here the meaning of Π(ω) is that of the probability of ω, whereas Π(x|ω) represents the utility of outcome x conditional on the occurrence of ω.\nThe important, and perhaps unconventional, point in all this discussion is that in our approach the utility function is just another mass function, that is, one such that Π(x|ω) ≥ 0, ∑ x∈X Π(x|ω) = 1 for all ω ∈ Ω. This means that the utility mass function is formally equivalent to a probability mass function, it is only our interpretation that changes: while the numbers in the probability function represent occurrence probabilities, in the utility function they represent mixture coefficients that allow us to compare vectors of (amounts of) outcomes. The more traditional view of the utilities is that of numbers between zero and one that do not need to add up to one.\nAn advantage of our representation is that we can directly exploit all the machinery and concepts already in place for probabilities also for utilities. For example, the notion of state independence trivially becomes probabilistic independence through (12), and this happens whenever for all x ∈ X it holds that\nΠ(x|ω′) = Π(x|ω′′)\nfor all ω′, ω′′ ∈ Ω, so that we are allowed to work with marginal mass functions for probability and utility. Instead, that state independence fails simply means that we have to work with the joint mass function Π, which appears to be a very natural way to address this case (all this will be detailed in Sections 7 and 9).\nThis feature extends over all the representation, not only in the specific case considered, as we can see by moving backwards toward greater generality. For instance, if we relax the precision requirement of the previous example, what we get is a representation of a decision-theoretic problem by a closed convex set M of joint mass functions. State independence in this case will coincide with a notion of independence or irrelevance for credal sets among all the possible ones. When state independence holds, preferences will be formed by combining a marginal credal set for probabilities MΩ with a marginal credal set for utilities MX . Completeness of utilities will mean that MX contains only one mass function; and vice versa for completeness of probabilities.\nThese credal sets are in a one-to-one correspondence with coherent lower previsions. Whence, there will be a coherent lower previsionP (·|{ω}) representing the lower envelope of the previsions that we can obtain from the credal set MX (·|{ω}) of the utilities conditional on {ω}; that is, by formally treating utilities as probabilities and computing the related expectations. Relaxing the example further, we can consider an infinite (not necessarily countable) space Ω and in this case the credal set MΩ will be made up of finitely additive probabilities.\nWhat we find remarkable is also that we can easily obtain the quantities we need explicitly from sets of desirable gambles using established tools. In more traditional axiomatisations of preferences, separation theorems are usually aimed at obtaining a ‘proof of existence’ of the linear functionals that represent probabilities and utilities, which then leads to a representation theorem. Our representation naturally appears to be more of a constructive nature, in the sense that we can actually compute the wanted numbers through (5); for instance, we can obtain the lower utility mass of x ∈ X conditional on ω ∈ Ω simply as\nP (I{x}|{ω}) = sup{µ ∈ R : I{ω}(I{x} − µ) ∈ R}.\nThe overall situation is very much alike when we finally move backwards to R. This will be in general a ‘joint’ model for beliefs and values. When we decompose it into separate models, there will be a marginal set for beliefs RΩ and other models for values, like R|{ω}, which will be formally treated as usual as if they were models of conditional beliefs instead of values. And this will allow us to exploit all the tools and concepts already developed for desirability, like the marginal extension, for instance. Yet, not all the concepts will be alike: for instance, as we said already, our interpretation excludes that the elements of X ‘occur’, so that updating should be done only conditional on subsets of Ω.\nNote that we are not claiming that all this is not possible to do in the traditional way to axiomatise preference. What we want to say is that our framework is naturally suited to represent decision-theoretic problems in which values (utilities) are formally treated as beliefs (probabilities); and that this helps dealing with these problems in a familiar way while exploiting well-established tools for beliefs also for values."}, {"heading": "5.3.1. Weak Archimedeanity, strict preference and the cardinality of spaces", "text": "The discussion in the previous section helps us also to uncover a question related to Condition A3 in relation to strict preference orderings. In fact, A3 is conceived to eventually lead to models that have to assign positive lower\nexpected utility (prevision) to all the elements of cone C, or, equivalently, to all the gambles in R. Remember that in the formulation based on R, beliefs and values naturally turn out to be jointly represented through a set M of linear previsions, which are formally equivalent to a set of probabilities (in the sense that not only probability but also utility is mathematically represented through a probability function). This enables us to see clearly that, under A3 and strict preference, it is necessary that Ω × X be countable: for R contains the positive gambles, among which that are the indicator functions of the subsets of Ω × X ; and a probability can assign positive mass to countably many events at most.\nOf course this is quite a limitation in the representation. It seems also a limitation that relates to the idea of regularity discussed in Section 2.3. All this may have us to appreciate that, by taking aside the positive gambles, the weak Archimedean condition wA3 is not subject to such a problem: it yields a representation through a set of linear previsions on gambles that can be defined on uncountable spaces. Note, in fact, that in this paper we are not restricting the cardinality of Ω (we do restrict the cardinality of X but for other reasons). This seems to be an original feature of our approach that has not been exploited so far."}, {"heading": "6. Extending a preference relation to the worst outcome", "text": "We have seen in the previous sections that the presence of the worst outcome in a preference relation is the key to establish the equivalence between preference and desirability. It is interesting to note, moreover, that the worst outcome originates the acceptability of the positive gambles in desirability; and this is what solves the controversy about the regularity assumption described in Section 2.3. As a consequence, the presence of the worst outcome appears to be somewhat of a fundamental concept for a preference relation. Then, in case a preference relation does not come with a worst act/outcome, it would be important to have tools to extend it to the worst outcome in a minimal kind of way.\nSo consider a coherent preference relation ≻ on H×H. Let us investigate the problem of extending it to Hz ×Hz in such a way that z acts as the worst outcome. We start by making precise the notion of extension:\nDefinition 24 (Extension to the worst outcome). Let ≻ be a coherent preference relation on H×H. An extension of ≻ to the worst outcome is a coherent relation, denoted by the same symbol ≻, on Hz ×Hz such that:\n(i) p ≻ z for all p ∈ Hz , p 6= z;\n(ii) π−11 (p) ≻ π −1 1 (q) whenever p ≻ q for some p, q ∈ H.\nNote that the definition is based on two truly minimal requirements. The first is just the definition of z as the worst outcome. The second makes the idea of the extension precise: we use the one-to-one correspondence between H and π−11 (H) to require that the original preferences be preserved by the extension.\nThe next theorem gives an equivalent characterisation of an extension to the worst outcome; based on this, it shows that there always exists a minimal extension, which is one that is included in any other, and yet that this extension is never weakly Archimedean (except for a trivial case):\nTheorem 16. Let ≻ be a coherent relation on H×H and let C be the corresponding cone. Then:\n(i) A coherent preference relation ≻ on Hz ×Hz extends relation ≻ on H×H to the worst outcome if and only if\n(∀p, q ∈ Hz) p ≻ q whenever p⊲ q or π(p− q) = r − s for some r, s ∈ H, r ≻ s. (13)\n(ii) The minimal extension of ≻ to the worst outcome corresponds to the coherent set of desirable gambles given by:\nR := {f ≥ λ(r − s) : r, s ∈ H, r ≻ s, λ > 0} ∪ L+. (14)\n(iii) Let P be the coherent lower prevision induced by R. For all f ∈ C, it holds that P (f) = 0. As a consequence, the minimal extension is weakly Archimedean if and only if C = ∅.\nNote that Condition (13), which characterises the extensions in Theorem 16, has a simple interpretation. The part related to objective preferences has been discussed already after Definition 21: it means that objective preferences should be indeed preferences irrespective of the specific subject we consider. Concerning the remaining part, observe that π(p − q) ∈ C implies that p(ω, z) = q(ω, z) for all ω ∈ Ω (note that p(ω, z) need not be constant on ω ∈ Ω). This means that your evaluation of p versus q is not going to be based on their behaviour on z, since it is identical in the two cases; and for this reason one can determine the preference relation between p and q by relying only on the original relation (via C).10\nThe second part of Theorem 16 gives an important result: that there is always a least-committal extension of a coherent preference relation to the worst outcome. Saying that it is least-committal means that such an extension is not requiring you to accept any preference other that those following from axioms A1, A2 and the assumption that X can be bounded by a worst outcome.11 This is a positive result in that under minimal conditions it allows us to assume right from the start that we work with preference relations provided with the worst outcome.\nOn the other hand, in the third part of the theorem we obtain a result that is not as positive, and in particular that R is never a coherent set of strictly desirable gambles (except in the trivial case that C = ∅). Remember that there is a one-to-one correspondence between sets of strictly desirable gambles and coherent lower previsions. In the specific context we are dealing with, this means that the minimal extension cannot be reproduced by a set of linear previsions. Stated differently, we obtain that any coherent preference relation (possibly comprising any Archimedean notion we might envisage), when extended in a least-committal way to the worst outcome, is not going to be weakly Archimedean, as it follows from Theorem 13, and hence not Archimedean either, because of Proposition 12 (see also Proposition 19 in Section 6.1).\nSo there is no minimal extension of relation ≻ to the worst outcome that is Archimedean. Still, one might wonder whether there are Archimedean extensions. These would introduce assessments other than those in (13). But it could also be that these other assessments are necessary for an extension to be Archimedean. And then one could think of defining the notion of minimal extension, this time among the Archimedean ones, and look for such a kind of minimal extension, provided that it exists. The problem is that it does not:\nCorollary 17. Let ≻ be a coherent relation under the assumptions of Theorem 16 and R be as in (14). If there is a coherent set of strictly desirable gambles R1 that includes R, then there is another coherent set of strictly desirable gambles R2 such that R ( R2 ( R1.\nWe can rephrase the corollary by saying that the notion of minimal extension among the weak Archimedean ones is ill-posed: in fact, the minimal extension should correspond to the intersection of all the Archimedean extensions; but this is just R, the least-committal extension of Theorem 16.\nAs a consequence, the choice of an Archimedean extension cannot be made automatically, it is you that should tell us which one to select among the infinitely many possible ones. For the same reason, even if we start from a weak Archimedean preference relation, and drop the worst outcome, then there is no way in general to have an automatic procedure to recover the preference relation from which we started. Stated differently, it appears that if you hold Archimedean preferences, you should first of all have in mind a worst outcome and only then start defining your assessments."}, {"heading": "6.1. Archimedean conditions and their relations", "text": "Let us consider a strengthening of the Archimedean property A3, which will be necessary for the developments in the next section:\nDefinition 25 (Strong Archimedean condition). Let ≻ be a coherent preference relation on H×H. We say that the relation is strongly Archimedean if it satisfies\n10The further reformulation (A.1) in Appendix A introduces additional preferences; those can be read as a simple consequence of the independence axiom A2: they state that if p ≻ q then also αp + (1 − α)t ≻ αq + (1 − α)z for all α ∈ (0, 1] and t ∈ Hz \\ {z}, given that t ≻ z.\n11We call it ‘least-committal’ and not, for instance, ‘without loss of generality’, also because the extension to the worst outcome does not seem to be trivial anyway: for, after all, we are bounding the relation in this way, and it is possible that you disagree that your actual preference can be bounded.\nsA3. (p, q ∈ H)p ≻ q ⇒ (∀r, s ∈ H)(∃β ∈ (0, 1))βp+ (1− β)r ≻ βq + (1 − β)s [strong Archimedeanity].\nThat sA3 is in fact stronger than the usual Archimedean property A3 is established in the following:\nProposition 18. Let ≻ be a coherent relation and C the corresponding cone. Then:\n(i) Relation ≻ satisfies A3 ⇔ (∀f, g ∈ C)(∃β1, β2 ∈ (0, 1))β1f − (1− β1)g ∈ C, β2g − (1 − β2)f ∈ C.\n(ii) Relation ≻ satisfies sA3 ⇔ (∀f ∈ C)(∀g ∈ A)(∃β ∈ (0, 1))βf + (1− β)g ∈ C.\n(iii) Relation ≻ satisfies sA3 ⇒ relation ≻ satisfies A3.\nTo see that A3 and sA3 are not equivalent in general, consider the following example:\nExample 2. Consider a gamble 0 6= f ∈ A, and let us define the binary relation ≻ on H×H by p ≻ q ⇔ p− q = λf for some λ > 0. This relation satisfies the following axioms:\nA1. f 6= 0 ⇒ p ⊁ p for every p ∈ H. Moreover, if p ≻ q ≻ r, there are λ1, λ2 > 0 such that p− q = λ1f, q − r = λ2f , and then p− r = (λ1 + λ2)f , whence p ≻ r.\nA2. p ≻ q ⇒ ∃λ > 0 such that p− q = λf . Given r ∈ H and β ∈ (0, 1], βp + (1 − β)r ≻ βq + (1 − β)r, since β(p− q) = βλf . The converse is analogous.\nA3. We apply Proposition 18. Given f1, f2 ∈ C, there are λ1, λ2 > 0 such that f1 = λ1f, f2 = λ2f . Then there are β1, β2 ∈ (0, 1) such that β1λ1 − (1 − β1)λ2 > 0 and β2λ2 − (1 − β2)λ1 > 0, from which we deduce that β1f1 − (1− β1)f2 and β2f2 − (1 − β2)f1 belong to C.\nTo see that sA3 may not hold, it suffices to consider p, q, r, s ∈ H such that p ≻ q and r ⊁ s. Then applying Proposition 18, there should be β ∈ (0, 1) such that β(p − q) + (1− β)(r − s) ∈ C. This implies that there is λ > 0 such that r − s = λf , a contradiction. ♦\nNext, assume that relation ≻ contains a worst outcome. This makes all the Archimedean conditions we have introduced so far collapse into a single notion (but note that wA3 needs to be equipped with an additional assumption of positivity):\nProposition 19. Let ≻ be a coherent relation with worst outcome z, C the corresponding cone and R := π(C). Let P be the coherent lower prevision induced by R through (2). Then the following are equivalent:\n(i) Relation ≻ satisfies sA3.\n(ii) Relation ≻ satisfies A3.\n(iii) Relation ≻ satisfies wA3 and P (f) > 0 for all f ∈ L+(Ω ×X )."}, {"heading": "6.2. Existence of Archimedean extensions in the finite case", "text": "Note that at this point we do not know yet whether there are coherent Archimedean extensions to the worst outcome of a given coherent preference relation ≻. In particular we would like that there were Archimedean extensions that do not introduce informative assessments, that is, assessments other than those necessary for the extension to be weakly Archimedean. We show next that these extensions may not always exist whenever Ω is finite; the case of infinite Ω is left as an open problem.\nShowing that there exists an Archimedean extension with worst outcome is equivalent to proving that it is possible to include set R, given in (14), in a coherent set of strictly desirable gambles. We are going to show that, when a coherent preference relation ≻ satisfies the strong Archimedean condition sA3, and Ω is indeed finite, then the set R of desirable gambles it induces has a proper superset of strictly desirable gambles. It is interesting to note that, even when we can build an open superset of R, it could be that any such superset introduces new preferences in the original space, as the following example shows:\nExample 3. Consider Ω := {ω},X := {x1, x2, x3} and let ≻ be the binary relation on H×H given by\np ≻ q ⇔ (∃λ > 0)p− q = λh,\nwhere gamble h is given by h(ω, x1) := 1, h(ω, x2) := −1, h(ω, x3) := 0. Then ≻ is a preference relation, and the set C it induces is given by\nC = {(a,−a, 0) : a > 0},\nwhere in order to simplify the notation we use the vector (α1, α2, α3) to refer to (f(ω, x1), f(ω, x2), f(ω, x3)). It follows from Example 2 that this preference relation satisfies axioms A1, A2 and A3, but not sA3.\nNow, if R1 is a set of strictly desirable gambles that includes the natural extension R of C and P 1 is the coherent lower prevision it induces, then it must be P 1(f) > 0 for every f ∈ C. This means that the credal set M(P 1) is a closed subset of\nM := {P : (∀f ∈ C)P (f) > 0}.\nLet P be a linear prevision on L(Ω × X ), and let p1 := P ({ω, x1}), p2 := P ({ω, x2}), p3 := P ({ω, x3}). Then it follows that P (f) > 0 for all f ∈ C if and only if p1 > p2.\nLet us show now that for any closed set M(P 1) ⊆ M, the set {f ∈ A : P 1(f) > 0} is a strict superset of C, from which it will follow that the set R1 of strictly desirable gambles associated with P 1 will induce more preferences than those encompassed by ≻.\nTo see that this is indeed the case, assume ex-absurdo that {f ∈ A : P 1(f) > 0} coincides with C. Then given δ > 0, for the gamble g := (1 + δ,−1,−δ) it must hold that P 1(g) ≤ 0. This implies that there is some P ∈ M(P 1) ⊆ M such that 0 ≥ P (g) = p1 − p2 + δ(p1 − p3). Since we know that p1 > p2, it must be the case that p1 < p3, whence δ ≥\np1−p2 p3−p1 . Moreover, since we can make the positive number δ as close to 0 as we want, this means that for every natural number n there is some Pn := (pn1 , p n 2 , p n 3 ) in M(P 1) with p n 3 − p n 1 > 0 such that\n1 n ≥ pn1 − p n 2\npn3 − p n 1\n. (15)\nBut the set M(P 1) is compact in the metric space associated with the Euclidean topology, so it is also sequentially compact. Thus, the sequence (Pn)n∈N has a convergent subsequence to some P ′ := (p′1, p ′ 2, p ′ 3). From Eq. (15) it follows that p′1 − p ′ 2 = 0, and this is a contradiction with P\n′ ∈ M. This shows that the set of strictly desirable gambles associated with any closed subset of M will include some\ngamble in A \\ C and therefore will not induce the same preferences. ♦\nOne issue in the example above is that the preference relation ≻ satisfies A3 but not sA3. Indeed, when ≻ is strongly Archimedean, we can always guarantee the existence of an open superset of R, as the following theorem shows:\nTheorem 20. Let ≻ be a coherent preference relation on H × H satisfying sA3. Assume Ω is finite, and let R be given by (14). Then there is a set of strictly desirable gambles R1 that includes R.\nMoreover, under strong Archimedeanity there are cases where we can find sets of strictly desirable gambles that include R and that introduce no new preferences in the original space:\nExample 4. Consider Ω := {ω},X := {x1, x2, x3} and let ≻ be the binary relation on H×H given by\nf ≻ g ⇔ f(ω, x1) < g(ω, x1), f(ω, x2) < g(ω, x2).\nThen ≻ is a coherent preference relation, and the set C it induces is given by\nC = {(a, b,−a− b) : max{a, b} < 0}.\nNow, if R1 is a set of strictly desirable gambles that includes the natural extension R of C and P 1 is the coherent lower prevision it induces, then it must be P 1(f) > 0 for every f ∈ C. This means that the credal set M(P 1) is a closed subset of\nM := {P : (∀f ∈ C)P (f) > 0}.\nLet P be a linear prevision on Ω × X , and let p1 := P ({ω, x1}), p2 := P ({ω, x2}). Then for every a, b ∈ R, if we take f on Ω ×X given by f(ω, x1) := a, f(ω, x2) := b, f(ω, x3) := −a− b, it holds that P (f) = a(2p1 + p2 − 1) + b(2p2 + p1 − 1). From this it follows that P ∈ M if and only if\nmin{2p1 + p2 − 1, 2p2 + p1 − 1} < 0,max{2p1 + p2 − 1, 2p2 + p1 − 1} ≤ 0.\nLet us show now that there is a closed convex set M(P 1) ⊆ M such that the set {f ∈ A : P 1(f) > 0} agrees with C, from which it will follow that the set R1 of strictly desirable gambles associated with P 1 induces the same preferences on the original space as relation ≻.\nTo see that this is indeed the case, consider Q1 := (q11 , q 1 2 , 1 − q 1 1 − q 1 2), Q2 := (q 2 1 , q 2 2 , 1 − q 2 1 − q 2 2) in M such\nthat 2q11 + q 1 2 − 1 < 0 = 2q 1 2 + q 1 1 − 1 and 2q 2 2 + q 2 1 − 1 < 0 = 2q 2 1 + q 2 2 − 1.\nThen given f := (a, b,−a− b) ∈ A \\ C, it holds that max{a, b} ≥ 0. Then\na ≥ 0 ⇒ Q1(f) = a(2q 1 1 + q 1 2 − 1) ≤ 0, b ≥ 0 ⇒ Q2(f) = b(2q 2 2 + q 2 1 − 1) ≤ 0,\nand as a consequence given P 1 := min{Q1, Q2}, it holds that P 1(f) ≤ 0 for every f ∈ A \\ C. Thus, M(P 1) is a closed convex subset of M satisfying that {f ∈ A : P 1(f) > 0} = C. ♦\nIt is an open problem at this stage to determine if this is the case for any coherent preference relation that is strongly Archimedean. Our conjecture is that this will hold, because of the following result:\nProposition 21. Assume Ω is finite, and let ≻ be a coherent preference relation on H ×H. Then ≻ satisfies sA3 if and only if C is an open subset of A."}, {"heading": "7. Decomposition and completeness of preferences", "text": "Thanks to the previous results, we have the possibility to represent coherent preference relations equivalently through coherent sets of desirable gambles in L(Ω × X ). Now we exploit this equivalence in order to analyse and discuss the most important special cases that allow us to simplify a decision-theoretic problem through some type of decomposition of preferences in a part made of beliefs and another of perceived values (of consequences).\nIn fact, without any further assumption, a decision-theoretic problem, represented by a coherent set R in L(Ω×X ), cannot actually be decomposed while maintaining the same information represented by R. This is not to say that we cannot profitably deal with the problem: we can for instance compute lower and upper (possibly conditional) previsions for any gamble in L(Ω ×X ); we can compute in particular probabilities separately from utilities and vice versa. But the point is that we cannot represent your preferences by coupling two separate models for belief and value unless we do some assumption of the type that we illustrate in the next section."}, {"heading": "7.1. State independence", "text": "Let us start by the following definition of irrelevance for coherent sets of gambles.\nDefinition 26 (Ω-X irrelevant product for gambles). A coherent set of gambles R on Ω × X is called an ΩX irrelevant product of its marginal sets of gambles RΩ ,RX if it includes the set\nR|Ω := {h ∈ L(Ω ×X ) : (∀ω ∈ Ω)h(ω, ·) ∈ RX ∪ {0}} \\ {0}. (16)\nThese products have been introduced, in another context and for lower previsions, in [18]. The rationale of the definition is the following. First, the requirement that h(ω, ·) ∈ RX ∪ {0} is there to say that the inferences conditional on {ω} encompassed by R|Ω should yield the marginal set RX . This is just a way to formally state that ω is irrelevant to X . The same is repeated for every ω, so that R|Ω can be regarded as being born out of aggregating all the irrelevant conditional sets. Given that Ω is possibly infinite, it should not be surprising that such a definition of R|Ω entails an assumption of conglomerability. We do it because the minimal set R we would obtain without this assumption may\nbe too weak to produce informative preferences (see [18, Section 5.1] for more details). Finally, that R contains R|Ω is imposed to make sure that R is a model coherent with the irrelevance of beliefs on values.\nIn the context of preferences, if R satisfies Definition 26 we say it models state independent preferences. The least-committal among these models is trivially given by the following:\nProposition 22. Given two marginal coherent sets of desirable gambles RΩ,RX , their smallest Ω-X irrelevant product is given by the marginal extension of RΩ and R|{ω} := RX (for all ω ∈ Ω), that is:\nR̂ := {g + h : g ∈ RΩ ∪ {0}, h ∈ R|Ω ∪ {0}} \\ {0}. (17)\nDefinition 26 and Eq. (17) represent our main proposal to model state-independent preferences, for two reasons. One the one hand, as discussed above, we think that it is important that R|Ω is included in the set that models your preferences. On the other, it follows from our interpretation of such a set, in Section 5, that updating is meaningful only if applied to elements of Ω, and therefore state independence should be an asymmetric notion (that is, we should not consider updating on X ).\nOn the other hand, symmetric notions are usually considered in the literature and hence we introduce some symmetric notions as well so as to lay the ground for a connection with former proposals (which we shall deepen in Section 8.1 when we consider the special case of lower previsions):\nDefinition 27 (Independent product for gambles). A coherent set of gambles R on Ω ×X is called an independent product of its marginal sets of gambles RΩ ,RX if it includes R|Ω and R|X , where\nR|X := {h ∈ L(Ω ×X ) : (∀x ∈ X )h(·, x) ∈ RΩ ∪ {0}} \\ {0}. (18)\nThese products were studied for finite spaces and several variables in [5]. Our formulation given above is an extension of the proposal in that paper. Note that the above conditions hold in particular when R includes R|Ω and\n(∀ω ∈ Ω)R|{ω} = RX , (19)\n(∀x ∈ X )R|{x} = RΩ; (20)\nthis is closer to the formulation in [5], and it is not required in general in the definition above. An independent product models state-independent preferences given that it includes the weakest Ω-X irrelevant product. The smallest, or least-committal, independent product of two sets is given by the following proposition, whose proof is analogous to that of Proposition 22:\nProposition 23 (Independent natural extension). Let RΩ,RX be two marginal coherent sets of desirable gambles and let R|Ω,R|X be given by Eqs. (16)–(18). Then the independent natural extension of RΩ ,RX is given by:\nRΩ ⊗RX := {g + h : g ∈ R|X ∪ {0}, h ∈ R|Ω ∪ {0}} \\ {0}.\nIt is the least committal model, in other words, for which your beliefs on Ω are independent of your values of X , and that moreover satisfies conglomerability with respect to Ω.\nWe need the independent natural extension in particular to be able to define another type of independent product, which is more informative than the former:\nDefinition 28 (Strong product for gambles). The strong (independent) product of marginal coherent sets RΩ ,RX is defined as\nRΩ ⊠RX := ∩{DΩ ⊗DX : RΩ ⊆ DΩ maximal and RX ⊆ DX maximal}.\nThe strong product can be regarded as the extension of a set of stochastically independent models to desirable gambles. We shall see more about the strong product in Section 8, when we see the analogous notions in terms of coherent lower previsions."}, {"heading": "7.2. State dependence", "text": "We say that a set of desirable gambles R models state-dependent preferences when it does not satisfy the conditions in Definition 26, i.e., when it does not include the set R|Ω derived from its marginal RX and the assumption of Ω-X irrelevance. This may arise for instance when the conditional sets of gambles R|{ω},R|{x} that R induces do not satisfy Eq. (19)."}, {"heading": "7.3. Completeness", "text": "So far we have discussed the general case of coherent sets of gambles R without discussing in particular the socalled complete or maximal coherent sets for which it holds that f /∈ R ⇒ −f ∈ R for all f ∈ L, f 6= 0. These correspond to precise models for which there is never uncertainty as to whether you accept or reject a gamble, and that are closely related to linear previsions. Given the equivalence between coherent sets of gambles in L(Ω × X ) and coherent preferences in Hz × Hz , discussing the case of maximal sets is a tantamount to discussing the case of complete preferences.\nDefinition 29 (Completeness of beliefs and values for gambles). A coherent set of desirable gamblesR ⊆ L(Ω×X ) is said to represent complete beliefs if RΩ is maximal. It is said to represent complete values if RX is maximal. Finally, if R is maximal, then it is said to represent complete preferences.\nThe rationale of this definition is straightforward: when we say, for instance, that R represents complete beliefs, we mean that you are never undecided between two options that are concerned only with Ω. The situation is analogous in the case of complete values. Finally, the case of complete preferences, the definition is just the direct application of the definition of maximality. Not surprisingly, if a coherent set of desirable gambles represents complete preferences, then it represents both complete beliefs and complete values. This follows immediately from [5, Proposition 22]. On the other hand, the converse does not hold in general: we can construct a non-maximal coherent set of desirable gambles R ⊆ L(Ω ×X ) that represents both complete beliefs and values, and this also in the case of finite Ω. See [5, Appendix A1] for an example.\nNote that a set of complete preferences need not represent state-independent preferences: to see this, it suffices to consider the set\n{g + h : g ∈ RΩ ∪ {0}, h(ω, ·) ∈ R|{ω} ∪ {0}, ∀ω ∈ Ω} \\ {0}\nwhere RΩ and R|{ω} are maximal for all ω ∈ Ω but R|{ω} 6= RX for some ω: we end up with a coherent set of statedependent preferences, and any maximal superset will represent complete preferences that will be state-dependent (since it will not include the set R|Ω given by Eq. (16) due to maximality)."}, {"heading": "8. In terms of lower previsions", "text": "In this section, we shall consider the particular case where your preferences are modelled by means of a coherent lower prevision P on L(Ω ×X )."}, {"heading": "8.1. State independent preferences", "text": "Let us define the products we shall be concerned with.\nDefinition 30 (Ω-X irrelevant product for lower previsions). Given marginal coherent lower previsions PΩ, PX , let\nP (f |{ω}) := PX (f(ω, ·)),\nfor all f ∈ L(Ω ×X ), and\nP (·|Ω) := ∑\nω∈Ω\nI{ω}P (·|{ω}).\nThen a coherent lower prevision P on L(Ω ×X ) is called an Ω-X irrelevant product of PΩ, PX if\nP ≥ PΩ(P (·|Ω)).\nIn this case we also say that P models state-independent preferences.\nHere P (·|Ω) plays the role that was of R|Ω in desirability; it is a mathematical tool that conglomerates all the conditional information. The concatenationPΩ(P (·|Ω)) is a marginal extension: in particular, it is the least-committal coherent Ω-conglomerable model built out of the given marginals and the assessment of irrelevance that defines P (·|Ω) through PX . Every coherent lower prevision that dominates PΩ(P (·|Ω)) is compatible with the irrelevance assessment but is also more informative than the marginal extension. Let us remark it with the following trivial proposition:\nProposition 24. Given two marginal coherent lower previsions PΩ , PX , their smallest Ω-X irrelevant product is given by the marginal extension\nPΩ(P (·|Ω)).\nAs in the case of desirability, we can define more precise irrelevant products. Among them there are the independent products:12\nDefinition 31 (Independent product for lower previsions). Consider marginal coherent lower previsions PΩ, PX . We say that a coherent lower prevision P on L(Ω × X ) is an independent product of PΩ, PX if it is both an ΩX irrelevant product and an X -Ω irrelevant product (this is defined analogously to the previous one).\nThe weakest independent product is again called the independent natural extension (see [5, 18] for more information). The, more informative, strong (independent) product is simply defined as a lower envelope of stochastic products:\nDefinition 32 (Strong product for lower previsions). Let PΩ, PX be two marginal coherent lower previsions. Their strong (independent) product is defined for every f ∈ L(Ω ×X ) as\nPΩ ⊠ PX (f) := min{PΩ(PX (f |Ω)) : PΩ ≥ PΩ, PX ≥ PX },\nwhere\nPX (·|Ω) := ∑\nω∈Ω\nI{ω}P (·|{ω}) and (21)\n(∀f ∈ L(Ω ×X ))P (f |{ω}) := PX (f(ω, ·)).\nRemark 5 (State independence and dynamic consistency). It is important at this point to consider the relation of state independence to dynamic consistency (as introduced in Remark 1). In particular, if state-independent preferences are modelled by the Ω-X irrelevant product of the marginals, then the weakest combination of the marginal PΩ and the conditional information P (·|Ω) (obtained through irrelevance) is just the marginal extension P := PΩ(P (·|Ω)), as stated by Proposition 24. This means that the marginal extension P implements a complete separation of utilities from probabilities:13 not only states of nature are irrelevant to utilities in this case, as it follows from P (·|{ω}) being constant on ω ∈ Ω, but in addition the joint model P of preferences can be recovered through the marginal and the conditional models alone: P = PΩ(P (·|Ω)), thanks to dynamic consistency. Taking into account Eq. (8), the irrelevant product corresponds to the lower envelope of the set\nM1 := {PΩ(P (·|Ω)) : PΩ ∈ MΩ, (∀ω ∈ Ω)P (·|{ω}) ∈ MX }, (22)\nwhere we are denoting by MX the credal set associated with PX , which, due to the irrelevance assumption, agrees with the one determined by P (·|{ω}) for every ω ∈ Ω. Note that in the set M1 the linear prevision P (·|{ω}) may vary with different ω, because the irrelevance assumption is made on the lower envelopes P (·|{ω}) only.\nIn case we use an Ω-X irrelevant product P that is not minimal, what we get is the weaker relation P ≥ PΩ(P (·|Ω)). This still implements the idea that states be irrelevant to utilities; however, in order to recover P from PΩ and P (·|Ω), we need in addition to describe the specific way in which P dominates PΩ(P (·|Ω)). This information ‘logically’ connects the linear previsions that dominate the marginal and the conditionals, thus preventing these models from being completely separate.\nA particularly important dominating model is the strong product, so it is useful to address also this case in some detail. Observe first that if P is a linear prevision with marginals PΩ, PX , then it corresponds to an irrelevant product if and only if it agrees with the marginal extension PΩ(P (·|Ω)), where P (f |{ω}) := PX (f(ω, ·)) for every ω ∈ Ω. This is also the outcome of a trivial assumption of dynamic consistency. But it helps to give a clearer view of the\n12The following definition is equivalent to the one established in [18, Definition 4] in the context of this paper, where one of the referential spaces is finite; we refer to [18] for a more general study of independent products.\n13Not so the other way around: remember that we are focusing on an asymmetric notion.\nmeaning of strong independence: it corresponds to the case where we consider only linear irrelevant products in set M1 above, so that Eq. (22) becomes\nM2 := {PΩ(P (·|Ω)) : PΩ ∈ MΩ, (∀ω, ω ′ ∈ Ω)P (·|{ω}) = P (·|{ω′}) ∈ MX }.\nHistorically, the rationale behind such a choice is that of sensitivity analysis: under this interpretation, a set such as M1 is regarded as a way to represent knowledge about a ‘true’, but partly unknown, linear model; and once the true model is supposed to have a certain property, such as that it is an irrelevant product, then all the linear models candidate to be the true one, which are the elements of M1, should satisfy that property too.\nNote moreover that under this interpretation, the strong product does satisfy a minimality property: it is the leastcommittal independent product of the marginals for which all the dominating linear previsions are irrelevant extensions. It is arguable that this is the proper notion of minimality to use under sensitivity analysis. As a consequence, under this interpretation, the strong product is a dynamically consistent model and hence it leads to complete separation too. This would not be the case under the more general behavioural interpretation of coherent lower previsions that we have adopted in this paper.\nWe end up this remark by pointing out that all these considerations can be made in a very similar way also for sets of desirable gambles; we have opted to describe them in the case of lower previsions only to keep the discussion more accessible. ♦"}, {"heading": "8.2. State dependent preferences", "text": "Similarly to the case of desirable gambles, when we model your beliefs by means of coherent lower previsions, we define state dependence as the lack of state independence: this means that if we consider a coherent lower prevision P with marginals PΩ , PX , it is said to model state-dependent preferences when it does not dominate the concatenation PΩ(P (·|Ω)), where P (·|Ω) is derived from PX by an assumption of epistemic irrelevance.\nOne particular case where we may obtain state dependence is when PΩ({ω}) > 0 for every ω but the conditional natural extension E(·|Ω) of P does not coincide with the one that PX induces by means of epistemic irrelevance. Then we may have that P ≥ PΩ(E(·|Ω)) but that P PΩ(P (·|Ω)). We refer to [18, Example 8] for an example."}, {"heading": "8.3. Completeness", "text": "The definition of completeness for lower previsions is a rephrasing of that for desirable gambles:\nDefinition 33 (Completeness of beliefs and values for lower previsions). A coherent lower previsionP onL(Ω×X ) is said to represent complete beliefs if its marginal PΩ is linear. It is said to represent complete values if its marginal PX is linear. Finally, if P is linear, then it is said to represent complete preferences.\nThere are a number of equivalent ways in which we can characterise the linearity of previsions in terms of the corresponding set of desirable gambles:\nProposition 25. Let P be a coherent lower prevision on L and R its corresponding coherent set of strictly desirable gambles. The following are equivalent:\n(i) P is a linear prevision.\n(ii) If f /∈ R then ε− f ∈ R for all ε > 0.\n(iii) R is negatively additive, meaning that f, g /∈ R ⇒ (∀ε > 0)f + g − ε /∈ R.\n(iv) For any event A, any α ∈ (0, 1) and real numbers µ1 > µ2, either αµ1 + (1 − α)µ2 ≻ µ1IA + µ2IAc or µ1IA + µ2IAc ≻ α′µ1 + (1− α′)µ2 for every α′ < α, where ≻ is the coherent preference relation on gambles associated with R by Definition 23.\nThe equivalence of (i) and (ii) has been proven in [17, Proposition 6]. It clearly shows that the linearity of previsions, once written in terms of gambles, is mathematically very similar to the maximality of a set of gambles. The characterisation of (i) through negative additivity in (iii) is essentially obtained through a rewriting of (ii); yet, in this form it shows its resemblance to the notion of negative transitivity that has been used to deduce the completeness of\nvalues [12, Axiom A.6]. Finally, the characterisation of (i) in (iv) is the analog of [12, Axiom A.7] used to derive the completeness of beliefs. So it is interesting to see that two notions that have been used with separate aims in the literature are actually the same notion once we represent utilities by coherent lower previsions besides probabilities. Indeed, we can focus on any of those formulations to immediately deduce characterisations for all the cases of completeness in preferences. By choosing negative additivity, we obtain the following:\nProposition 26. Consider a coherent preference relation ≻ on gambles represented by a coherent lower prevision P on L(Ω × X ), whose corresponding coherent set of gambles is denoted by R. Let RΩ ,RX denote its marginals. Then:\n(i) P represents complete beliefs ⇔ RΩ is negatively additive.\n(ii) P represents complete values ⇔RX is negatively additive.\n(iii) P represents complete preferences ⇔R is negatively additive."}, {"heading": "9. State independence means strong product in former proposals", "text": "In the previous sections we have discussed the questions of state independence to some length and proposed ways to address it through notions of irrelevance or independence for sets of probabilities. Now it is time to detail how our proposal relates to previous ones that have been made under incomplete preferences as well. We focus in particular on Galaabaatar and Karni’s work [12], which provides quite a general treatment and is easier to put in correspondence with ours. They obtain state independence in particular by means of [12, Axioms A.4 and A.5]. The first of these two axioms is also called the dominance axiom or the sure thing principle. On the other hand, [12, Axiom A.5] corresponds to Eq. (23) in the following:\nTheorem 27. Let P be a coherent lower prevision on L(Ω×X ) and let PΩ, PX denote the marginals of P . For any PX ≥ PX , we define PX (·|Ω) by means of Eq. (21). Then\nP ≤ P (PX (·|Ω)) for every PX ≥ PX (23)\nif and only if P ≤ PΩ ⊠ PX .\nThus, it turns out that [12, Axiom A.5] is just imposing that preferences are represented by a coherent lower prevision P that is at most as precise as the strong product of the marginal models for probabilities and utilities. In other words, the greatest coherent lower prevision P with marginals PΩ, PX satisfying (23) is given by their strong product.\nNext we give an alternative characterisation of the strong product as the least informative model satisfying (our reformulation of) [12, Axiom A.4]. For every ω ∈ Ω and f ∈ L(Ω ×X ), let us define the X -measurable gamble\nfω : Ω ×X → R\n(ω′, x) 7→ f(ω, x).\nThe reformulation of [12, Axiom A.4] in the language of coherent lower previsions is the following:\n(∀g, f ∈ L(Ω ×X ))((∀ω ∈ Ω)P (g − fω) ≥ 0 ⇒ P (g − f) ≥ 0). (24)\nLet us show first of all that this condition can be used to characterise independent products in the linear case:\nLemma 28. A linear prevision P satisfies (24) if and only if it is an independent product of its marginals. Moreover, Eq. (24) is preserved by taking lower envelopes.\nIn order to extend Lemma 28 to the imprecise case, we prove that (i) the result holds when both Ω,X are finite, and that (ii) the case of Ω infinite can be approximated as a limit of finite sets. The next proposition addresses the first case.\nProposition 29. Let Ω,X be finite spaces, and let P be a coherent lower prevision on L(Ω×X ). Then P satisfies (24) if and only if it is a lower envelope of linear previsions satisfying\n(∀ω ∈ Ω)(∀x ∈ X )P ({(ω, x)}) = P ({ω})P ({x}). (25)\nIt is an open problem at this stage whether a result akin to Proposition 29 holds when one of the spaces is infinite. The second case to be dealt with is done through the next:\nTheorem 30. Consider a coherent lower prevision P on L(Ω × X ) with marginals PΩ, PX . If P satisfies Eq. (24), then it dominates the strong product PΩ ⊠ PX .\nWe see then that the strong product is the smallest (i.e., most conservative) coherent lower prevision with given marginals that satisfies (24). We have thus two characterisations of the strong product. As we shall see, if we put them together we can express the strong product as the only coherent lower prevision that satisfies (23) and (24) simultaneously.\nBefore establishing it, we are going to see that each of the conditions can be used to characterise stochastic independence in the case of complete preferences. Remember that a coherent lower prevision P on Ω × X models complete preferences when it is a linear prevision, i.e., when P (f) = −P (−f) for every f ∈ L(Ω × X ). The marginals PΩ , PX of a linear prevision P on L(Ω×X ) are also linear previsions on L(Ω),L(X ). Conversely, if you have complete preferences and they are compatible with some state independent model, then there is only one possible state independent model: the concatenation PΩ(PX (·|Ω)). This coincides with the only independent product of these marginals, as we see in the following result, whose proof is omitted since it is a direct consequence of Theorem 27 and Lemma 28. Note that it holds also for the case where Ω is infinite.\nCorollary 31. Let P be a linear prevision on L(Ω ×X ). The following are equivalent:\n(i) P is the product of its marginals.\n(ii) P satisfies (23).\n(iii) P satisfies (24).\nFinally, our main result can be summarised by the following theorem, which follows immediately from Theorem 27 and Lemma 28 for the direct implication, and from Theorems 27 and 30 for the converse one.\nTheorem 32. Let P be a coherent lower prevision on L(Ω ×X ). Then P is the strong product of its marginals if and only if it satisfies (23) and (24).\nLet us briefly comment on this result. What we have obtained is that the notion of state independence is implicitly implemented in [12] by the strong product. We find this interesting for several reasons:\n◦ It provides a clear bridge to a well-known notion of independence used in imprecise probability.\n◦ It also shows that the two conditions ([12, Axioms A.4 and A.5]) used to formalise state independence in [12], can be employed to that end also when Ω is infinite.\n◦ It implies that there are weaker and potentially better notions than the strong product that can be employed to model state independence, such as the weakest independent products of Sections 7.1 and 8.1.\n◦ Turning the viewpoint around, the correspondence with the strong product can be regarded as a way to provide a behavioural interpretation of the strong product (so far, the strong product appears to have been justified only through sensitivity analysis), in particular by regarding it as the weakest model that satisfies the sure thing principle, that is, Eq. (24)."}, {"heading": "10. The full Archimedean case", "text": "We know from Section 4 that the case of Archimedean preferences is equivalent to that of a coherent set of strictly desirable gambles R ⊆ L(Ω × X ). Taking into account the correspondence between strict desirability and lower previsions, we deduce that Archimedean preferences can be equivalently represented by means of a set of linear previsions.\nDespite the usefulness of this outcome, there are important limitations it is subject to. Too see this, assume that there is ω ∈ Ω such that P ({ω}) = 0 (it will often be the case even that P ({ω}) = 0 if Ω is infinite). Then the conditional natural extension of P given ω, given by Eq. (7), will be vacuous. In other words, it turns out that your assumption to get to knowω renders your utilities vacuous. The problem here is that P is too much of an uninformative model to be able to represent non-vacuous conditionals in the presence of conditioning events with zero probability.\nAnd yet, it is entirely possible that your (unconditional) preferences are represented by a coherent lower prevision P on L(Ω×X ), and at the same time that your utility model conditional on a state of natureω is given by a conditional lower prevision P (·|{ω}) that is different from the conditional natural extension of P given ω (see [33, Appendix F4]). This is to say that despite a pair such as P , P (·|Ω) is only made up of probabilities and utilities, there is no single coherent lower prevision that is equivalent to it; that is, there is no set of strictly desirable gambles on L(Ω ×X ) that is equivalent to it, and hence there is no Archimedean relation either. What we argue, in other words, is that there are useful preferences relations, which are expressed only via (a collection of) sets of linear previsions, that are not characterised by Axiom wA3 and therefore that the Archimedean axiom is too restrictive.\nIf we focus the attention on the case that Ω is finite, we immediately have a characterisation of the preference relations that can be assessed by relying only on sets of linear previsions:\nDefinition 34 (Fully Archimedean preferences—finite Ω). Given a coherent preference relation ≻ on Hz × Hz , with Ω finite, we say that relation ≻ is fully Archimedean if the corresponding coherent set of desirable gambles R ⊆ L(Ω ×X ) satisfies the following condition:\nf ∈ R ⇒ (∃ε > 0)IS(f)(f − ε) ∈ R, (26)\nwhere S(f) := {(ω, x) ∈ Ω ×X : f(ω, x) 6= 0} is the support of f .\nIn fact, it has been shown in [17, Theorem 15] that a coherent set of desirable gambles R satisfies (26) if and only if it is equivalent to a collection of separately coherent conditional lower previsions. The remaining coherent sets of desirable gambles, those that do not satisfy (26), are in a sense the ‘purest’ non-Archimedean sets, since there is no way to represent them equivalently by collections of closed convex sets of linear previsions. Example 1 describes an instance of this situation.\nNote that Eq. (26) can be interpreted quite simply: what is required there is a property analogous to strict desirability but extended to the conditional case, for all events that are supports of gambles in R. In other words, Eq. (26) is still a continuity property as the Archimedean one, but it is extended so as to be satisfied by all the relevant conditional inferences, not only the unconditional ones, as in the case of wA3.\nWith regard to the case that Ω is infinite, it is possible to generalise (26) to such a situation:\nDefinition 35 (Full strict desirability). Let R be a coherent set of gambles. We say that it is fully strictly desirable if it is the natural extension of a set of gambles R′ satisfying Eq. (26).\nThe term above means that R keeps the same information as a set of conditional lower previsions. This will be a consequence of the following result:\nProposition 33. Consider a coherent set of desirable gambles R on L(Ω ×X ). Let\nR1|B := {f ∈ R : f = Bf, inf S(f) f > 0} ∪ {0},\nR2|B := {f ∈ R : f = Bf, (∃ε > 0)B(f − ε) ∈ R},\nR̃|B := {f + g : f ∈ R1|B, g ∈ R2|B}, (27)\nfor every set B ⊆ Ω ×X , and R̃ := ∪B⊆Ω×X R̃|B.\nThen R is the natural extension of R̃ if and only if R is fully strictly desirable.\nAs a consequence, we have the following:\nTheorem 34. Let (P (·|Bi))i∈I be a family of coherent conditional lower previsions satisfying\n(∀J ⊆ I, |J | < +∞)(∀j ∈ J)(∀fj ∈ L(Ω ×X )) sup ω∈∪j∈JBj\n  ∑\nj∈J\nBj(fj − P (fj |Bj))\n  (ω) ≥ 0, (28)\nand let R be the natural extension of ∪i∈IR̃|Bi, where\nR1|Bi := {Bif : inf S(f) f > 0} ∪ {0}\nR2|Bi := {Bi(f − P i(f |Bi) + ε) : f ∈ L, ε > 0}\nR̃|Bi := {f1 + f2 : f1 ∈ R1|Bi, f2 ∈ R2|Bi}.\nThen R is a fully strictly desirable set of gambles.\nIn other words, if a family of coherent conditional lower previsions satisfies the regularity condition (28), then there is always a fully strictly desirable coherent set that is equally expressive to them, in the sense that each inference that we can do from the family of conditionals can be done from the set, and vice versa. As a consequence, Theorem 34 generalises [17, Theorem 15].\nLet us show next that for finite possibility spaces, Definition 35 can be simplified:\nProposition 35. If Ω is finite, then the natural extension of a set of gambles satisfying Eq. (26) also satisfies (26). As a consequence, a coherent set R is fully strictly desirable if and only if it satisfies (26).\nLet us show that this result does not hold in general on infinite spaces:\nExample 5. Let our possibility space be the set of natural numbers, Bn := {2n− 1, 2n} for n ≥ 1, and P (·|Bn) the uniform probability distribution. Consider the set of gambles R′ := ∪n∈NR|Bn, where R|Bn is defined by Eq. (6). It is easy to prove that R′ satisfies condition (26). Its natural extension is given by\nR := {f 6= 0 : (∃J ⊆ N finite)((∀j ∈ J)(P (f |Bj) > 0) and ((∀n /∈ J)(Bnf ≥ 0)))}.\nTo see that R does not satisfy Eq. (26), consider the gamble f ∈ R given by f(1) := −1, f(2) := 2, f(n) := 1 n for every n ≥ 3. Then there is no ε > 0 such that f − ε belongs to R, because for every ε > 0 there is some natural number nε such that (f − ε)(m) < 0 ∀m ≥ nε. ♦\nTo summarise the aim of this section, what we claim is that it could be worth considering full strict desirability as a replacement of the traditional Archimedean condition (A3 or wA3), given that it fully characterises all the problems that can be expressed only through probabilities and utilities."}, {"heading": "11. Related work", "text": "The link between desirability and preference has been surfacing in the literature in a number of cases, but has apparently gone unnoticed. That it has surfaced is not surprising, because the theoretical study of preferences based on the mixture-independence axiom results in, and is worked out using, cones; cones are also the fundamental tool in desirability. That it has not been remarked and exploited explicitly, as we do in this paper, is. Perhaps the most evident case where the two theories have nearly touched each other is in Galaabaatar and Karni’s work [12]. In the next sections, we discuss this and two other main approaches in the literature that have dealt with the axiomatisation of incomplete preferences, and compare our approach with them."}, {"heading": "11.1. The work of Galaabaatar and Karni", "text": "One of the most influential works for this paper has been the one carried out by Galaabaatar and Karni (GK) in [12]."}, {"heading": "11.1.1. In short", "text": "They provide an axiomatisation of incomplete preferences for finite spaces of possibilities and outcomes. They consider a strict preference ordering on acts and use axioms that are essentially ours as well, with the difference that they impose Archimedeanity all the way through, so as to obtain representation results always based on probabilities and utilities. They consider the special cases of partial and complete separation of probabilities and utilities and also provide an axiomatisation for two particular cases of interest: those of precise utilities with imprecise probabilities (that they call Knightian uncertainty) and of precise probabilities with imprecise utilities.\nRemarkably, for their results they exploit a cone that is very similar to our set of desirable gambles R obtained out of C by dropping an outcome z ∈ Xz from consideration. The difference is that they do not assume that there is the worst outcome (so z denotes just an element of Xz in this section) but rather they assume that there is a worst act (besides a best act); and probably for this reason they just remove an arbitrary element of Xz to obtain the derived cone. This seems to be the key passage that prevents them from identifying the worst outcome with the set of positive gambles and hence to obtain an actual set of desirable gambles. Yet, the similarity of their approach to ours has allowed us to take advantage of some of their results, in particular in some key passages of Theorem 13 and Proposition 29.\nThe main differences with our work is that we have taken full advantage of desirability to work out the extension to infinite (not necessarily countable) Ω and to model non-Archimedean problems. Working directly with desirability has also allowed us to give a more primitive axiomatisation and to formulate some results in a way that is arguably more intuitive; for instance, in our approach what they call state independence is equivalently reformulated explicitly as the factorisation of joint models into marginal probability and utility models."}, {"heading": "11.1.2. A deeper view", "text": "With respect to the basic axioms, what we have called a coherent preference relation corresponds to [12, Axioms A.1 and A.3], and the Archimedean condition exactly corresponds to the one they consider in their paper (that is, [12, Axioms A.2]).\nThe first result they provide in [12, Lemma 1] is that if a preference relation is bounded, coherent and Archimedean, then it can be represented by means of a family Φ of real-valued functions on Ω ×Xz , so that for all p, q ∈ Hz:\np ≻ q ⇔ (∀φ ∈ Φ) ∑\n(ω,x)∈Ω×Xz\np(ω, x)φ(ω, x) > ∑\n(ω,x)∈Ω×Xz\nq(ω, x)φ(ω, x).\nThis has been somewhat improved in our Theorem 13: we show that a weaker version of the Archimedean condition suffices to establish the correspondence with a coherent set of strictly desirable gambles R ⊆ L(Ω ×X ). This set is in turn equivalent to a family M of finitely additive probabilities on Ω × X , and as a consequence we obtain that for all p, q ∈ Hz , denoting f := π(p), g := π(q):\np ≻ q, p⋫ q ⇔ (∀P ∈ M)P (f) > P (g), f − g ∈ R \\ L+ ⇔ f ≻ g, f 6 g.\nNote on the other hand that p⊲ q implies that f − g ∈ L+ and that f ≻ g. However, it may be that in that case the lower prevision associated with R satisfies P (f − g) = 0, meaning that P (f) = P (g) for some P ∈ M. This is an example of non-Archimedeanity that cannot be represented using closed convex sets of probabilities alone (i.e., lower previsions) and which shows once again the additional expressiveness of desirable gambles; this was mentioned already in Section 2.3.\nAnother important difference between our work and that of GK is that they assume that a preference relation is bounded by a worst and a best act. We have shown in Section 6 that the assumption of a worst act is not without consequences: although if we start with a coherent preference relation in a space without a worst act we can always extend it to a bigger space with a worst outcome, the minimal extension will never14 satisfy the Archimedean property A3, irrespectively of the notion of Archimedeanity one starts from. Moreover, in order for an Archimedean extension to exist, under the same conditions of GK, we must assume that the original relation satisfies a stronger version of A3, as Theorem 20 shows; in addition we have shown that there is not such a thing like the minimal (weak) Archimedean extension in such a situation. Note also that our axiomatisation, perhaps surprisingly, only needs the existence of the\n14Except in the trivial case where we start with a vacuous preference relation; see Theorem 16.\nworst act. Also, the related notion of objective preference in Definition 21 allows us to represent what seems to be the appropriate definition of a vacuous preference relation (see Proposition 11 and the discussion that follows it).\nIn [12, Theorem. 1], they show that a coherent and Archimedean preference relation that is moreover bounded and satisfies their so-called dominance axiom is in correspondence with a family Φ of probability-utility models. They represent these as {(ΠU , U) : U ∈ U}, where ΠU denotes the family of probability measures on Ω that is combined with a particular utility function U on X . Note that in a completely similar manner we could represent Φ as {(P,UP ) : P ∈ P}, where UP denotes the set of utility functions that is combined with a particular probability measure on Ω. This second representation is closer to the one we have provided in this paper in the case of state independence: it stresses the fact that our (possibly imprecise) utility function may rather depend on the belief model we have on the states of nature.\nWhat the dominance axiom mentioned above requires is that, for every pair of horse lotteries p, q,\n(∀ω ∈ Ω)q ≻ pω ⇒ q ≻ p,\nwhere pω is the von Neumann-Morgenstern horse lottery defined by pω(ω′, ·) := p(ω, ·) for all ω′ ∈ Ω. This axiom is analogous to our condition (24), which we have used to establish a correspondence with lower envelopes of linear products in Proposition 29.\nOn the other hand, in [12, Theorem 2] they provide conditions for the complete separation of probabilities and utilities, so that ΠU does not depend on U in the above representation. This combination of each probability measure on the set that models your beliefs on Ω with every utility function on the set that models your values of X is implicitly made by the strong product in GK. We make this explicit by Theorem 27, which provides a sufficient condition for the dominance by the strong product, by means of a property analogous to [12, Axiom A.5]; by putting it together with condition (24), we can eventually obtain a characterisation of the strong product along the lines of GK. Note, in passing, that this implies that GK’s representation of state-independent preferences is dynamically consistent provided that we opt for a sensitivity-analysis interpretation of sets of probabilities and utilities (see Remark 5).\nYet, the behavioural interpretation can often be more natural in practice. In that case, we can use weaker and more realistic ways to obtain state-independent models that are dynamically consistent. For example, we can model state independence similarly to GK but using independent products, such as the independent natural extension, as discussed in Section 8. Or we can drop the assumption that irrelevance should be symmetric between beliefs and values and move on to the weaker, and arguably more reasonable, marginal extension models of Propositions 22 and 24.\nFinally, GK also discuss the cases of precise probabilities or utilities. Their work has actually been connected to other characterisations of linear previsions in Proposition 25.\nFirst, in [12, Theorem 3] they characterise Knightian uncertainty, which corresponds to the case of imprecise probabilities and precise utilities. They show that for this it is necessary to add an axiom of negative transitivity on constant acts on Ω. We have established an analogous result in our context in Proposition 26(ii) using X -measurable gambles and the negative additivity of a coherent set of desirable gambles. Note that in our result we are allowing for an infinite Ω and we are not requiring the existence of a best act.\nConcerning precise probabilities and imprecise utilities, the characterisation in [12, Theorem 4] requires their Axiom A.7 that is analogous to condition (iii) of Proposition 26, and again our result is established also for an infinite Ω."}, {"heading": "11.2. The work by Nau", "text": "Another important work in the axiomatisation of the expected utility model with imprecise probabilities and utilities was carried out by Nau in [21]. Like GK, he considers the case of finite spaces of possibilities and outcomes; unlike them, he makes an axiomatisation of weak preferences, that is, he uses a weak relation , instead of the strict preferences (relation ≻) we have considered in this paper. He discusses this point in some detail in [21, Section 4].\nFrom the point of view of this paper, the distinction between weak and strict preferences is not too important: the reason is that there is an alternative formulation of desirability that assumes the zero gamble to be desirable, and hence implicitly defines a weak preference order (see [33, Appendix F]). In such a formulation, the convexity conditions D3, D4 are the same as before, so that we still deal with convex cones; the remaining two conditions D1, D2 are instead replaced by the following two:\nD1′. f ≥ 0 ⇒ f ∈ R;\nD2′. f 0 ⇒ f /∈ R.\nThe first makes clear that the zero gamble is desirable now, besides the positive ones. The second explicitly states that the negative gambles are not desirable; this was a consequence of D1, D2 and D4 in the original formulation.\nNow, consider a set of gambles R that satisfies D1′, D2′ and D3, D4. If we define preference as in Definition 23, by saying that f is preferred to g whenever f − g ∈ R, then what we get is a weak preference order, given that reflexivity is allowed by f − f = 0 ∈ R.\nIn other words, the original formulation lets us model strict preference but not indifference; the new one models weak, but not strict, preference.15 Other than this, the two formulations of desirability are essentially equivalent; this means that we could rewrite this paper with minor changes by using the alternative formulation together with weak preference. In particular, one of the minor changes would be related to Archimedeanity. Recall that in this paper Archimedeanity corresponds to sets of strictly desirable gambles, which are open convex cones, in the sense that they exclude the border (except for the part of the cone made up by the positive gambles). In the new formulation, Archimedeanity would correspond to closed convex cones, that is, cones that include the border.\nGoing back to Nau’s work, he imposes the existence of a best and a worst outcome (similarly to GK, with the difference that they impose best and worst acts); we refer to the previous section for a discussion of this point. In addition, he also requires that relation satisfies a continuity axiom. This axiom appears in fact to be the analog of focusing on sets of desirable gambles that include the border, that is, on the Archimedean condition for desirability in case of weak preference. He proves in [21, Theorem 2] that under these conditions, and together with the analogue of axioms A1, A2 in case of weak preference, relation can be represented by means of a family of state-dependent expected utility functions. The continuity axiom enables him in addition to obtain in some cases a representation in terms of a basis.\nThis result is similar to our basic representation theorem in terms of a coherent set of desirable gambles, or its associated coherent lower prevision P : in the finite case any linear prevision P ∈ M(P ) will be equal to P (P (·|Ω)), by total expectation (i.e., marginal extension), so that we can regard it as a state-dependent representation.\nWith respect to state independence, he studies under which conditions relation is characterised by means of a family of state-independent models, which in the language of this paper correspond to factorising linear previsions. He first obtains a representation of this type for constant von Neumann-Morgenstern lotteries only [21, Theorem 3], and then another representation for arbitrary horse lotteries in [21, Theorem 4], by means of the following axiom:\nIf p ≻ q, A αb + (1− α)z, and βb + (1− β)z B, then:\n[α′Ap+ (1 − α′)p′ α′Aq + (1− α′)q′ ⇒ β′Bp+ (1− β′)p′ β′Bq + (1− β′)q′] ,\nwhere b denotes the best act, A,B are subsets of Ω, α > 0, f ′, g′ are constant acts and α′, β′ are related by the formula\nα′ = 1 ⇒ β′ = 1 and α′ < 1 ⇒ β′\n1− β′ ≤\nαα′\n(1 − α)(1 − α′) .\nHe calls this axiom strong state-independence. In our language, the representation he obtains means that the corresponding lower prevision is a lower envelope of factorising linear previsions. It has been characterised in Proposition 29 by means of the somewhat simpler axiom (24)."}, {"heading": "11.3. The work by Seidenfeld, Schervish and Kadane", "text": "Seidenfeld, Schervish and Kadane (SSK) are the authors of one of the first axiomatisations of incomplete preferences based on a multiprior expected multiutility representation [28]."}, {"heading": "11.3.1. Overview", "text": "They study the problem for strict preference orders and impose on them Axioms A1 and A2, such as GK and we do. However, their work presents some significant departure from ours and the others we have been discussing, mainly for the following reasons:\n15In order to represent both indifference and strict preference, one needs a richer language than desirability, such as the one proposed by Quaeghebeur et al. in [24].\n◦ They allow for a countable space of rewards X and for simple lotteries defined as σ-additive probabilities on such a countable support. (The space of possibilities is assumed to be infinite but only finite partitions of Ω are eventually used, so that we can actually regard Ω as finite in their approach.)\n◦ They allow for sets of expected utilities that are not necessarily closed; therefore their representation is richer than others thanks to the additional expressiveness due to the accurate treatment of the border of such sets. These sets are convex, on the other hand.\nThese two features make SSK’s treatment substantially more complex than those of Nau or GK."}, {"heading": "11.3.2. At a deeper level", "text": "For a start, they define a special type of Archimedean axiom based on a topological structure on preferences:\ntA3. (∀n ∈ N)(pn ≻ qn)((pn)n∈N → p)((qn)n∈N → q) ⇒ (∀r ∈ H)(r ≻ p ⇒ r ≻ q)(q ≻ r ⇒ p ≻ r),\nwhere the convergence of the horse lotteries is understood as point-wise. Their motivation to do so is given through the following:\nExample 6 (Example 2.1 in [28]). Consider a trivial space of possibilities Ω with only one element and a set of three rewards: X := {z, a, b}. Here z is the worst outcome and b the best one. Acts can then be represented as simple von Neumann-Morgenstern lotteries, which depend on outcomes alone. Preferences are determined by the utility functions {uα : X → [0, 1]|uα(z) := 0, uα(b) := 1, uα(a) := α, α ∈ (0, 1)} by means of:\n(∀α ∈ (0, 1)) ∑\nx∈X\np(x)uα(x) > ∑\nx∈X\nq(x)uα(x) ⇒ p ≻ q,\nfor all p, q ∈ H. SSK show that relation ≻ satisfies Axioms A1 and A2 but it fails the Archimedean axiom A3. ♦\nThe point here is that the common Archimedean condition A3 is not suited to deal with sets of expected utilities that are informative on the border, as in the example. And since SSK want to have a representation in terms of expected utilities, then they drop A3 as inadequate to capture the situation and move on to tA3.\nHowever, there is a another possible way out: it consists in dropping the idea that we should have an expected utility representation in the case of the example. In fact, since relation ≻ of the example satisfies A1 and A2, we can use Proposition 9 to equivalently represent it by a coherent set of desirable gambles R, which is in particular given by\nR := {f ∈ L({a, b}) : (∀α ∈ (0, 1))αf(a) + f(b) > 0}.\nIt is not difficult to check that R is not a strictly desirable set; this is a direct consequence of relation ≻ failing A3, and more precisely A3′, which is equivalent to wA3 in the considered problem (see Proposition 12). This means that in our formalisation there is not the possibility to have a representation of the problem by a closed and convex set of linear previsions; yet, we can deal with it in an unproblematic way via desirability.\nWe can look at this question also in more general terms as follows. In the Conclusions of their paper, SSK mention that the border of the set of expected utilities is not something that should be sidestepped, as by taking it into proper account, one enhances the expressiveness of the models used. We are in fact very close in spirit, as well as very sympathetic, towards the underlying idea; only, we are particularly concerned with the border of the sets of desirable gambles rather than that of the sets of expected utilities. One reason for this standpoint is that the related theory looks simpler in our view; we can for instance avoid introducing the transfinite induction used by SSK. Moreover, we can formally identify our axiomatisation based on desirability with a logic, as it follows from the discussion in Section 2.1. That this is possible for SSK’s theory is unclear to us. Also, we need not be concerned with so-called null events, which are events related to zero probabilities. They are usually neglected in traditional theories and at the same time they complicate the formal development, whereas we can take them into account while treating them uniformly with others, in an implicit way. More generally speaking, our standpoint is that desirability greatly empowers a theory of incomplete preferences to gain expressiveness while keeping the overall approach and the mathematics relatively simple and straightforward.\nThis is not to make any definite claim about the relative expressiveness of a desirability-based axiomatisation and SSK’s theory, because this would need a separate investigation. We believe, for instance, that the information on the\nborder of the sets of expected utilities, which SSK can capture, can as well be captured by using desirable gambles. But turning this into a formal claim needs some careful work. On the other hand, SSK can deal with countable spaces of outcomes. This seems to be somewhat limited when they extend a partial preference relation ≻ to a total one by transfinite induction, as they can get a weak preference relation only. Related to this, they eventually obtain a notion of almost state independence through a limit argument, as actual state independence seems prevented from being obtained in their setting. On our side, we conjecture that it is possible to extend the work in this paper without major problems to a countable space of outcomes while preserving the main structure and results of the paper, but, also in this case, this has to be verified. Finally, the use of σ-additive probabilities would make it difficult to extend SSK’s approach fully to an uncountable set Ω, which is something we instead can do quite simply by desirability. At the same time, it is clear that SSK’s idea of taking advantage of the border of the set of expected utilities has been a bright idea as it considerably expands the power of a theory of preferences compared to more traditional approaches."}, {"heading": "11.3.3. Extension to the worst act", "text": "Another question of particular relevance for this paper is that SSK do not assume that best and worst act exist: they give a theorem ([28, Theorem 2]) to prove that any relation can be extended to best and worst acts, while preserving in particular their Archimedean condition tA3. This somewhat clashes with our results in Section 6, so it is useful to take some time to deepen this question. We focus on the worst act, which has been the subject of our discussion in Section 6.\nA minor consideration is that there seems to be some trouble with SSK’s Theorem 2. In particular the theorem appears to fail in case the original relation ≻ is empty. In this case all acts are incomparable to each other and, unfortunately, SSK’s definition of indifference (Definition 8) coincides with incomparability for an empty relation. This eventually leads SSK’s Definition 16 to yield the non-rational extension in which every act is preferred to every other. Yet, this problem should not be too difficult to fix; recall that Theorem 16 (point 3) shows that the empty relation is a well-solved case under wA3. On the other hand, we cannot use this result directly, given that it exploits an Archimedean condition different from tA3. It is useful to contrast the two possible solutions with the help of a simple example.\nExample 7. Consider a problem with a finite possibility space Ω and a trivial set X made by only one element (this means that we can neglect X and work only with Ω). Assume that we start with an empty relation ≻. Then Theorem 16 shows that the minimal Archimedean extension under wA3 corresponds to the vacuous set of desirable gambles R = L+. In turn, this is in a one-to-one relation, through (2), with the vacuous credal set: that is, the set of all the mass functions on Ω. This is the traditional model for the complete lack of information about Ω. The vacuous credal set is not a possible solution for SSK’s extension of the empty relation, though. The problem is originated by zero probabilities: assume that a mass functions assigns zero probability to some ω ∈ Ω; then gamble f , equal to 1 in ω and 0 everywhere else, has lower prevision equal to zero. Since f can be written as f = π(p− z) for some p ∈ Hz , then we should deduce that there is an act that is not preferred to z. We can correct for this problem by considering the open set of all the mass functions that assign positive probability to each element of Ω, which we argue should be SSK’s solution for the present case. Notice however that, strictly—or logically—speaking, this cannot be truly regarded as a vacuous credal set given that some mass functions are missing from it. ♦\nMost importantly, we can try to map the Archimedean condition tA3 into one for sets of desirable gambles. In fact, SSK’s relation ≻ satisfies axioms A1, A2, whence (provided X is finite) it is in a one-to-one correspondence with a coherent set R of desirable gambles, as it follows from Theorem 15. Moreover, from the point-wise convergences (pn)n∈N → p and (qn)n∈N → q, in tA3, we deduce that the sequence (pn − qn)n∈N converges point-wise to p − q. Then, if pn ≻ qn for every n ∈ N, it follows that π(p− q) is in the closure of a sequence of gambles in R, or, in other words, that π(p− q) is a so-called almost-desirable gamble [33, Section 3.7].16 Conversely, it is well known that any almost-desirable gamble is the limit of a sequence of desirable gambles, and therefore the almost-desirable gambles can be identified with the topological closure of set R (see [17, Proposition 4]), which we denote by R. Overall, this means that Axiom tA3 can be reformulated as follows in the context of desirability:\n16A subtlety is that almost-desirable gambles are uniform limits of gambles in R, while tA3 is based on point-wise convergence. This difference is immaterial in the present context as the two convergences coincide in a countable space Ω×X for gambles obtained through differences of acts.\ntA3′. f ∈ R, g ∈ R ⇒ f + g ∈ R.\nIn the language of [7], condition tA3′ requires that any almost-desirable gamble should be weakly desirable. We have shown in [17, Example 11] that this is not always the case, which is another way of showing that axiom tA3 is not trivial.\nInterestingly, we can use the above formulation to easily show that there are cases where there is indeed a minimal extension of a relation satisfying axioms A1, A2, tA3 to include a worst outcome:\nExample 8. Let P be a coherent lower prevision on L(Ω ×X ) such that P ({(ω, x)}) > 0 for every (ω, x) ∈ Ω ×X , and consider the relation ≻′ on H×H given by\nr ≻′ s ⇔ P (r − s) > 0.\nThis relation satisfies axioms A1, A2 and tA3. Let relation ≻ on Hz ×Hz , given by Eq. (A.1) in the Appendix, be the minimal extension of relation ≻′ to the worst outcome that satisfies axioms A1, A2.\nThen it holds that p ≻ q implies P (π(p− q)) > 0. To prove this, note that if p⊲ q, then π(p− q) ∈ L+, and then given (ω, x) ∈ Ω ×X such that π(p− q)(ω, x) > 0, it holds that\nP (π(p− q)) ≥ P (I{(ω,x)}π(p− q)(ω, x)) > 0.\nOn the other hand, if π(p− q) = r − s for some r, s ∈ H, r ≻′ s, it follows that P (π(p− q)) = P (r − s) > 0. From this it follows that if we consider a gamble f which is the limit of a sequence of gambles of the type pn− qn, n ∈ N, with pn ≻ qn, it holds that P (π(f)) ≥ 0. Using this, together with the super-additivity of P , we deduce that tA3′ holds and as a consequence relation ≻ satisfies tA3. ♦\nOne may wonder at this point what is the underlying reason that makes the minimal extension in the previous example Archimedean according to tA3 and non-Archimedean in the sense of wA3 (recall that the latter means that there is no open coherent set of desirable gambles that can represent it, or, equivalently, that there is no closed set of linear previsions that can). The reason appears to be just a question of border: in fact, the example shows that it is possible to characterise the extended relation by an open set of linear previsions, all of which assign positive prevision to each gamble π(p− q) such that p ≻ q. On the other hand, the example shows that for a limit gamble like f it only holds that P (π(f)) ≥ 0. This is easy to see in a specific case, if we take the limit gamble 0 = limn→∞ π((p− z)/n), whose lower prevision is clearly zero whereas each gamble inside the limit has positive lower prevision (provided that p 6= z). This means that relation ≻ cannot be represented by a closed set of linear previsions. SSK bypass this problem by working with sets of linear previsions that need not be closed; we deal with the same problem by using coherent sets of desirable gambles that need not be strictly desirable, that is, open."}, {"heading": "12. Conclusions", "text": "Traditional decision-theoretic axiomatisations, à la Anscombe-Aumann, typically turn a problem of incomplete preferences into an equivalent convex cone C made of scaled differences of horse lotteries (on the possibility space Ω and set of outcomes X ). This cone is used as a tool to derive a representation of preferences in terms of a set of expected utilities through the Archimedean axiom.\nIn this paper we have argued that convex cones should be fully given the primary role in the axiomatisation of incomplete preferences. We have shown as the objects making up cone C can, with a simple transformation, be directly regarded as gambles (i.e., bounded random variables f : Ω × X → R) a subject finds acceptable, or desires. This formally turns cone C into an equivalent convex cone R of desirable gambles, as defined in the literature of imprecise probability.\nThe implications on the decision-theoretic side appear far-reaching: we have discussed how a decision-theoretic problem can be formulated exclusively in terms of desirable gambles, preference being a derived notion; and that we can deal with non-Archimedean problems by directly working on cone R using the operations it comes equipped with. Using these operations, we have given new, simple formulations of state independence and completeness directly at the level of the cone, which then hold also for non-Archimedean problems. In the Archimedean case, these formulations are naturally specialised to the set of expected utilities induced by the cone. In this case, we have shown in particular\nthat the traditional notion of state independence is eventually based on the idea of stochastic independence; and that we can actually take advantage of this insight to propose much a weaker notion of state independence exploiting the literature of imprecise probability. We have also taken a close look at the Archimedean axiom itself using desirability: we have shown that it can profitably be weakened, which has allowed us to work with uncountable possibility spaces; on the other hand, we have given a new condition, full Archimedeanity, that is needed to truly capture all the problems that can be represented through sets of expected utilities. In doing so, we have uncovered the importance of the worst act in a preference relation, in order to make the bridge to desirability; and shown that the best act is actually unnecessary for the theoretical development. We have also shown that it is always possible to extend a preference relation in a minimal way to one with a worst act, but not in an Archimedean way.\nWe can read the results also in the other way around, so as to find out the implications of this work for imprecise probability. We mention just two of them. Most importantly, the extension of desirability we have proposed here to vector-valued gambles (that is, gambles f : Ω×X → R rather than f : Ω → R) can be regarded as the foundation of the theory of desirability generalised to deal with imprecise and non-linear utility, which is done here for the first time. Another new outcome is the characterisation of the strong product as the weakest model that satisfies the sure thing principle. The strong product defines a notion of independence obtained through a set of stochastically independent models. It is a well-known and much used notion that is however widely regarded, and to some extent criticised, as lacking a behavioural interpretation (in the sense that it can only be given a sensitivity analysis interpretation). Our characterisation shows that this is actually not the case as it gives the strong product, for the first time, a clear behavioural interpretation.\nThere are a few main opportunities for research that the present work opens up. One is determined by the current limitation of the set of outcomes X to be finite. Our viewpoint is that the extension to a countable set X should be relatively easy to attain by defining a horse lottery p so as that p(ω, ·) is a countably additive probability for each ω ∈ Ω; the main reasoning line in the paper could probably be preserved by this choice, but it might be the case that some of the proofs have to be also quite substantially reworked. The passage to an uncountable set X seems to involve a different degree of complexity. The main reason is that we cannot represent the simple lottery p(ω, ·) through a countably additive probability when X is uncountable; and, on the other hand, using a finitely additive probability seems to be impractical. Therefore to properly deal with this case, one seems to have to develop ideas that may be also fundamentally different from those in the present paper.\nAnother challenge is related to the question of conglomerability. In this paper we have tried to minimise the involvement of conglomerability in the development, as it is already quite a controversial topic per se. At the moment, conglomerabiliy is used only in our definitions of state independence based on irrelevant products—removing conglomerability in this case could give rise to definitions of state independence with questionable properties. This nevertheless, the issue of conglomerability relates to many parts of the paper and there should be, in the future, work dedicated to clarify its role in this context. For instance, in the Archimedean case, our formulation leads to modelling beliefs by a set of finitely additive probabilities on Ω. In case conglomerability is considered as an essential property of a probabilistic model, then a conglomerability axiom should be added to the desirability formulation of decisiontheoretic problems, so as to make sure that only sets of probabilities with the property of being conglomerable are obtained.\nIt could be also useful to take advantage of the definition of natural extension for a set of gambles so as to give a weaker axiomatisation of incomplete preferences. The idea is that a subject would be allowed to express desirability statements only on a subset of all the possible gambles (e.g., only the gambles corresponding to von Neumann-Morgenstern lotteries); requiring that these statements avoid partial loss would be a rationality condition necessary and sufficient to extend them into a coherent set of gambles through natural extension, that is, to a coherent preference relation. In this way, we would obtain a more general and flexible assessment procedure through the use of a weaker rationality condition than coherence.\nFinally, it would be useful to evaluate the expressive power of the theory based on cones that we propose here relative to the theory by Seidenfeld et al. [28]. The interest lies in particular in the different ways the two theories cope with non-Archimedean problems: through the border of the set of expected utilities in the case of Seidenfeld et al., and through the border of the cone of gambles in ours."}, {"heading": "Acknowledgements", "text": "We acknowledge the financial support by project TIN2014-59543-P."}, {"heading": "Appendix A. Proofs", "text": "In this appendix we collect the proofs of all the results in the paper as well as a few results that are more technical and are needed for some proofs.\nProof of Lemma 7. Suppose ex-absurdo that there is ω̄ ∈ Ω such that for no x ∈ X , w(ω̄, x) = 1. Then there must be x1, x2 ∈ X such that w(ω̄, x1), w(ω, x2) ∈ (0, 1). Let ε := 12 min{w(ω̄, x1), w(ω̄, x2), 1− w(ω̄, x1), 1− w(ω̄, x2)}. Define acts p, q so that they coincide with w for all ω ∈ Ω,ω 6= ω̄, while in ω̄ they are defined by\np(ω̄, x) :=    w(ω̄, x) + ε if x = x1, w(ω̄, x)− ε if x = x2,\nw(ω̄, x) otherwise,\nq(ω̄, x) :=    w(ω̄, x)− ε if x = x1, w(ω̄, x) + ε if x = x2,\nw(ω̄, x) otherwise.\nSince by assumption it must hold that p ≻ w and q ≻ w, we deduce, thanks also to the convexity of cone C, that 0 = (p − w) + (q − w) ∈ C. This is a contradiction with the irreflexivity of the preference relation, through Proposition 4.\nProof of Proposition 9. The proof of the second point is trivial, so we concentrate on showing that R satisfies D1– D4:\nD1. Consider f ∈ L+(Ω × X ) and let λ := supω∈Ω ∑\nx∈X f(ω, x). Note that λ > 0 otherwise f would not be positive and moreover that λ < +∞ because f is bounded. Then let p ∈ Hz be defined by\np(ω, x) :=\n{ f(ω,x)\nλ if x 6= z,\n1− ∑\nx 6=z f(ω,x) λ otherwise.\nIt follows that π(λ(p− z)) = f and since p 6= z because f is positive, then p ≻ z and hence f ∈ R.\nD2. C does not contain the origin by Proposition 5 and hence 0 /∈ R.\nD3. This follows trivially from the convexity of C, again by Proposition 5.\nD4. This follows trivially from the convexity of C taking into consideration that π is a linear functional.\nProof of Proposition 10. p⊲ q ⇒ π(p− q) ∈ L+(Ω ×X ). By Proposition 9, there are p′, q′ ∈ Hz and λ > 0 such that p′ ≻ q′ and λπ(p′ − q′) = π(p− q). Applying π−12 to both sides of the equation, we get that\nλ(p′ − q′) = p− q,\nwhence λ λ+1 (p ′ − q′) = 1 λ+1 (p− q). Applying now Proposition 3, we conclude that p ≻ q.\nProof of Proposition 11. We begin with the direct implication. Assume first of all that |Xz | ≥ 3. Let u be the uniform act defined by u(ω, x) := 1/|Xz| for all ω ∈ Ω. Then fix any x′ 6= z and ε > 0 small enough so as to define act p given, for all ω ∈ Ω, by\np(ω, x) :=    u(ω, x) + ε if x = x′, u(ω, x)− ε if x = z,\nu(ω, x) otherwise.\nIt follows that p ≻ u since p⊲u. Given that also u ≻ z, we can apply the Archimedean axiom A3 to obtain that there is a β ∈ (0, 1) such that:\nβp+ (1 − β)z ≻ u.\nBut βp + (1 − β)z⋫ u: it is enough to notice that for any ω ∈ Ω and any x 6= x′, z, it holds that [βp + (1 − β)z − u](ω, x) = (β − 1)/|Xz| < 0.\nNext, if |Xz | = 2 and |Ω| ≥ 2, then we can take ω1 ∈ Ω and define horse lotteries p, q by p(ω1, x) = 1, q(ω1, x) = 0, p(ω′, x) = q(ω′x) = 12 for any ω\n′ 6= ω1. Then p⊲ q⊲ z, whence p ≻ q ≻ z. However, for any β ∈ (0, 1) it holds that\n(∀ω′ 6= ω1)βp(ω ′, x) + (1− β)z(ω′, x) < q(ω′, x),\nwhence βp+ (1 − β)z⋫ q and as a consequence ≻ is not Archimedean. Conversely, given Ω := {ω},Xz := {x, z}, then it holds that p⊲ q ⇔ p(ω, x) > q(ω, x), and then if p ≻ q ≻ r there are α, β ∈ (0, 1) such that αp(ω, x) + (1 − α)r(ω, x) > q(ω, x) > βp(ω, x) + (1 − β)q(ω, x), meaning that αp+ (1 − α)r ≻ q ≻ βp+ (1− β)r, and as a consequence ≻ is Archimedean.\nProof of Proposition 12. (i) Given p ≻ q ≻ r, q⋫ r, we have by A2 that αq + (1 − α)p ≻ αr + (1 − α)p ≻ αr + (1 − α)q for any α ∈ (0, 1). We apply A3′ to the latter chain of preferences; note that this requires that αq + (1 − α)p⋫αr + (1 − α)p, which is true since q⋫ r. As a consequence, there is γ ∈ (0, 1) such that γ(αq + (1 − α)p) + (1 − γ)(αr + (1 − α)q) ≻ αr + (1 − α)p, or, equivalently, that αγ(q − r) − (1 − α)(1 − γ)(p − q) ∈ C, where C is the cone associated with ≻. Normalizing we find β ∈ (0, 1) such that βq + (1− β)q = q ≻ βp+ (1− β)r.\n(ii) (⇒) Consider p, q, r ∈ Hz such that p ≻ q ≻ r, p⋫ q. By wA3 it holds that αp + (1 − α)z ≻ q for some α ∈ (0, 1). And since by Proposition 3 we have that αp + (1 − α)r ≻ αp + (1 − α)z, we deduce that αp+ (1− α)r ≻ q.\n(⇐) This implication trivially follows by a direct application of A3′ to p, q ∈ Hz such that p ≻ q, p⋫ q, given that q ≻ z.\nNext we give a lemma that considers a special translation of a coherent set of desirable gambles. Its proof, needed for Theorem 13, is a reformulation of ideas in [12, Lemma 1], on top of which we establish the connection between wA3 and D0.\nLemma 36. Let R be the coherent set of desirable gambles on Ω ×X arising from a coherent preference relation ≻ on Hz × Hz through (11). Denote by u the uniform act in Hz defined by u(ω, x) := 1/|Xz| for all ω ∈ Ω, x ∈ Xz . Consider the following translated sets:\nτ(R) := {g ∈ L(Ω ×X ) : g = π(u) + f, f ∈ R},\nτ(L+(Ω ×X )) := {g ∈ L(Ω ×X ) : g π(u)},\nand the following version of D0 adapted to τ(R):\nD0′. g ∈ τ(R) \\ τ(L+(Ω ×X )) ⇒ (∃δ > 0)g − δ ∈ τ(R).\nThen it follows that:\n(i) D0 and D0′ are equivalent conditions.\n(ii) τ(R) = {π(u) + λπ(p− u) : λ > 0, p ≻ u}.\nProof. Note first that if g = π(u) + f , g ∈ τ(R), then f ∈ R: in fact if g ∈ τ(R), then g = π(u) + h for some h ∈ R, whence f = h.\n(i) Let us show that D0 and D0′ are equivalent conditions.\nConsider g ∈ τ(R) \\ τ(L+(Ω ×X )); then g = π(u) + f , f ∈ R \\ L+(Ω × X ). Applying D0, there is δ > 0 such that f − δ ∈ R, whence π(u) + f − δ = g − δ ∈ τ(R).\nConversely, if f ∈ R \\ L+(Ω ×X ), then π(u) + f ∈ τ(R) \\ τ(L+(Ω × X )); applying D0′ we get that there is δ > 0 such that π(u) + f − δ ∈ τ(R), whence f − δ ∈ R.\n(ii) It is trivial that {π(u) + λπ(p − u) : λ > 0, p ≻ u} ⊆ τ(R), so we concentrate on the converse inclusion.\nConsider π(u) + f . Then there are λ > 0 and p1 ≻ p2 such that f = λπ(p1 − p2). Remember that |Xz | ≥ 2 by assumption (see Remark 3); whence, if we take µ ∈ (0, 1\nλ|Xz| ), we obtain that [u + µλ(p1 − p2)](ω, x) ∈\n[0, 1] for all (ω, x) ∈ Ω × Xz . Since it holds is addition that ∑\nx∈Xz [p1 − p2](ω, x) = 0 for all ω ∈ Ω,\nwe have also that ∑\nx∈Xz [u + µλ(p1 − p2)](ω, x) = ∑ x∈Xz\nu(ω, x) = 1 for all ω ∈ Ω. We deduce that p := u+ µλ(p1 − p2) ∈ Hz .\nGiven that p − u = µλ(p1 − p2) and that p1 ≻ p2, we obtain from Proposition 3 that p ≻ u. And since π(u) + f = π(u) + 1\nµ π(p− u), we deduce that π(u) + f ∈ {π(u) + λπ(p− u) : λ > 0, p ≻ u}.\nProof of Theorem 13. Coherence follows from Proposition 9. In order to prove that R is a set of strictly desirable gambles, it is enough to show that D0′ holds, thanks to Lemma 36.\nConsider g ∈ τ(R) \\ τ(L+(Ω ×X )). Then, according to Lemma 36, g = π(u) + f , with f := λπ(p − u) ∈ R, λ > 0, and for some p ∈ Hz such that p ≻ u, p⋫u.\nSince u ≻ z, it follows from wA3 that there is some β ∈ (0, 1) such that βp+ (1 − β)z ≻ u, whence\nπ(β(p− u)− (1− β)(u − z)) = βf\nλ − (1− β)π(u) ∈ R.\nSince R is a cone, this means that f − λ(1−β) β π(u) ∈ R for some β ∈ (0, 1), or, in other words, that f − δ ∈ R, with δ := λ(1−β) β|Xz|\n> 0. We deduce that g − δ = π(u) + f − δ ∈ τ(R), whence D0′ holds and as a consequence R is a coherent set of strictly desirable gambles.\nProof of Theorem 14. (i) The direct implication is trivial. For the converse, we proceed with a constructive proof.\nThe case f = 0 is trivial so we assume that f 6= 0. We use λ := supω∈Ω ∑ x∈Xz |f(ω, x)| to normalise f through f := f/λ, so that each of the previous sums is not greater than one. At this point for each ω ∈ Ω, we need to represent f(ω, ·) as the difference of two mass functions on X , say m+ω −m − ω . We proceed as follows:\nm+ω (x) :=    0 if x 6= z and f(ω, x) ≤ 0, f(ω, x) if x 6= z and f(ω, x) > 0,\n1− ∑\nx∈X m + ω (x) if x = z.\nm−ω (x) :=    0 if x 6= z and f(ω, x) ≥ 0, −f(ω, x) if x 6= z and f(ω, x) < 0,\n1− ∑\nx∈X m − ω (x) if x = z.\nIt is trivial that the difference m+ω − m − ω reproduces f(ω, x) for all x 6= z. In the case x = z, by assumption\nf(ω, z) = − ∑\nx 6=z f(ω, x), and since\n− ∑\nx 6=z\nf(ω, x) = ∑\nx 6=z:f(ω,x)<0\n−f(ω, x)− ∑\nx 6=z:f(ω,x)>0\nf(ω, x)\n= (1− ∑\nx 6=z:f(ω,x)>0\nf(ω, x))− (1 − ∑\nx 6=z:f(ω,x)<0\n−f(ω, x)),\nwe have also that f(ω, z) = m+ω (z) − m − ω (z). Since this holds for all ω ∈ Ω, f can be represented as the difference of two horse lotteries.\nFinally, it is enough to multiply f by λ to go back to the original, unnormalised, gamble, which is then an element of A(Hz).\n(ii) To any λ(p− q) ∈ A(Hz), we associate the gamble f := λπ(p− q). Let us show that such a map is injective.\nAssume that there are λ1(p1 − q1) and λ2(p2 − q2) that are both mapped to the same gamble f . This makes it trivial that λ1(p1 − q1)(ω, x) = f(ω, x) = λ2(p2 − q2)(ω, x) for all ω ∈ Ω and x 6= z. In the case of x = z, it is enough to write\nλ1(p1 − q1)(ω, z) = −λ1 ∑\nx∈X\n(p1 − q1)(ω, x) = −λ2 ∑\nx∈X\n(p2 − q2)(ω, x) = λ2(p2 − q2)(ω, z)\nfor every ω ∈ Ω. As a consequence, λ1(p1 − q1) = λ2(p2 − q2).\nConcerning surjectivity, if we take a gamble f ∈ L(Ω×X ), we can always extend it to a gamble g ∈ L(Ω×Xz) via\ng(x) :=\n{ f(x) if x 6= z,\n− ∑\nx∈X f(x) if x = z.\nApplying the first statement, we deduce that there are acts p, q and λ > 0 such that g = λ(p − q), whence f = λπ(p − q).\n(iii) Let C := π−12 (R). By the second statement, ∅ 6= C ⊆ A(Hz) \\ {0}. To show that C is convex, consider p1, p2, q1, q2 ∈ Hz and λ1, λ2 > 0 such that h1 := λ1(p1 − q1), h2 := λ2(p2 − q2) ∈ C. By construction, γ1π(h1) + γ2π(h2) ∈ R for all γ1, γ2 > 0, whence π −1 2 (γ1π(h1) + γ2π(h2)) = γ1h1 + γ2h2 ∈ C.\nUsing Proposition 6, we obtain that R induces the following coherent preference relation:\np ≻ q ⇔ λ(p− q) ∈ C ⇔ λπ(p− q) ∈ R.\nTo show that p ≻ z for all p ∈ Hz , p 6= z, it is then enough to consider that π(p− z) is a positive gamble.\nWe are left to show that if R is strictly desirable, then ≻ is weakly Archimedean. Let us consider p ≻ q, p⋫ q. By D0, there is δ > 0 such that π(p − q) − δ ∈ R. Choose β ∈ (0, 1) so that π((1 − β)p) ≤ δ. Then π(βp− q) ≥ π(p− q)− δ, whence π(βp− q) ∈ R, which implies that βp+ (1 − β)z ≻ q.\nProof of Theorem 15. As usual, given a coherent preference relation ≻, we map it into the set of gambles defined by R := π(C), where C := {λ(p − q) : p ≻ q, λ > 0}. Set R is coherent as a consequence of Proposition 9. That the map is injective is trivial considered that π2 (the restriction of π to scaled differences of acts) is invertible. That it is surjective follows from Theorem 14. The equivalence of the weak Archimedean condition and strict desirability follows from Theorems 13 and 14. Finally, the relation and the set of strictly desirable gambles give rise to the same representation because C and R induce the same set of linear previsions.\nProof of Theorem 16. (i) Let us consider the direct implication. If p⊲ q, then p ≻ q holds as a consequence of Proposition 10 and the fact that z is the worst outcome for ≻. On the other hand, if r ≻ s, then using Definition 24 we obtain that π−11 (r) ≻ π −1 1 (s), which is equivalent to π −1 2 (r − s) ∈ C, where C is the cone\ninduced by ≻. As a consequence, p− q = π−12 (r − s) ∈ C, whence p ≻ q.\nFor the converse implication, it is enough to note that p⊲ z for all p 6= z, so that p ≻ z; and that, on the other hand, r ≻ s and π(π−11 (r) − π −1 1 (s)) = r − s imply that π −1 1 (r) ≻ π −1 1 (s).\n(ii) Remember that any extension has a corresponding convex cone C (which is not empty because of the worst outcome). We know by the first point in the theorem that π−12 (r − s) ∈ C if r ≻ s and moreover that t − z ∈ C ∪ {0} for any t ∈ Hz . Given that C is convex, then also λ1π −1 2 (r − s) + λ2(t− z) ∈ C for all λ1, λ2 > 0. In\nother words, if there are p, q ∈ Hz and λ3 > 0 such that λ1π −1 2 (r − s) + λ2(t − z) = λ3(p− q), then p ≻ q. Equivalently, p ≻ q if π(p− q) ≥ λ(r − s), r, s ∈ H, r ≻ s, λ > 0, where the inequality is obtained by letting λ := λ1/λ3 and observing that π(λ2(t− z)) = λ2π(t) spans the entire set {f ≥ 0} when t ∈ Hz . This allows us to reformulate (13) in an equivalent way as follows:\n(∀p, q ∈ Hz) p ≻ q whenever p⊲ q or π(p− q) ≥ λ(r − s) for some r, s ∈ H, r ≻ s, λ > 0. (A.1)\nAt this point we consider C′ := {λ(r − s) : r, s ∈ H, r ≻ s, λ > 0}. Assume for the moment that C′ is not empty. Then C′ is a convex cone that does not contain the origin. If we regard C′ as a set of gambles in\nL(Ω × X ), then C′ avoids partial loss because it does not contain zero while being convex. On the other hand, it is not coherent because it does not contain L+. We can therefore take its natural extension (see Eq. (1)) so as to obtain the smallest, or least-committal, coherent set of gambles that contains C′:\nR := {f ≥ λ(r − s) : r, s ∈ H, r ≻ s, λ > 0)} ∪ L+.\nObserve that if C′ = ∅, then its natural extension is R = L+, which is the vacuous set of gambles; therefore R represents the correct extension also in this special case.\nGiven that R is a coherent set of gambles on Ω×X , we can use Theorem 14 to create a new coherent preference relation ≻ on Hz × Hz , with corresponding cone C := π−1(R), for which z is the worst outcome. Recalling that p ≻ q ⇔ λπ(p − q) ∈ R for some λ > 0, it is then trivial to prove that the new relation ≻ contains all the preferences expressed by (A.1) and only them. As a consequence it is the minimal extension of ≻ on H×H to the worst outcome, because any extension has to express at least those preferences.\n(iii) Assume first of all that C 6= ∅, and let us prove that P (f) = 0 for every f ∈ C. This will imply that R is not a coherent set of strictly desirable gambles, because C ⊆ R \\ L+.\nSince C ⊆ R, it follows from Eq. (2) that P (f) ≥ 0 for every f ∈ C. On the other hand, if P (f) > 0 for some f ∈ C, there should be some ε > 0 such that f − ε ∈ R; but then we would have that for any ω ∈ X ,∑\nx∈X (f − ε)(ω, x) = −ε|X | < 0, while by construction any gamble g ∈ R satisfies ∑\nx∈X g(ω, x) ≥ 0. Thus, P (f) = 0 and as a consequence, R is not a set of strictly desirable gambles.\nThe converse implication, where C = ∅, follows from the fact that in this case R = L+, which is a (trivial) set of strictly desirable gambles.\nProof of Corollary 17. Denote by P 1 the coherent lower prevision associated with R1 and by P the lower prevision induced by R. Consider f ∈ C. We know by point (iii) in Theorem 16 that P (f) = 0. Considered in addition that R1 includes R, it is strictly desirable and that f /∈ L+, we obtain that P 1(f) > 0. Written in other words:\n(∀f ∈ C)P (f) = 0 < P 1(f).\nIt follows that M(P 1) ( M(P ) and that any linear prevision P1 ≥ P 1 satisfies P1(f) > 0 for every f ∈ C. Fix now f ∈ C, consider P1 ∈ M(P 1) and P ∈ M(P ) such that P1(f) = P 1(f) and P (f) = P (f). Take P2 := 1 2P1 + 1 2P ∈ M(P ), and let M2 be the convex hull of M(P 1) ∪ {P2}. Its lower envelope P 2 is a lower prevision that lies between P and P 1 and satisfies in particular P 2(f) = P 1(f)/2. As a consequence, its associated set of strictly desirable gambles R2 is a proper subset of R1 and moreover it properly includes R (because P 2(g) > 0 for all g ∈ C by construction while P (g) = 0).\nProof of Proposition 18. (i) (⇒) Consider f, g ∈ C. Then we can express them as f = λ1(p1−q1), g = λ2(p2− q2), for λ1, λ2 > 0, p1 ≻ q1, p2 ≻ q2. Assume for the time being that λ1 = λ2 = 1. By A2,\nαp1 + (1− α)p2 ≻ αq1 + (1− α)p2 ≻ αq1 + (1− α)q2\nfor any α ∈ (0, 1). Applying now A3, we deduce the existence of β1, β2 ∈ (0, 1) such that\nβ1(αp1 + (1− α)p2) + (1 − β1)(αq1 + (1− α)q2) ≻ αq1 + (1− α)p2 and\nαq1 + (1− α)p2 ≻ β2(αp1 + (1− α)p2) + (1 − β2)(αq1 + (1− α)q2),\nfrom which we deduce that\nαβ1(p1 − q1)− (1− α)(1 − β1)(p2 − q2) ∈ C and (1− α)(1 − β2)(p2 − q2)− αβ2(p1 − q1) ∈ C;\nnormalizing we find γ1, γ2 ∈ (0, 1) such that\nγ1f − (1− γ1)g ∈ C and γ2g − (1− γ2)f ∈ C.\nNext, if either λ1 or λ2 6= 1, we deduce from the reasoning above that there is some β ∈ (0, 1) such that\nβ f\nλ1 − (1− β)\ng\nλ2 ∈ C,\nwhence, given k := β + (1− β)λ1 λ2 , it holds that\nβ f\nλ1\nλ1 k − (1− β) g\nλ2\nλ1 k ∈ C,\nand β1 := β k ∈ (0, 1). Analogously, we can find β2 ∈ (0, 1) such that β2g − (1− β2)f ∈ (0, 1).\n(⇐) Given p ≻ q ≻ r, it follows from Eq. (10) that f := p − q, g := q − r ∈ C. Applying A3, there are β1, β2 ∈ (0, 1) such that β1f − (1 − β1)g ∈ C, β2g − (1− β2)f ∈ C. But taking into account that\nβ1f − (1− β1)g = β1p+ (1− β1)r − q and β2g − (1− β2)f = q − β2r − (1− β2)p,\nwe deduce from Proposition 4 that β1p+ (1− β1)r ≻ q ≻ β2r + (1 − β2)p.\n(ii) (⇒) Consider f ∈ C, g ∈ A. Then there are λ1, λ2 > 0, p ≻ q and r, s ∈ H such that f = λ1(p − q), g = λ2(r− s). Assume first of all that λ1 = λ2 = 1. Then there is some β ∈ (0, 1) such that βp+(1− β)r ≻ βq + (1− β)s, whence βf + (1− β)g ∈ C. Now, if either λ1, λ2 6= 1, it follows from the above reasoning that there is some β ∈ (0, 1) such that β f\nλ1 + (1 − β) g λ2 ∈ C, whence βf + (1−β)λ1 λ2 g ∈ C, and, by considering the normalising constant\nk := β + (1−β)λ1 λ2 , it follows that, given β′ := β k ∈ (0, 1), β′f + (1− β′)g ∈ C.\n(⇐) Consider p ≻ q and take r, s ∈ H. Then f := p− q ∈ C, g := r− s ∈ A, whence there is some β ∈ (0, 1) such that βf + (1− β)g = βp+ (1− β)r− βq − (1− β)s ∈ C. Applying Proposition 4, we deduce that βp+ (1 − β)r ≻ βq + (1− β)s.\n(iii) Consider f, g ∈ C. Since −g,−f ∈ A, we deduce from the second statement that there are β1, β2 ∈ (0, 1) such that β1f − (1−β1)g ∈ C and β2g− (1−β2)f ∈ C. Applying the first statement, we deduce that ≻ satisfies A3. This completes the proof.\nProof of Proposition 19. (i ⇒ ii) This case has been proved in Proposition 18.\n(i ⇐ ii) Consider p, q, r, s ∈ Hz such that p ≻ q. Observe first of all that the following is true for some α ∈ (0, 1):\nαp+ (1− α)z ≻ αq + (1 − α)s. (A.2)\nThis is trivial if s = z and otherwise it follows from Proposition 18 through α(p − q) − (1 − α)(s − z) ∈ C. It shows in particular that the case r = z holds. Therefore assume that r 6= z. Apply A2 to obtain that αp+(1−α)r ≻ αp+(1−α)z. Combining this with (A.2), we conclude that αp+(1−α)r ≻ αq+(1−α)s.\n(ii ⇒ iii) By using the equivalence between wA3 and A3′ (see Proposition 12), it is trivial that A3 implies wA3. Thus it is enough to have that P (f) > 0 for all f ∈ L+(Ω × X ); this is equivalent to showing that for every (ω, x) ∈ Ω ×X there is some δ > 0 such that I{(ω,x)} − δ ∈ R.\nLet u be the uniform act onΩ×Xz , and let p be the horse lottery given by p := u+ 1|Xz| (I{(ω,x)}−I{(ω,z)}). Then it follows that p ≻ u ≻ z. Applying A3, we deduce that there is some α ∈ (0, 1) such that αp+ (1− α)z ≻ u, whence\nπ(αp+ (1 − α)z − u) = (2α− 1) 1\n|Xz| I{(ω,x)} − (1− α)\n1\n|Xz | I{(ω,x)}c ∈ R.\nFrom this it follows that it must be 2α − 1 > 0, and applying the non-negative homogeneity of R we deduce that there is some δ > 0 such that I{(ω,x)} − δI{(ω,x)}c ∈ R. Consider now a natural number N > δ. Then\nI{(ω,x)} − δ\nN + 1 =\n( 1\nN + 1 I{(ω,x)} −\nδ\nN + 1 I{(ω,x)}c\n) + ( N\nN + 1 −\nδ\nN + 1\n) I{(ω,x)} ∈ R.\n(ii ⇐ iii) Thanks to Proposition 12, we know that wA3 implies A3 as long as the latter is applied to non-trivial preferences. Let us show that the positivity condition implies the case with objective preferences involved. In particular, let us consider p⊲ q ≻ r (the remaining cases are analogous). By the super-additivity and positive homogeneity of coherent lower previsions, and for anyα ∈ (0, 1), we have that P (απ(p−q)+(1−α)π(r−q)) ≥ αP (π(p−q))+ (1−α)P (π(r−q)); and this is positive for small enough 1−α, considered that P (π(p−q)) > 0 by assumption. This implies that απ(p−q)+(1−α)π(r−q) ∈ R, or, in other words, that αp+(1−α)r ≻ αq+(1−α)q = q.\nLemma 37. Assume Ω is finite, and let ≻ be a coherent relation on H × H. Let R, from (14), be its associated coherent set of desirable gambles, and P its corresponding coherent lower prevision.\n(i) R has an open superset ⇔ (∀f ∈ C)P (f) > 0.\n(ii) If ≻ satisfies sA3, then: (∃f ∈ C)P (f) = 0 ⇒ (∀g ∈ A)P (g) = P (g) = 0.\nProof. (i) We begin with a direct implication. Let R′ be an open superset of R, and let P ′ be its associated coherent lower prevision. The inclusion R ⊆ R′ implies that P (f) ≤ P ′(f) ≤ P ′ (f) ≤ P (f) for any gamble\nf . Moreover, for any f ∈ R \\ L+ ⊆ R′ \\ L+, it holds that P ′(f) > 0 because R′ is a coherent set of strictly desirable gambles, and as a consequence also P (f) > 0 for every f ∈ C.\nConversely, taking into account that linear previsions on L(Ω × X ) are characterized by their restrictions to events, the credal set M(P ) can be regarded as a closed and convex subset of the Euclidean space.\nTake P in the relative interior of M(P ). Then there is some ε > 0 such that B(P ; ε) ∩ aff(M(P )) ⊆ M(P ), where aff(M(P )) denotes the affine expansion of M(P ). We are going to prove that P (f) > 0 for any f ∈ C. Fix f ∈ C. Using point (iii) in Theorem 16, P (f) = 0 < P (f). Assume ex-absurdo that P (f) = 0.\nThen for any other P1 6= P in B(P ; ε) we can consider P2 := 2P − P1 ∈ aff(M(P )) ∩B(P ; ε): to prove that indeed P2 ∈ B(P ; ε), note that |P2({ω, x}) − P ({ω, x})| = |P ({ω, x}) − P1({ω, x})| ≤ ε. Now, P (f) = P (f) = 0 implies that P1(f) = P2(f) = 0, and with this reasoning we would conclude that P ′(f) = 0 for every P ′ ∈ B(P ; ε).\nHowever, since f 6= 0 because ≻ is irreflexive, there must be some ω ∈ Ω such that f(ω, ·) is not constant on 0, and then we deduce that there must be some xi 6= xj ∈ X such that\nf(ω, xi) 6= f(ω, xj) and max{P ({(ω, xi)}), P ({(ω, xj)})} > 0; (A.3)\nto prove this, note that there must be some x∗ ∈ X such that P ({(ω, x∗)}) > 0, and then if Eq. (A.3) did not hold we would obtain that f(ω, x∗) = f(ω, x′) for every x′ 6= x∗; since ∑ x∈X f(ω, x) = 0, this would mean that f(ω, ·) is constant on 0, a contradiction.\nConsider then xi, xj in the conditions of Eq. (A.3), and assume without loss of generality that P ({(ω, xj)}) > 0. Then for ε′ small enough it holds that P ′ := P+ε′(I{(ω,xi)}−I{(ω,xj)}) belongs to B(P ; ε) and P\n′(f) 6= P (f), a contradiction.\nThus, we conclude that there is some linear prevision P ∈ M(P ) satisfying P (f) > 0 for every f ∈ C. It follows that its associated set of strictly desirable gambles includes R.\n(ii) Assume P (f) = P (f) = 0 for some f ∈ C, and take g 6= f in A. Since ≻ satisfies sA3, we deduce from Proposition 18 that there is some β ∈ (0, 1) such that βf + (1 − β)g ∈ C, whence 0 ≤ P (βf − (1 − β)g) ≤ P (βf) + P ((1 − β)g) = 0 − (1 − β)P (g) ≤ 0, whence also P (g) = 0. Applying the same reasoning to −g we conclude that P is constant on 0 in A.\nProof of Theorem 20. Let P be the coherent lower prevision induced by R, and assume ex-absurdo that R has no open superset. From Lemma 37, it follows that P (f) = P (f) = 0 for every f ∈ A. Let us show that this last condition cannot happen.\nFor every f ∈ A, P (f) = 0 implies that for every ε > 0 there is some gε ∈ C such that f+ε ≥ gε, or, equivalently, that gε − f ≤ ε. If there were a pair (ω, x) such that gε(ω, x) − f(ω, x) < −ε|Ω ×X|, then it would be impossible\nto satisfy the constraint that ∑ (ω,x)∈Ω×X f(ω, x) = ∑ (ω,x)∈Ω×X gε(ω, x) = 0, taking into account that gε − f ≤ ε. Therefore, we obtain that ‖f − gε‖ ≤ ε|Ω ×X|, where || · || denotes the supremum norm. As a consequence, A = C, where the closure is taken in the topology of uniform convergence.\nLet now π′ denote the projection operator from Ω × X to Ω × X ′, where X ′ results from dropping the last component in X . It follows that π′(A) = R|Ω×X\n′|. In addition, since C is convex we deduce that π(C) is also convex, and also (π(C)) = π(C) = R|Ω×X\n′|. But the only convex set that is dense in an Euclidean space is the Euclidean space itself [4, Corollary 1.2.13], whence π(C) = π(A), and therefore C = A. But this would mean that for every f ∈ A both f,−f ∈ C, which contradicts the coherence of the set R.\nThus, it must be P (f) > 0 for every f ∈ C and as a consequence R has an open superset.\nLemma 38. Assume that Ω is finite, and let k := |X | − 1. Then the set A has a finite generating family {g1, . . . , gℓ} such that, if ‖f‖ ≤ ε, then we can write f = ∑ℓ i=1 λigi and λi ∈ [0, kε] for i = 1, . . . , ℓ.\nProof of Lemma 38. Denote the elements of X by x1, . . . , xk+1 and consider the family {I{(ω,xi)}− I{(ω,xj)} : ω ∈ Ω, xi 6= xj ∈ X}, and let f ∈ A. Let us show that we can express f as a linear combination, with non-negative coefficients, of the functions in the generating family. To this end, we can work independently on each ω.\nFix then ω ∈ Ω. In order to simplify the notation, in the following we rename fω := f(ω, ·) and drop any other reference to ω. Moreover, we assume without loss of generality that all the non-negative values of fω occur prior to the negative ones; that is, that fω(xi) ≥ 0 for i = 1, . . . ,m and fω(xi) < 0 for i > m. Let us show then that\nfω =\nk∑\ni=1\n (I{xi} − I{xi+1}) i∑\nj=1\nfω(xi)\n\n . (A.4)\nObserve first that the coefficients λi := ∑i\nj=1 fω(xi) are indeed non-negative, thanks to the assumption that the non-negative values occur prior to the remaining ones, and because f ∈ A. It trivially holds also that λi ≤ kε.\nNow, to show that Eq. (A.4) holds, it is convenient to rewrite it as follows:\nfω = λ1I{x1} +\n[ k∑\ni=2\n(λi − λi−1)I{xi} ] − λkI{xk+1}. (A.5)\nThen it is trivial that (A.5) holds in the case of x1. In case i ∈ {2, . . . , k}, it is enough to observe that λi − λi−1 =∑i j=1 fω(xi) − ∑i−1 j=1 fω(xi) = fω(xi). As a consequence, the case of xk+1 becomes trivial as well, given that it must be that ∑k+1\ni=1 fω(xi) = 0.\nLemma 39. Let ≻ be a coherent preference relation on H×H satisfying sA3 and with corresponding cone C. Assume Ω is finite, and let R be given by Eq. (14). Then:\n(i) For any gamble f ∈ C, there exists some εf > 0 such that the open ball B(f ; εf) satisfies\nB(f ; εf) ∩ A ⊆ C.\n(ii) posi(R̃) ∩ A = posi(R̃ ∩ A), where R̃ := ∪f∈CB(f ; εf).\nProof of Lemma 39. (i) Let P be the coherent lower prevision induced by R. Let f := p − q, and {g1, . . . , gℓ} be the finite generating family of A, existing by Lemma 38. By Proposition 18, for any i = 1, . . . , ℓ, there is some βi ∈ (0, 1) such that βif + (1 − βi)gi ∈ C. Moreover, since f ∈ C it follows that for any β ≥ βi the gamble βf + (1− β)gi also belongs to C. As a consequence, given β∗ := maxi=1,...,ℓ βi ∈ (0, 1), it holds that β∗f +(1− β∗)gi ∈ C for all i = 1, . . . , ℓ. Now, since C is a convex cone, given αi ≥ 0 such that ∑ℓ i=1 αi > 0,\nit holds that ℓ∑\ni=1\nαi(β ∗f + (1 − β∗)gi) = β ∗(\nℓ∑\ni=1\nαi)f + (1 − β ∗)\nℓ∑\ni=1\nαigi ∈ C. (A.6)\nConsider ε < 1−β ∗\nβ∗kℓ . By Lemma 38, for every g ∈ A such that ‖g − f‖ ≤ ε, there are λi ∈ [0, εk] such that\ng − f = ∑ℓ\ni=1 λigi, whence\ng = f +\nℓ∑\ni=1\nλigi = f + 1− β∗\nβ∗\nℓ∑\ni=1\n( λiβ ∗\n1− β∗\n) gi;\nrecall that ‖ · ‖ refers to the supremum norm. Applying Eq. (A.6) with αi := λiβ\n∗ 1−β∗ and δ := ∑ℓ\ni=1 αi > 0, we deduce that\nβ∗δf + (1− β∗) ℓ∑\ni=1\nλiβ ∗\n1− β∗ gi = β\n∗δf +\nℓ∑\ni=1\nλiβ ∗gi ∈ C,\nand since this set is a cone,\nδf + ℓ∑\ni=1\nλigi ∈ C.\nObserve that by construction, 0 < δ = ∑ℓ\ni=1 λiβ\n∗ 1−β∗ ≤ ℓkεβ∗\n1−β∗ < 1, whence also (1− δ)f ∈ C; and since this set is convex, we deduce that\nf +\nℓ∑\ni=1\nλigi = g ∈ C.\nWe conclude that there is some ε > 0 such that g ∈ C for every g satisfying ‖g − f‖ ≤ ε.\n(ii) We immediately have that posi(R̃ ∩ A) ⊆ posi(R̃) ∩ posi(A) = posi(R̃) ∩ A, so we only need to establish the converse inclusion.\nLet us begin by showing that R̃ is a cone. Consider a gamble g ∈ R̃ and λ > 0. Then there is some f ∈ C such that g ∈ B(f ; εf ), whence λg ∈ B(λf ;λεf ). Since on the other hand\nB(λf ;λεf ) ∩ A = λB(f ; εf ) ∩ A = λ(B(f ; εf ) ∩ A) ⊆ λC = C,\nwe deduce that ελf ≥ λεf , and as a consequence λg ∈ R̃. Consider a gamble f ∈ posi(R̃)∩A. Then there are f1, . . . , fn ∈ R̃, λ1, . . . , λn > 0 such that f = ∑n\ni=1 λifi. Note that since R̃ is a cone, we can assume without loss of generality that λi = 1 for every i = 1, . . . , n. For every i = 1, . . . , n, there is some gi ∈ C and some hi ∈ B(0; εgi) such that fi = gi + hi. Let us prove that there are h′′i ∈ B(0; εgi) ∩ A such that f = ∑n i=1(gi + h ′′ i ). Since gi + h ′′ i will belong to R̃ ∩ A, we will conclude that f ∈ posi(R̃ ∩ A), and the proof will be complete.\nNote that we can work independently for each ω ∈ Ω; in addition, our construction of the gambles h′′i shall not depend on the gambles gi above. Fix then ω ∈ Ω, and let X = {x1, . . . , xk}.\nConsider the table\nh1(ω, x1) h2(ω, x1) . . . hn(ω, x1) h1(ω, x2) h2(ω, x2) . . . hn(ω, x2)\n... ... . . . ... h1(ω, xk) h2(ω, xk) . . . hn(ω, xk)\nBy construction, the i-th column is bounded in (−εgi , εgi), and the sum of all the elements of the table is equal to 0, because f ∈ A. Note, though, that the sum in each row is not necessarily equal to 0.\nOur goal then is to find a table\nh′′1(ω, x1) h ′′ 2(ω, x1) . . . h ′′ n(ω, x1) h′′1(ω, x2) h ′′ 2(ω, x2) . . . h ′′ n(ω, x2)\n... ... . . . ... h′′1(ω, xk) h ′′ 2(ω, xk) . . . h ′′ n(ω, xk)\nsuch that:\n◦ (∀i = 1, . . . , n) ∑k\nj=1 h ′′ i (ω, xj) = 0.\n◦ (∀i = 1, . . . , n)(∀j = 1, . . . , k)h′′i (ω, xj) ∈ (−εgi , εgi). ◦ (∀j = 1, . . . , k) ∑n\ni=1 h ′′ i (ω, xj) = ∑n i=1 hi(ω, xj).\nThe first of these requirements is done in order to guarantee that h′′i belongs to A; the second, to prove that h ′′ i\nbelongs to B(0; εgi); and the third, to guarantee that f = ∑n i=1(gi + h ′′ i ). Then by repeating the process for every ω we end up with the gambles h′′1 , . . . , h ′′ n required above. Consider j ∈ {1, . . . , n− 1}, and let f ′j be a gamble on X whose supremum norm satisfies\n‖f ′j‖ < n∑\ni=j\nεgj .\nWe shall show that there exists a gamble h′j on X satisfying the following five conditions:\n‖f ′j − h ′ j‖ <\nn∑\ni=j+1\nεgi . (A.7)\n‖h′j‖ < εgj . (A.8)∑\nx∈X\nh′j(x) = 0. (A.9)\nOnce we have established that it is possible to find the gamble h′j , we proceed as follows:\n◦ We consider the gamble f ′1 on X given by f ′ 1(x) := ∑n i=1 hi(ω, x). It satisfies ‖f ′ 1‖ < ∑n i=1 εgi , so we\nfind h′1 satisfying Eqs. (A.7)–(A.9) for j = 1.\n◦ The gamble f ′2 := f ′ 1 − h ′ 1 satisfies ‖f ′ 2‖ < ∑n i=2 εgi because of Eq. (A.7), so we find h ′ 2 satisfying\nEqs. (A.7)–(A.9) for j = 2.\n◦ We repeat the procedure for f ′j := f ′ j−1 − h ′ j−1 for j = 3, . . . , n− 1. ◦ Finally, given f ′n := f ′ n−1 − h ′ n−1 = f ′ 1 − h ′ 1 − · · · − h ′ n−1, we take h ′ n := f ′ n. By (A.7), ‖h ′ n‖ < εgn and\nf ′1(x) = ∑n i=1 h ′ i(x). Moreover,\n∑\nx∈X\nh′n(x) = ∑\nx∈X\nf ′1(x)− n−1∑\ni=1\n∑\nx∈X\nh′i(x) = 0− n−1∑\ni=1\n0 = 0.\nAt that stage it suffices to make h′′i (ω, xj) = h ′ i(xj) for every j = 1, . . . , k to obtain the gambles h ′′ 1 , . . . , h ′′ n we need.\nSo take j ∈ {1, . . . , n − 1}, a gamble f ′j with ‖f ′ j‖ < ∑n i=j εgi and let us establish the existence of a gamble h′j satisfying conditions (A.7)–(A.9) above. Consider the partition of X given by:\nA0 := {x : f ′ j(x) = 0} A1 := {x : f ′ j(x) > 0, f ′ j(x) ≥ εgj} A2 := {x : f ′ j(x) > 0, f ′ j(x) < εgj} A3 := {x : f ′ j(x) < 0, f ′ j(x) ≤ −εgj} A4 := {x : f ′ j(x) < 0, f ′ j(x) > −εgj}.\nWe make h′j(x) := f ′ j(x) = 0 for every x ∈ A0. Then a gamble h ′ j satisfies Eqs. (A.7), (A.8) when it satisfies\n(∀x ∈ A1) h ′ j(x) ∈\n max{f ′j(x)− n∑\ni=j+1\nεgi , 0}, εgj\n\n , (A.10)\n(∀x ∈ A2) h ′ j(x) ∈\n max{f ′j(x)− n∑\ni=j+1\nεgi , 0}, f ′ j(x)\n\n , (A.11)\n(∀x ∈ A3) h ′ j(x) ∈\n −εgj ,max{f ′j(x) + n∑\ni=j+1\nεgi , 0}\n\n , (A.12)\n(∀x ∈ A4) h ′ j(x) ∈\n f ′j(x),max{f ′j(x) + n∑\ni=j+1\nεgi , 0}\n\n . (A.13)\nLet us detail this for the case of x ∈ A1; the proof for the other cases is similar. First of all, since by construction h′j(x) < εgj < f ′ j(x) and also 0 < h ′ j(x), we see that Eq. (A.8) is satisfied. With respect to (A.7), note that |f ′j(x)− h ′ j(x)| = f ′ j(x)− h ′ j(x) < ∑n i=j+1 εgi ⇔ h ′ j(x) > f ′ j(x) − ∑n i=j+1 εgi . Now, it follows from interval arithmetic that ∑\nx∈A1∪A2 h′j(x) can take any value in\n  ∑\nx∈A1∪A2\nmax{f ′j(x)− n∑\ni=j+1\nεgi , 0}, ∑\nx∈A1\nεgj + ∑\nx∈A2\nf ′j(x)\n  =: (C,D),\nand similarly ∑\nx∈A3∪A4 h′j(x) can take any value in  − ∑\nx∈A3\nεgj + ∑\nx∈A4\nf ′j(x), ∑\nx∈A3∪A4\nmax{f ′j(x) + n∑\ni=j+1\nεgi , 0}\n  =: (E,F ),\nand therefore that ∑\nx∈X h ′ j(x) can take any value in the open interval (C+E,D+F ). Thus, in order to prove\nthat it is possible to satisfy the constraints in Eqs. (A.10)–(A.13) and also ∑\nx∈X h ′ j(x) = 0 (i.e., Eq. (A.9)),\nwe are going to establish that C + E < 0 < D + F .\nLet us establish that C + E < 0, or, in other words, that C < −E; the proof of D + F > 0 is symmetrical. Let k := ∑\nx∈A1∪A2 f ′j(x) > 0. Then, there exists some natural number m such that k ∈ [m ∑n i=j εgi , (m +\n1) ∑n\ni=j εgi) (because the ratio k∑\nn i=j εgi is positive and so it must belong to an interval [m,m + 1) for some\nnatural number m). Define k′ := k −m ∑n i=j εgi ∈ [0, ∑n\ni=j εgi). Let us establish that C is strictly bounded above by\nmεgj +max\n  k ′ − n∑\ni=j+1\nεgi , 0\n   . (A.14)\nNote that for every x ∈ A1∪A2, it holds that max{f ′j(x)− ∑n i=j+1 εgi , 0} > 0 only when f ′ j(x) ≥ ∑n i=j+1 εgi ,\nso if we define B := {x : f ′j(x) ≥ ∑n i=j+1 εgi} it holds that\nC =\n{∑ x∈B(f ′ j(x) − ∑n i=j+1 εgi) if B 6= ∅,\n0 otherwise. (A.15)\nThis means that in order to maximize the value of C we would like that ∑\nx∈B f ′ j(x) is as close to k as possible.\nOn the other hand, for a given value of ∑\nx∈B f ′(x), the outer sum in the right-hand side in (A.15) maximises\nwhen B is as small as possible, which in turn implies that f ′(x) is as large as possible for the elements of B. Putting these considerations together, we conclude that we maximize C for a given value of k when B has m + 1 elements: in m of them we have f ′j(x) = ∑n i=j εgi (and so h ′ j = εgj ), while in the other one\nf ′j(x) = k −m ∑n i=j εgi = k ′ (and so h′j(x) = max{k ′ − ∑n i=j+1 εgi , 0}). Thus, C is strictly bounded by Eq. (A.14); the strict inequality holds because by assumption |f ′j(x)| < ∑n\ni=j εgi for every x, so we can only get arbitrarily close to the equalities mentioned in the previous phrase. On the other hand, since ∑\nx∈X f ′ j(x) = 0, it holds that k = − ∑ x∈A3∪A4 f ′j(x). Then −E = ∑ x∈A3 εgj −∑\nx∈A4 f ′j(x). For a lower bound on −E we want this sum to be as far from k as possible; this means that we want A3 to be as large as possible, and that for any x ∈ A3 we want to maximise −f ′(x) − εgj . We do this when −f ′(x) = ∑n i=j εgi as often as possible (again m times, taking into account the assumption of\nk ∈ [m ∑n i=j εgi , (m+ 1) ∑n i=j εgi)); while for the remaining k ′ = k −m ∑n i=j εgi we must allocate at least min{k′, εgj} (we allocate εgj if we can still be in A3 and k ′ when we must be in A4). These considerations imply that −E is bounded below by mεgj +min{k ′, εgj}, (A.16)\nwith the same considerations about the strict inequality as above.\nThe result then follows by noting that the value in (A.14) is smaller than the value in (A.16). Indeed, there are two possible cases:\n• If k′ ≥ εgj , then\nmin{k′, εgj} = εgj ≥ max\n  k ′ − n∑\ni=j+1\nεgi , 0\n   , because k ′ ≤ n∑\ni=j\nεgi ;\n• if k′ < εgj , then we obtain\nmax   k ′ − n∑\ni=j+1\nεgi , 0    ≤ k ′ = min{k′, εgj}.\nWe see then that C + E < 0. In a similar way we can see that D + F > 0. As a consequence, if we consider h′j(x) in the intervals determined by Eqs. (A.10)–(A.13), the sum ∑ x∈X h ′ j(x) can take any value in the interval (C + E,D + F ), and in particular the value 0. Thus, there is a gamble h′j satisfying conditions (A.7)–(A.9). If we now apply this result in the manner described above, we end up with gambles h′1, . . . , h ′ n such that\nf ′1(x) = ∑n i=1 h ′ i(x), ‖h ′ i‖ < εgi and ∑ x∈X h ′ i(x) = 0 for all i = 1, . . . , n. Finally, repeating the process for every ω we obtain the gambles h′′1 , . . . , h ′′ n required.\nProof of Proposition 21. We begin with the direct implication. From Lemma 39, if ≻ satisfies sA3 then for every f ∈ C there is some εf > 0 such that B(f ; εf) ∩ A ⊆ C. As a consequence, C is an open subset of A.\nConversely, let C be an open convex cone in A, and let ≻ be the coherent preference relation given by p ≻ q ⇔ p − q ∈ C. We show that ≻ satisfies sA3 by means of the characterization in Proposition 18. Consider f ∈ C, g ∈ A. By Lemma 39, there is some εf > 0 such that B(f ; εf ) ∩ A ⊆ C. In particular, given β ∈ (0, 1) such that ‖(1− β)(f − g)‖ < εf , it holds that\n‖f − (βf + (1− β)g)‖ = ‖(1− β)(f − g)‖ < εf ⇒ βf + (1− β)g ∈ B(f ; εf) ∩ A.\nAs a consequence, βf +(1− β)g ∈ C and applying Proposition 18 we conclude that ≻ is strongly Archimedean.\nProof of Proposition 22. R̂ is the conglomerable natural extension of RX ,R|{ω} (for all ω ∈ Ω), as it follows from [20, Proposition 29]. Therefore it is a coherent set and it trivially includes R|Ω by construction. We are left\nto show that R̂ induces both RΩ and RX . We begin by proving that the Ω-marginal of R̂ is RΩ . Consider an Ωmeasurable gamble f ∈ R̂. Then there are g ∈ RΩ and h ∈ R|Ω such that f ≥ g + h. For any ω ∈ Ω such that h(ω, ·) 6= 0, it holds that\n0 ≤ max x∈X h(ω, x) ≤ max x∈X f(ω, x)− g(ω, x) = f(ω)− g(ω),\nwhere in last equality we are using that both f, g are Ω-measurable. On the other hand, for any ω ∈ Ω such that h(ω, ·) = 0 it holds that f(ω) ≥ g(ω). Thus, f ≥ g, and since RΩ is a coherent set of gambles we conclude that also f ∈ RΩ . The converse inclusion is trivial.\nFix next ω ∈ Ω. If fI{ω} ∈ R̂, then there are g ∈ RΩ and h ∈ R|Ω such that fI{ω} ≥ g + h. For any ω′ 6= ω, it holds that\n(∀x ∈ X )0 ≥ g(ω′) + h(ω′, x),\nwhence it must be g(ω′) ≤ minx∈X −h(ω′, x) ≤ 0. Thus, if we consider instead g′ := gI{ω} ≥ g ∈ RΩ and h′ := hI{ω} ∈ R|Ω, we also have that fI{ω} ≥ g′ + h′. Taking into account that g′ ∈ RΩ , it should be g′(ω) ≥ 0, whence fI{ω} ≥ hI{ω} and thus f ∈ RX . Again, the converse inclusion is trivial.\nProof of Proposition 25. (i) ⇔ (ii) This has been proven in [17, Proposition 6].\n(i) ⇒ (iii) Consider gambles f, g /∈ R. Using (ii), we have that ε/2 − f, ε/2 − g ∈ R for all ε > 0; whence ε− (f + g) ∈ R for all ε > 0. By D2 and D4, it follows that f + g − ε /∈ R for all ε > 0.\n(iii) ⇒ (i) Using (ii), assume ex-absurdo that there is a gamble h and ε > 0 such that h, ε− h /∈ R. Using (iii), we obtain that h+ ε− h+ δ = ε+ δ /∈ R for all δ > 0, which contradicts D1.\n(i) ⇒ (iv) Note that\nαµ1 + (1 − α)µ2 ≻ µ1IA + µ2IAc ⇔ (1− α)(µ2 − µ1)IA + α(µ1 − µ2)IAc ∈ R,\nand similarly\nµ1IA + µ2IAc ≻ α ′µ1 + (1− α ′)µ2 ⇔ (1− α ′)(µ1 − µ2)IA + α ′(µ2 − µ1)IAc ∈ R.\nNow, if P is a linear prevision,\nP ((1 − α)(µ2 − µ1)IA + α(µ1 − µ2)IAc) = (µ2 − µ1)(P (A) − α).\nHence, there are two possibilities: either P (A) < α, and then P ((1−α)(µ2−µ1)IA+α(µ1−µ2)IAc) > 0 and as a consequence (1−α)(µ2−µ1)IA+α(µ1−µ2)IAc ∈ R; or P (A) ≥ α, whence for every α′ < α it holds that\nP ((1 − α′)(µ1 − µ2)IA + α ′(µ2 − µ1)IAc) = (µ1 − µ2)(P (A)− α ′) > 0,\nand as a consequence (1− α′)(µ1 − µ2)IA + α′(µ2 − µ1)IAc ∈ R.\n(iv) ⇒ (i) If P is not a linear prevision, then its restriction to events cannot be additive, so there is some event A such that P (A) < P (A). Then if we take µ1 = 1, µ2 = 0 and α ∈ (P (A), P (A)),\nαµ1 + (1− α)µ2 − (µ1IA + µ2IAc) = α− IA /∈ R because P (A) > α,\nand similarly given α′ ∈ (P (A), α),\nµ1IA + µ2IAc − (α ′µ1 + (1 − α ′)µ2) = IA − α ′ /∈ R because P (A) < α′.\nThis is a contradiction.\nProof of Theorem 27. Let us begin by establishing the direct implication. Assume ex-absurdo that P is not dominated by the strong product PΩ ⊠ PX . Then there are some PΩ ∈ M(PΩ) and PX ∈ M(PX ) such that PΩ × PX /∈ M(P ). Thus, there is some gamble f in L(Ω ×X ) such that P (f) > (PΩ × PX )(f). On the other hand,\n(PΩ × PX )(f) = PΩ(PX (f |Ω)) ≥ PΩ(PX (f |Ω)),\nand this is a contradiction with Eq. (23). Conversely, let us prove first of all that the strong product PΩ ⊠ PX satisfies Eq. (23). Consider PX ≥ PX and a gamble f ∈ L(Ω ×X ). Given the gamble PX (f |Ω) on Ω, there is some PΩ ≥ PΩ such that\nPΩ(PX (f |Ω)) = PΩ(PX (f |Ω)),\nwhence PΩ ⊠ PX (f) ≤ PΩ(PX (f |Ω)), and as a consequence (23) holds. Now, if P ≤ PΩ ⊠ PX , given PX ≥ PX and a gamble f ∈ L(Ω ×X ), P (f) ≤ PΩ ⊠ PX (f) ≤ PΩ(PX (f |Ω)). Hence, P also satisfies (23).\nOur next result is used in the proof of Lemma 28. It extends [6, Proposition 25].\nLemma 40. Let P be a coherent lower prevision on L(Ω × X ) with marginals PΩ, PX . If PX =: PX is a linear prevision, then the only independent product of PΩ, PX is the strong product PΩ ⊠ PX , which coincides moreover with PΩ(PX (·|Ω)).\nProof. It has been established in [18, Proposition 7] that when PX is a linear prevision, then P is an independent product if and only if it dominates PΩ(PX (·|Ω)). Let us show that we must actually have the equality.\nGiven a gamble f , it holds that\nP (f − PX (f |Ω)) ≥ PΩ(PX (f − PX (f |Ω))|Ω)) = 0 and\nP (−f − PX (−f |Ω)) ≥ PΩ(PX (−f − PX (−f |Ω))|Ω)) = 0,\nwhence\n0 = P (0) = P ((f − PX (f |Ω)) + (−f − PX (−f |Ω))) ≥ P (f − PX (f |Ω)) + P (−f − PX (−f |Ω)) ≥ 0,\nand as a consequence P (f − PX (f |Ω)) = 0 for every f . From this it follows that P (f − PX (f |Ω)) = −P (−(f − PX (f |Ω))) = −P (−f − PX (−f |Ω)) = 0 for every f ∈ L(Ω × X ). Now, it is a consequence of [33, Theorem 2.6.1(e)] that\nP (f) = P ((f − PX (f |Ω)) + PX (f |Ω)) ≤ P (f − PX (f |Ω)) + P (PX (f |Ω)) = PΩ(PX (f |Ω)),\nand since we have the double inequality we obtain the equality. We deduce in particular that the strong product, which is an independent product, must also coincide with PΩ(PX (·|Ω)).\nProof of Lemma 28. Let us first show that Eq. (24) is equivalent to the following:\n(∀g, f ∈ L)P (g − f) ≥ inf ω∈Ω\nP (g − fω). (A.17)\nTo show the direct implication, let g′ := g − infω∈Ω P (g − fω). Considered that infω∈Ω P (g′ − fω) = 0, we obtain by Eq. (24) that P (g′ − f) ≥ 0, whence P (g − f) ≥ infω∈Ω P (g − fω). For the converse implication, it is enough to consider that P (g − f) ≥ infω∈Ω P (g − fω) ≥ 0.\nNow, in the particular case that P is a linear prevision P (with marginals PΩ , PX ), then Eq. (A.17) is in turn equivalent to P (−f) ≥ infω∈Ω P (−fω) = infω∈Ω P (−f |ω), where P (·|Ω) is derived from PX by Eq. (21). This is also equivalent to\nP (f) ≥ inf ω∈Ω PX (f |ω)\nbecause the former inequality has to hold for all gambles f .\nIf P is an independent product of its marginals, then it is in particular coherent with PX (·|Ω), and by [33, Theorem 6.5.7], this is equivalent to P (f) ≥ infω∈Ω PX (f |ω). Conversely, if it is coherent with PX (·|Ω), then by [33, Theorem 6.7.3] it must be P = PΩ(PX (·|Ω)), and then, by Lemma 40, P is an independent product.\nLet us show now that (24) is preserved by taking lower envelopes. Let M be a family of linear previsions satisfying Eq. (24), and take P := infM. Consider gambles f, g ∈ L(Ω × X ). Then for any ε > 0 there is some P ∈ M such that\nP (g − f − inf ω∈Ω P (g − fω)) = P (g − f − inf ω∈Ω P (g − fω))− ε ≥ P (g − f − inf ω∈Ω P (g − fω))− ε ≥ −ε,\ntaking into account that P ≥ P and that it satisfies (24). Since this holds for any ε > 0, we deduce that P (g − f − infω∈Ω P (g − fω)) ≥ 0 and as a consequence P also satisfies Eq. (24).\nThe next proof is a reformulation of the one given by Galaabaatar and Karni in [12, Theorem 1].\nProof of Proposition 29. The direct implication follows from Lemma 28. Let us prove the converse. Let exp(M(P )) denote the set of exposed points17 of M(P ). Since Ω,X are finite, it follows from Straszewicz’s theorem [25, Theorem 18.6] that M(P ) is the closed convex hull of exp(M(P )), and as a consequenceP is the lower envelope of the set of exposed points. Let us show that each of these linear previsions satisfies Eq. (25).\nIn order to prove this, we are going to show first that the following condition is necessary for the factorisation in Eq. (25):\n(∀x1, x2 ∈ X )(∃kx1,x2 ∈ R)(∀ω ∈ Ω)P ({(ω, x1)}) = kx1,x2P ({(ω, x2)}).\nTo prove that this is the case, note that under the above conditions we get, for any ω ∈ Ω, x ∈ X , that\nP ({ω}) = ∑\nx′∈X\nP ({(ω, x′)}) = ∑\nx′∈X\nkx,x′P ({(ω, x)}) = P ({(ω, x)})( ∑\nx′∈X\nkx,x′) (A.18)\nand\nP ({x})kx,x′ = ( ∑\nω′∈Ω\nP ({(ω′, x)}))kx,x′ = ∑\nω′∈Ω\n(kx,x′P ({(ω ′, x)})) =\n∑\nω′∈Ω\nP ({(ω′, x′)}) = P ({x′}),\nwhence P ({x})( ∑\nx′∈X\nkx,x′) = ∑\nx′∈X\nkx,x′P ({x}) = ∑\nx′∈X\nP ({x′}) = 1.\nThis implies that P ({x}) > 0 and as a consequence that ( ∑\nx′∈X kx,x′) = 1 P ({x}) ; using Eq. (A.18), we conclude that P ({(ω, x)}) = P ({ω})P ({x}).\nNow, assume ex-absurdo that there is an exposed point P of M(P ) that does not satisfy Eq. (25). Then, the reasoning above implies that we can find two elements x1, x2 in X for which there is no real k such that P ({(ω, x1)}) = kP ({(ω, x2)}) for all ω.\nThis in turn implies that there are ω1, ω2 in Ω such that P ({(ω1, x1)}) = k1P ({(ω1, x2)}) and P ({(ω2, x1)}) = k2P ({(ω2, x2)}) for different non-negative real numbers k1 6= k2. Note that the inequalities P ({(ω1, x1)}) 6= k2P ({(ω1, x2)}) and P ({(ω2, x1)}) 6= k1P ({(ω2, x2)}) imply that P ({(ω1, x2)}), P ({(ω2, x2)}) 6= 0 and that\nk1, k2 > 0. Assume without loss of generality that k1 > k2. Then for every λ ∈ (\n1 k1 , 1 k2\n) ,"}, {"heading": "P (λI{x1}|{ω1}) > P (I{x2}|{ω1}) and P (λI{x1}|{ω2}) < P (I{x2}|{ω2}).", "text": "In particular, we can choose some λ∗ ∈ ( 1 k1 , 1 k2 ) such that P (λ∗I{x1}) 6= P (I{x2}). Consider then the gambles h1 := λ ∗I{x1} and h2 := I{x2}.\n17From [25, Section 18], an exposed point of a convex set C is a point through which there is a supporting hyperplane which contains no other point of C.\nAssume for instance that P (h1) > P (h2) (if P (h1) < P (h2) then it suffices to reverse the argument below), and let us define the gamble f ∈ L(Ω ×X ) by\nf : Ω ×X → R\n(ω, x) 7→\n{ h1(ω, x) if P (h1|{ω}) ≥ P (h2|{ω}),\nh2(ω, x) otherwise.\nIt follows from this definition that\nfω =\n{ hω1 if P (h1|{ω}) ≥ P (h2|{ω}),\nhω2 otherwise,\nwhence fω1 = hω11 , f ω2 = hω22 .\nNow, since P is an exposed point, there is a gamble g ∈ L(X × Ω) such that P (g) < P ′(g) for any P ′ ∈ M(P ), P ′ 6= P . Note that we can assume without loss of generality that P (g) = 0, simply by redefining g := g−P (g). In particular, for every λ > 0 it holds that P (λg) = λP (g) = 0, and therefore\n(∀λ > 0)P (λg + h1 − h1) = P (λg + h1 − f ω1) = 0,\ntaking into account that hω11 = h1 because it is an X -measurable gamble. Let us show that there is some λ > 0 such that P (λg+h1−h2) ≥ 0. If this were not the case, then for every natural number n there would be some Pn ∈ M(P ) such that Pn(ng+h1−h2) < 0, whence Pn(h2−h1) > nPn(g). Since M(P ) is a compact subset of R|Ω×X|, which is a metric space, it is sequentially compact, so there is a subsequence of (Pn)n∈N that converges towards some P ′ ∈ M(P ). If P ′(g) > 0, then we have that P ′(h2 − h1) ≥ mP ′(g) for all m ∈ N, which means that P ′(h2 − h1) = +∞, a contradiction. Thus, we must have P ′(g) = 0 or, equivalently, P ′ = P . But P (h2 − h1) = P ′(h2 − h1) ≥ 0 by construction, while we have assumed before that P (h1) > P (h2). This is a contradiction.\nWe conclude that there is some λ⋆ > 0 such that P (λ⋆g + h1 − h2) ≥ 0. Then P (λ⋆g + h1 − fω) ≥ 0 for all ω ∈ Ω, since we have established that\nP (λ⋆g + h1 − h1) ≥ 0 and P (λ⋆g + h1 − h2) ≥ 0.\nOn the other hand,\nP (λ⋆g + h1 − f) ≤ P (λ ⋆g + h1 − f) = P (h1 − f) =\n∑\nω∈Ω\nP ({ω})[P (h1|{ω})− P (f ω|{ω})]\n= ∑\nω∈Ω:fω=h2\nP ({ω})[P (h1|{ω})− P (h2|{ω})] ≤ P ({ω2})[P (h1|{ω2})− P (h2|{ω2})] < 0,\nsince P ({ω2}) > 0 and P (h1|{ω2}) < P (h2|{ω2}). This is a contradiction with (24).\nThe next one is a technical result needed in the proof of Theorem 30 below.\nLemma 41. Let P 1, P 2 be two coherent lower previsions with a linear domain K ⊆ L, and such that P 1(f) ≥ P 2(f) for every f ∈ K. Let P ′2 be a coherent lower prevision on L that extends P 2. Then there is a coherent lower prevision P ′1 on L that extends P 1 such that P ′ 1 ≥ P ′ 2.\nProof. Consider the credal set M(P 1) := {P linear : (∀f ∈ K)P (f) ≥ P 1(f)}, and let M(P ′ 2) be the credal set associated with P ′2. Define M := M(P 1) ∩M(P ′ 2). This is the intersection of two compact and convex sets, so it is also compact and convex. We start proving that it is not empty. Let us assume by contradiction that M is empty. Then we can apply the strong separation theorem in [33, Appendix E3] and find a gamble f and a real number µ such that P ′(f) < µ for every P ′ ∈ M(P 1) and P ′(f) > µ for every P ′ ∈ M(P ′2). This means that the upper envelope EP 1 of M(P 1) satisfies EP 1(f) < P ′ 2(f).\nSince K is a linear set, we can regard it as a convex cone with the additional property that K = −K. This allows us to deduce from [33, Theorem 3.1.4] that EP\n1 (f) = inf{P 1(g) + µ : f ≤ g + µ, g ∈ K} < P ′ 2(f); whence there\nis some ε > 0, some real µ and some g ∈ K such that f ≤ g + µ and P 1(g) + µ ≤ P ′ 2(f)− ε. It follows that\nf − g − µ+ P 1(g) + µ ≤ P ′ 2(f)− ε ⇒ f − P ′ 2(f)− g + P 1(g) ≤ −ε ⇒ f − P ′ 2(f)− g + P ′ 2(g) ≤ −ε,\ntaking into account that P 1(g) ≥ P 1(g) ≥ P 2(g) = P ′ 2(g), given that g ∈ K and that P ′ 2 is an extension of P 2. This contradicts the coherence of P ′2. We conclude that M is not empty. By [33, Theorem 3.6.1], M induces a coherent lower prevision P ′1 on L, and M(P ′ 1) = M = M(P 1)∩M(P ′ 2). This implies that P ′1 dominates P ′ 2 as well as P 1. In order to show that it is an extension of P 1, it remains to prove that P ′1 coincides with P 1 on K. Consider a gamble f ∈ K, and let P1 ∈ M(P 1) satisfy P1(f) = P 1(f). The restriction of P1 to K dominates P 2, so we can reason as before to conclude that M(P1) ∩M(P ′ 2) 6= ∅.\nNote that any linear prevision P ′1 in M(P1) must agree with P1 on K, since this set is negation invariant and we have P ′1(f) ≥ P1(f) and also P1(f) = −P1(−f) ≥ −P ′ 1(−f) = P ′ 1(f) for any f ∈ K. Thus, we conclude that there is a linear prevision P ′1 that coincides with P1 in K and dominates P ′ 2 on all gambles. It follows that P ′1 ∈ M(P 1) ∩M(P ′ 2) = M(P ′ 1). As a consequence, P ′ 1(f) ≤ P ′ 1(f) = P 1(f), and since the converse inequality holds trivially we conclude that P ′1 = P 1 on K.\nProof of Theorem 30. If Ω is finite, the result follows from Proposition 29. Consider next the case of Ω infinite, and assume ex-absurdo that there is a gamble f on Ω × X such that P (f) < (PΩ ⊠ PX )(f). By Lemma 28, Eq. (24) is preserved by taking lower envelopes, so we can redefine P := min{P, PΩ ⊠ PX } and obtain a coherent lower prevision on L(Ω ×X ) that is dominated by PΩ ⊠ PX and satisfies Eq. (24).\nLet us prove that for every natural number n there exists a simple gamble fn on Ω ×X such that ‖fn − f‖ ≤ 1n . Since f is bounded, there exists some natural number k such that −k ≤ inf f ≤ sup f ≤ k. For every n, there\nexists a finite partition Bn of [−k, k] with intervals Inj of length smaller than 1 n . Let us define the gamble fn on Ω×X by\nfn(ω, x) := inf I n j if f(ω, x) ∈ I n j ,\nfor every (ω, x) ∈ Ω×X . Then since the partition Bn is finite, we deduce that fn is simple. Moreover, by construction |fn(ω, x) − f(ω, x)| ≤ 1 n\nfor every (ω, x) ∈ Ω ×X . Let us define next the relation\nω ∼ ω′ ⇔ (∀x ∈ X )fn(ω, x) = fn(ω ′, x).\nThis is trivially an equivalence relation. It has a finite number of equivalence classes: if {z1, . . . , zk} denotes the finite range of fn and X = {x1, . . . , xm}, then the equivalence classes are given by\n{ω : (∀i = 1, . . . ,m)fn(ω, xi) = zti},\nwhere (t1, . . . , tm) ∈ {1, . . . , k}m is finite. In other words, the number of equivalence classes is at most {1, . . . , k}m. Let us denote these classes by {B1, . . . , Bℓ}.\nNext, let us define the set of gambles\nK := {g ∈ L(Ω ×X ) : (∀ω ∼ ω′)g(ω, x) = g(ω′, x)}.\nThis is a linear set of gambles: given g1, g2 ∈ K and reals λ1, λ2, it holds that\n(λ1g1 + λ2g2)(ω, x) = λ1g1(ω, x) + λ2g2(ω, x) = λ1g1(ω ′, x) + λ2g2(ω ′, x) = (λ1g1 + λ2g2)(ω ′, x)\nfor every ω ∼ ω′. The set K corresponds to the gambles that are measurable with respect to the finite partition {Bj × {xi} : i = 1, . . . ,m, j = 1, . . . , ℓ} of Ω ×X , and by construction it includes the gamble fn. Let P ′ denote the restriction of P to K. Its marginals are P ′Ω and PX , where P ′ Ω is the restriction of PΩ to the gambles that are measurable with respect to the partition B := {B1, . . . , Bℓ} of Ω. Moreover, K is in a one-to-one correspondence with L({1, . . . , ℓ} × X ), so we can regard P ′ as a coherent lower prevision defined on the set of\ngambles on a finite possibility space. Since P satisfies (24), so does its restriction P ′. By Proposition 29, P ′ is a lower envelope of linear previsions satisfying Eq. (25), so there are two linear previsions P ′Ω ≥ P ′ Ω, PX ≥ PX such that\nP (fn) = P ′(fn) = (P ′ Ω × PX )(fn).\nBy construction, we can regard P ′Ω as a linear prevision defined on the set\n{f ∈ L(Ω) : (∀ω ∼ ω′)f(ω) = f(ω′)}\nthat dominates PΩ on this domain. By Lemma 41, there is a linear prevision PΩ ∈ M(PΩ) that extends P ′ Ω . This means that P (fn) = (P ′Ω × PX )(fn) ≥ (PΩ ⊠ PX )(fn), and applying coherence, that P (f) = limn→∞ P (fn) ≥ limn→∞(PΩ ⊠ PX )(fn) = (PΩ ⊠ PX )(f). Since P is dominated by the strong product PΩ ⊠ PX , we conclude that P (f) = (PΩ ⊠ PX )(f), a contradiction.\nProof of Proposition 33. For the direct implication, it suffices to show that R̃ satisfies Eq. (26). Consider a set B and a gamble f ∈ R̃|B. Then there are f1 ∈ R1|B, f2 ∈ R2|B such that f = f1+ f2. Note that by construction S(f1), S(f2), S(f) ⊆ B and also there is some ε > 0 such that B(f2 − ε) ∈ R. Let us prove that IS(f)(f − ε 2 ) ∈ R̃|B. Since S(f) ⊆ B, it holds that, for any δ > 0,\nIS(f)(f − δ) = B(f − δ) + δIB\\S(f) = B(f1 + f2 − δ) + δIB\\S(f) = B(f2 − δ) + Bf1 + δIB\\S(f);\nthe gamble Bf1 + δIB\\S(f) belongs to R1|B for any δ > 0; on the other hand, B(f2 − δ) belongs to R2|B for any δ ∈ (0, ε), and in particular for δ = ε2 . As a consequence, IS(f)(f − ε 2 ) ∈ R̃|B.\nThis implies that R̃|B satisfies Eq. (26), and as a consequence so does R̃. Therefore, its natural extension R is a fully strictly desirable set of gambles.\nAs for the converse implication, by construction, R̃|B ⊆ R for every set B, whence R includes the natural extension of R̃. If R is a fully strictly desirable set, then it is the natural extension of a set R′ satisfying Eq. (26). Given a gamble f ∈ R′, it follows from (26) that f ∈ R2|S(f) ⊆ R̃|S(f), and hence R′ ⊆ R̃ ⊆ R. As a consequence, R is the natural extension of R̃.\nProof of Theorem 34. First of all, we are going to show that R is coherent. For this, it suffices to show that the set ∪i∈IR2|Bi avoids partial loss. Since for every i ∈ I the set R2|Bi is a convex cone, given that P i(·|Bi) is coherent, the set ∪i∈IR2|Bi incurs partial loss if and only if there is some finite J ⊆ I and gj ∈ R2|Bj for every j ∈ J such that ∑ j∈J gj ≤ 0. In that case,\n0 ≥ ∑\nj∈J\ngj = ∑\nj∈J\nBj(fj − (P j(fj|Bj)− εj)),\nfor some fj ∈ L and some εj > 0. As a consequence,\nsup ω∈∪j∈JBj\n  ∑\nj∈J\nBj(fj − P (fj |Bj))\n\n (ω) < 0,\na contradiction with Eq. (28). Let us show next that R̃|Bi satisfies Eq. (26). Consider f ∈ R̃|Bi. Then there are f1 ∈ R1|Bi, f2 ∈ R2|Bi such that f = f1 + f2. Note that by construction S(f1), S(f2), S(f) ⊆ Bi. Thus, for any δ > 0,\nIS(f)(f − δ) = Bi(f − δ) + δIBi\\S(f) = Bi(f1 + f2 − δ) + δIBi\\S(f) = Bi(f2 − δ) + Bif1 + δIBi\\S(f);\nthe gamble Bif1 + δIBi\\S(f) belongs to R1|Bi for any δ > 0; on the other hand, for f2 there exists some g2 ∈ L and some ε > 0 such that f2 = Bi(g2 − (P i(g2|Bi) − ε)), whence if we take δ ∈ (0, ε) we obtain that Bi(f2 − δ) = Bi(g2 − (P i(g2|Bi)− (ε− δ))) ∈ R2|Bi. As a consequence, IS(f)(f − δ) ∈ R̃|Bi.\nWe have obtained that the set R̃|Bi satisfies Eq. (26) for all i ∈ I , and as a consequence so does the union ∪i∈IR̃|Bi. Since R is the natural extension of ∪i∈IR̃|Bi, we deduce that it is a fully strictly desirable set.\nProof of Proposition 35. Assume that a set of gambles R′ satisfies (26), and let R be its natural extension. Then by definition of the natural extension, for every f ∈ R there are gambles f1, . . . , fn ∈ R′ and positive real numbers λ1, . . . , λn such that\nf = IS(f)f ≥ n∑\nj=1\nλjfj.\nBy (26), for every j ∈ {1, . . . , n} there is some εj such that IS(fj)(fj − εj) ∈ R ′. Let\nε := min{min j λjεj , min ω∈S(f)\\∪jS(fj) f(ω)} > 0.\nNote that f > 0 in IS(f)\\∪jS(fj), provided that S(f) \\∪jS(fj) 6= ∅, since f 6= 0 in S(f), while f ≥ ∑n\nj=1 λjfj = 0 outside ∪jS(fj); moreover, since S(f) is finite we deduce that minω∈S(f)\\∪jS(fj) f(ω) > 0. Taking into account that λjεj > 0 for all j, we conclude that indeed ε > 0. Moreover, we deduce also that\nIS(f)\\∪jS(fj)(f − ε) ≥ 0; (A.19)\nto prove this, it is enough to reconsider that f > 0 in S(f) \\ ∪jS(fj), and that ε ≤ minω∈S(f)\\∪jS(fj) f(ω). Now,\nIS(f)(f − ε) ≥ ( n∑\nj=1\nλjfj)− εIS(f) ≥ n∑\nj=1\nλjIS(fj)fj − εI∪jS(fj) − εIS(f)\\∪jS(fj)\n≥ n∑\nj=1\n(λjIS(fj)fj − εIS(fj))− εIS(f)\\∪jS(fj)\n≥ n∑\nj=1\nλjIS(fj)(fj − εj)− εIS(f)\\∪jS(fj), (A.20)\nwhere in the last passage we have used that ε ≤ minj λjεj . Consider two cases:\n◦ If ω ∈ S(f) \\ ∪jS(fj), then IS(f)(f − ε) ≥ 0 = ∑n\nj=1 λjIS(fj)(fj − εj), where the inequality follows from (A.19).\n◦ If ω ∈ ∪jS(fj), then IS(f)(f − ε) ≥ ∑n j=1 λjIS(fj)(fj − εj), as it follows from (A.20).\nAs a consequence, IS(f)(f−ε) ≥ ∑n j=1 λjIS(fj)(fj−εj), and since IS(fj)(fj−εj) ∈ R ′, we deduce that IS(f)(f−ε) belongs to R. Thus, R also satisfies (26). We conclude that R is fully strictly desirable if and only if it satisfies (26)."}], "references": [{"title": "A definition of subjective probability", "author": ["F.J. Anscombe", "R.J. Aumann"], "venue": "The Annals of Mathematical Statistics,", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1963}, {"title": "Knightian decision theory: part I", "author": ["T. Bewley"], "venue": "Decisions in economics and finance,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 2002}, {"title": "Lecture Notes in Convex Analysis", "author": ["P. Cheridito"], "venue": "Pricenton University,", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 2013}, {"title": "Irrelevance and independence for sets of desirable gambles", "author": ["G. de Cooman", "E. Miranda"], "venue": "Journal of Artificial Intelligence Research,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 2012}, {"title": "Independent natural extension", "author": ["G. de Cooman", "E. Miranda", "M. Zaffalon"], "venue": "Artificial Intelligence,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2011}, {"title": "Exchangeability and sets of desirable gambles", "author": ["G. de Cooman", "E. Quaeghebeur"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2012}, {"title": "Sulla proprietà conglomerativa delle probabilità subordinate", "author": ["B. de Finetti"], "venue": "Rendiconti del Reale Instituto Lombardo,", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 1930}, {"title": "Sul significato soggettivo della probabilità", "author": ["B. de Finetti"], "venue": "Fundamenta Mathematicae,", "citeRegEx": "9", "shortCiteRegEx": "9", "year": 1931}, {"title": "La prévision: ses lois logiques, ses sources subjectives", "author": ["B. de Finetti"], "venue": "Annales de l’Institut Henri Poincaré,", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 1937}, {"title": "Recursive multiple-priors", "author": ["L.G. Epstein", "M. Schneider"], "venue": "Journal of Economic Theory,", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2003}, {"title": "Subjective expected utility with incomplete", "author": ["T. Galaabaatar", "E. Karni"], "venue": "preferences. Econometrica,", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2013}, {"title": "Consistent plans, consequentialism, and expected", "author": ["P. Hammond"], "venue": "utility. Econometrica,", "citeRegEx": "13", "shortCiteRegEx": "13", "year": 1988}, {"title": "Studies in Subjective Probability", "author": ["H.E. Kyburg Jr.", "H.E. Smokler", "editors"], "venue": "Wiley, New York,", "citeRegEx": "14", "shortCiteRegEx": "14", "year": 1964}, {"title": "Dynamic consistency and non-expected utility models of choice under uncertainty", "author": ["M. Machina"], "venue": "Journal of Economic Literature,", "citeRegEx": "15", "shortCiteRegEx": "15", "year": 1989}, {"title": "Marginal extension in the theory of coherent lower previsions", "author": ["E. Miranda", "G. de Cooman"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "16", "shortCiteRegEx": "16", "year": 2007}, {"title": "Notes on desirability and conditional lower previsions", "author": ["E. Miranda", "M. Zaffalon"], "venue": "Annals of Mathematics and Artificial Intelligence,", "citeRegEx": "17", "shortCiteRegEx": "17", "year": 2010}, {"title": "Independent products in infinite spaces", "author": ["E. Miranda", "M. Zaffalon"], "venue": "Journal of Mathematical Analysis and Applications,", "citeRegEx": "18", "shortCiteRegEx": "18", "year": 2015}, {"title": "On the problem of computing the conglomerable natual extension", "author": ["E. Miranda", "M. Zaffalon"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "19", "shortCiteRegEx": "19", "year": 2015}, {"title": "Conglomerable natural extension", "author": ["E. Miranda", "M. Zaffalon", "G. de Cooman"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "20", "shortCiteRegEx": "20", "year": 2012}, {"title": "The shape of incomplete preferences", "author": ["R. Nau"], "venue": "The Annals of Statistics,", "citeRegEx": "21", "shortCiteRegEx": "21", "year": 2006}, {"title": "Incomplete preferences under uncertainty: indecisiveness in beliefs versus tastes", "author": ["E. Ok", "P. Ortoleva", "G. Riella"], "venue": null, "citeRegEx": "22", "shortCiteRegEx": "22", "year": 2012}, {"title": "Comparative expectations", "author": ["A.P. Pedersen"], "venue": "Studia Logica,", "citeRegEx": "23", "shortCiteRegEx": "23", "year": 2014}, {"title": "Accept & reject statement-based uncertainty models", "author": ["E. Quaeghebeur", "G. de Cooman", "F. Hermans"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "24", "shortCiteRegEx": "24", "year": 2015}, {"title": "Convex Analysis", "author": ["R.T. Rockafellar"], "venue": null, "citeRegEx": "25", "shortCiteRegEx": "25", "year": 1970}, {"title": "The Foundations of Statistics", "author": ["L.J. Savage"], "venue": null, "citeRegEx": "26", "shortCiteRegEx": "26", "year": 1954}, {"title": "Decisions without ordering", "author": ["T. Seidenfeld", "M.J. Schervish", "J.B. Kadane"], "venue": "Acting and reflecting,", "citeRegEx": "27", "shortCiteRegEx": "27", "year": 1990}, {"title": "A representation of partially ordered preferences", "author": ["T. Seidenfeld", "M.J. Schervish", "J.B. Kadane"], "venue": "The Annals of Statistics,", "citeRegEx": "28", "shortCiteRegEx": "28", "year": 1995}, {"title": "Rethinking the Foundations of Statistics", "author": ["T. Seidenfeld", "M.J. Schervish", "J.B. Kadane"], "venue": null, "citeRegEx": "29", "shortCiteRegEx": "29", "year": 1999}, {"title": "Coherence and the axioms of confirmation", "author": ["A. Shimony"], "venue": "The Journal of Symbolic Logic,", "citeRegEx": "30", "shortCiteRegEx": "30", "year": 1955}, {"title": "Consistency in statistical inference and decision", "author": ["C.A.B. Smith"], "venue": "Journal of the Royal Statistical Society, Series A,", "citeRegEx": "31", "shortCiteRegEx": "31", "year": 1961}, {"title": "Morgestern. Theory of games and economic behaviour", "author": ["O.J. Von Neumann"], "venue": null, "citeRegEx": "32", "shortCiteRegEx": "32", "year": 1947}, {"title": "Statistical Reasoning with Imprecise Probabilities", "author": ["P. Walley"], "venue": null, "citeRegEx": "33", "shortCiteRegEx": "33", "year": 1991}, {"title": "Notes on conditional previsions", "author": ["P.M. Williams"], "venue": "Technical report, School of Mathematical and Physical Science,", "citeRegEx": "34", "shortCiteRegEx": "34", "year": 1975}, {"title": "Notes on conditional previsions", "author": ["P.M. Williams"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "35", "shortCiteRegEx": "35", "year": 2007}, {"title": "Probability and time", "author": ["M. Zaffalon", "E. Miranda"], "venue": "Artificial Intelligence,", "citeRegEx": "36", "shortCiteRegEx": "36", "year": 2013}], "referenceMentions": [{"referenceID": 30, "context": "Strand one It seems natural to found a theory of rational decision making on the notion of preference; after all, what is deciding other than choosing between alternatives? This must have been the idea behind the early works on the subject, starting from von Neumann and Morgenstern’s [32], to the analytical framework of Anscombe and Aumann [1] and to that of Savage [26].", "startOffset": 285, "endOffset": 289}, {"referenceID": 0, "context": "Strand one It seems natural to found a theory of rational decision making on the notion of preference; after all, what is deciding other than choosing between alternatives? This must have been the idea behind the early works on the subject, starting from von Neumann and Morgenstern’s [32], to the analytical framework of Anscombe and Aumann [1] and to that of Savage [26].", "startOffset": 342, "endOffset": 345}, {"referenceID": 24, "context": "Strand one It seems natural to found a theory of rational decision making on the notion of preference; after all, what is deciding other than choosing between alternatives? This must have been the idea behind the early works on the subject, starting from von Neumann and Morgenstern’s [32], to the analytical framework of Anscombe and Aumann [1] and to that of Savage [26].", "startOffset": 368, "endOffset": 372}, {"referenceID": 1, "context": "Axiomatisations of rational decision making with incomplete preferences came much later, though, through the works of Bewley [3], Seidenfeld et al.", "startOffset": 125, "endOffset": 128}, {"referenceID": 26, "context": "[28], Nau [21], and, more recently, Ok et al.", "startOffset": 0, "endOffset": 4}, {"referenceID": 19, "context": "[28], Nau [21], and, more recently, Ok et al.", "startOffset": 10, "endOffset": 14}, {"referenceID": 20, "context": "[22], and Galaabaatar and Karni [12].", "startOffset": 0, "endOffset": 4}, {"referenceID": 10, "context": "[22], and Galaabaatar and Karni [12].", "startOffset": 32, "endOffset": 36}, {"referenceID": 8, "context": "De Finetti’s next bright move was to deduce probability by imposing a single axiom of self-consistency on Thilda’s fair prices for different gambles [10].", "startOffset": 149, "endOffset": 153}, {"referenceID": 29, "context": "Smith suggested that de Finetti’s approach could be extended to account for the case that probabilities are indeterminate or not precisely specified [31].", "startOffset": 149, "endOffset": 153}, {"referenceID": 32, "context": "Williams made Smith’s ideas precise, by giving an axiomatisation that is again based on a notion of self-consistency, which is called coherence since then [34].", "startOffset": 155, "endOffset": 159}, {"referenceID": 31, "context": "Williams’ fundamental work went largely unnoticed until Walley used it as the basis for his theory of imprecise probability [33].", "startOffset": 124, "endOffset": 128}, {"referenceID": 7, "context": "Conglomerability [9] is a property that a finitely additive model may or may not satisfy, and that makes a difference when the space of possibilities is infinite.", "startOffset": 17, "endOffset": 20}, {"referenceID": 25, "context": "2These are also called favourable gambles in [27].", "startOffset": 45, "endOffset": 49}, {"referenceID": 0, "context": "If we call Ω the possibility space and X the set of possible outcomes, or prizes, then a horse lottery, or act, p : Ω × X → [0, 1] is a nested, or compound, lottery that returns a simple lottery p(ω, ·) on X for each possible realisation of ω ∈ Ω.", "startOffset": 124, "endOffset": 130}, {"referenceID": 19, "context": "We consider the work by Nau [21] in the light of the connection we make to desirability, showing how some of his notions map into ours and vice versa.", "startOffset": 28, "endOffset": 32}, {"referenceID": 10, "context": "The work by Galaabaatar and Karni [12] is particularly interesting to compare as it has been a source of inspiration for ours, and because it is actually quite close in spirit, even though it misses the connection to desirability.", "startOffset": 34, "endOffset": 38}, {"referenceID": 26, "context": "Finally, we consider the work by Seidenfeld, Schervish and Kadane [28].", "startOffset": 66, "endOffset": 70}, {"referenceID": 32, "context": "This result goes back to Williams [34] and Walley [33] (for a recent proof, see [17, Proposition 2].", "startOffset": 34, "endOffset": 38}, {"referenceID": 31, "context": "This result goes back to Williams [34] and Walley [33] (for a recent proof, see [17, Proposition 2].", "startOffset": 50, "endOffset": 54}, {"referenceID": 28, "context": "It is instructive to track the origin of this assumption: it goes back to an important article by Shimony [30].", "startOffset": 106, "endOffset": 110}, {"referenceID": 21, "context": "But there are signs that something is changing and that there could be a renewed interest in non-Archimedean models (see for instance Pedersen’s very recent interesting work [23]).", "startOffset": 174, "endOffset": 178}, {"referenceID": 32, "context": "In fact, conditions D1–D4 essentially make up Williams’ theory of desirability [34].", "startOffset": 79, "endOffset": 83}, {"referenceID": 31, "context": "The competing theory by Walley [33] adds them a fifth condition that depends on the choice of a partition B of the possibility space:", "startOffset": 31, "endOffset": 35}, {"referenceID": 6, "context": "Despite the innocuous-looking nature of D5, conglomerability has originated almost a century-long controversy after de Finetti discovered it [8].", "startOffset": 141, "endOffset": 144}, {"referenceID": 34, "context": "In some recent work we have shown that there are cases where conglomerability is necessary for a probabilistic theory to make coherent inferences in time [36].", "startOffset": 154, "endOffset": 158}, {"referenceID": 31, "context": "Although the natural extension is easy to compute [33], this is not necessarily the case for the conglomerable natural extension [20, 19].", "startOffset": 50, "endOffset": 54}, {"referenceID": 18, "context": "Although the natural extension is easy to compute [33], this is not necessarily the case for the conglomerable natural extension [20, 19].", "startOffset": 129, "endOffset": 137}, {"referenceID": 17, "context": "Although the natural extension is easy to compute [33], this is not necessarily the case for the conglomerable natural extension [20, 19].", "startOffset": 129, "endOffset": 137}, {"referenceID": 14, "context": "2] and later extended to deal with more than two spaces in [16]; in the previous form for desirable gambles it has appeared in [20, Section 7.", "startOffset": 59, "endOffset": 63}, {"referenceID": 13, "context": "This is a concept originally highlighted by Machina [15] and also related to the work of Hammond [13].", "startOffset": 52, "endOffset": 56}, {"referenceID": 11, "context": "This is a concept originally highlighted by Machina [15] and also related to the work of Hammond [13].", "startOffset": 97, "endOffset": 101}, {"referenceID": 9, "context": "This seems to be what Epstein and Schneider called ‘rectangularity’ in [11].", "startOffset": 71, "endOffset": 75}, {"referenceID": 24, "context": "The idea of a ‘probability currency’ appears to go back to Savage [26] and Smith [31] and has already been used also to give an interpretation of gambles in Walley’s theory [33, Section 2.", "startOffset": 66, "endOffset": 70}, {"referenceID": 29, "context": "The idea of a ‘probability currency’ appears to go back to Savage [26] and Smith [31] and has already been used also to give an interpretation of gambles in Walley’s theory [33, Section 2.", "startOffset": 81, "endOffset": 85}, {"referenceID": 16, "context": "These products have been introduced, in another context and for lower previsions, in [18].", "startOffset": 85, "endOffset": 89}, {"referenceID": 3, "context": "These products were studied for finite spaces and several variables in [5].", "startOffset": 71, "endOffset": 74}, {"referenceID": 3, "context": "this is closer to the formulation in [5], and it is not required in general in the definition above.", "startOffset": 37, "endOffset": 40}, {"referenceID": 3, "context": "The weakest independent product is again called the independent natural extension (see [5, 18] for more information).", "startOffset": 87, "endOffset": 94}, {"referenceID": 16, "context": "The weakest independent product is again called the independent natural extension (see [5, 18] for more information).", "startOffset": 87, "endOffset": 94}, {"referenceID": 16, "context": "12The following definition is equivalent to the one established in [18, Definition 4] in the context of this paper, where one of the referential spaces is finite; we refer to [18] for a more general study of independent products.", "startOffset": 175, "endOffset": 179}, {"referenceID": 10, "context": "We focus in particular on Galaabaatar and Karni’s work [12], which provides quite a general treatment and is easier to put in correspondence with ours.", "startOffset": 55, "endOffset": 59}, {"referenceID": 10, "context": "What we have obtained is that the notion of state independence is implicitly implemented in [12] by the strong product.", "startOffset": 92, "endOffset": 96}, {"referenceID": 10, "context": "5]) used to formalise state independence in [12], can be employed to that end also when Ω is infinite.", "startOffset": 44, "endOffset": 48}, {"referenceID": 10, "context": "Perhaps the most evident case where the two theories have nearly touched each other is in Galaabaatar and Karni’s work [12].", "startOffset": 119, "endOffset": 123}, {"referenceID": 10, "context": "The work of Galaabaatar and Karni One of the most influential works for this paper has been the one carried out by Galaabaatar and Karni (GK) in [12].", "startOffset": 145, "endOffset": 149}, {"referenceID": 19, "context": "The work by Nau Another important work in the axiomatisation of the expected utility model with imprecise probabilities and utilities was carried out by Nau in [21].", "startOffset": 160, "endOffset": 164}, {"referenceID": 26, "context": "The work by Seidenfeld, Schervish and Kadane Seidenfeld, Schervish and Kadane (SSK) are the authors of one of the first axiomatisations of incomplete preferences based on a multiprior expected multiutility representation [28].", "startOffset": 221, "endOffset": 225}, {"referenceID": 22, "context": "in [24].", "startOffset": 3, "endOffset": 7}, {"referenceID": 26, "context": "1 in [28]).", "startOffset": 5, "endOffset": 9}, {"referenceID": 0, "context": "Preferences are determined by the utility functions {uα : X → [0, 1]|uα(z) := 0, uα(b) := 1, uα(a) := α, α ∈ (0, 1)} by means of:", "startOffset": 62, "endOffset": 68}, {"referenceID": 5, "context": "In the language of [7], condition tA3 requires that any almost-desirable gamble should be weakly desirable.", "startOffset": 19, "endOffset": 22}, {"referenceID": 26, "context": "[28].", "startOffset": 0, "endOffset": 4}, {"referenceID": 0, "context": "Remember that |Xz | ≥ 2 by assumption (see Remark 3); whence, if we take μ ∈ (0, 1 λ|Xz| ), we obtain that [u + μλ(p1 − p2)](ω, x) ∈ [0, 1] for all (ω, x) ∈ Ω × Xz .", "startOffset": 133, "endOffset": 139}], "year": 2015, "abstractText": "We establish an equivalence between two seemingly different theories: one is the traditional axiomatisation of incomplete preferences on horse lotteries based on the mixture independence axiom; the other is the theory of desirable gambles (bounded random variables) developed in the context of imprecise probability, which we extend here to make it deal with vector-valued gambles. The equivalence allows us to revisit incomplete preferences from the viewpoint, and with the tools, of desirability and through the derived notion of coherent lower previsions (i.e., lower expectation functionals). On this basis, we obtain new results and insights: in particular, we show that the theory of incomplete preferences can be developed assuming only the existence of a worst act—no best act is needed—, and that a weakened Archimedean axiom suffices too; this axiom allows us also to address some controversy about the regularity assumption (that probabilities should be positive—they need not), which enables us also to deal with uncountable possibility spaces; we show that it is always possible to extend in a minimal way a preference relation to one with a worst act, and yet the resulting relation is never Archimedean, except in a trivial case; we show that the traditional notion of state independence coincides with the notion called strong independence in imprecise probability (stochastic independence in the case of complete preferences)—this leads us to give much a weaker definition of state independence than the traditional one; we rework and uniform the notions of complete preferences, beliefs, values; we argue that Archimedeanity does not capture all the problems that can be modelled with sets of expected utilities and we provide a new notion that does precisely that. Perhaps most importantly, we argue throughout that desirability is a powerful and natural setting to model, and work with, incomplete preferences, even in the case of non-Archimedean problems. This leads us to suggest that desirability, rather than preference, should be the primitive notion at the basis of decision-theoretic axiomatisations.", "creator": "LaTeX with hyperref package"}}}