{"id": "1510.09130", "review": {"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "30-Oct-2015", "title": "Latent Bayesian melding for integrating individual and population models", "abstract": "In many statistical problems, a more coarse-grained model may be suitable for population-level behaviour, whereas a more detailed model is appropriate for accurate modelling of individual behaviour. This raises the question of how to integrate both types of models. Methods such as posterior regularization follow the idea of generalized moment matching, in that they allow matching expectations between two models, but sometimes both models are most conveniently expressed as latent variable models. We propose latent Bayesian melding, which is motivated by averaging the distributions over populations statistics of both the individual-level and the population-level models under a logarithmic opinion pool framework. In a case study on electricity disaggregation, which is a type of single-channel blind source separation problem, we show that latent Bayesian melding leads to significantly more accurate predictions than an approach based solely on generalized moment matching.", "histories": [["v1", "Fri, 30 Oct 2015 15:39:06 GMT  (167kb,D)", "http://arxiv.org/abs/1510.09130v1", "11 pages, Advances in Neural Information Processing Systems (NIPS), 2015. (Spotlight Presentation)"]], "COMMENTS": "11 pages, Advances in Neural Information Processing Systems (NIPS), 2015. (Spotlight Presentation)", "reviews": [], "SUBJECTS": "stat.ML cs.AI stat.AP stat.ME", "authors": ["mingjun zhong", "nigel h goddard", "charles a sutton"], "accepted": true, "id": "1510.09130"}, "pdf": {"name": "1510.09130.pdf", "metadata": {"source": "META", "title": "Latent Bayesian melding for integrating individual and population models", "authors": ["Mingjun Zhong", "Nigel Goddard", "Charles Sutton"], "emails": ["mzhong@inf.ed.ac.uk", "nigel.goddard@inf.ed.ac.uk", "csutton@inf.ed.ac.uk"], "sections": [{"heading": "1 Introduction", "text": "Good statistical models of populations are often very different from good models of individuals. As an illustration, the population distribution over human height might be approximately normal, but to model an individual’s height, we might use a more detailed discriminative model based on many features of the individual’s genotype. As another example, in social network analysis, simple models like the preferential attachment model [3] replicate aggregate network statistics such as degree distributions, whereas to predict whether two individuals have a link, a social networking web site might well use a classifier with many features of each person’s previous history. Of course every model of an individual implies a model of the population, but models whose goal is to model individuals tend to be necessarily more detailed.\nThese two styles of modelling represent different types of information, so it is natural to want to combine them. A recent line of research in machine learning has explored the idea of incorporating constraints into Bayesian models that are difficult to encode in standard prior distributions. These methods, which include posterior regularization [9], learning with measurements [16], and the generalized expectation criterion [18], tend to follow a moment matching idea, in which expectations of the distribution of one model are encouraged to match values based on prior information.\nInterestingly, these ideas have precursors in the statistical literature on simulation models. In particular, Bayesian melding [21] considers applications in which there is a computer simulation M that maps from model parameters θ to a quantity φ = M(θ). For example, M might summarize the output of a deterministic simulation of population dynamics or some other physical phenomenon. Bayesian melding considers the case in which we can build meaningful prior distributions over both θ and φ. These two prior distributions need to be merged because of the deterministic relationship;\nar X\niv :1\n51 0.\n09 13\n0v 1\n[ st\nat .M\nL ]\n3 0\nthis is done using a logarithmic opinion pool [5]. We show that there is a close connection between Bayesian melding and the later work on posterior regularization, which does not seem to have been recognized in the machine learning literature. We also show that Bayesian melding has the additional advantage that it can be conveniently applied when both individual-level and population-level models contain latent variables, as would commonly be the case, e.g., if they were mixture models or hierarchical Bayesian models. We call this approach latent Bayesian melding.\nWe present a detailed case study of latent Bayesian melding in the domain of energy disaggregation [11, 20], which is a particular type of blind source separation (BSS) problem. The goal of the electricity disaggregation problem is to separate the total electricity usage of a building into a sum of source signals that describe the energy usage of individual appliances. This problem is hard because the source signals are not identifiable, which motivates work that adds additional prior information into the model [14, 15, 20, 25, 26, 8]. We show that the latent Bayesian melding approach allows incorporation of new types of constraints into standard models for this problem, yielding a strong improvement in performance, in some cases amounting to a 50% error reduction over a moment matching approach."}, {"heading": "2 The Bayesian melding approach", "text": "We briefly describe the Bayesian melding approach to integrating prior information in deterministic simulation models [21], which has seen wide application [1, 6, 23]. In the Bayesian modelling context, denote Y as the observation data, and suppose that the model includes unknown variables S, which could include model parameters and latent variables. We are then interested in the posterior\np(S|Y ) = p(Y )−1p(Y |S)pS(S). (1) However, in some situations, the variables S may be related to a new random variable τ by a deterministic simulation function f(·) such that τ = f(S). We call S and τ input and output variables. For example, in the energy disaggregation problem, the total energy consumption variable τ = ∑T t=1 S T t µ where St are the state variables of a hidden Markov model (one-hot encoding) and µ is a vector containing the mean energy consumption of each state (see Section 5.2). Both τ and S are random variables, and so in the Bayesian context, the modellers usually choose appropriate priors pτ (τ) and pS(S) based on prior knowledge. However, given pS(S), the map f naturally introduces another prior for τ , which is an induced prior denoted by p∗τ (τ). Therefore, there are two different priors for the same variable τ from different sources, which might not be consistent. In the energy disaggregation example, p∗τ is induced by the state variables St of the hidden Markov model which is the individual model of a specific household, and pτ could be modelled by using population information, e.g. from a national survey — we can think of this as a population model since it combines information from many households. The Bayesian melding approach combines the two priors into one by using the logarithmic pooling method so that the logarithmically pooled prior is p̃τ (τ) ∝ p∗τ (τ)αpτ (τ)1−α where 0 ≤ α ≤ 1. The prior p̃τ melds the prior information of both S and τ . In the model (1), the prior pS does not include information about τ . Thus it is required to derive a melded prior for S. If f is invertible, the prior for S can be obtained by using the change-of-variable technique. If f is not invertible, Poole and Raftery [21] heuristically derived a melded prior\np̃S(S) = cαpS(S)\n( pτ (f(S))\np∗τ (f(S))\n)1−α (2)\nwhere cα is a constant given α such that ∫ p̃S(S)dS = 1. This gives a new posterior p̃(S|Y ) = p̃(Y )−1p(Y |S)p̃S(S). Note that it is interesting to infer α [22, 7], however we use a fixed value in this paper. So far we have been assuming there are no latent variables in pτ . We now consider the situation when τ is generated by some latent variables."}, {"heading": "3 The latent Bayesian melding approach", "text": "It is common that the variable τ is modelled by a latent variable ξ, see the examples in Section 5.2. So we could assume that we have a conditional distribution p(τ |ξ) and a prior distribution pξ(ξ). This defines a marginal distribution pτ (τ) = ∫ pξ(ξ)p(τ |ξ)dξ. This could be used to produce the\nmelded prior (2) of the Bayesian melding approach\np̃S(S) = cαpS(S)\n(∫ pτ (f(S)|ξ)pξ(ξ)dξ\np∗τ (f(S))\n)1−α . (3)\nThe integration in (3) is generally intractable. We could employ the Monte Carlo method to approximate it for a fixed τ . However, importantly we are also interested in inferring the latent variable ξ which is meaningful for example in the energy disaggregation problem. When we are interested in finding the maximum a posteriori (MAP) value of the posterior where p̃S(S) was used as the prior, we propose to use a rough approximation ∫ pξ(ξ)pτ (τ |ξ)dξ ≈ maxξ pξ(ξ)pτ (τ |ξ). This leads to an approximate prior\np̃S(S) ≈ max ξ p̃S,ξ(S, ξ) = max ξ cαpS(S)\n( pτ (f(S)|ξ)pξ(ξ)\np∗τ (f(S))\n)1−α . (4)\nTo obtain this approximate prior for S, the joint prior p̃S,ξ(S, ξ) has to exist, and so we show that it does exist under certain conditions by the following theorem. We assume that S and ξ are continuous random variables, and that both p∗τ and pτ are positive and share the same support. Also, EpS(S)[·] denotes the expectation with respect to pS . Theorem 1. If EpS(S) [ pτ (f(S)) p∗τ (f(S)) ] < ∞, then a constant cα < ∞ exists such that∫\np̃S,ξ(S, ξ)dξdS = 1, for any fixed α ∈ [0, 1].\nThe proof can be found in the supplementary materials. In (4) we heuristically derived an approximate joint prior p̃S,ξ. Interestingly, if ξ and S are independent conditional on τ , we can show as follows that p̃S,ξ is a limit distribution derived from a joint distribution of ξ and S induced by τ . To see this, we derive a joint prior for S and ξ,\npS,ξ(S, ξ) = ∫ p(S, ξ|τ)pτ (τ)dτ = ∫ p(S|τ)p(ξ|τ)pτ (τ)dτ\n=\n∫ p(τ |S)pS(S)\np∗τ (τ) p(τ |ξ)pξ(ξ) pτ (τ) pτ (τ)dτ = pS(S)pξ(ξ)\n∫ p(τ |S)p(τ |ξ)\np∗τ (τ) dτ.\nFor a deterministic simulation τ = f(S), the distribution p(τ |S) = p(τ |S, τ = f(S)) is ill-defined due to the Borel’s paradox [24]. The distribution p(τ |S) depends on the parameterization. We assume that τ is uniform on [f(S) − δ, f(S) + δ] conditional on S and δ > 0, and the distribution is then denoted by pδ(τ |S). The marginal distribution is pδ(τ) = ∫ pδ(τ |S)pS(S)dS. Denote g(τ) = p(τ |ξ)p∗τ (τ) and gδ(τ) = p(τ |ξ) pδ(τ) . Then we have the following theorem. Theorem 2. If limδ→0 pδ(τ) = p∗τ (τ), and gδ(τ) has bounded derivatives in any order, then limδ→0 ∫ pδ(τ |S)gδ(τ)dτ = g(f(S)).\nSee the supplementary materials for the proof. Under this parameterization, we denote p̂S,ξ(S, ξ) = pS(S)pξ(ξ) limδ→0 ∫ pδ(τ |S)gδ(τ)dτ = pS(S)pξ(ξ)p(f(S)|ξ)p∗τ (f(S)) . By applying the logarithmic pooling method, we have a joint prior\np̃S,ξ(S, ξ) = cα (pS(S)) α (p̂S,ξ(S, ξ)) 1−α = cαpS(S)\n( pτ (f(S)|ξ)pξ(ξ)\np∗τ (f(S))\n)1−α .\nSince the joint prior blends the variable S and the latent variable ξ, we call this approximation the latent Bayesian melding (LBM) approach, which gives the posterior p̃(S, ξ|Y ) = p̃(Y )−1p(Y |S)p̃S,ξ(S, ξ). Note that if there are no latent variables, then latent Bayesian melding collapses to the Bayesian melding approach. In section 6 we will apply this method to an energy disaggregation problem for integrating population information with an individual model."}, {"heading": "4 Related methods", "text": "We now discuss possible connections between Bayesian melding (BM) and other related methods. Recently in machine learning, moment matching methods have been proposed, e.g., posterior regularization (PR) [9], learning with measurements [16] and the generalized expectation criterion [18].\nThese methods share the common idea that the Bayesian models (or posterior distributions) are constrained by some observations or measurements to obtain a least-biased distribution. The idea is that the system we are modelling is too complex and unobservable, and thus we have limited prior information. To alleviate this problem, we assume we can obtain some observations of the system in some way, e.g., by experiments, for example those observations could be the mean values of the functions of the variables. Those observations could then guide the modelling of the system. Interestingly, a very similar idea has been employed in the bias correction method in information theory and statistics [12, 10, 19], where the least-biased distribution is obtained by optimizing the Kullback-Leibler divergence subject to the moment constraints. Note that the bias correction method in [17] is different to others where the bias of a consistent estimator was corrected when the bias function could be estimated.\nWe now consider the posteriors derived by PR and BM. In general, given a function f(S) and values bi, PR solves the constrained problem minimizeep KL(p̃(S)||p(S|Y )) subject to Eep (mi(f(S)))− bi ≤ δi, ||δi|| ≤ ; i = 1, 2, · · · , I. where mi could be any function such as a power function. This gives an optimal posterior p̃PR(S) = Z(λ)\n−1p(Y |S)p(S)∏Ii=1 exp(−λimi(f(S))) where Z(λ) is the normalizing constant. BM has a deterministic simulation f(S) = τ where τ ∼ pτ . The posterior is then p̃BM (S) = Z(α) −1p(Y |S)p(S) ( pτ (f(S)) p∗τ (f(S)) )1−α . They have a similar form and the key difference is the last factor which is derived from the constraints or the deterministic simulation. p̃PR and p̃BM are identical, if −∑Ii=1 λimi(f(S)) = (1− α) log pτ (f(S)) p∗τ (f(S)) .\nThe difference between BM and LBM is the latent variable ξ. We could perform BM by integrating out ξ in (3), but this is computationally expensive. Instead, LBM jointly models S and ξ allowing possibly joint inference, which is an advantage over BM."}, {"heading": "5 The energy disaggregation problem", "text": "In energy disaggregation, we are given a time series of energy consumption readings from a sensor. We consider the energy measured in watt hours as read from a household’s electricity meter, which is denoted by Y = (Y1, Y2, · · · , YT ) where Yt ∈ R+. The recorded energy signal Y is assumed to be the aggregation of the consumption of individual appliances in the household. Suppose there are I appliances, and the energy consumption of each appliance is denoted byXi = (Xi1, Xi2, · · · , XiT ) where Xit ∈ R+. The observed aggregate signal is assumed to be the sum of the component signals so that Yt = ∑I i=1Xit + t where t ∼ N (0, σ2). Given Y , the task is to infer the unknown component signals Xi. This is essentially the single-channel BSS problem, for which there is no unique solution. It can also be useful to add an extra component U = (U1, U2, · · · , UT ) to model the unknown appliances to make the model more robust as proposed in [15]. The prior of Ut is defined as p(U) = 1v2(T−1) exp { − 12v2 ∑T−1 t=1 |Ut+1 − Ut| } . The model then has a new form Yt = ∑I i=1Xit + Ut + t. A natural way to represent this model is as an additive factorial hidden Markov model (AFHMM) where the appliances are treated as HMMs [15, 20, 26]; this is now described."}, {"heading": "5.1 The additive factorial hidden Markov model", "text": "In the AFHMM, each component signal Xi is represented by a HMM. We suppose there are Ki states for each Xit, and so the state variable is denoted by Zit ∈ {1, 2, · · · ,Ki}. Since Xi is a HMM, the initial probabilities are πik = P (Zi1 = k) (k = 1, 2, · · · ,Ki) where ∑Ki k=1 πik = 1; the mean values are µi = {µ1, µ2, · · · , µKi} such that Xit ∈ µi; the transition probabilities are P (i) = (p\n(i) jk ) where p (i) jk = P (Zit = j|Zi,t−1 = k) and ∑Ki j=1 p (i) jk = 1. We denote all these\nparameters {πi, µi, P (i)} by θ. We assume they are known and can be learned from the training data. Instead of using Z, we could use a binary vector Sit = (Sit1, Sit2, · · · , SitKi)T to represent the variable Z such that Sitk = 1 when Zit = k and for all Sitj = 0 when j 6= k. Then we are interested in inferring the states Sit instead of inferring Xit directly, since Xit = STitµi. Therefore\nwe want to make inference over the posterior distribution\nP (S,U, σ2|Y, θ) ∝ p(Y |S,U, σ2)P (S|θ)p(U)p(σ2)\nwhere the HMM defines the prior of the states P (S|θ) ∝ ∏Ii=1 ∏Ki k=1 π\nSi1k ik ×∏T\nt=2 ∏I i=1 ∏ k,j ( p (i) kj )SitkSi,t−1,j , the inverse noise variance is assumed to be a Gamma dis-\ntribution p(σ−2) ∝ (σ−2)α−1 exp { −βσ−2 } , and the data likelihood has the Gaussian form p(Y |S,U, σ2, θ) = |2πσ2|−T2 exp { − 12σ2 ∑T t=1 ( Yt − ∑I i=1 S T itµi − Ut )2} . To make the MAP\ninference over S, we relax the binary variable Sitk to be continuous in the range [0, 1] as in [15, 26]. It has been shown that incorporating domain knowledge into AFHMM can help to reduce the identifiability problem [15, 20, 26]. The domain knowledge we will incorporate using LBM is the summary statistics."}, {"heading": "5.2 Population modelling of summary statistics", "text": "In energy disaggregation, it is useful to provide a summaries of energy consumption to the users. For example, it would be useful to show the householders the total energy they had consumed in one day for their appliances, the duration that each appliance was in use, and the number of times that they had used these appliances. Since there already exists data about typical usage of different appliances [4], we can employ these data to model the distributions of those summary statistics.\nWe denote those desired statistics by τ = {τi}Ii=1, where i denotes the appliances. For appliance i, we assume we have measured some time series from different houses for many days. This is always possible because we can collect them from public data sets, e.g., the data reviewed in [4]. We can then empirically obtain the distributions of those statistics. The distribution is represented by pm(τim|Γim, ηim) where Γim represents the empirical quantities of the statistic m of the appliance i which can be obtained from data and ηim are the latent variables which might not be known. Since ηim are variables, we can employ a prior distribution p(ηim).\nWe now give some examples of those statistics. Total energy consumption: The total energy consumption of an appliance can be represented as a function of the states of HMM such that τi =∑T t=1 S T itµi. Duration of appliance usage: The duration of using the appliance i can also be\nrepresented as a function of states τi = ∆t ∑T t=1 ∑Ki k=2 Sitk where ∆t represents the sampling duration for a data point of the appliances, and we assume that Sit1 represents the off state which means the appliance was turned off. Number of cycles: The number of cycles (the number of times an appliance is used) can be counted by computing the number of alterations from OFF state to ON such that τi = ∑T t=2 ∑Ki k=2 I(Sitk = 1, Si,t−1,1 = 0).\nLet the binary vector ξi = (ξi1, ξi2, · · · , ξic, · · · , ξiCi) represent the number of cycles, where ξic = 1 means that the appliance i had been used c cycles, and ∑Ci c=1 ξic = 1. (Note ξi is an example of ηi in this case.) To model these statistics in our LBM framework, the latent variable that we use is the number of cycles ξ. The distributions of τi could be empirically modelled by using the observation data. One approach is to assume a Gaussian mixture density such that p(τi|ξi) = ∑Ci c=1 p(ξic =\n1)pc(τi|Γi), where ∑Ci c=1 p(ξic = 1) = 1 and pc is the Gaussian component density. Using the mixture Gaussian, we basically assume that, for an appliance, given the number of cycles the total energy consumption is modelled by a Gaussian with mean µic and variance σ 2 ic. A simpler model\nwould be a linear regression model such that τi = ∑Ci c=1 ξicµic + i where i ∼ N (0, σ2i ). This model assumes that given the number of cycles the total energy consumption is close to the mean µic. The mixture model is more appropriate than the regression model, but the inference is more difficult. When τi represents the number of cycles for appliance i, we can use τi = ∑Ci c=1 cicξic where cic represents the number of cycles. When the state variables Si are relaxed to [0, 1], we can then employ a noise model such that τi = ∑Ci c=1 cicξic + i where ∼ N (0, σ2i ). We model ξi with a\ndiscrete distribution such that P (ξi) = ∏Ci c=1 p ξic ic where pic represents the prior probability of the number of cycles for the appliance i, which can be obtained from the training data. We now show that how to use the LBM to integrate the AFHMM with these population distributions."}, {"heading": "6 The latent Bayesian melding approach to energy disaggregation", "text": "We have shown that the summary statistics τ can be represented as a deterministic function of the state variable of HMMs S such that τ = f(S), which means that the τ itself can be represented as a latent variable model. We could then straightforwardly employ the LBM to produce a joint prior over S and ξ such that p̃S,ξ(S, ξ) = cαpS(S) ( pτ (f(S)|ξ)p(ξ) p∗τ (f(S)) )1−α . Since in our model f is not invertible, we need to generate a proper density for p∗τ . One possible way is to generate N random samples {S(n)}Nn=1 from the prior pS(S) which is a HMM, and then p∗τ can be modelled by using kernel density estimation. However, this will make the inference difficult. Instead, we employ a Gaussian density p∗τim(τim) = N (µ̂im, σ̂2im) where µ̂im and σ̂2im are computed from {S(n)}Nn=1. The new posterior distribution of LBM thus has the form\np(S,U,Σ|Y, θ) ∝ p(Σ)p(U)p̃S,ξ(S, ξ)p(Y |S,U, σ2)\n= p(Σ)p(U)cαpS(S) ( pτ (f(S)|ξ)p(ξ) p∗τ (f(S)) )1−α p(Y |S,U, σ2)\nwhere Σ represents the collection of all the noise variances. All the inverse noise variances employ the Gamma distribution as the prior. We are interested in inferring the MAP values. Since the variables S and ξ are binary, we have to solve a combinatorial optimization problem which is intractable, so we solve a relaxed problem as in [15, 26]. Since log pS(S) is not convex, we employ the relaxation method of [15]. So a newKi×Ki variable matrixHit = (hitjk) is introduced such that hitjk = 1 when Si,t−1,k = 1 and Sitj = 1 and otherwise hitjk = 0. Under these constraints, we then obtain log pS(S) = log p(S,H) = ∑I i=1 S T i1 log πi + ∑ i,t,k,j h it jk log p (i) jk ; this is now linear. We optimize the log-posterior which is denoted by L(S,H,U,Σ, ξ). The constraints for those variables are represented as setsQS = {∑Ki k=1 Sitk = 1, Sitk ∈ [0, 1],∀i, t } ,Qξ = {∑Ci c=1 ξic = 1, ξic ∈ [0, 1],∀i } , QH,S = {∑Ki l=1H it l. = S T i,t−1, ∑Ki l=1H it .l = Sit, h it jk ∈ [0, 1],∀i, t } , and QU,Σ ={\nU ≥ 0,Σ ≥ 0, σ2im < σ̂2im,∀i,m }\n. Denote Q = QS ∪ Qξ ∪ QH,S ∪ QU,Σ. The relaxed optimization problem is then\nmaximize S,H,U,Σ,ξ\nL(S,H,U,Σ, ξ) subject to Q.\nWe oberved that every term in L is either quadratic or linear when Σ are fixed, and the solutions for Σ are deterministic when the other variables are fixed. The constraints are all linear. Therefore, we optimize Σ while fixing all the other variables, and then optimize all the other variables simultaneously while fixing Σ. This optimization problem is then a convex quadratic program (CQP), for which we use MOSEK [2]. We denote this method by AFHMM+LBM."}, {"heading": "7 Experimental results", "text": "We have incorporated population information into the AFHMM by employing the latent Bayesian melding approach. In this section, we apply the proposed model to the disaggregation problem. We will compare the new approach with the AFHMM+PR [26] using the set of statistics τ described in Section 5.2. The key difference between our method AFHMM+LBM and AFHMM+PR is that AFHMM+LBM models the statistics τ conditional on the number of cycles ξ."}, {"heading": "7.1 The HES data", "text": "We apply AFHMM, AFHMM+PR and AFHMM+LBM to the Household Electricity Survey (HES) data1. This data set was gathered in a recent study commissioned by the UK Department of Food and Rural Affairs. The study monitored 251 households, selected to be representative of the population, across England from May 2010 to July 2011 [27]. Individual appliances were monitored, and in some households the overall electricity consumption was also monitored. The data were monitored\n1The HES dataset and information on how the raw data was cleaned can be found from https://www.gov.uk/government/publications/household-electricity-survey.\nevery 2 or 10 minutes for different houses. We used only the 2-minute data. We then used the individual appliances to train the model parameters θ of the AFHMM, which will be used as the input to the models for disaggregation. Note that we assumed the HMMs have 3 states for all the appliances. This number of states is widely applied in energy disaggregation problems, though our method could easily be applied to larger state spaces. In the HES data, in some houses the overall electricity consumption (the mains) was monitored. However, in most houses, only a subset of individual appliances were monitored, and the total electricity readings were not recorded.\nGenerating the population information: Most of the houses in HES did not monitor the mains readings. They all recorded the individual appliances consumption. We used a subset of the houses to generate the population information of the individual appliances. We used the population information of total energy consumption, duration of appliance usage and the number of cycles in a time period. In our experiments, the time period was one day. We modelled the distributions of these summary statistics by using the methods described in the Section 5.2, where the distributions were Gaussian. All the required quantities for modelling these distributions were generated by using the samples of the individual appliances.\nHouses without mains readings: In this experiment, we randomly selected one hundred households, and one day’s usage was used as test data for each household. Since no mains readings were monitored in these houses, we added up the appliance readings to generate synthetic mains readings. We then applied the AFHMM, AFHMM+PR and AFHMM+LBM to these synthetic mains to predict the individual appliance usage. To compare these three methods, we employed four error measures. Denote x̂i as the inferred signal for the appliance usage xi. One measure is the normalized disaggregation error (NDE): P it(xit−x̂it)2P\nit x 2 it . This measures how well the method predicts the energy consumption at every time point. However, the householders might be more interested in the summaries of the appliance usage. For example, in a particular time period, e.g, one day, people are interested in the total energy consumption of the appliances, the total time they have been using those appliances and how many times they have used them. We thus employ 1I ∑I i=1 |r̂i−ri|P i ri\nas the signal aggregate error (SAE), the duration aggregate error (DAE) or the cycle aggregate error (CAE), where ri represents the total energy consumption, the duration or the number of cycles, respectively, and r̂i represents the predicted summary statistics.\nAll the methods were applied to the synthetic data. Table 1 shows the overall error computed by these methods. We see that both the methods using prior information improved over the base line method AFHMM. The AFHMM+PR and AFHMM+LBM performed similarly in terms of NDE and SAE, but AFHMM+LBM improved over AFHMM+PR in terms of DAE (8%) and CAE (50%).\nHouses with mains readings: We also applied those methods to 6 houses which have mains readings. We used 10 days data for each house, and the recorded mains readings were used as the input to the models. All the methods were used to predict the appliance consumption. Table 2 shows the\nerror of each house and also the overall errors. This experiment is more realistic than the synthetic mains readings, since the real mains readings were used as the input. We see that both the methods incorporating prior information have improved over the AFHMM in terms of NDE, SAE and DAE. The AFHMM+PR and AFHMM+LBM have the similar results for SAE. AFHMM+LBM is improved over AFHMM+PR for NDE (15%), DAE (10%) and CAE (40%)."}, {"heading": "7.2 UK-DALE data", "text": "In the previous section we have trained the model using the HES data, and applied the models to different houses of the same data set. A more realistic situation is to train the model in one data set, and apply the model to a different data set, because it is unrealistic to expect to obtain appliancelevel data from every household on which the system will be deployed. In this section, we use the HES data to train the model parameters of the AFHMM, and model the distribution of the summary statistics. We then apply the models to the UK-DALE dataset [13], which was also gathered from UK households, to make the predictions. There are five houses in UK-DALE, and all of them have mains readings and as well as the individual appliance readings. All the mains meters were sampled every 6 seconds and some of them also sampled at a higher rate, details of the data and how to access it can be found in [13]. We employ three of the houses for analysis in our experiments (houses 1, 2 & 5 in the data). The other two houses were excluded because the correlation between the sum of submeters and mains is very low, which suggests that there might be recording errors in the meters. We selected 7 appliances for disaggregation, based on those that typically use the most energy. Since the sample rate of the submeters in the HES data is 2 minutes, we downsampled the signal from 6 seconds to 2 minutes for the UK-DALE data. For each house, we randomly selected a month for analysis. All the four methods were applied to the mains readings. For comparison purposes, we computed the NDE, SAE, DAE and CAE errors of all three methods, averaged over 30 days. Table 3 shows the results. The results are consistent with the results of the HES data. Both the AFHMM+PR and AFHMM+LBM improve over the basic AFHMM, except that AFHMM+PR did not improve the CAE. As for HES testing data, AFHMM+PR and AFHMM+LBM have similar results on NDE and SAE. And AFHMM+LBM again improved over AFHMM+PR in DAE (70%) and CAE (68%). These results are consistent in suggesting that incorporating population information into the model can help to reduce the identifiability problem in single-channel BSS problems."}, {"heading": "8 Conclusions", "text": "We have proposed a latent Bayesian melding approach for incorporating population information with latent variables into individual models, and have applied the approach to energy disaggregation problems. The new approach has been evaluated by applying it to two real-world electricity data sets. The latent Bayesian melding approach has been compared to the posterior regularization approach (a case of the Bayesian melding approach) and AFHMM. Both the LBM and PR have significantly lower error than the base line method. LBM improves over PR in predicting the duration and the number of cycles. Both methods were similar in NDE and the SAE errors."}, {"heading": "Acknowledgments", "text": "This work is supported by the Engineering and Physical Sciences Research Council, UK (grant numbers EP/K002732/1 and EP/M008223/1)."}], "references": [], "referenceMentions": [], "year": 2015, "abstractText": "In many statistical problems, a more coarse-grained model may be suitable for<lb>population-level behaviour, whereas a more detailed model is appropriate for ac-<lb>curate modelling of individual behaviour. This raises the question of how to in-<lb>tegrate both types of models. Methods such as posterior regularization follow<lb>the idea of generalized moment matching, in that they allow matching expec-<lb>tations between two models, but sometimes both models are most conveniently<lb>expressed as latent variable models. We propose latent Bayesian melding, which<lb>is motivated by averaging the distributions over populations statistics of both the<lb>individual-level and the population-level models under a logarithmic opinion pool<lb>framework. In a case study on electricity disaggregation, which is a type of single-<lb>channel blind source separation problem, we show that latent Bayesian melding<lb>leads to significantly more accurate predictions than an approach based solely on<lb>generalized moment matching.", "creator": "LaTeX with hyperref package"}}}