{"id": "1511.01710", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "5-Nov-2015", "title": "Adaptive information-theoretic bounded rational decision-making with parametric priors", "abstract": "Deviations from rational decision-making due to limited computational resources have been studied in the field of bounded rationality, originally proposed by Herbert Simon. There have been a number of different approaches to model bounded rationality ranging from optimality principles to heuristics. Here we take an information-theoretic approach to bounded rationality, where information-processing costs are measured by the relative entropy between a posterior decision strategy and a given fixed prior strategy. In the case of multiple environments, it can be shown that there is an optimal prior rendering the bounded rationality problem equivalent to the rate distortion problem for lossy compression in information theory. Accordingly, the optimal prior and posterior strategies can be computed by the well-known Blahut-Arimoto algorithm which requires the computation of partition sums over all possible outcomes and cannot be applied straightforwardly to continuous problems. Here we derive a sampling-based alternative update rule for the adaptation of prior behaviors of decision-makers and we show convergence to the optimal prior predicted by rate distortion theory. Importantly, the update rule avoids typical infeasible operations such as the computation of partition sums. We show in simulations a proof of concept for discrete action and environment domains. This approach is not only interesting as a generic computational method, but might also provide a more realistic model of human decision-making processes occurring on a fast and a slow time scale.", "histories": [["v1", "Thu, 5 Nov 2015 12:08:51 GMT  (665kb,D)", "http://arxiv.org/abs/1511.01710v1", "4 pages, 1 figure, Workshop on Bounded Optimality and Rational Metareasoning at Neural Information Processing Systems conference, Montreal, Canada, 2015"]], "COMMENTS": "4 pages, 1 figure, Workshop on Bounded Optimality and Rational Metareasoning at Neural Information Processing Systems conference, Montreal, Canada, 2015", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["jordi grau-moya", "daniel a braun"], "accepted": false, "id": "1511.01710"}, "pdf": {"name": "1511.01710.pdf", "metadata": {"source": "CRF", "title": "Adaptive information-theoretic bounded rational decision-making with parametric priors", "authors": ["Jordi Grau-Moya", "Daniel A. Braun"], "emails": ["jordi.grau@tuebingen.mpg.de", "daniel.braun@tuebingen.mpg.de"], "sections": [{"heading": null, "text": "Adaptive information-theoretic bounded rational decision-making with parametric priors\nJordi Grau-Moya Max Planck Institute for Intelligent Systems\nMax Planck Institute for Biological Cybernetics Spemannstraße 38, Tübinben 72076, Germany\njordi.grau@tuebingen.mpg.de\nDaniel A. Braun Max Planck Institute for Intelligent Systems\nMax Planck Institute for Biological Cybernetics Spemannstraße 38, Tübinben 72076, Germany daniel.braun@tuebingen.mpg.de"}, {"heading": "1 Abstract", "text": "Deviations from rational decision-making due to limited computational resources have been studied in the field of bounded rationality, originally proposed by Herbert Simon [1]. There have been a number of different approaches to model bounded rationality [2] ranging from optimality principles [3] to heuristics [4]. Here we take an information-theoretic approach to bounded rationality [5], where information-processing costs are measured by the relative entropy between a posterior decision strategy and a given fixed prior strategy. In the case of multiple environments, it can be shown that there is an optimal prior rendering the bounded rationality problem equivalent to the rate distortion problem for lossy compression in information theory [6]. Accordingly, the optimal prior and posterior strategies can be computed by the well-known Blahut-Arimoto algorithm which requires the computation of partition sums over all possible outcomes and cannot be applied straightforwardly to continuous problems. Here we derive a sampling-based alternative update rule for the adaptation of prior behaviors of decision-makers and we show convergence to the optimal prior predicted by rate distortion theory. Importantly, the update rule avoids typical infeasible operations such as the computation of partition sums. We show in simulations a proof of concept for discrete action and environment domains. This approach is not only interesting as a generic computational method, but might also provide a more realistic model of human decision-making processes occurring on a fast and a slow time scale."}, {"heading": "2 Information-theoretic bounded rationality", "text": "In decision theory an agent faces an environment y from the environment set Y and has to decide which action x to take from the action set X . The desirability of the action in that particular environment is quantified by the utility function U : X × Y 7→ R. The objective of the decision-maker is to maximize the utility depending on the environment y, that is\nx∗(y) = argmax x U(x, y).\nWhen the number of possible actions is vast, the maximization problem for any environment becomes computationally infeasible because the decision-maker must evaluate the utility of every possible action and choose the best one. This raises the need of extending classic decision-theory to take into account the available computational resources.\nHere we consider decision-makers with a prior distribution p0(x) over the search space and with limited computational resources. We measure computational resources in terms of an “informa-\nWorkshop on Bounded Optimality and Rational Metareasoning at Neural Information Processing Systems conference, Montreal, Canada, 2015\nar X\niv :1\n51 1.\n01 71\n0v 1\n[ cs\n.A I]\n5 N\nov 2\n01 5\ntion distance”, namely the relative entropy DKL (p||p0) = ∑ x p(x) log p(x) p0(x)\nbetween the prior behaviour p0 and a new behaviour p after deliberation. This information-processing cost can be related to physical inefficiencies in thermodynamics [5]. For every environment y the decision problem can be phrased as a constrained maximization problem withDKL(p||p0) ≤ B, where the decision-maker can only afford to spend a maximum number of bits B to change the prior behavior p0 to the new behavior p, such that\nargmax p(x|y) F(y) = argmax p(x|y) ∑ x p(x|y)U(x, y)− 1 β DKL (p(x|y)||p0(x)) (1)\nwhere 1/β is the Lagrange multiplier and serves as a resource parameter that trades off utility and computational cost. For β → ∞ we recover classic decision-theory, and for β → 0 the decisionmaker has no resources and acts according to the prior. We can extend the maximization problem in Eq. (1) to also maximize over the prior distribution in average over all environments\nargmax p(x|y),p(x) J = argmax p(x|y),p(x) ∑ y p(y) [∑ x p(x|y)U(x, y)− 1 β DKL (p(x|y)||p(x)) ] (2)\nThis objective function is commonly known as the rate-distortion objective first stated by C. Shannon. The solution to this problem that gives the optimal prior p(x) is the following set of two analytic self-consistent equations\np∗(x|y) = 1 Z(y) p(x) exp(βU(x, y)) (3)\np(x) = ∑ y p(y)p∗(x|y) (4)\nwhere Z(y) = ∑ x p(x)e\nβU(x,y) is the partition sum. In practice, the solution can be computed using the Blahut-Arimoto algorithm that basically iterates through both equations until convergence. However, every iteration includes the computation of the partition sum Z(y) that can potentially be infeasible because it involves a function evaluation over all possible actions in the set X which could be very large. Another inconvenience is that the Blahut-Arimoto algorithm can only be applied directly when the action space is discrete."}, {"heading": "3 Decision-maker with parametric prior", "text": "Here we propose a sampling-based approach that avoids the computation of partition sums and that can also be applied to continuous action spaces. In order to achieve this we require a parametrized family of distributions pθ(x) to allow for a gradient ascent update rule. Replacing p(x) in Eq. (3)-(4) by pθ(x) and inserting into Eq. (2), we can rewrite the rate-distortion objective J as\nJ (θ) = 1 β ∑ y p(y) logZθ(y)\nwhere Zθ(y) = ∑ x pθ(x) exp(βU(x, y)) and pθ(x|y) = 1 Zθ(y)\npθ(x) exp(βU(x, y)). The gradient with respect to θ is\n∇θJ (θ) = 1\nβ ∑ y p(y) ∑ x pθ(x)∇θ log pθ(x) exp(βU(x, y))∑ x pθ(x) exp(βU(x, y)\n= 1\nβ ∑ y p(y) ∑ x pθ(x|y)∇θ log pθ(x) (5)\nwhere in the first row we have used the equality ∇θpθ(x) = pθ(x)∇θ log pθ(x), and in the second row we used the definition of the parametric conditional pθ(x|y). Due to the double expectation in Eq. (5), we can now approximate the gradient stochastically by single samples y′ ∼ p(y) and x′ ∼ pθ(x|y′) and evaluating ∇θJ (θ) ≈ 1β∇θ log pθ(x\n′). The parameter updates are computed as usual with\nθt+1 = θt + α\nβ ∇θ log pθ(x′) (6)\nwhere α is the learning rate.\nSampling For the approximation ∇θJ (θ) ≈ 1β∇θ log pθ(x ′) the decision-maker needs to generate a sample from pθ(x|y′) after being given the sample y′ from the environment. This can be achieved, for example, by a rejection sampling scheme. The rejection sampling algorithm takes samples from the proposal distribution pθ(x) and accepts or rejects them according to the acceptancerejection rule\nu ≤ min ( 1, exp(βU(x, y)\nexp(βT (y))\n) (7)\nwhere u ∼ U [0, 1] is sampled from a uniform distribution and the aspiration level of the decisionmaker for the environment y is T (y) ≥ maxx U(x, y). If the actions x correspond to accepted samples, it can be shown that the decision-maker effectively generates samples from the conditional pθ(x|y). The average number of samples required for acceptance given a particular y is\ns(y) = exp(βT (y))\nZθ(y) ≥ exp(DKL (pθ(x|y)||pθ(x)))\nthat is greater than the exponential of the relative entropy—connecting sampling complexity with the information-theoretic costs. The average number of required samples across all environments is naturally\nS = ∑ y p(y)s(y). (8)"}, {"heading": "4 Simulations", "text": "While the proposed algorithm works for both continuous and discrete parametric distributions, here we demonstrate its performance in simulations for the discrete case, because this allows comparing the solutions to the optimal Blahut-Arimoto solutions. Additionally, these simulations illustrate the impact of β on learning and plateau performance and on the average number of samples required.\nThe parametric prior When using gradient methods in parameter space, it has to be made sure that the parameters do not violate given constraints—for example in the case of a discrete distribution over n + 1 outcomes with parameters p = [p0, p1, . . . , pn], the constraints p0 = 1 − ∑n i=1 pi and pi ≥ 0 must be satisfied. Often the constraints can be naturally satisfied by reparameterizing the distribution. In the discrete case we may define actions for example as vectors of the form xi = [x0, . . . xi, . . . xn] with only one dimension having value xi = 1 and the rest xj = 0 for all j 6= i where 0 ≤ i ≤ n. Then we can reparameterize the discrete distribution as\npθ(x) = exp ( n∑ i=1 θixi − ψ(θ) ) (9)\nwith the new parameter vector θ = [θ1, . . . θn] and where ψ(θ) = log (1 + ∑n i=1 exp(θi)). The gradient∇θ log pθ(x) from Eq. (5) can then be computed as\n∇θ log pθ(x) =  ∂ ∂θ1 log pθ(x) ...\n∂ ∂θn log pθ(x)\n =  x1 − exp(θ1)1+∑ exp(θi)\n... xn − exp(θn)1+∑ exp(θi)  . (10) Note that with this reparameterization θi = log pip0 the parameters θi ∈ R can vary across all reals, thereby naturally satisfying the constraints for pi.\nSimulations In Fig. 1 we show the evolution of a bounded rational decision-maker that updates the prior pθ(x) according to Eq. (6) and uses the rejection sampling scheme from Eq. (7) to sample from the conditionals pθ(x|y). For illustration we have chosen |X | = 10 and |Y| = 5 and a utility function U(x, y) ∈ [0; 1] where the utility values for every x and y are sampled randomly between 0 and 1. The first panel shows how the sampling-based solutions converge to the optimal BlahutArimoto solutions, as the relative entropy between the parameterized prior pθ(x) and the optimal prior (the solution to Eq.(4)) is being reduced towards zero. It can be seen that the more rational decision-maker (higher β) takes longer to converge. In the second panel, we show the average\nnumber of samples according to Eq. (8). It can be seen that for all decision-makers the number of required samples reduces over time as the prior gets closer to the optimal prior, indicating that the optimal solution is actually reducing the average information-theoretic distance between prior and conditionals. It can also be seen that more rational decision-makers require more samples. In the third panel, we show how the average utility ∑ y p(y) ∑ x pθ(x|y)U(x, y) improves over time with a better prior. Finally, the fourth panel shows how the prior is shaped by the rationality parameter β. In a highly rational decision-maker the prior reflects an (more) evenly spread distribution between all the actions that are optimal in any of the environments. In a decision-maker with low rationality the prior will concentrate on the small set of actions that achieve on average a high utility across environments, because these decision-makers do not have resources to process environment-specific information."}, {"heading": "5 Conclusions", "text": "Here we extend the information-theoretic model for bounded rational decision-making to allow for adaptation of the prior. This naturally leads to two time scales for information-processing. The first process is a slow process regarding the update of the prior distribution. We have shown that such an update can be estimated efficiently from samples and that it converges to the optimal solution obtained from rate distortion theory. The second process is the sampling process that a decision-maker with fixed prior would use to process information specific for a particular environment. A decisionmaker with low rationality can be thought of as having no time for planning being forced to act according to the prior distribution that might not be a very good solution for the observed environment but that is the best possible prior given its computational resources. Thus, this approach might not only provide a normative model for human decision-making processes occurring on different time scales, but also an efficient sampling-based solution for the rate distortion problem.\nAcknowledgments This study was supported by the DFG, Emmy Noether grant BR4164/1-1."}], "references": [{"title": "A behavioral model of rational choice", "author": ["H.A. Simon"], "venue": "The quarterly journal of economics,", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1955}, {"title": "Computational rationality: A converging paradigm for intelligence in brains", "author": ["Samuel J Gershman", "Eric J Horvitz", "Joshua B Tenenbaum"], "venue": "minds, and machines. Science,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2015}, {"title": "Provably bounded-optimal agents", "author": ["S.J Russel", "D. Subramanian"], "venue": "Journal of Artificial Intelligence Research,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 1995}, {"title": "Reasoning the fast and frugal way: models of bounded rationality", "author": ["G. Gigerenzer", "D.G. Goldstein"], "venue": "Psychological review,", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 1996}, {"title": "Thermodynamics as a theory of decision-making with information-processing costs", "author": ["P.A. Ortega", "D.A. Braun"], "venue": "Proc of the Royal Society A: Mathematical, Physical and Engineering Science,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 2013}, {"title": "Bounded rationality, abstraction and hierarchical decision-making: an information-theoretic optimality principle", "author": ["T. Genewein", "F. Leibfried", "J. Grau-Moya", "D.A. Braun"], "venue": "Frontiers in Robotics and AI,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2015}], "referenceMentions": [{"referenceID": 0, "context": "Deviations from rational decision-making due to limited computational resources have been studied in the field of bounded rationality, originally proposed by Herbert Simon [1].", "startOffset": 172, "endOffset": 175}, {"referenceID": 1, "context": "There have been a number of different approaches to model bounded rationality [2] ranging from optimality principles [3] to heuristics [4].", "startOffset": 78, "endOffset": 81}, {"referenceID": 2, "context": "There have been a number of different approaches to model bounded rationality [2] ranging from optimality principles [3] to heuristics [4].", "startOffset": 117, "endOffset": 120}, {"referenceID": 3, "context": "There have been a number of different approaches to model bounded rationality [2] ranging from optimality principles [3] to heuristics [4].", "startOffset": 135, "endOffset": 138}, {"referenceID": 4, "context": "Here we take an information-theoretic approach to bounded rationality [5], where information-processing costs are measured by the relative entropy between a posterior decision strategy and a given fixed prior strategy.", "startOffset": 70, "endOffset": 73}, {"referenceID": 5, "context": "In the case of multiple environments, it can be shown that there is an optimal prior rendering the bounded rationality problem equivalent to the rate distortion problem for lossy compression in information theory [6].", "startOffset": 213, "endOffset": 216}, {"referenceID": 4, "context": "This information-processing cost can be related to physical inefficiencies in thermodynamics [5].", "startOffset": 93, "endOffset": 96}, {"referenceID": 0, "context": "The rejection sampling algorithm takes samples from the proposal distribution pθ(x) and accepts or rejects them according to the acceptancerejection rule u ≤ min ( 1, exp(βU(x, y) exp(βT (y)) ) (7) where u ∼ U [0, 1] is sampled from a uniform distribution and the aspiration level of the decisionmaker for the environment y is T (y) ≥ maxx U(x, y).", "startOffset": 210, "endOffset": 216}], "year": 2015, "abstractText": "Deviations from rational decision-making due to limited computational resources have been studied in the field of bounded rationality, originally proposed by Herbert Simon [1]. There have been a number of different approaches to model bounded rationality [2] ranging from optimality principles [3] to heuristics [4]. Here we take an information-theoretic approach to bounded rationality [5], where information-processing costs are measured by the relative entropy between a posterior decision strategy and a given fixed prior strategy. In the case of multiple environments, it can be shown that there is an optimal prior rendering the bounded rationality problem equivalent to the rate distortion problem for lossy compression in information theory [6]. Accordingly, the optimal prior and posterior strategies can be computed by the well-known Blahut-Arimoto algorithm which requires the computation of partition sums over all possible outcomes and cannot be applied straightforwardly to continuous problems. Here we derive a sampling-based alternative update rule for the adaptation of prior behaviors of decision-makers and we show convergence to the optimal prior predicted by rate distortion theory. Importantly, the update rule avoids typical infeasible operations such as the computation of partition sums. We show in simulations a proof of concept for discrete action and environment domains. This approach is not only interesting as a generic computational method, but might also provide a more realistic model of human decision-making processes occurring on a fast and a slow time scale.", "creator": "LaTeX with hyperref package"}}}