{"id": "1601.00287", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "3-Jan-2016", "title": "Wavelet Scattering on the Pitch Spiral", "abstract": "We present a new representation of harmonic sounds that linearizes the dynamics of pitch and spectral envelope, while remaining stable to deformations in the time-frequency plane. It is an instance of the scattering transform, a generic operator which cascades wavelet convolutions and modulus nonlinearities. It is derived from the pitch spiral, in that convolutions are successively performed in time, log-frequency, and octave index. We give a closed-form approximation of spiral scattering coefficients for a nonstationary generalization of the harmonic source-filter model.", "histories": [["v1", "Sun, 3 Jan 2016 12:30:38 GMT  (1164kb,D)", "http://arxiv.org/abs/1601.00287v1", "Proceedings of the 18th International Conference on Digital Audio Effects (DAFx-15), Trondheim, Norway, Nov 30 - Dec 3, 2015, pp. 429--432. 4 pages, 3 figures"]], "COMMENTS": "Proceedings of the 18th International Conference on Digital Audio Effects (DAFx-15), Trondheim, Norway, Nov 30 - Dec 3, 2015, pp. 429--432. 4 pages, 3 figures", "reviews": [], "SUBJECTS": "cs.SD cs.AI", "authors": ["vincent lostanlen", "st\\'ephane mallat"], "accepted": false, "id": "1601.00287"}, "pdf": {"name": "1601.00287.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["Vincent Lostanlen", "Stéphane Mallat"], "emails": ["vincent.lostanlen@ens.fr"], "sections": [{"heading": "1. INTRODUCTION", "text": "The spectro-temporal evolution of harmonic sounds conveys essential information to audio classification, blind source separation, transcription, as well as other processing tasks. This information is however difficult to capture in time-varying, polyphonic mixtures. On one hand, spectrogram-based pattern recognition algorithms [1] are exposed to detection errors as they enforce strong constraints on the shape of harmonic templates. On the other, time-varying generalizations of matrix factorization [2] are underconstrained and thus may fail to converge to a satisfying solution. In this article, we address the characterization of harmonic structures without any detection nor training step.\nWavelets have long proven to provide meaningful, sparse activations as long as they operate on a dimension on which the signal has already some regularity. Although a single sine wave draws a regular edge on the time-frequency plane, a harmonic comb is made of distant sharp peaks over the log-frequency axis, an irregular pattern that is hard to characterize globally. This irregularity weakens the discriminative power of existing wavelet-like representations, such as Mel-frequency cepstral coefficients (MFCC).\nTo recover regularity across partials within a wavelet framework, we capitalize on the fact that power-of-two harmonics are exactly one octave apart. By rolling up the log-frequency axis into a spiral, such that octave intervals correspond to full turns, these partials get aligned on a radius. Consequently, introducing the integer-valued octave variable reveals harmonic regularity that was not explicit in the plane of time and log-frequency.\nOnce specified the variables of time, log-frequency, and octave index, our representation merely consists in cascading three wavelet decompositions along them and applying complex modulus. Thus, the constant-Q scalogram is \"scattered\" into channels over which main factors of time variability are disentangled and regularized, yet harmonicity is preserved.\n∗ This work is supported by the ERC InvariantClass 320959. The source code to reproduce figures and experiments is available at www.github.com/lostanlen/scattering.m.\nSection 2 gives a formal definition of the spiral scattering transform. Section 3 introduces a nonstationary formulation of the source-filter model relying on time warps, and shows that its variabilities in pitch and spectral envelope are jointly linearized by the spiral scattering transform. Section 4 provides a visual interpretation of the spiral scattering coefficients of a nonstationary musical note."}, {"heading": "2. FROM TIME SCATTERING TO SPIRAL SCATTERING", "text": "This section builds the spiral scattering transform progressively as a cascade of wavelet transforms along time, log-frequency, and octave index. All three variables share the same framework."}, {"heading": "2.1. Time scattering", "text": "An analytic \"mother\" wavelet is a complex filter ψ(t) whose Fourier transform ψ̂(ω) is concentrated over the dimensionless frequency interval [1 − Q/2, 1 + Q/2], where the quality factor Q is in the typical range 12–24. Dilations of this wavelet define a family of bandpass filters centered at frequencies λ1 = 2 j1+ χ1 Q , where the indices j1 ∈ Z and χ1 ∈ {1 . . . Q} respectively denote octave and chroma:\nψ̂λ1(ω) = ψ̂(λ −1ω) i.e. ψλ1(t) = λ1ψ(λ1t). (1)\nDAFX-1\nar X\niv :1\n60 1.\n00 28\n7v 1\n[ cs\n.S D\n] 3\nJ an\n2 01\n6\nThe wavelet transform convolves an input signal x(t) with the filter bank of ψλ1 ’s. We denote convolutions along time by the operator t∗. Applying complex modulus to all wavelet convolutions results in the \"scalogram\" matrix\nx1(t, log λ1) = |x t∗ ψλ1 | for all λ1 > 0, (2)\nwhose frequential axis is uniformly sampled by the binary logarithm log λ1. The scalogram x1 localizes the energy of x(t) around frequencies λ1 over durations 2Q/λ1, trading frequency resolution for time resolution.\nThe constant-Q transform (CQT) S1x corresponds to a lowpass filtering of x1 with a window φT (t) of size T :\nS1x(t, log λ1) = x1 t∗ φT = |x t∗ ψλ1 | t∗ φT . (3)\nTo recover the amplitude modulations lost when averaging by φT in Equation (3), the time scattering transform also convolves x1 with a second filterbank of wavelets ψλ2 and applies complex modulus to get\nx2(t, log λ1, log λ2) = |x1 t∗ ψλ2 | = ||x t∗ ψλ1 | t∗ ψλ2 |. (4)\nThe wavelets ψλ2(t) have a quality factor in the range 1–2, though we choose to keep the same notation ψ for simplicity. Like in Equation (3), averaging in time creates invariance to translation in time up to T , yielding\nS2x(t, log λ1, log λ2) = x2 t∗ φT = ||x t∗ ψλ1 | t∗ ψλ2 | t∗ φT . (5)\nDue to the constant-Q property, S1x and S2x are stable to small time warps of x(t) as long as they do not exceed Q−1, i.e. one semitone. This implies that small modulations, such as tremolo and vibrato, are accurately linearized [3]."}, {"heading": "2.2. Joint time-frequency scattering", "text": "The time scattering transform defined in Equation (4) decomposes each frequency band separately, and thus cannot properly capture the coherence of time-frequency structures, such as those induced by pitch contour. To remedy this, Andén et al. [4] have redefined the wavelets ψλ2 ’s as functions of both time and log-frequency, indexed by pairs λ2 = (α, β), where α is a modulation frequency in Hertz and β is a frequency along log-frequencies in cycles per octaves. The joint wavelets ψλ2(t, log λ1) factorize as\nψλ2(t, log λ1) = ψα(t)× ψβ(log λ1). (6)\nWe write χ1∗ to denote convolutions along the log-frequency axis, i.e. along chromas. Wavelet scattering is extended to twodimensional convolutions by plugging Equation (6) into the definition of x2 in Equation (4):\nx2(t, log λ1, log λ2) = |x1 t,χ1∗ ψλ2 | = |x1 t∗ ψα χ1∗ ψβ |. (7)\nThe joint time-frequency scattering transform corresponds to the \"cortical transform\" introduced by Shamma and his team to formalize his findings in auditory neuroscience [10]."}, {"heading": "2.3. Spiral scattering", "text": "The time-frequency scattering transform defined in Equation (7) provides template-free features for pitch variability along time. However, it is unaware of the harmonic structure of voiced sounds, such as vowels or musical notes. The multiscale evolution of this structure yields relevant information about attack transients and formantic changes, almost independently from the pitch contour.\nIn order to capture this information, we extend the joint timefrequency scattering transform to encompass regularity in time across octaves at fixed chroma, in conjunction with regularity along neighboring constant-Q bands. Just like wavelet filterbanks along time and log-frequency have been defined in the two previous subsections, we capitalize on harmonicity by introducing a third wavelet filterbank.\nWe roll up the log-frequency variable log λ1 into a pitch spiral making one full turn at each octave (see Figure 1). Since a frequency interval of one octave corresponds to one unit in binary logarithms log λ1, pitch height and pitch chroma in the spiral correspond to integer part blog λ1c and fractional part {log λ1}:\nlog λ1 = blog λ1c+ {log λ1} = j1 + χ1 Q . (8)\nIn this setting, the fundamental frequency f0 is aligned with its power-of-two harmonics 2f0, 4f0, 8f0 and so forth. Likewise, the perfect fifth 3f0 is aligned with 6f0. As the number of harmonics per octave increase exponentially, the alignment of upper harmonics — 5f0, 7f0, and so forth — in the spiral is less crucial, because it can also be recovered with convolutions along chromas for β−1 of the order of a few semitones.\nThe wavelet ψλ2 is now defined as a product between wavelets in time, log-frequency, and octave index:\nψλ2(t, log λ1) = ψα(t)× ψβ(log λ1)× ψγ(blog λ1c). (9)\nDAFX-2\nIn the previous definition, ψβ operates over the rectilinear logfrequency variable log λ1, not over the circular chroma variable χ1 = {log λ1}. This is to avoid artifacts at octave boundaries.\nExamples of the \"spiral wavelet\"ψλ2 are shown in Figure 2 for different values of α, β and γ. To ensure invertibility and energy conservation, the quefrencies β and γ must take negative values, including zero. We adopt the shorthand notation\nlog λ2 = (logα, log |β|, signβ, log |γ|, sign γ) (10)\nto specify their indexing. In the special case β = 0, ψβ is no longer a wavelet but a low-pass filter whose support covers one octave. By convention, the corresponding log-frequency index is log |β| = −∞. The same remark applies to ψγ for γ = 0, which covers six octaves. Since its Fourier transform ψ̂λ2 is centered at (α, β, γ), the spiral wavelet ψλ2 has a pitch chroma velocity of α/β and a pitch height velocity of α/γ, both measured in octaves per second.\nWe write j1∗ to denote convolutions across neighboring octaves. The definition for x2 is comparable to Equations (4) and (7):\nx2(t, log λ1, log λ2) = |x1 t,χ1,j1∗ ψλ2 |\n= |x1 t∗ ψα χ1∗ ψβ j1∗ ψγ |.\n(11)\nRolling up pitches into a spiral is a well-established idea in music, if only because of circularity of musical pitch classes. It has been studied by Shepard [5], Risset [6], and Deutsch [7] to build paradoxes in perception of pitch, and is corroborated by functional imaging of the auditory cortex (see Warren [8])."}, {"heading": "3. DEFORMATIONS OF THE SOURCE-FILTER MODEL", "text": "A classical model for voiced speech production consists in the convolution of a harmonic glottal source e(t) with a vocal tract filter h(t). Introducing independent deformations to both components brings realistic variability to pitch and spectral envelope. This section studies the decomposition of the deformed source-filter model in the spiral scattering transform."}, {"heading": "3.1. Overview", "text": "Let e(t) = ∑ n δ(t−n) be a harmonic signal and t 7→ θ(t) a time warp function. We define a warped source as eθ(t) = (e ◦ θ)(t). Similarly, we compose a filter h(t) and a warp t 7→ η(t) to define hη(t) = (h ◦ η)(t). The warped source-filter model is the signal\nxθ,η(t) = (eθ t∗ hη)(t) (12)\nObserve that θ̇(t) induces a change of fundamental frequency, whereas η̇(t) accounts for a local dilation of the spectral envelope |ĥ|(ω). We show in this section that, for θ̇(t) and η̇(t) reasonably regular over the support of first-order wavelets, the local maxima of x2 are clustered on a plane in the (α, β, γ) space of scattering coefficients. This plane satisfies the Cartesian equation\nα+ θ̈(t)\nθ̇(t) β +\nη̈(t) η̇(t) γ = 0. (13)\nIn a polyphonic context, this result means that harmonic sounds overlapping both in time and frequency could be resolved according to their respective source-filter velocities.\nOur proof is driven by harmonicity and spectral smoothness properties — Equation (18) — and derives Equation (13) from the computation of wavelet ridges on the pitch spiral [9]."}, {"heading": "3.2. Source-filter factorization in the scalogram", "text": "Given λ1 near the pth partial pθ̇(t) where p ∈ N, we linearize θ(t) and η(t) over the support of the first-order wavelet ψλ1(t). We work under the following assumptions:\n(a) Q large enough to discriminate the pth partial: Q > 2p,\n(b) slowly varying source: ‖θ̈/θ̇‖∞ λ1/Q, (c) slowly varying filter: ‖η̈/η̇‖∞ λ1/Q, and (d) spectral smoothness:\n‖d(log |ĥ|)/dω‖∞ × ‖1/η̇‖∞ Q/λ1. According to (a), partials p′ 6= p have a negligible contribution to the scalogram of the source at the log-frequency log λ1. For lack of any interference, this scalogram is constant through time, and we may drop the dependency in t:\n|e t∗ ψλ1 | ≈ |ψ̂λ1(p)|. (14)\nAccording to (b), the scalogram of the warped source eθ(t) can be replaced by the scalogram of the original source translated along the log-frequency axis at the velocity log θ̇(t):\n|eθ t∗ ψλ1 |(t) = |e t∗ ψλ1 |(θ(t)) ≈ |ψ̂λ1(pθ̇(t))|. (15)\nAccording to (c), we linearize η(t) over the support of ψλ1(t). According to (d), we approximate ĥ(ω) by a constant over the frequential support of the wavelet and factorize the filtering as a product:\n(hη ∗ ψλ1) (t) ≈ ĥ ( λ1 η̇(t) ) × ψλ1 ( η(t) η̇(t) ) . (16)\nBy plugging Equation (15) into Equation (16), the scalogram of the deformable source-filter model appears as a separable product:\n|xθ,η t∗ ψλ1 |(t) = |ψ̂λ1(pθ̇(t))| × ∣∣∣∣ĥ( λ1η̇(t) )∣∣∣∣ . (17)"}, {"heading": "3.3. Harmonicity and spectral smoothness properties", "text": "The second step in the proof consists in showing that the convolution along chromas with ψβ only applies to e1,θ , whereas the convolution across octaves with ψγ only applies to h1,η . Indeed, all wavelets are designed to carry a negligible mean value, i.e. convolving them with a constant yields zero. Therefore, the harmonicity and spectral smothness properties rewrite as∣∣∣|eθ t∗ ψλ1 | j1∗ ψγ∣∣∣ ≈ 0 and ∣∣∣|eθ t∗ ψλ1 | χ1∗ ψβ∣∣∣ ≈ 0. (18) Gathering Equations (17) and (18) into the definition of spiral scattering yields\nxθ,η t,χ1,j1∗ ψλ2 (19)\n= [( |eθ t∗ ψλ1 | χ1∗ ψβ ) × ( |hη t∗ ψλ1 | j1∗ ψγ )] t∗ ψα,\nwhere the superscripts t, χ1, and j1 denote convolutions along time, chromas and octaves respectively.\nDAFX-3"}, {"heading": "3.4. Extraction of instantaneous frequencies", "text": "As a final step, we state that the phase of (|eθ t∗ ψλ1 | χ ∗ ψβ) is β×(log λ1−log pθ̇(t)). By differentiating this quantity along t for fixed log λ1, we obtain an instantaneous frequency of−βθ̈(t)/θ̇(t). Similarly, the instantaneous frequency of (|hη t∗ ψλ1 | j1∗ ψγ) is −γη̈(t)/η̇(t). As long as\nα ≥ ∣∣∣∣ θ̈(t)θ̇(t)β ∣∣∣∣ and α ≥ ∣∣∣∣ η̈(t)η̇(t)γ ∣∣∣∣ , (20)\nthe envelopes of these two convolutions are almost constant over the support of ψα(t) [9]. We conclude with the following approximate closed-form expression for the spiral scattering coefficients of the deformed source-filter model:\nx2(t, log λ1, log λ2) = ∣∣∣|eθ t∗ ψλ1 | χ1∗ ψβ∣∣∣× ∣∣∣|hη t∗ ψλ1 | j1∗ ψγ∣∣∣ × ∣∣∣∣ψ̂α (− θ̈(t)θ̇(t)β − η̈(t)η̇(t)γ\n)∣∣∣∣ . (21) The Fourier spectrum |ψ̂α(ω)| of ψα(t) is a bump centered at the frequency α. Equation (13) follows immediately from the above formula. The same result holds for the averaged coefficients S2x = x2 ∗φT if the velocities θ̈(t)/θ̇(t) or η̈(t)/η̇(t) have small relative variations:∣∣∣∣ ...θ (t)θ̈(t) − θ̈(t)θ̇(t) ∣∣∣∣ T−1 and ∣∣∣∣ ...η (t)η̈(t) − η̈(t)η̇(t) ∣∣∣∣ T−1. (22)\nIn the example of a trombone signal, glissando can be modeled by θ̈(t)/θ̇(t) in the source-filter model, whereas the brassiness profile induces a timbral velocity η̈(t)/η̇(t). Figure 3 illustrates that these two velocities are stably disentangled and characterized."}, {"heading": "4. CONCLUSIONS", "text": "The spiral model we have presented is well-known in music theory and experimental psychology [5, 6, 7]. However, existing methods in audio signal processing do not fully take advantage from its richness, because they either picture pitch on a line (e.g. MFCC) or on a circle (e.g. chroma features). In this article, we have shown how spiral scattering can represent the transientness of harmonic sounds."}, {"heading": "5. REFERENCES", "text": "[1] C. Kereliuk and P. Depalle, “Improved Hidden Markov Model Partial Tracking Through Time-frequency Analysis,” in Proc. DAFx, 2008.\n[2] R. Hennequin, R. Badeau, and B. David, “NMF with Time-frequency Activations to Model Nonstationary Audio Events,” IEEE Trans. Audio, Speech, Language Process., vol. 19, no. 4, pp. 744–753, 2011.\n[3] J. Andén and S. Mallat, “Scattering Representation of Modulated Sounds,” Proc. DAFx, , no. 3, 2012.\n[4] J. Andén, V. Lostanlen, and S. Mallat, “Joint Time-frequency Scattering for Audio Classification,” Proc. IEEE MLSP, 2015.\n[5] R. Shepard, “Circularity in Judgments of Relative Pitch,” J. Acoust. Soc. Am., vol. 36, no. 12, pp. 2346, 1964.\n[6] J.-C. Risset, “Pitch control and pitch paradoxes demonstrated with computer-synthesized sounds,” J. Acoust. Soc. Am., vol. 46, no. 1A, pp. 88–88, 1969.\n[7] D. Deutsch, K. Dooley, and T. Henthorn, “Pitch circularity from tones comprising full harmonic series.,” J. Acoust. Soc. Am., vol. 124, no. 1, pp. 589–597, 2008.\n[8] J. Warren, S. Uppenkamp, R. Patterson, and T. Griffiths, “Analyzing Pitch Chroma and Pitch Height in the Human Brain,” Ann. N. Y. Acad. Sci., vol. 999, no. 17, pp. 212–214, 2003.\n[9] N. Delprat, B. Escudié, P. Guillemain, R. Kronland-Martinet, P. Tchamitchian, and B. Torrésani, “Asymptotic Wavelet and Gabor Analysis: Extraction of Instantaneous Frequencies,” IEEE Trans. Inf. Theory, vol. 38, pp. 644–664, 1992.\n[10] K. Patil, D. Pressnitzer, S. Shamma, and M. Elhilali, “Music in our ears: the biological bases of musical timbre perception,” PLoS Computational Biology, vol. 8, no. 11, 2012.\nDAFX-4"}], "references": [{"title": "Improved Hidden Markov Model Partial Tracking Through Time-frequency Analysis", "author": ["C. Kereliuk", "P. Depalle"], "venue": "Proc. DAFx, 2008.", "citeRegEx": "1", "shortCiteRegEx": null, "year": 2008}, {"title": "NMF with Time-frequency Activations to Model Nonstationary Audio Events", "author": ["R. Hennequin", "R. Badeau", "B. David"], "venue": "IEEE Trans. Audio, Speech, Language Process., vol. 19, no. 4, pp. 744–753, 2011.", "citeRegEx": "2", "shortCiteRegEx": null, "year": 2011}, {"title": "Scattering Representation of Modulated Sounds", "author": ["J. Andén", "S. Mallat"], "venue": "Proc. DAFx, , no. 3, 2012.", "citeRegEx": "3", "shortCiteRegEx": null, "year": 2012}, {"title": "Circularity in Judgments of Relative Pitch", "author": ["R. Shepard"], "venue": "J. Acoust. Soc. Am., vol. 36, no. 12, pp. 2346, 1964.", "citeRegEx": "5", "shortCiteRegEx": null, "year": 1964}, {"title": "Pitch control and pitch paradoxes demonstrated with computer-synthesized sounds", "author": ["J.-C. Risset"], "venue": "J. Acoust. Soc. Am., vol. 46, no. 1A, pp. 88–88, 1969.", "citeRegEx": "6", "shortCiteRegEx": null, "year": 1969}, {"title": "Pitch circularity from tones comprising full harmonic series", "author": ["D. Deutsch", "K. Dooley", "T. Henthorn"], "venue": "J. Acoust. Soc. Am., vol. 124, no. 1, pp. 589–597, 2008.", "citeRegEx": "7", "shortCiteRegEx": null, "year": 2008}, {"title": "Analyzing Pitch Chroma and Pitch Height in the Human Brain", "author": ["J. Warren", "S. Uppenkamp", "R. Patterson", "T. Griffiths"], "venue": "Ann. N. Y. Acad. Sci., vol. 999, no. 17, pp. 212–214, 2003.", "citeRegEx": "8", "shortCiteRegEx": null, "year": 2003}, {"title": "Asymptotic Wavelet and Gabor Analysis: Extraction of Instantaneous Frequencies", "author": ["N. Delprat", "B. Escudié", "P. Guillemain", "R. Kronland-Martinet", "P. Tchamitchian", "B. Torrésani"], "venue": "IEEE Trans. Inf. Theory, vol. 38, pp. 644–664, 1992.", "citeRegEx": "9", "shortCiteRegEx": null, "year": 1992}, {"title": "Music in our ears: the biological bases of musical timbre perception", "author": ["K. Patil", "D. Pressnitzer", "S. Shamma", "M. Elhilali"], "venue": "PLoS Computational Biology, vol. 8, no. 11, 2012. DAFX-4", "citeRegEx": "10", "shortCiteRegEx": null, "year": 2012}], "referenceMentions": [{"referenceID": 0, "context": "On one hand, spectrogram-based pattern recognition algorithms [1] are exposed to detection errors as they enforce strong constraints on the shape of harmonic templates.", "startOffset": 62, "endOffset": 65}, {"referenceID": 1, "context": "On the other, time-varying generalizations of matrix factorization [2] are underconstrained and thus may fail to converge to a satisfying solution.", "startOffset": 67, "endOffset": 70}, {"referenceID": 2, "context": "This implies that small modulations, such as tremolo and vibrato, are accurately linearized [3].", "startOffset": 92, "endOffset": 95}, {"referenceID": 8, "context": "The joint time-frequency scattering transform corresponds to the \"cortical transform\" introduced by Shamma and his team to formalize his findings in auditory neuroscience [10].", "startOffset": 171, "endOffset": 175}, {"referenceID": 3, "context": "It has been studied by Shepard [5], Risset [6], and Deutsch [7] to build paradoxes in perception of pitch, and is corroborated by functional imaging of the auditory cortex (see Warren [8]).", "startOffset": 31, "endOffset": 34}, {"referenceID": 4, "context": "It has been studied by Shepard [5], Risset [6], and Deutsch [7] to build paradoxes in perception of pitch, and is corroborated by functional imaging of the auditory cortex (see Warren [8]).", "startOffset": 43, "endOffset": 46}, {"referenceID": 5, "context": "It has been studied by Shepard [5], Risset [6], and Deutsch [7] to build paradoxes in perception of pitch, and is corroborated by functional imaging of the auditory cortex (see Warren [8]).", "startOffset": 60, "endOffset": 63}, {"referenceID": 6, "context": "It has been studied by Shepard [5], Risset [6], and Deutsch [7] to build paradoxes in perception of pitch, and is corroborated by functional imaging of the auditory cortex (see Warren [8]).", "startOffset": 184, "endOffset": 187}, {"referenceID": 7, "context": "Our proof is driven by harmonicity and spectral smoothness properties — Equation (18) — and derives Equation (13) from the computation of wavelet ridges on the pitch spiral [9].", "startOffset": 173, "endOffset": 176}, {"referenceID": 7, "context": "the envelopes of these two convolutions are almost constant over the support of ψα(t) [9].", "startOffset": 86, "endOffset": 89}, {"referenceID": 3, "context": "The spiral model we have presented is well-known in music theory and experimental psychology [5, 6, 7].", "startOffset": 93, "endOffset": 102}, {"referenceID": 4, "context": "The spiral model we have presented is well-known in music theory and experimental psychology [5, 6, 7].", "startOffset": 93, "endOffset": 102}, {"referenceID": 5, "context": "The spiral model we have presented is well-known in music theory and experimental psychology [5, 6, 7].", "startOffset": 93, "endOffset": 102}], "year": 2016, "abstractText": "We present a new representation of harmonic sounds that linearizes the dynamics of pitch and spectral envelope, while remaining stable to deformations in the time-frequency plane. It is an instance of the scattering transform, a generic operator which cascades wavelet convolutions and modulus nonlinearities. It is derived from the pitch spiral, in that convolutions are successively performed in time, log-frequency, and octave index. We give a closed-form approximation of spiral scattering coefficients for a nonstationary generalization of the harmonic source-filter model.", "creator": "LaTeX with hyperref package"}}}