{"id": "1709.00228", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "1-Sep-2017", "title": "Learning Multi-item Auctions with (or without) Samples", "abstract": "We provide algorithms that learn simple auctions whose revenue is approximately optimal in multi-item multi-bidder settings, for a wide range of valuations including unit-demand, additive, constrained additive, XOS, and subadditive. We obtain our learning results in two settings. The first is the commonly studied setting where sample access to the bidders' distributions over valuations is given, for both regular distributions and arbitrary distributions with bounded support. Our algorithms require polynomially many samples in the number of items and bidders. The second is a more general max-min learning setting that we introduce, where we are given \"approximate distributions,\" and we seek to compute an auction whose revenue is approximately optimal simultaneously for all \"true distributions\" that are close to the given ones. These results are more general in that they imply the sample-based results, and are also applicable in settings where we have no sample access to the underlying distributions but have estimated them indirectly via market research or by observation of previously run, potentially non-truthful auctions.", "histories": [["v1", "Fri, 1 Sep 2017 10:07:18 GMT  (66kb)", "http://arxiv.org/abs/1709.00228v1", "Appears in FOCS 2017"]], "COMMENTS": "Appears in FOCS 2017", "reviews": [], "SUBJECTS": "cs.GT cs.DS cs.LG", "authors": ["yang cai", "constantinos daskalakis"], "accepted": false, "id": "1709.00228"}, "pdf": {"name": "1709.00228.pdf", "metadata": {"source": "CRF", "title": null, "authors": [], "emails": ["cai@cs.mcgill.ca", "costis@csail.mit.edu"], "sections": [{"heading": null, "text": "ar X\niv :1\n70 9.\n00 22\n8v 1\n[ cs\n.G T\n] 1\nS ep\nWe provide algorithms that learn simple auctions whose revenue is approximately optimal in multi-item multi-bidder settings, for a wide range of bidder valuations including unit-demand, additive, constrained additive, XOS, and subadditive. We obtain our learning results in two settings. The first is the commonly studied setting where sample access to the bidders’ distributions over valuations is given, for both regular distributions and arbitrary distributions with bounded support. Here, our algorithms require polynomially many samples in the number of items and bidders. The second is a more general max-min learning setting that we introduce, where we are given “approximate distributions,” and we seek to compute a mechanism whose revenue is approximately optimal simultaneously for all “true distributions” that are close to the ones we were given. These results are more general in that they imply the sample-based results, and are also applicable in settings where we have no sample access to the underlying distributions but have estimated them indirectly via market research or by observation of bidder behavior in previously run, potentially non-truthful auctions.\nAll our results hold for valuation distributions satisfying the standard (and necessary) independenceacross-items property. They also generalize and improve upon recent works of Goldner and Karlin [28] and Morgenstern and Roughgarden [35], which have provided algorithms that learn approximately optimal multi-item mechanisms in more restricted settings with additive, subadditive and unit-demand valuations using sample access to distributions. We generalize these results to the complete unit-demand, additive, and XOS setting, to i.i.d. subadditive bidders, and to the max-min setting.\nOur results are enabled by new uniform convergence bounds for hypotheses classes under product measures. Our bounds result in exponential savings in sample complexity compared to bounds derived by bounding the VC dimension, and are of independent interest."}, {"heading": "1 Introduction", "text": "The design of revenue-optimal auctions is a central problem in Economics and Computer Science, which has found myriad applications in online and offline settings, ranging from sponsored search and online advertising to selling artwork by auction houses, and public goods such as drilling rights and radio spectrum by governments. The problem involves a seller who wants to sell one or several items to one or multiple strategic bidders with private valuation functions, mapping each bundle of items they may receive to how much value they derive from the bundle. As no meaningful revenue guarantee can possibly be achieved without any information about the valuations of the bidders, the problem has been classically studied under Bayesian assumptions, where a joint distribution from which all bidders’ valuations are drawn is common knowledge, and the goal is to maximize revenue in expectation with respect to this distribution.\nIn the single-item setting, Bayesian assumptions have enabled beautiful and influential developments in auction theory. Already 36 years ago, a breakthrough result by Myerson identified the optimal single-item auction when bidder values are independent [36], and the ensuing decades saw a great deal of further understanding and practical applications of single-item auctions, importantly in online settings.\nHowever, the quest for optimal multi-item auctions has been quite more challenging. It has been recognized that revenue-optimal multi-item auctions can be really complex, may exhibit counter-intuitive properties, and be fragile to changes in the underlying distributions; for a discussion and examples see survey [18]. As such, it is doubtful that there is a crisp characterization of the structure of optimal multi-item auctions, at least not beyond single-bidder settings [19]. On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20]. Importantly, this progress has enabled identifying simple auctions (mostly variations of sequential posted pricing mechanisms) that achieve constant factor approximations to the revenue of the optimum [5, 42, 11, 16, 13], under the item-independence assumption of Definition 1 and Example 1. These auctions are way simpler than the optimum, and have strong incentive properties: they are dominant strategy truthful, while still competing against the optimal Bayesian truthful mechanism. The current state-of-the-art is given as Theorem 8, which applies to bidders with valuation functions from the broad class of fractionally subbaditive (a.k.a. XOS) valuations, which contains submodular.\nAs our discussion illustrates, studying auctions assuming Bayesian priors has been quite fruitful, enabling us to identify guiding principles for how to structure auctions to achieve optimal (in single-item settings) or approximately optimal (in multi-item settings) revenue. To apply this theory to practice, however, one needs knowledge of the underlying distributions. Typically, one would estimate these distributions via market research or by observations of bidder behavior in prior auctions, then use the estimated distributions to design a good auction. However, estimation involves approximation, and the performance of mechanisms can be quite fragile to errors in the distributions. This motivates studying whether optimal or approximately optimal auctions can be identified when one has imperfect knowledge of the true distributions.\nWith this motivation, recent work in Computer Science has studied whether approximately optimal mechanisms can be “learned” given sample access to the underlying distributions. This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].\nOn the multi-item front, however, where the analogue of Myerson’s theory is elusive, and unlikely, our understanding is much sparser. Recent work of Morgenstern and Roughgarden [35] has taken a computational learning theory approach to identify the sample complexity required to optimize over classes of simple auctions. Combined with the afore-described results on the revenue guarantees of simple auctions, their work leads to algorithms that learn approximately optimal auctions in multi-item settings with multiple unit-demand bidders, or a single subadditive bidder, from polynomially many samples in the number of items and bidders. These results apply to distributions satisfying the item-independence assumption of Definition 1 and\nExample 1, under which the approximate optimality of simple auctions has been established.\nWhile well-suited for identifying the sample complexity required to optimize over a class of simple mechanisms, which is a perfectly reasonable goal to have but not the one in this paper, the approach taken in [35] is arguably imperfect towards proving polynomial sample bounds for learning approximately optimal auctions in the settings where simple mechanisms are known to perform well in the first place. This is due to the following discordance: (i) On the one hand, simple and approximately optimal mechanisms in multi-item settings are mostly only known under item-independence. (ii) On the other hand, the computational learning techniques employed in [35], and in particular bounding the pseudo-dimension of a class of auctions, are not fine enough to discern the difference in sample complexity required to optimize under item-independence and without itemindependence. As such, this technique can only obtain polynomial sample bounds for approximate revenue optimization if it so happens that a class of mechanisms is both learnable from polynomially-many samples under arbitrary distributions, and it guarantees approximately optimal revenue under item-independence, or for some other interesting class of distributions.1\nIn particular, bounding the pseudo-dimension of classes of auctions as a means to prove polynomialsample bounds for approximate revenue optimization hits a barrier even for multiple additive bidders with independent values for items. In this setting, the approximately optimal auctions that are known are the best of selling the items separately or running a VCG mechanism with entry fees [42, 11], as described in Section 5.2. Unfortunately, the latter can easily be seen to have pseudo-dimension that is exponential in the number of bidders, thus only implying a sufficient exponentially large sample size to optimize over these mechanisms. Is this exponential sample size really necessary or an artifact of the approach? Recent work of Goldner and Karlin [28] gives us hope that it is the latter. They show how to learn approximately optimal auctions in the multi-item multi-bidder setting with additive bidders using only one sample from each bidder’s distribution, assuming that it is regular and independent across items.\nOur results. We show that simple and approximately optimal mechanisms are learnable from polynomiallymany samples for multi-item multi-bidder settings, whenever:\n• the bidder valuations are fractionally subadditive (XOS), i.e. we can accommodate additive, unitdemand, constrained additive, and submodular valuations;\n• the distributions over valuations satisfy the standard item-independence assumption of Definition 1 and Example 1, and their single-item marginals are arbitrary and bounded, or (have arbitrary supports but\nare) regular.2\nIn particular, our results constitute vast extensions of known results on the polynomial learnability of approximately optimal auctions in multi-item settings [35, 28]. Additionally we show that:\n• whenever the valuations are additive and unit-demand, or whenever the bidders are symmetric and have XOS valuations, our approximately optimal mechanisms can be identified from polynomially many\nsamples and in polynomial time;\n• whenever the bidders are symmetric (i.e. their valuations are independent and identically distributed) and have subadditive valuations, we can compute from polynomially many samples and in polynomial-time\na simple mechanism whose revenue is a Ω (\nn max{m,n}\n) -fraction of the optimum, where m and n are\nrespectively the number of items and bidders. In particular, if the number of bidders is at least a constant fraction of the number of items, the mechanism is a constant factor approximation; and\n1It is known that some restriction needs to be made on the distribution to gain polynomial sample complexity, as otherwise exponential lower bounds are known for learning approximately optimal auctions even for a single unit-demand bidder [24]. 2We note again that without the standard item-independence (or some other) restriction on the distributions, we cannot hope to learn approximately optimal auctions from sub-exponentially many samples, even for a single unit-demand bidder [24].\n• in the setting of the previous bullet, if the itemmarginals are regular, our mechanism is prior-independent, i.e. there is a single mechanism, identifiable without any samples from the distributions, providing the\nafore-described revenue guarantee.\nFinally, the mechanisms learned by our algorithms for XOS bidders are either rationed sequential posted price mechanisms (RSPMs) or anonymous sequential posted price mechanisms with entry fees (ASPEs) as defined in Section 6. The mechanisms learned for symmetric subadditive bidders are RSPMs. RSPMs maintain a price pij for every bidder and item pair and, in some order over bidders i = 1, . . . , n, they give one opportunity to bidder i to purchase one item j that has not been purchased yet at price pij . ASPEs maintain one price pj for every item and, in some order over bidders i = 1, . . . , n, they give one opportunity to bidder i to purchase any subset S′ of the items S that have not been purchased yet as long as he also pays an “entry fee” that depends on S and the identity of the bidder. See Algorithm 3.\nLearning without Samples. Thus far, our algorithms used samples from the valuation distributions to identify an approximately optimal and simple mechanism under item-independence. However, having sample access to the distributions may be impractical. Often we can observe the actions used by bidders in non-truthful auctions that were previously run, and use these observations to estimate the distributions over valuations using econometric methods [30, 37, 4]. In fact, it may likely be the case we have never sold all the items together in the past, and only have observations of bidder behavior in non-truthful auctions selling each item separately. Econometric methods would achieve better approximations in this case, but only for the item marginals. Finally, we may want to combine multiple sources of information about the distributions, combining past bidder behavior in several different auctions and with market research data.\nWith this motivation in mind, we would like to extend our learnability results beyond the setting where sample access to the valuation distributions is provided. We propose “learning” approximately optimal multiitem auctions given distributions that are close to the true distributions under some distribution distance d(·, ·). In particular, given approximate distributions D̂1, . . . , D̂n over bidder valuations, we are looking to identify a mechanism M satisfying the following max-min style objective:\n∀D1, . . . ,Dn s.t. d(Di, D̂i) ≤ ǫ,∀i : RevM(D1, . . . ,Dn) ≥ Ω(OPT(D1, . . . ,Dn))− poly(ǫ,m, n). (1)\nThat is, we want to find a mechanismM whose revenue is within a constant multiplicative and a poly(ǫ,m, n) additive error from optimum, simultaneously in all possible worlds D1, . . . ,Dn, where d(Di, D̂i) ≤ ǫ,∀i. It is not a priori clear that such a “one-fits-all” mechanism actually exists.\nThere are several notions of distance d(·, ·) between distributions that we could study in the formulation of Goal (1), but we opt for an easy one to satisfy. We only require that we know every bidder’s marginal distributions over single-item values to within ǫ in Kolmogorov distance;3 see Definition 2. All that this requires is that the cumulative density functions of the approximating distributions over single-item values is within ǫ in infinity norm from the corresponding cumulative density functions of the corresponding true distributions. As such, it is an easy property to satisfy. For example, given sample access to any single-item marginal, the DKW inequality [25] implies that O(log(1/δ)/ǫ2) samples suffice to learn it to within ǫ in Kolmogorov distance, with probability at least 1 − δ. So achieving Goal (1) directly also implies polynomial sample learnability of approximately optimal auctions. But a Kolmogorov approximation can also be arrived at by combining different sources of information about the single-item marginals such as the ones described above. Regardless of how the approximations were obtained, the max-min goal outlined above guarantees\n3Indeed, Goal (1) is achievable only for bounded distributions even in the single-item single-bidder setting. Given any bounded distribution D̂, create D by moving ǫ probability mass in D̂ to +∞. It is not hard to see that D and D̂ are within ǫ in Kolmogorov distance, but no single mechanism can satisfy the approximation guarantee for bothD and D̂ simultaneously. Using a similar argument, we can argue that the additive error has to depend onH which is the upper bound on any bidder’s value for a single item. See Section 2 for our formal model.\nrobustness of the revenue of the identified mechanism M with respect to all sources of error that came into the estimation of the single-item marginal distributions.\nWhile Goal (1) is not a priori feasible, we show how to achieve it in multi-item multi-bidder settings with constrained additive bidders, or symmetric bidders with subadditive valuations, under the standard assumption of item-independence. Our results are polynomial-time in the same cases as our sample-based results discussed above.\nRoadmap and Technical Ideas. In Section 4, we present a new approach for obtaining uniform convergence bounds for hypotheses classes under product distributions; see Theorem 2 and Corollary 1. We show that our approach can significantly improve the sample complexity bound obtained via traditional methods such as VC theory. In particular, Table 3 compares the sample complexity bounds obtained via our approach to those obtained by VC theory for different classes of hypotheses.\nOur results for mechanisms make use of recent work on the revenue guarantees of simple mechanisms, which are mainly variants of sequential posted pricing mechanisms [11, 13]. Using our results from Section 4, in Section 5, we derive uniform convergence bounds for the revenue of a class of mechanisms shown to achieve a constant fraction of optimal revenue when all bidders have valuations that are constrained additive over independent items. These mechanisms are called Sequential Posted Price with Entry Fee Mechanisms, a.k.a. SPEMs,4. As a corollary of the uniform convergence of SPEMs, we obtain our sample based results for constrained additive bidders. In fact, we obtain a slightly stronger statement than uniform convergence of the revenue of SPEMs, which also implies our max-min results for constrained-additive bidders; see Theorems 3 and 4. In particular, Theorem 4 and the DKW inequality imply the polynomial-sample learnability of approximately revenue-optimal auctions for constrained additive bidders.\nTechnically speaking, our sample based and max-min approximation results for constrained additive bidders provide a crisp illustration of how we leverage item-independence and our new uniform convergence bounds for product measures to sidestep the exponential pseudo-dimension of the class of mechanisms that we are optimizing over. Let us discuss our max-min results which are stronger. Suppose Di = ×jDij is the true distribution over bidder i’s valuation and D̂i = ×jD̂ij is the approximating distribution, where Dij and D̂ij are respectively the item j marginals. To argue that the revenue of some anonymous sequential posted price with entry fees (ASPE) mechanism is similar under D = ×iDi and D̂ = ×iD̂i, we need to couple in total variation distance the decisions of what sets all bidders buy in the execution of the mechanism under D and D̂. The issue that we encounter is that there are exponentially many subsets each bidder may buy, hence the naive use of the Kolmogorov bound ||Dij − D̂ij ||K ≤ ǫ, on each single-item marginal results in an exponential blow-up in the total variation distance of what subset of items bidder i buys, invalidating our desired coupling. To circumvent this challenge, we argue in Lemma 4 that the events corresponding to which subset of items each buyer will buy are single-intersecting, according to Definition 4, when seen as events on the buyer’s single-item values. Single-intersecting events may be non-convex and have infinite VC dimension. Nevertheless, because single-item values are independent, our new uniform convergence bounds for product measures (Lemma 3) imply that the difference in probabilities of any such event under D and D̂ is only a factor of m, the number of items, larger than the bound ǫ on the Kolmogorov distance between single-item marginals.\nWe specialize our results to unit-demand bidders in Section 5.1 to obtain computationally efficient solutions for both max-min and sample-based models. Similarly, Section 5.2 contains our results for additive bidders. We also generalize our sample-based results for constrained additive bidders to XOS bidders in Section 6. Finally, we provide computationally efficient solutions for symmetric XOS and even symmetric subadditive bidders in Section 7. These results are based on showing that (i) the right parameters of SPEMs can be efficiently and approximately identified with sample or max-min access to the distributions; and (ii) that the revenue guarantees of simple mechanisms can be robustified to accommodate error in the setting of the\n4Note that any RSPM or ASPE is an SPEM.\nparameters. In particular, our sample-based result for unit-demand bidders robustifies the ex-ante relaxation of the revenue maximization problem from [1] and its conversion to a sequential posted pricing mechanism from [15], and makes use of the extreme-value theorem for regular distributions from [7]. Our sample-based result for additive bidders shows how to use samples to design mechanisms that approximate the revenue of Yao’s VCG with entry fees mechanism [42]. Our sample-based results for XOS bidders show how to use samples to approximate the parameters of the RSPM and ASPE mechanisms of [13], and argue, by re-doing their duality proofs, that their revenue guarantees are robust to errors in the approximation. Finally, our sample based result for symmetric subadditive bidders is based on a new, duality based, approximation, showing how to eliminate the use of ASPEs from the result of [13]. This even allows us to obtain prior-independent mechanisms when the item marginals are regular."}, {"heading": "2 Preliminaries", "text": "We focus on revenue maximization in the combinatorial auction with n independent bidders and m heterogenous items. Each bidder has a valuation that is subadditive over independent items (see Definition 1). We denote bidder i’s type ti as 〈tij〉 m j=1, where tij is bidder i’s private information about item j. For each i, j, we assume tij is drawn independently from the distribution Dij . Let Di = × m j=1Dij be the distribution of bidder i’s type andD = ×ni=1Di be the distribution of the type profile. We use Tij (or Ti, T ) and fij (or fi, f ) to denote the support and density function of Dij (or Di,D). For notational convenience, we let t−i to be the types of all bidders except i. Similarly, we define D−i, T−i and f−i for the corresponding distributions, support sets and density functions. When bidder i’s type is ti, her valuation for a set of items S is denoted by vi(ti, S). Throughout the paper we use OPT to denote the optimal revenue obtainable by any randomized and Bayesian truthful mechanism.\nDefinition 1. [40] For every bidder i, whose type ti is drawn from a product distribution Fi = ×jFij , her distribution, Vi, over valuation functions vi(ti, ·) is subadditive over independent items if:\n- vi(·, ·) has no externalities, i.e., for each ti ∈ Ti and S ⊆ [m], vi(ti, S) only depends on 〈tij〉j∈S , formally, for any t′i ∈ Ti such that t ′ ij = tij for all j ∈ S, vi(t ′ i, S) = vi(ti, S). - vi(·, ·) is monotone, i.e., for all ti ∈ Ti and U ⊆ V ⊆ [m], vi(ti, U) ≤ vi(ti, V ).\n- vi(·, ·) is subadditive, i.e., for all ti ∈ Ti and U , V ⊆ [m], vi(ti, U ∪ V ) ≤ vi(ti, U) + vi(ti, V ).\nWe use Vi(tij) to denote vi(ti, {j}), as it only depends on tij . When vi(ti, ·) is XOS (or constrained additive) for all i and ti ∈ Ti, we say Vi is XOS (or constrained additive) over independent items.\nExample 1. [40] We may instantiate Definition 1 to define restricted families of subadditive valuations as follows. In all cases, suppose t = {tj}j∈[m] is drawn from ×jDj . To define a valuation function that is:\n- unit-demand, we can take tj to be the value of item j, and set v(t, S) = maxj∈S tj . - additive, we can take tj to be the value of item j, and set v(t, S) = ∑ j∈S tj . - constrained additive, we can take tj to be the value of item j, and set v(t, S) = maxR⊆S,R∈I ∑ j∈R tj , for some downward closed set system I ⊆ 2[m]. - XOS (a.k.a. fractionally subadditive), we can take tj = {t (k) j }k∈[K] to encode all possible values associated with item j, and take v(t, S) = maxk∈[K] ∑ j∈S t (k) j .\nNote that constrained additive valuations contain additive and unit-demand valuations as special cases,\nand are contained in XOS valuations."}, {"heading": "Distribution Access Models", "text": "We consider the following three different models to access the distributions.\n• Sample access to bounded distributions. We assume that for any buyer i and any type ti ∈ Ti, her value Vi(tij) for any single item j lies in [0,H].\n• Sample access to regular distributions. We assume that for any buyer i and any type ti ∈ Ti, the distribution of her value Vi(tij) for any item j is regular.\n• Direct access to approximate distributions. We assume that we have direct access to a distribution D̂ = ×i∈[n],j∈[m]D̂ij , for example we can query the pdf, cdf of D̂ and take samples from D̂. Moreover, for any buyer i and any type ti ∈ Ti, the distributions of the random variable Vi(tij) when tij is sampled from D̂ij or Dij are within ǫ in Kolmogorov distance, and both distributions are supported on [0,H].\nDefinition 2. The Kolmogorov distance between two distributions P and Q over R, denoted ||P − Q||K , is defined as supx∈R |PrX∼P [X ≤ x] − PrX∼Q[X ≤ x]|. The total variation distance between two probability measures P and Q on a sigma-algebra F of subsets of some sample space Ω, denoted ||P −Q||TV , is defined as supE∈F |P (E) −Q(E)|."}, {"heading": "3 Summary of Our Results", "text": "We summarize our results in the following two tables. Table 1 contains all sample-based results and Table 2 contains all results under the max-min learning model."}, {"heading": "4 Uniform Convergence under Product Measures", "text": "In this section, we develop machinery for obtaining uniform convergence bounds for hypotheses over product measures. Our goal is to save on the sample complexity implied by VC dimension bounds, as summarized in Table 3. Indeed, we obtain low sample complexity bounds for indicators over single-intersecting sets (see\nDefinition 4), which play a key role in proving our results for learning approximately revenue-optimal auctions. Our main results of this section are Theorem 2 for general functions, and Corollary 1 for sets.\nWe first define what type of uniform convergence bounds we seek to prove.\nDefinition 3 ((ǫ, δ)-uniform convergence with respect to proxy measure). A hypothesis class H of functions mapping domain set X toR has (ǫ, δ)-uniform convergence with sample complexity s(ǫ, δ) iff, for all ǫ, δ > 0, there exists a processing P : X s(ǫ,δ) → ∆(X ) such that for any distribution D ∈ ∆(X ) when k = s(ǫ, δ):\nPr z1,··· ,zk∼D [ sup g∈H ∣∣Ez∼P(z1,··· ,zk)[g(z)] − Ez∼D[g(z)] ∣∣ ≤ ǫ ] ≥ 1− δ.\nWhenX is the Cartesian product of a collection of setsX1, . . . ,Xk, i.e.X = ×iXi, we say that a hypothesis class H as above has (ǫ, δ)-p.m. uniform convergence with sample complexity s(ǫ, δ) if the above holds for all D that are product measures over X .\nNext we provide a simple lemma, which leads to a simple version of our main result stated as Theorem 1.\nOur main result, stated as Theorem 2, follows.\nLemma 1. Let X1, . . . ,Xd be d domain sets and H be a hypothesis class with functions mapping from the product space ×di=1Xi to R. For all i ∈ [d], let Hi be the projected hypothesis class of H on Xi, that is, Hi = {g | ∃f ∈ H ∃ a−i ∈ ×j 6=iXj ∀ xi ∈ Xi, g(xi) = f(xi, a−i)}. For every i ∈ [d], let Di and D̂i be two distributions supported on Xi. Suppose for all i ∈ [d],\nsup g∈Hi\n∣∣∣Ex∼Di[g(x)] − Ex∼D̂i[g(x)] ∣∣∣ ≤ ǫ,\nthen\nsup f∈H\n∣∣∣Ex∼×di=1Di [f(x)]− Ex∼×di=1D̂i [f(x)] ∣∣∣ ≤ d · ǫ.\nProof. Let Fi and F̂i be the probability measure function for Di and D̂i respectively. We will prove the statement using a hybrid argument. We create a sequence of product distributions {D(j)}j≤d, where D (j) = D̂1 × · · · × D̂j ×Dj+1 × · · · × Dd, and D (0) = D, D(d) = D̂. To prove our claim, it suffices to show that for any integer j ∈ [d], |Ex∼D(j−1) [f(x)]− Ex∼D(j) [f(x)]| ≤ ǫ.\nNext, we show how to derive this inequality.\n|Ex∼D(j−1) [f(x)]− Ex∼D(j) [f(x)]|\n= ∣∣∣∣∣ ∫\n×i6=jXi\n(∫\nXj\nf(xj, x−j)dFj(xj) ) dF̂1(x1) · · · dF̂j−1(xj−1)dFj+1(xj+1) · · · dFd(xd)\n−\n∫\n×i6=jXi\n(∫\nXj\nf(xj , x−j)dF̂j(xj) ) dF̂1(x1) · · · dF̂j−1(xj−1)dFj+1(xj+1) · · · dFd(xd) ∣∣∣∣∣\n= ∣∣∣∣∣ ∫\n×i6=jXi\n( Exj∼Dj [f(xj , x−j)]− Exj∼D̂j [f(xj, x−j)] ) dF̂1(x1) · · · dF̂j−1(xj−1)dFj+1(xj+1) · · · dFd(xd) ∣∣∣∣∣\n≤ǫ ·\n∫\n×i6=jXi\ndF̂1(x1) · · · dF̂j−1(xj−1)dFj+1(xj+1) · · · dFd(xd)\n=ǫ\nTheorem 1. Let X1, . . . ,Xd be d domain sets andH a hypothesis class of functions mapping from the product space ×di=1Xi to R. For all i ∈ [d], let Hi be the projected hypothesis class of H on Xi, that is Hi = {g | ∃f ∈ H ∃ a−i ∈ ×j 6=iXj ∀ xi ∈ Xi, g(xi) = f(xi, a−i)}.\nSuppose that, for all i ∈ [d], Hi has (ǫ, δ)-uniform convergence with sample complexity si(ǫ, δ). Then H has (ǫ, δ)-p.m. uniform convergence with sample complexity s(ǫ, δ) = maxi∈[d] si(ǫ/d, δ/d).\nIn particular, let z(1), . . . ,z(ℓ) be a sample of size ℓ = s(ǫ, δ) from a product measure ×i∈[d]Di. Define\nD̂i = Pi(z (1) i , . . . , z (ℓ) i ), for all i ∈ [d], where z (j) i is the i-th entry of sample z (j) and Pi is the processing corresponding toHi’s uniform convergence. Then\nPr z(1),...,z(ℓ) [ sup f∈H ∣∣∣Ez∼×i∈[d]D̂i [f(z)]− Ez∼×i∈[d]Di [f(z)] ∣∣∣ ≤ ǫ ] ≥ 1− δ.\nProof of Theorem 1: Since ℓ ≥ si(ǫ/d, δ/d), Pr [ supg∈Hi ∣∣∣Ez∼D̂i[g(z)] − Ez∼Di[g(z)] ∣∣∣ ≤ ǫ/d ] ≥ 1−δ/d for\nall i ∈ [d]. By the union bound, with probability at least 1 − δ, supg∈Hi ∣∣∣Ez∼D̂i[g(z)] − Ez∼Di[g(z)] ∣∣∣ ≤ ǫ/d\nfor all i ∈ [d]. According to Lemma 1, supf∈H ∣∣∣Ez∼×i∈[d]D̂i [f(z)]− Ez∼×i∈[d]Di [f(z)] ∣∣∣ ≤ ǫwith probability at least 1− δ. ✷\nTheorem 2. Let X1, . . . ,Xd be d domain sets andH a hypothesis class of functions mapping from the product space ×di=1Xi to R. For all T ⊆ [d], let HT be the projected hypothesis class of H on XT ≡ ×i∈TXi, that is, HT = { g | ∃f ∈ H ∃ a−T ∈ ×j /∈TXj ∀ xT ∈ XT , g(xT ) = f(xT , a−T ) } . Suppose that, for all T ⊆ [d], HT has (ǫ, δ)-p.m. uniform convergence with sample complexity sT (ǫ, δ), and define\ns(ǫ, δ) = min k, partitions\nT1⊔T2⊔. . .⊔Tk = [d]\nmax i=1,...,k sTi(ǫ/k, δ/k). (2)\nThen H has (ǫ, δ)-p.m. uniform convergence with sample complexity s(ǫ, δ). In particular, let z(1), . . . ,z(ℓ) be a sample of size ℓ = s(ǫ, δ) from a product measure ×i∈[d]Di. Suppose that the optimum of (2) is attained at k = k̃ for partition T̃1 ⊔ T̃2 ⊔ . . . ⊔ T̃k̃ = [d]. Define D̂T̃i =\nPT̃i(z (1) T̃i , . . . ,z (ℓ) T̃i ), for all i ∈ [d], where z (j) T̃i contains the entries of sample z(j) in coordinates T̃i and PT̃i is the processing corresponding toHT̃i’s uniform convergence. Then\nPr z(1),...,z(ℓ) [ sup f∈H ∣∣∣∣Ez∼×i∈[k̃]D̂T̃i [f(z)]− Ez∼×i∈[d]Di [f(z)] ∣∣∣∣ ≤ ǫ ] ≥ 1− δ.\nProof of Theorem 2: For every possible partition use Theorem 1. ✷\nNest, we specialize Theorem 2 to indicator functions over sets.\nCorollary 1. We use the same notation as in Theorem 2. Suppose that all functions in H map ×di=1Xi to {0, 1}, i.e. they are indicators over sets. Suppose also that the VC dimension of HT (viewed as a collection of sets) is VT . Define\nVmax = min k, partitions\nT1⊔T2⊔. . .⊔Tk = [d]\n{ k2 · max\ni=1,...,k VTi\n} . (3)\nAssume that the optimum of (3) is attained at k = k̃ for partition T̃1 ⊔ T̃2 ⊔ . . . ⊔ T̃k̃ = [d].\nThen ℓ = O ( Vmax ǫ2 · ln k̃ǫ + k̃2 ǫ2 · ln k̃δ ) samples from ×i∈[d]Di suffice to obtain (ǫ, δ)-p.m. uniform conver-\ngence for H. Formally,\nPr z(1),...,z(ℓ) [ sup f∈H ∣∣∣∣Ez∼× i∈[k̃]D̂T̃i [f(z)]− Ez∼×i∈[d]Di [f(z)] ∣∣∣∣ ≤ ǫ ] ≥ 1− δ,\nwhere for a given sample z(1), . . . ,z(ℓ) from a product distribution ×i∈[d]Di the distributions D̂T̃i are defined to be uniform over z (1)\nT̃i , . . . ,z\n(ℓ) T̃i , where z (j) T̃i contains the entries of sample z(j) in coordinates T̃i.\nTable 3 compares the sample complexity for uniform convergence implied by Theorem 2 and Corollary 1 to that implied by VC theory, when the underlying measures are product. Suppose H contains the indicator functions of all convex sets in Rd. VC theory does not provide any finite sample bound for uniform convergence, as the VC dimension of H is ∞. Do our results provide a finite bound? Notice that, for all i, Hi simply contains all intervals in R. Hence, Vi = 2 and Corollary 1 implies that ℓ = O( d2 ǫ2 · ( log dδ + log d ǫ ) ) samples suffice to obtain (ǫ, δ)-p.m. uniform convergence for H . In fact, our sample complexity bound can be improved to O ( d2\nǫ2 · log d δ\n) , as O ( log 1 δ\nǫ2\n) samples suffice to guarantee (ǫ, δ)-uniform convergence for all\nintervals in R due to the DKW inequality [25].\nIn the next a few sections, we apply our uniform convergence results to learn a mechanism with approximately optimal revenue. A type of events called single-intersecting (see Definition 4) plays a key role in our analysis. These events are defined based on the geometric shape of the corresponding sets. For example, balls, rectangles and all convex sets are single-intersecting, but this definition includes some non-convex sets as well, for example, “cross-shaped” sets. It turns out that being able to handle these non-convex sets is crucial for our results, as many events we care about are not convex but nonetheless are single-intersecting.\nDefinition 4 (Single-intersecting Events). For any event E in Rℓ, E is single-intersecting if the intersection of E and any line that is parallel to one of the axes is an interval. More formally, for any i ∈ [ℓ] and any line Li = { x ∈ Rℓ | x−i = a−i } , where a−i ∈ R\nℓ−1, the intersection of Li and E is of the form{ x ∈ Rℓ | x−i = a−i, xi ∈ [\n¯ a, ā]\n} where\n¯ a ≤ ā. In particular, we allow ¯ a to be −∞ and ā to be +∞.\nWe establish a uniform convergence bound for single-intersecting events by combing the DKW inequality and Theorem 1.\nLemma 2. For any integer ℓ, let H be the hypothesis class that contains all indicator functions for singleintersecting events in Rℓ. ThenH has (ǫ, δ)-p.m. uniform convergence with sample complexity O ( ℓ2\nǫ2 · log ℓδ\n) .\nProof. As the projected hypothesis class for the i-th coordinate simply contains all intervals in R, the sample complexity for (ǫ, δ)-uniform convergence isO( 1\nǫ2 · log 1δ ) due to the DKW inequality. The claim follows from\nTheorem 1.\nNext, we show a slightly stronger statement, which is a type of uniform convergence bound when access to approximate distributions is given. More specifically, we argue that for any single-intersecting event, the difference in the probability of this event under two product distributions D = ×i∈[ℓ]Di and D̂ = ×i∈[ℓ]D̂i is at most 2ξ · ℓ, if ||Di − D̂i||K ≤ ξ for all i. It is not hard to see that Lemma 3 and the DKW inequality imply Lemma 2.\nLemma 3. For any integer ℓ, let D = ×ℓi=1Di and D̂ = × ℓ i=1D̂i, where Di and D̂i are both supported on R\nfor any i ∈ [ℓ]. If ||Di − D̂i||K ≤ ξ, ∣∣PrD[E ]− PrD̂[E ] ∣∣ ≤ 2ξ · ℓ for any single-intersecting event E .\nProof. LetH = {1x∈E : E is single-intersecting}. By the definition of single-intersecting events, Hi is the set of the indicator functions of all intervals in R for any i ∈ [ℓ]. Since ||Di − D̂i||K ≤ ξ,\nsup g∈Hi\n∣∣∣Ex∼Di[g(x)] − Ex∼D̂i[g(x)] ∣∣∣ ≤ 2ξ.\nBy Lemma 1,\nsup f∈H\n∣∣Ex∼D [f(x)]− Ex∼D̂ [f(x)] ∣∣ ≤ 2ξ · ℓ.\nThe following table (Table 3) summarizes some uniform convergence bounds implied by our results in this\nsection."}, {"heading": "5 Constrained Additive Bidders: Uniform Convergence of the Revenue of Se-", "text": "quential Posted Price with Entry Fee Mechanisms\nWe consider a specific class of mechanisms, namely Sequential Posted Price with Entry fee Mechanisms, a.k.a. SPEMs; see Algorithm 1 for details. Cai and Zhao [13] recently showed that if the bidders’ valuations are XOS\nover independent items, the best SPEM achieves a constant fraction of the optimal revenue. 5 This section has two goals. The first is to show that, when bidders have constrained additive valuations over independent items, polynomially many samples suffice to guarantee uniform convergence for the revenue of all SPEMs, and hence our ability to select a near-optimal SPEM from polynomially many samples. This can be proven by applying our uniform convergence result for single-intersecting events (Lemma 2). The second (and stronger goal) is to show that we can learn a near-optimal SPEM under the max-min learning model (Theorem 4). We show that the revenue of any SPEM changes no more than O(ǫ · m2 · n ·H) under the true and approximate valuation distributions (Theorem 3), where ǫ is an upper bound of the Kolmogorov distance between the true and approximate distributions for every item marginal of every bidder. It is, of course, not hard to see that Theorem 3 and the DKW inequality imply uniform convergence of the revenue of all SPEMS. To establish Theorem 3, we need to apply Lemma 3 instead of Lemma 2.\nAlgorithm 1 Sequential Posted Price with Entry Fee Mechanism (SPEM)\nRequire: A collection of prices {pij}i∈[n],j∈[m] and a collection of entry fee functions {δi(·)}i∈[n] where\nδi : 2 [m] 7→ R is bidder i’s entry fee function.\n1: S ← [m] 2: for i ∈ [n] do 3: Show bidder i the set of available items S and set the entry fee for bidder i to be δi(S). 4: if Bidder i pays the entry fee δi(S) then 5: i receives her favorite bundle S∗i and pays ∑ j∈S∗i pij . 6: S ← S\\S∗i . 7: else 8: i gets nothing and pays 0. 9: end if\n10: end for\nWe first establish a technical lemma, which states that, for any set of items S, any set of prices {pj}j∈[m] and entry fee δ, the distribution over the set of items purchased by a constrained additive bidder whose valuation is drawn fromD = ×j∈[m]Dj and D̂ = ×j∈[m]D̂j has total variation distance at most 2mξ, if ||Dj−D̂j ||K ≤ ξ for every item j ∈ [m]. This is quite surprising. Given that, for each set of items S′ ⊆ S, the difference in the probability that the buyer will purchase this particular set S′ under D and D̂ could already be as large as Θ(mξ), and the distribution has an exponentially large support size, a trivial argument would give a bound of 2m · Θ(mξ). To overcome this analytical difficulty, we argue instead that for any collection of sets of items, the event that the buyer’s favorite set lies in this collection is single-intersecting. Then our result follows from Lemma 3. Notice that it is crucial that Lemma 3 holds for all events that are single-intersecting, as the event we consider here is clearly non-convex in general.\nLemma 4. For any set S ⊆ [m], any prices {pj}j∈[m] and entry fee δ(S), let L and L̂ be the distributions over the set of items purchased from S by a constrained additive bidder under prices {pj}j∈[m] and entry fee δ when her type is drawn from D = ×j∈[m]Dj and D̂ = ×j∈[m]D̂j respectively. If ||Dj − D̂j ||K ≤ ξ for all item j, ||L − L̂||TV ≤ 2mξ.\nProof. For any set R ⊆ S, let ER be the event that the bidder purchases set R. Proving that the total variation distance between L and L̂ is no more than 2m · ξ is the same as proving that for any K ≤ 2|S|,∣∣∣ PrD [ t ∈ ⋃K ℓ=1 ERℓ ] − PrD̂ [ t ∈ ⋃K ℓ=1 ERℓ\n]∣∣∣ ≤ 2m · ξ where R1, · · ·RK are arbitrary distinct subsets of 5Cai and Zhao [13] showed that the best ASPE or RSPM achieves a constant fraction of the optimal revenue. Clearly, any ASPE is also a SPEM, and any RSPM is simply a SPEM if we force the bidders to be unit-demand by only allowing each of them to purchase at most one item.\nS. Since the dimension of the bidder’s type space is m, if we can prove that ⋃K\nℓ=1 ERℓ is always singleintersecting, our claim follows from Lemma 3.\nFor any j ∈ [m] and a−j ∈ R m−1 ≥0 , let Lj(a−j) = {(tj, a−j) |tj ∈ R≥0}. We claim that Lj(a−j) intersects with at most two different EU and EV where U and V are subsets of S. WLOG, we assume that (0, a−j) ∈ EU .\n• If U = ∅, that means the utility of the favorite set for type (0, a−j) is smaller than the entry fee δ(S). If we increase the value of tj , two cases could happen: (1) the utility of the favorite set is still lower than the entry fee; (2) the utility of the favorite set is higher than the entry fee. In case (1), (tj , a−j) ∈ E∅. In case (2), the bidder pays the entry fee and purchases her favorite set V . Then item j must be in V , because otherwise the utility for set V does not change from type (0, a−j) to type (tj , a−j). If we keep increasing tj , bidder i’s favorite set remains to be V and she keeps accepting the entry fee and purchasing V . Hence, Lj(a−j) can intersect with at most one event ER where R is non-empty.\n• If U 6= ∅, that means U is the favorite set of type (0, a−j) and the utility for winning set U is higher than the entry fee. If we increase the value of tj , two cases could happen: (1) U remains the favorite set; (2) a different set V becomes the new favorite set. In case (1), (tj , a−j) ∈ EU . In case (2), item j must lie in V but not in U , otherwise how could U be better than V for type (0, a−j) but worse for type (tj , a−j). If we keep increasing tj , the bidder’s favorite set remains to be V and she keeps accepting the entry fee and purchasing V . Hence, Lj(a−j) can intersect at most two different events.\nIt is not hard to see that any event ER is an intersection of halfspaces, so the intersection of Lj(a−j) with any event ER is an interval. Also, notice that any type t ∈ R m ≥0 must lie in an event ER for some set R ⊆ S. If Lj(a−j) intersects with two different events EU and EV , the two intersected intervals must lie back to back on Lj(a−j). Otherwise, Lj(a−j) intersects with at least three different events. Contradiction. Since Lj(a−j) intersects with at most two different events, no matter which of these events are in {ERℓ}ℓ∈[K], the intersection\nof Lj(a−j) and ⋃K ℓ=1 ERℓ is either empty or an interval meaning ⋃K\nℓ=1 ERℓ is single-intersecting. Now our claim simply follows from Lemma 3.\nTheorem 3. Suppose all bidders’ valuations are constrained additive over independent items. For any SPEM, let REV and R̂EV be its expected revenue under D and D̂ respectively. If Dij and D̂ij are both supported on [0,H], and ||Dij − D̂ij ||K ≤ ξ for all i ∈ [n] and j ∈ [m],\n∣∣∣REV − R̂EV ∣∣∣ ≤ 2nmξ · (mH + OPT) .\nProof. We use a hybrid argument. Consider a sequence of distributions {D(i)}i≤n, where D (i) = D̂1 × · · · × D̂i×Di+1×· · ·×Dn, andD (0) = D,D(n) = D̂. We use REV(i) to denote the expected revenue of the SPEM\nunder D(i). To prove our claim, it suffices to argue that ∣∣∣REV(i−1) − REV(i) ∣∣∣ ≤ 2ξm · (m ·H + OPT) . We denote by Sk and S ′ k the random set of items that remain available after visiting the first k bidders underD (i−1) and D(i). Clearly, for k ≤ i − 1, ||Sk − S ′ k||TV = 0, so the expected revenue collected from the first i − 1 bidders under D(i−1) and D(i) is the same. According to Lemma 4, ||Si − S ′ i||TV ≤ 2m · ξ. The total amount of money bidder i spends can never be higher than her value for receiving all the items which is at mostm ·H . So the difference in the expected revenue collected from bidder i under D(i−1) and D(i) is at most 2ξ ·m2H . Suppose R is the set of remaining items after visiting the first i bidders, then the expected revenue collected from the last n − i bidders is the same under D(i−1) and D(i), as these bidders have the same distributions. Moreover, this expected revenue is no more than OPT, since the optimal mechanism can simply just sell R to the last n − i bidders using the same prices and entry fee as in the SPEM we consider. Of course, for any fixed R, the probabilities that Si = R and S ′ i = R are different, but since for any R the expected revenue from the last n− i bidders is at most OPT, the difference in the expected revenue from the last n− i bidders under\nD(i−1) and D(i) is at most ||Si − S ′ i||TV · OPT ≤ 2ξ ·mOPT. Hence, the total difference between REV (i−1) and REV(i) is at most 2ξm · (mH + OPT).\nTheorem 4. (Max-min Learning for Constrained Additive Bidders) When all bidders’ valuations are constrained additive over independent items and for any bidder i and any item j, Dij and D̂ij are supported on [0,H] and ||Dij − D̂ij||K ≤ ǫ for some ǫ = O( 1 nm ), then with only access to D̂ = ×i,jD̂ij , our algorithm can learn an RSPM or ASPE whose revenue is at least OPTc − ǫ ·O(m 2nH), where OPT is the optimal revenue by any BIC mechanism under D = ×i,jDij . c > 1 is an absolute constant.\nClearly, Theorem 4 also implies a polynomial sample complexity bound for learning an approximately revenue-optimal mechanism. A better sample complexity bound can be obtained directly, i.e. without invoking the uniform convergence of the revenue of SPEMs, and is stated as Theorem 9 for the broader class of XOS valuations. Similarly, when bidders have simpler valuations, i.e., additive or unit-demand valuations, we can sharpen our results and achieve polynomial-time learnability of the approximately optimal mechanism using more specialized techniques. See Sections 5.1 and 5.2 for details."}, {"heading": "5.1 Unit-demand Valuations: Polynomial-Time Learning", "text": "In this section, we consider bidders with unit-demand valuations, sharpening our results to show how to learn approximately revenue-optimal mechanisms in polynomial time. It is shown in a sequence of works [15, 32, 11] that there exists a sequential posted price mechanism (SPM see Algorithm 2 for details) that achieves at least 124 of the optimal revenue when bidders are unit-demand. We show that under all three distribution access models of Section 2 there exists a polynomial-time algorithm that learns a sequential posted price mechanism whose revenue approximates the optimal revenue. We only sketch the proof here and postpone the details to Appendix B.\nTheorem 5. When all bidders have unit-demand valuations and\n• Dij is supported on [0,H] for all bidder i and item j, there exists a polynomial time algorithm that learns\nan SPM whose revenue is at least OPT144 −ǫH with probability 1−δ given O (( 1 ǫ )2 ( m2n log nǫ + log 1 δ )) samples from D; or\n• Dij is a regular distribution for all bidder i and item j, there exists a polynomial time algorithm that learns a randomized SPMwhose revenue is at least OPT33 with probability 1−δ givenO(max{m,n}\n2m2n2· log nmδ ) samples from D; or\n• we are only given access to D̂ij where ||D̂ij−Dij ||K ≤ ǫ for all bidder i and item j, there is a polynomial time algorithm that constructs a randomized SPM whose revenue underD is at least ( 1 4 − (n+m) · ǫ ) ·(\nOPT 8 − 2ǫ ·mnH\n) 6.\nSample Access to Bounded Distributions: the result is due to Morgenstern and Roughgarden [35].\nDirect Access to Approximate Distributions: we first consider a convex program based on D (see Figure 1) which is usually referred to as the ex-ante relaxation of the revenue maximization problem [1], and use its optimum as a proxy for OPT. Next, we consider a similar convex program based on D̂ (see Figure 2) and show that the optima of the two convex programs are close to each other. Finally, we use techniques developed by Chawla et al. [15] to convert the optimal solution of the second convex program into a randomized SPM. We can show that the constructed randomized SPM achieves a revenue that approximates the optimum of the second convex program under D, which implies that the mechanism’s revenue also approximates the OPT. As\n6If we set ǫ to be O( 1 m+n ), this is the max-min guarantee we want to achieve.\nwe are given D̂, we can solve the second convex program and convert its optimal solution into a randomized SPM in polynomial time. See Theorem 10 in Appendix B.1 for further details.\nSample Access to Regular Distributions: we use a similar convex program relaxation based approach as in the previous case. The main difference is that regular distributions could be unbounded and thus ruin the approximation guarantee. We show how to use the Extreme Value theorem in [7] to truncate the distributions without hurting the revenue by much. See Theorem 12 in Appendix B.3 for further details."}, {"heading": "5.2 Additive Valuations: Polynomial-Time Learning", "text": "In this section, we consider bidders with additive valuations, again sharpening our results to show polynomialtime learnability. It is known that the better of the following two mechanisms achieves at least 18 of the optimal revenue when all bidders have additive valuations [42, 11]:\nSelling Separately: the mechanism sells each item separately using Myerson’s optimal auction.\nVCG with Entry Fee: the mechanism solicits bids b = (b1, · · · , bn) from the bidders, then offers each bidder i the option to participate for an entry fee ei(b−i,Di), which is the median of the random variable∑\nj∈[m](tij −maxk 6=i bkj) +, where ti ∼ Di 7. This random variable is exactly bidder i’s utility when her type is ti and the other bidders’ are b−i. If bidder i chooses to participate, she pays the entry fee and can take any item j at pricemaxk 6=i bkj . Notice that the mechanism never over allocate any item, as only the highest bidder for an item can afford it.\nIndeed, only counting the revenue from the entry fee in the second mechanism and the optimal revenue\nfrom selling the items separately already suffices to provide an 8-approximation [42, 11].\nTheorem 6 ([11]). Let SREV be the optimal revenue for selling the items separately and BREV be the expected entry fee collected from the VCG with entry fee mechanism. Then OPT ≤ 6 · SREV + 2 · BREV.\nGoldner and Karlin [28] showed that one sample suffices to learn a mechanism that achieves a constant fraction of the optimal revenue when Dij is regular for all i ∈ [n] and j ∈ [m]. We show how to learn an approximately optimal mechanism in the other two models.\nTheorem 7. When the bidders have additive valuations and\n• Dij is supported on [0,H] for all bidder i and item j, we can learn in polynomial time a mechanism\nwhose expected revenue is at least OPT32 −ǫ·H with probability 1−δ givenO (( m ǫ )2 · ( n log n log 1ǫ + log 1 δ )) samples from D; or\n• we are only given access to distributions D̂ij where ||D̂ij −Dij||K ≤ ǫ for all bidder i and item j, there is a polynomial time algorithm that constructs a mechanism whose expected revenue under D is at least OPT 266 − 96ǫ ·mnH when ǫ ≤ 1 16max{m,n} .\nSample Access to Bounded Distributions: Goldner and Karlin’s proof [28] can be directly applied to the bounded distributions to show a single sample suffices to learn a mechanism whose expected revenue approximates the BREV. Then as SREV is the revenue of m separate single-item auctions, we can use the result in [35] to approximate it. See Theorem 13 in Appendix C.1 for further details.\nDirect Access to Approximate Distributions: for each single item, we apply Theorem 5 to learn an individual auction, then run these learned auctions in parallel. Clearly, the combined auction’s revenue approximates\n7The entry fee function defined in [42, 11] is slightly different. They showed that there exists an entry fee Xi, such that bidder i accepts the entry fee with probability at least 1/2. Then they argued that extracting Xi/2 as the revenue in the VCG with entry fee mechanism is enough to obtain a factor 8 approximation. It is not hard to observe that our entry fee is accepted with probability exactly 1/2, thus our entry fee is at least as large as Xi. So our mechanism also suffices to provide a factor 8 approximation.\nSREV. For BREV, we show that for every bidder i and every bid profile b−i of the other bidders, the event that corresponds to bidder i accepting any entry fee is single-intersecting (see Definition 4). This implies that the probability for a bidder to accept an entry fee under D̂ and D is close (Lemma 3). So we can essentially use the median of ∑ j∈[m](tij −maxk 6=i bkj)\n+ with ti ∼ D̂i as the entry fee. See Theorem 14 in Appendix C.2 for further details."}, {"heading": "6 XOS Valuations", "text": "In this section we go beyond constained additive valuations to show learnability of approximately revenueoptimal auctions from polynomially many samples. The better of the following two mechanisms is known to achieve a constant fraction of the optimal revenue, when bidders have valuations that are XOS over independent items [13].\nRationed Sequential Posted Price Mechanism (RSPM): the mechanism is almost the same as SPM in Algorithm 2, except there is an extra constraint that every bidder can purchase at most one item.\nAnonymous Sequential Posted Price with Entry Fee Mechanism (ASPE): every buyer faces the same collection of item prices {pj}j∈[m]. The seller visits the bidders sequentially. For every bidder, the seller shows her all the available items (i.e. items that have not yet been purchased) and the associated price for each item, then asks her to pay a personalized entry fee which depends on her type distribution and the set of available items. If the bidder accepts the entry fee, she can proceed to purchase any available item at the given price; if she rejects the entry fee, she neither receives nor pays anything. See Algorithm 3 for details.\nTheorem 8. [13] There exists a collection of prices {p∗j}j∈[m], such that if we set the entry fee function δ∗i (S) to be the median of bidder i’s utility for set S, either the ASPE(p\n∗, δ∗) or the best RSPM achieves at least a constant fraction of the optimal revenue when bidders’ valuations are XOS over independent items. More formally, let u∗i (ti, S) = maxS∗⊆S vi(ti, S ∗) − ∑ j∈S∗ p ∗ j be bidder i’s utility for the set of items S when her type is ti. We define δ ∗ i (S) to be the median of the random variable u ∗ i (ti, S) (with ti ∼ Di) for any set S ⊆ [m]. Moreover, the price p∗j for any item j is no larger than 2G, where G = maxi,j Gij and\nGij := supx { Prtij∼Dij [Vi(tij) ≥ x] ≥ 1 5max{m,n} } .\nOur goal next is to bound the sample complexity for learning a near-optimal RSPM and the ASPE described\nin Theorem 8 under XOS valuations.\nWe consider first the task of learning a near-optimal RSPM. In a RSPM, all bidders are restricted to be unit-demand, so the revenue of the best RSPM is upper bounded by the optimal revenue in the corresponding unit-demand setting. In Section 5.1, we have shown how to learn an approximately optimal mechanism for unit-demand bidders, and those algorithms can be used to approximate the best RSPM.\nSo, for the rest of this section, it suffices to focus on learning an ASPE whose revenue approximates the revenue of the ASPE described in Theorem 8. We will do this in Section 6.1. Before that, we need a robust version of Theorem 8. In the next Lemma, we argue that if we use a collection of prices {p′j}j∈[m] sufficiently close to {p∗j}j∈[m] and entry fee δ ′ i(S) sufficiently close to the median of the utility for every bidder i and subset S, the better of the corresponding ASPE and the best RSPM still approximates the optimal revenue. We postpone the proof to Appendix D.\nLemma 5. For any ǫ > 0 and µ ∈ [0, 14 ], let {p ′ j}j∈[m] be a collection of prices such that |p ′ j − p ∗ j | ≤ ǫ for all j ∈ [m], where {p∗j}j∈[m] is the collection of prices in Theorem 8. Let δ ′ i(S) be bidder i’s entry fee function such that Prti∼Di [u ′ i(ti, S) ≥ δ ′ i(S)] ∈ [1/2 − µ, 1/2 + µ] for any set S ⊆ [m], where u ′ i(ti, S) = maxS∗⊆S vi(ti, S ∗) − ∑ j∈S∗ p ′ j . Then, either the ASPE(p\n′, δ′) or the best RSPM achieves revenue at least OPT C1(µ)\n− C2(µ) · (m + n) · ǫ when bidders’ valuations are XOS over independent items. Both C1(·) and C2(·) are monotonically increasing functions that only depend on µ.\nDefinition 5. We say a collection of prices {pj}j∈[m] is in the B-bounded ǫ-net if pj is a multiple of ǫ and no larger than B for any item j. For any collection of prices {pj}j∈[m], we say the entry fee functions are µbalanced if for every bidder i and every set S ⊆ [m], her entry fee δi(S) satisfies Prti∼Di [ui(ti, S) ≥ δi(S)] ∈ [1/2 − µ, 1/2 + µ], where ui(ti, S) = maxS∗⊆S vi(ti, S ∗)− ∑ j∈S∗ pj .\nCorollary 2. For bidders with valuations that are XOS over independent items and any ǫ > 0, there exists a collection of prices {pj}j∈[m] in the 2G-bounded ǫ-net such that for any µ-balanced entry fee functions {δi(·)}i∈[n] with µ ∈ [0, 1 4 ], either the ASPE(p, δ) or the best RSPM achieves revenue at least OPT C1(µ) − C2(µ) · (m+ n) · ǫ."}, {"heading": "6.1 XOS Valuations: sample access to bounded and regular distributions", "text": "In this section, we consider how to learn an ASPE with high revenue given sample access to D. Our learning algorithm is a two-step procedure. In the first step, we take a few samples from D and use these samples to set the entry fee for every collection of prices {pj}j∈[m] in the ǫ-net. More specifically, to decide δi(S) we compute the utility of bidder i for set S under {pj}j∈[m] over all the samples and take the empirical median among all these utilities to be δi(S). With a polynomial number of samples, we can guarantee that for any {pj}j∈[m] in the ǫ-net the computed entry fee functions {δi(·)}i∈[n] are µ-balanced. Now, we have created an ASPE for every {pj}j∈[m] in the ǫ-net. In the second step, we take some fresh samples from D and use them to estimate the revenue for each of the ASPEs we created in the first step, then pick the one that has the highest empirical revenue. It is not hard to argue that with a polynomial number of samples the mechanism we pick has high revenue with probability almost 1. Combining our algorithm with Theorem 5, we obtain the following theorem.\nTheorem 9. When all bidders’ valuations are XOS over independent items and\n• the random variable Vi(tij) is supported on [0,H] for each bidder i and item j, we can learn an RSPM and an ASPE such that with probability at least 1 − δ the better of the two mechanisms has revenue at\nleast OPTc1 − ξ ·H for some absolute constant c1 > 1 given O ( (mnξ ) 2 · (m · log m+nξ + log 1 δ ) ) samples from D;\n• the random variable Vi(tij) is regular for each bidder i and item j, we can learn an RSPM and an ASPE such that with probability at least 1 − δ the better of the two mechanisms has revenue at least OPTc2 for\nsome absolute constant c2 > 1 given O ( max{m,n}2m2n2 ( m log(m+ n) + log 1δ )) samples fromD.\nThe bounded case is proved as Theorem 15 in Appendix D.1. The regular case is proved as Theorem 16 in\nAppendix D.1."}, {"heading": "7 Symmetric Bidders", "text": "In this section, we consider symmetric bidders (Di = Di′ for all i and i ′ ∈ [n]) with XOS and subadditive valuations. For XOS valuations, our goal is to improve our algorithms from Section 6 to be computationally efficient under bidder symmetry. For subadditive valuations, our goal is to establish the learnability of approximately optimal mechanisms whose revenue improves as the number of bidders becomes comparable to the number of items. We only describe the results here and postpone the formal statements and proofs to Appendix E.\n• XOS valuations: we can learn in polynomial time an approximately optimal mechanism with a polynomial number of samples when the valuations are XOS over independent items. Our algorithm essentially\nestimates all the parameters needed to run the RSPM and ASPE used in [13]. In general, it is not clear how to estimate these parameters efficiently. But when the bidders are symmetric, one only needs to consider “symmetric parameters” which greatly simplifies the search space and allows us to estimate all the parameters in polynomial time. See Appendix E.2 for details.\n• subadditive valuations: when the valuations are subadditive over independent items, the optimal revenue is at most O (\nn max{m,n}\n) times larger than the highest revenue obtainable by an RSPM. In other\nwords, if the number of items is within a constant times the number of bidders, an RSPM suffices to extract a constant fraction of the optimal revenue. Applying our results for unit-demand bidders in Section 5.1, we can learn a nearly-optimal RSPM, which is also a good approximation to OPT. In fact, when the distribution for random variable Vi(tij) is regular for every bidder i and item j, we can design a priorindependent mechanism that achieves a constant fraction of the optimal revenue. See Appendix E.3 for details."}, {"heading": "Appendix", "text": ""}, {"heading": "A Our Mechanisms", "text": "Here are the detailed description of the two major mechanisms we use: Sequential Posted Price Mechanism (SPM) and Anonymous Sequential Posted Price with Entry Fee Mechanism (ASPE). We also use the Rationed Sequential Posted Price Mechanism (RSPM) when bidders are not unit-demand. RSPM is almost identical to SPM except that there is an extra constraint saying that no bidder can purchase more than one item.\nAlgorithm 2 Sequential Posted Price Mechanism (SPM) Require: Pij is the price for bidder i to purchase item j. 1: S ← [m] 2: for i ∈ [n] do 3: Show bidder i the set of available items S. 4: i purchases her favorite bundle S∗i ∈ maxS′⊆S vi(ti, S ′)− ∑ j∈S′ Pij and pays ∑\nj∈S∗i Pij .\n5: S ← S\\S∗i . 6: end for\nAlgorithm 3 Anonymous Sequential Posted Price with Entry Fee Mechanism (ASPE)\nRequire: A collection of prices {pj}j∈[m] and a collection of entry fee functions {δi(·)}i∈[n] where δi :\n2[m] 7→ R is bidder i’s entry fee function. 1: S ← [m] 2: for i ∈ [n] do 3: Show bidder i the set of available items S and set the entry fee for bidder i to be δi(S). 4: if Bidder i pays the entry fee δi(S) then 5: i receives her favorite bundle S∗i and pays ∑ j∈S∗i pj . 6: S ← S\\S∗i . 7: else 8: i gets nothing and pays 0. 9: end if\n10: end for"}, {"heading": "B Missing Details from Section 5.1", "text": "B.1 Unit-demand Valuations: direct access to approximate distributions\nWe first consider the model where we only have access to an approximate distribution D̂. The following definition is crucial for proving our result.\nDefinition 6. For any single dimensional distribution D with cdf F , we define its revenue curve RD : [0, 1] 7→ R≥0 as\nRD(q) =maxx · ¯ q · F−1(1− ¯ q) + (1− x) · q̄ · F−1(1− q̄)\ns.t. x · ¯ q + (1− x) · q̄ = q\nx, ¯ q, q̄ ∈ [0, 1]\nwhere F−1(1− p) = sup{x ∈ R : Prv∼D[v ≥ x] ≥ p}.\nLemma 6 (Folklore). Let ϕij(·) and ϕ̂ij(·) be the ironed virtual value function for distribution Dij and D̂ij respectively, then for any q ∈ [0, 1], RDij (q) = ∫H F−1ij (1−q) ϕ(x)dF (x) and RD̂ij(q) = ∫H F̂−1ij (1−q) ϕ̂(x)dF (x). Since the ironed virtual value function is monotonically non-decreasing, RDij(·) and RD̂ij(·) are concave functions.\nWe provide an upper bound of the optimal revenue using RDij in the next Lemma. To do that, we first need the definition of the Single-Dimensional Copies Setting.\nSingle-Dimensional Copies Setting: In the analysis for unit-demand bidders in [15, 11], the optimal revenue is upper bounded by the optimal revenue in the single-dimensional copies setting defined in [15]. We use the same technique. We construct nm agents, where agent (i, j) has value Vi(tij) of being served with tij ∼ Dij , and we are only allow to use matchings, that is, for each i at most one agent (i, k) is served and for each j at most one agent (k, j) is served8. Notice that this is a single-dimensional setting, as each agent’s type is specified by a single number. Let OPTCOPIES-UD be the optimal BIC revenue in this copies setting.\nLemma 7. For unit-demand bidders, there exists a collection of non-negative numbers {qij}i∈[n],j∈[m] satisfying ∑ i qij ≤ 1 for all j ∈ [m] and ∑ j qij ≤ 1 for all i ∈ [n], such that the optimal revenue\nOPT ≤ 4 · ∑\ni,j\nRDij (qij).\nProof. As shown in [11], OPT ≤ 4OPTCOPIES-UD. Let qij be the ex-ante probability that agent (i, j) is served in the optimal mechanism for the copies setting. Chawla et al. [15] showed that OPTCOPIES-UD ≤∑\ni,j RDij (qij). Our statement follows from the two inequalities above.\nNext, we consider a convex program (Figure 1) and argue that the value of the optimal solution of this\nprogram is at least 18 of the optimal revenue.\nLemma 8. The optimal solution of convex program in Figure 1 is at least OPT8 .\n8This is exactly the copies setting used in [15], if every bidder i is unit-demand and has value Vi(tij) with type ti. Notice that this unit-demand multi-dimensional setting is equivalent as adding an extra constraint, each buyer can purchase at most one item, to the original setting with subadditive bidders.\nProof. Let {q′ij} be the collection of nonnegative numbers in Lemma 7. Clearly, { q′ij 2 } is a set of feasible\nsolution for the convex program. Since RDij (·) is concave, RDij ( q′ij 2 ) ≥ RDij (q ′ ij) 2 + RDij (0) 2 = RDij (q ′ ij) 2 . Therefore, ∑\ni,j\nRDij ( q′ij 2 ) ≥ 1 2 · ∑\ni,j\nRDij(q ′ ij) ≥\nOPT\n8 .\nIf we know all Fij exactly, we can solve the convex program (Figure 1) and use the optimal solution to construct an SPM via an approach provided in [15, 11]. The constructed sequential posted mechanism has revenue at least 14 of the optimal value of the convex program, which is at least OPT 32 . Next, we show that with only access to F̂ij , we can essentially carry out the same approach. Consider a different convex program (Figure 2).\nNot that if the support size for all D̂ij is upper bounded by some finite number s, the convex program above can be rewritten as a linear program with size poly(n,m, s). In the following Lemma, we prove that the optimal values of the two convex programs above are close.\nLemma 9. Let {q∗ij}i∈[n],j∈[m] and {q̂ij}i∈[n],j∈[m] be the optimal solution of the convex program in Figure 1 and 2 respectively. ∑\ni,j\nRD̂ij (q̂ij) ≥ ∑\ni,j\nRDij (q ∗ ij)− ǫ ·mnH.\nProof. We first fix some notations. For any bidder i and item j, let ¯ q∗ij, q̄ ∗ ij and xij ∈ [0, 1] be the numbers satisfy that xij · ¯ q∗ij ·Fij −1(1− ¯ q∗ij)+(1−xij)· q̄ ∗ ij ·Fij −1(1− q̄∗ij) = RDij (q ∗ ij) and xij · ¯ q∗ij+(1−xij)· q̄ ∗ ij = q ∗ ij .\nLet ¯ pij = Fij −1(1− ¯ q∗ij), p̄ij = Fij −1(1− q̄∗ij), and q ′ ij = xij ·\n( 1− F̂ij(\n¯ pij)\n) + (1− xij) · ( 1− F̂ij(p̄ij) ) .\nBy the definition of RD̂ij (·),\nRD̂ij (q ′ ij) ≥ xij ·\n( 1− F̂ij(\n¯ pij) ) · ¯ pij + (1− xij) · ( 1− F̂ij(p̄ij) ) · p̄ij (4)\nSince ||D̂ij −Dij ||K ≤ ǫ, F̂ij( ¯ pij) ∈ [1− ¯ q∗ij − ǫ, 1− ¯ q∗ij + ǫ] and F̂ij(p̄ij) ∈ [1− q̄ ∗ ij − ǫ, 1− q̄ ∗ ij + ǫ]. Hence,\nthe RHS of inequality (4) is greater than RDij(q ∗ ij)− ǫ ·H . Therefore, RD̂ij(q ′ ij) ≥ RDij (q ∗ ij)− ǫ ·H .\nNext, we argue that {q′ij}i∈[n],j∈[m] is a feasible solution for the convex program in Figure 2. Since 1 −\nF̂ij( ¯ pij) ≤ ¯ q∗ij + ǫ and 1− F̂ij(p̄ij) ≤ q̄ ∗ ij + ǫ, q ′ ij ≤ q ∗ ij + ǫ. Thus,\n∑ i q ′ ij ≤ ∑ i q ∗ ij + n · ǫ ≤ 1 2 + n · ǫ for all\nj ∈ [m]. Similarly, we can prove ∑\nj q ′ ij ≤ 1 2 +m · ǫ for all i ∈ [n]. As {q̂ij}i∈[n],j∈[m] is the optimal solution\nfor the second convex program, ∑ i,j RD̂ij (q̂ij) ≥ ∑ i,j RD̂ij (q ′ ij) ≥ ∑ i,j RDij(q ∗ ij)− ǫ ·mnH .\nFinally, we show how to use the optimal solution of the convex program in Figure 2 to construct an SPM that approximates the optimal revenue well. We first provide a general transformation that turns any approximately feasible solution of convex program in Figure 1 to an SPM mechanism.\nLemma 10. For any distribution D = ×i∈[n],j∈[m]Dij , given a collection of independent random variables {pij}i∈[n],j∈[m] such that\n∑\ni∈[n]\nPr pij ,tij∼Dij [tij ≥ pij] ≤ 1− η1, for all j ∈ [m]\nand ∑\nj∈[m]\nPr pij ,tij∼Dij [tij ≥ pij] ≤ 1− η2, for all i ∈ [n],\nwe can construct in polynomial time a randomized SPM such that the revenue under D is at least\nη1η2 · ∑\ni,j\nEpij [ pij · Pr\ntij∼Dij [tij ≥ pij ]\n] .\nProof. Consider a randomized SPM that sells item j to bidder i at price pij . Notice that bidder i purchases exactly item j if all of the following three conditions hold: (i) for all bidders ℓ 6= i, tℓj is smaller than the corresponding price pℓj , (ii) for all items k 6= j, tik is smaller than the corresponding price pik, and (iii) tij is greater than the corresponding price pij . These three conditions are independent from each other. The first condition holds with probability at least 1 − ∑ ℓ 6=i Prpℓj ,tℓj∼Dℓj [tℓj ≥ pℓj] ≥ η1. The second condition holds\nwith probability at least 1− ∑\nk 6=j Prpik,tik∼Dik [tik ≥ pik] ≥ η2. When the first two conditions hold, bidder i\npurchases item j whenever she can afford it. Her expected payment is Epij [ pij · Prtij∼Dij [tij ≥ pij] ] . Hence,\nthe expected revenue for selling item j to bidder i is at least η1η2 ·Epij [ pij · Prtij∼Dij [tij ≥ pij] ] and the total\nexpected revenue is at least η1η2 · ∑\ni,j Epij [ pij · Prtij∼Dij [tij ≥ pij ] ] .\nLemma 11. Given any feasible solution {qij}i∈[n],j∈[m] of the convex program in Figure 2, we can con-\nstruct a (randomized) SPM in polynomial time such that its revenue under D is at least ( 1 4 − (n+m) · ǫ ) ·(∑\ni,j RD̂ij(qij)− ǫ · nmH ) .\nProof. We first fix some notations. For any bidder i and item j, let ¯ qij, q̄ij and xij ∈ [0, 1] be the numbers satisfying xij · ¯ qij · F̂ −1 ij (1− ¯ qij)+(1−xij) · q̄ij · F̂ −1 ij (1− q̄ij) = RD̂ij (qij) and xij ·¯ qij +(1−xij) · q̄ij = qij .\nWe use pij to denote a random variable that is ¯ pij = F̂\n−1 ij (1−\n¯ qij) with probability xij and p̄ij = F̂\n−1 ij (1− q̄ij)\nwith probability 1− xij . Next, we construct a randomized SPM based on {pij}i∈[n],j∈[m] according to Lemma 10. Note that\n∑\ni∈[n]\nPr pij ,tij∼Dij\n[tij ≥ pij] ≤ ∑\ni∈[n]\n( Pr\npij ,tij∼D̂ij\n[tij ≥ pij ] + ǫ\n) = ∑\ni∈[n]\nqij + nǫ ≤ 1\n2 + 2nǫ\nfor all item j, and\n∑\nj∈[m]\nPr pij ,tij∼Dij\n[tij ≥ pij] ≤ ∑\nj∈[m]\n( Pr\npij ,tij∼D̂ij\n[tij ≥ pij ] + ǫ\n) = ∑\ni∈[m]\nqij +mǫ ≤ 1\n2 + 2mǫ\nfor all bidder i. Hence, we can construct in polynomial time a randomized SPM with revenue at least\n( 1\n2 − 2nǫ\n)( 1\n2 − 2mǫ\n) · ∑\ni,j\nEpij [ pij · Pr\ntij∼Dij [tij ≥ pij]\n]\n≥\n( 1\n4 − (n+m)ǫ\n)∑\ni,j\nEpij [ pij · ( Pr\ntij∼D̂ij\n[tij ≥ pij]− ǫ\n)]\n≥\n( 1\n4 − (n+m)ǫ\n)∑\ni,j\n( RD̂ij(qij)− ǫ · nmH )\nThe first inequality is because ∣∣∣ ∣∣∣Dij − D̂ij ∣∣∣ ∣∣∣ K ≤ ǫ, and the second inequality is because pij is upper bounded by H and Epij [ pij · Prtij∼D̂ij [tij ≥ pij] ] = RD̂ij (qij) by the definition of pij .\nTheorem 10. For unit-demand bidders, given distributions D̂ij where ∣∣∣ ∣∣∣D̂ij −Dij ∣∣∣ ∣∣∣ K ≤ ǫ for all i ∈ [n] and j ∈ [m], there is a polynomial time algorithm that constructs a randomized SPM whose revenue under D is at least ( 1 4 − (n +m) · ǫ ) · ( OPT 8 − 2ǫ ·mnH ) .\nProof. Our algorithm first computes the optimal solution {q̂ij}i∈[n],j∈[m] for the convex program in Figure 2, then constructs a randomized SPM based on {q̂ij}i∈[n],j∈[m] using Lemma 11. It is not hard to see that our algorithm runs in polynomial time. By chaining the inequalities in Lemma 8, 9 and 11, we can argue that the revenue of our mechanism is at least ( 1 4 − (n+m) · ǫ ) · ( OPT 8 − 2ǫ ·mnH ) .\nB.2 Unit-demand Valuations: sample access to bounded distributions\nWhen the distributions Dij are all bounded, the following theorem provides the sample complexity.\nTheorem 11. [35] WhenDij is supported on [0,H] for all bidder i and item j, the sample complexity for (ǫ, δ)-\nuniformly learning the revenue of SPMs for unit-demand bidders isO ((\n1 ǫ )2 ( m2n log n log 1ǫ + log 1 δ )) . That\nis, with probability 1 − δ, the empirical revenue based on the samples for any SPM is within ǫ ·H of its true expected revenue. Moreover, with the same number of samples, there is a polynomial time algorithm that learns an SPM whose revenue is at least OPT144 − ǫH with probability 1− δ.\nB.3 Unit-demand Valuations: sample access to regular distributions\nIn this section, we show there exists a polynomial time algorithm that learns an SPMwhose revenue is at least a constant fraction of the optimal revenue with polynomial in n andm samples. Note that unlike in the previous two models, the error of our learning algorithm is only multiplicative when the distributions are regular. First, we present a Lemma regarding the revenue curve function for regular distributions.\nLemma 12. [7] For any regular distribution F , let RF (·) be the corresponding revenue curve. For any 0 < q′ ≤ q ≤ p < 1,\n(1− p) ·RF (q ′) ≤ RF (q).\nThroughout this section, we use Z to denote max{m,n} and C to be a constant that will be specified later. Using Lemma 12, we show in the next Lemma that restricting qij to be at least 1 CZ does not affect the objective value of the convex program in Figure 1 by too much.\nLemma 13. Suppose {q∗ij}i∈[n],j∈[m] is the optimal solution of the convex program in Figure 1. Let q ′ ij = max{ 1CZ , q ∗ ij}, then ∑ i,j RDij (q ′ ij) ≥ ( 1− 1CZ ) · ∑ i,j RDij (q ∗ ij) ≥ ( 1− 1CZ ) · OPT8 . Proof. According to Lemma 8, ∑\ni,j RDij (q ∗ ij) ≥ OPT 8 . So to prove the statement, it suffices to argue that\nfor any i and j, RDij (q ′ ij) ≥ ( 1− 1CZ ) · RDij (q ∗ ij). If q ∗ ij = q ′ ij , this inequality clearly holds. If q ∗ ij 6= q ′ ij , q∗ij ≤ q ′ ij = 1 CZ . Since Fij is regular, we can apply Lemma 12 to q ′ ij and q ∗ ij and obtain inequality RDij (q ′ ij) ≥(\n1− 1CZ ) ·RDij (q ∗ ij).\nUsing Lemma 13, we argue how to compute in polynomial time an approximately optimal SPM. Suppose D′ij is the distribution that we obtain after truncating Dij at a threshold Hij 9, and we have direct access to a\ndiscrete distribution D̂′ij such that ∣∣∣ ∣∣∣D̂′ij −D′ij ∣∣∣ ∣∣∣ K ≤ ǫ for all i and j. We show in the following Lemma that the optimal solution of a convex program similar to the one in Figure 2 but for {D̂′ij}i∈[n],j∈[m] can guide us to design an approximately optimal SPM under D in polynomial time. As we have sample access to D, we will argue later that a polynomial number of samples suffices to generate {D̂′ij}i∈[n],j∈[m].\nLemma 14. Let {Hij}i∈[n],j∈[m] be a collection of positive numbers satisfying Fij(Hij) ∈ [1− 1 C·Z , 1− 1\n3C·Z ] for all i ∈ [n] and j ∈ [m]. LetD′ij be the distribution of the random variable min{tij,Hij} where tij ∼ Dij ,\nand D̂′ij be a discrete distribution such that ∣∣∣ ∣∣∣D̂′ij −D′ij ∣∣∣ ∣∣∣ K ≤ ǫ for all i ∈ [n] and j ∈ [m]. Suppose s is an upper bound of the support size for any distribution D̂′ij , then given direct access to D̂ ′ ij , we can\ncompute in time polynomial in n,m and s a randomized SPM that achieves revenue at least ( 1 2 − 1 C − 2nǫ ) ·(\n1 2 − 1 C − 2mǫ ) · (( 1− 1CZ ) · OPT8 − 2ǫ · nmH ) under D, where H = maxi,j Hij .\nProof. Consider the following convex program:\nmax ∑\ni,j\nRD̂′ij (qij)\ns.t. ∑\ni\nqij ≤ 1\n2 +\n1 C + n · ǫ for all j ∈ [m]\n∑\nj\nqij ≤ 1\n2 +\n1 C +m · ǫ for all i ∈ [n]\nqij ≥ 0 for all i ∈ [n] and j ∈ [m]\n9Let tij ∼ Dij , thenmin{tij ,Hij} is the corresponding truncated random variable drawn from D ′ ij .\nLet {q∗ij}i∈[n],j∈[m] be the optimal solution of the convex program in Figure 1 and q ′ ij = max{ 1 C·Z , q ∗ ij}.\nFor every i and j, let p′ij = F −1 ij (1− q ′ ij) and q̃ij = Prtij∼D̂′ij\n[ tij ≥ p ′ ij ] . By the definition ofHij , p ′ ij ≤ Hij ,\nso\np′ij q̃ij ≥ p ′ ij\n( Pr\ntij∼D′ij\n[ tij ≥ p ′ ij ] − ǫ ) ≥ p′ijq ′ ij − ǫ ·Hij = RDij (q ′ ij)− ǫ ·Hij. (5)\np′ijq ′ ij equals to RDij(q ′ ij) because Dij is a regular distribution.\nNext, we argue that {q̃ij}i∈[n],j∈[m] is a feasible solution of the convex program above. Observe that\n∑\ni\nq̃ij ≤ ∑\ni\nq′ij + nǫ ≤ ∑\ni\n( q∗ij + 1\nCZ\n) + nǫ ≤ 1\n2 +\n1 C + nǫ\nfor all item j ∈ [m] and\n∑\nj\nq̃ij ≤ ∑\nj\nq′ij + nǫ ≤ ∑\nj\n( q∗ij + 1\nCZ\n) +mǫ ≤ 1\n2 +\n1 C +mǫ\nfor all bidder i ∈ [n].\nLet ÔPT be the optimal solution of the convex program above. As {q̃ij}i∈[n],j∈[m] is a feasible solution,\nÔPT ≥ ∑\ni,j\nRD̂′ij (q̃ij) ≥\n∑\ni,j\np′ij q̃ij ≥ ∑\ni,j\nRDij(q ′ ij)− ǫ · nmH ≥\n( 1− 1\nCZ\n) · OPT\n8 − ǫ · nmH.\nThe second last inequality is due to inequality (5) and the last inequality is due to Lemma 13.\nSo far, we have argued that the optimal solution of our convex program has value close to the OPT. We will show in the second part of the proof that using the optimal solution of our convex program, we can construct an SPM whose revenue under D is close to ÔPT. Let q̂ij be the optimal solution of the convex program above and p̂ij be the corresponding random price, that is, Prp̂ij ,tij∼D̂′ij [tij ≥ p̂ij] = q̂ij and RD̂′ij (q̂ij) =\nEp̂ij [ p̂ij · Prtij∼D̂′ij [tij ≥ p̂ij ] ] . As p̂ij ≤ Hij ,\nPr p̂ij ,tij∼Dij [tij ≥ p̂ij] = Pr p̂ij ,tij∼D′ij [tij ≥ p̂ij ] ∈ [q̂ij − ǫ, q̂ij + ǫ].\nTherefore, for all item j\n∑\ni\nPr p̂ij ,tij∼Dij\n[tij ≥ p̂ij ] ≤ ∑\ni\nPr p̂ij ,tij∼D̂′ij\n[tij ≥ p̂ij] + nǫ = ∑\ni\nq̂ij + nǫ ≤ 1\n2 +\n1 C + 2nǫ\nand for all bidder i\n∑\nj\nPr p̂ij ,tij∼Dij\n[tij ≥ p̂ij] ≤ ∑\nj\nPr p̂ij ,tij∼D̂′ij\n[tij ≥ p̂ij] +mǫ = ∑\nj\nq̂ij +mǫ ≤ 1\n2 +\n1 C + 2mǫ.\nAccording to Lemma 10, we can construct a randomized SPM with {p̂ij}i∈[n],j∈[m] whose revenue is at least( 1 2 − 1 C − 2nǫ ) · ( 1 2 − 1 C − 2mǫ ) · ∑ i,j Ep̂ij [ p̂ij · Prtij∼Dij [tij ≥ p̂ij ] ] under D. Clearly,\nEp̂ij [ p̂ij · Pr\ntij∼Dij [tij ≥ p̂ij]\n] ≥ Ep̂ij [ p̂ij · ( Pr\ntij∼D̂′ij\n[tij ≥ p̂ij ]− ǫ )] ≥ RD̂′ij (q̂ij)− ǫ ·Hij .\nTherefore, the revenue of the constructed randomized SPM under D is at least\n( 1\n2 −\n1 C − 2nǫ\n) · ( 1\n2 −\n1 C − 2mǫ\n) · ( ÔPT− ǫ · nmH )\n≥\n( 1\n2 −\n1 C − 2nǫ\n) · ( 1\n2 −\n1 C − 2mǫ\n) · (( 1− 1\nCZ\n) · OPT\n8 − 2ǫ · nmH\n) .\nIt is not hard to see that both {q̂ij}i∈[n],j∈[m] and {p̂ij}i∈[n],j∈[m] can be computed in time polynomial in n,m and s.\nWhen ǫ is small enough, the additive error in Lemma 14 can be converted into a multiplicative error. Next, we argue that with a polynomial number of samples, we can learn {Hij}i∈[n],j∈[m] and {D̂ ′ ij}i∈[n],j∈[m] with enough accuracy.\nTheorem 12. If for all bidder i and item j, Dij is a regular distribution, we can learn in polynomial time with probability 1 − δ a randomized SPM whose revenue is at least OPT33 with O ( Z2m2n2 · log nmδ ) (Z = max{m,n}) samples. Proof. First, if we take O ( C2 · Z2 · log nmδ ) samples from each Dij , we can find an Hij such that Fij(Hij) lies in[1 − 1CZ , 1 − 1 3CZ ] with probability 1 − δ 2nm . By the union bound, the probability that all Hij satisfy the requirement is at least 1 − δ2 . From now on, we assume Fij(Hij) ∈ [1 − 1 C·Z , 1 − 1\n3C·Z ] for all i and j. Observe that OPT ≥ maxi,j Hij · 1 3C·Z , as the expected revenue for selling item j to bidder i at price Hij is at least Hij 3C·Z . Therefore, there exists sufficiently large constant d and C , if ǫ = 1 d·Znm the randomized SPM learned in Lemma 14 has revenue at least OPT33 . According to the Dvoretzky-Kiefer-Wolfowitz (DKW)\ninequality [25], if we take O ( d2Z2n2m2 · log nmδ ) samples fromD′ij (we can take samples fromDij then cap the samples at Hij) and let D̂ ′ ij be the uniform distribution over the samples, ∣∣∣ ∣∣∣D′ij − D̂′ij ∣∣∣ ∣∣∣ K ≤ 1d·Znm with\nprobability 1− δ2nm . By the union bound, ∣∣∣ ∣∣∣D′ij − D̂′ij ∣∣∣ ∣∣∣ K ≤ 1d·Znm for all i ∈ [n] and j ∈ [m]with probability at least 1 − δ/2. Finally, by another union bound, the Hij and D̂ ′ ij we learned from O ( Z2n2m2 · log nmδ ) samples satisfy Fij(Hij) ∈ [1− 1 C·Z , 1− 1 3C·Z ] and ∣∣∣ ∣∣∣D′ij − D̂′ij ∣∣∣ ∣∣∣ K ≤ 1d·Znm for all i and j with probability at least 1− δ. In other words, we can learn a randomized SPM whose revenue is at least OPT33 with probability\nat least 1 − δ using O ( Z2n2m2 · log nmδ ) samples. Furthermore, the support size of any D̂′ij is at most\nO ( Z2n2m2 · log nmδ ) samples, so our learning algorithm runs in time polynomial in n and m."}, {"heading": "C Missing Details from Section 5.2", "text": "C.1 Additive Valuations: sample access to bounded distributions\nAs shown by Goldner and Karlin [28], one sample suffices to design a mechanism that approximates BREV. The idea is to use the VCG with entry fee mechanism but replace the entry fee ei(b−i,Di) for bidder i with ei(b−i, si) = ∑ j∈[m](sij −maxk 6=i bkj)\n+, where si is a sample drawn fromDi. It is easy to argue that for any b−i, over the randomness of the sample si and bidder i’s real type ti, the event that ei(b−i, si) ≥ ei(b−i,Di) and bidder i accepts the entry fee ei(b−i, si) happens with probability at least 1 8 . As 1 2 · ∑\ni∈[n] Et[ei(t−i,Di)] = BREV, the expected revenue (over the randomness of the types and the samples) from their mechanism is at least 18 · ∑ i∈[n] Et[ei(t−i,Di)] = BREV 4 . Next, we show how to learn a mechanism that approximates SREV.\nLemma 15. When Dij is supported on [0,H] for all bidder i and item j, the sample complexity for (ǫ, δ)-\nuniformly learning the revenue of SPMs for additive bidders is O ((\n1 ǫ )2 ( m2n log n log 1ǫ + log 1 δ )) . More-\nover, we can learn in polynomial time an SPM whose revenue is at least SREV4 − 3ǫ 2 ·H with probability 1− δ given the same number of samples.\nProof. The first half of the Lemma was proved by Morgenstern and Roughgarden [35]. We show how to prove the second half of the claim. Let OPTj be the optimal revenue for selling item j. By the prophet inequality [41], there exists an SPM for selling item j with a collection of prices {pij}i∈[n] that achieves revenue at least OPTj/2. As the bidders are additive, if we run the SPMs for selling each item simultaneously, the expected revenue is exactly the sum of the revenue of the SPM mechanisms for auctioning a single item. Note that the simultaneous SPM is indeed a SPM for selling all items. Hence, there exists an SPM that achieves revenue at least OPT/2. Since the sample complexity for (ǫ, δ)-uniformly learning the revenue of\nSPMs is O ((\nm ǫ )2 ( n log n log 1ǫ + log 1 δ )) , the empirical revenue induced by the samples is within ǫ · H of\nthe true expected revenue with probability 1− δ for any SPM. We use ERopt to denote the optimal empirical revenue obtained by any SPM. If we apply the prophet inequality to the empirical distribution, we can construct an SPM whose empirical revenue ER is at least ERopt/2. Notice that ERopt is at most ǫ · H less than the optimal true expected revenue obtained by any SPM, which is at least OPT/2. Combining the two inequalities above, we have ER ≥ OPT/4− ǫ/2 ·H with probability 1 − δ. Also, the true expected revenue of our SPM is at least ER − ǫ · H , so our SPM achieves expected revenue at least OPT4 − 3ǫ 2 ·H with probability 1− δ.\nNow we are ready to prove our Theorem for additive bidders when their valuations are bounded.\nTheorem 13. When the bidders have additive valuations and Dij is supported on [0,H] for all bidder i and item j, we can learn in polynomial time a mechanism whose expected revenue is at least OPT32 − ǫ · H with probability 1− δ given\nO ((m ǫ )2 · ( n log n log 1 ǫ + log 1 δ ))\nsamples from D.\nProof. According to Lemma 15, we can learn a mechanism whose revenue is at least SREV4 − ǫ 24 · H with\nprobability 1− δ given O ((\nm ǫ )2 · ( n log n log 1ǫ + log 1 δ )) samples. As we explained in the beginning of this\nsection, with one sample from the distribution we can construct a randomized mechanism whose expected revenue is at least BREV4 . Therefore, the better of our two mechanisms has expected revenue at least OPT 32 − ǫ ·H with probability 1− δ.\nC.2 Additive Valuations: direct access to approximate distributions\nIn this section, we discuss how to learn an approximately optimal mechanism for additive bidders when we are given direct access to approximate value distributions. Again, we first show how to learn a mechanism whose revenue approximates SREV then we provide another mechanism whose revenue approximates BREV. Lemma 16. For additive bidders, given distributions D̂ij where ∣∣∣ ∣∣∣D̂ij −Dij\n∣∣∣ ∣∣∣ K ≤ ǫ for all i ∈ [n] and\nj ∈ [m], there is a polynomial time algorithm that constructs a randomized SPM whose revenue under D is at least ( 1 4 − ǫ · n ) · ( SREV 8 − 2ǫ ·mnH ) .\nProof. Let OPTj be the optimal revenue for selling item j. As the bidders are additive, if we can construct a randomized SPM Mj for every item j such that its expected revenue under D is at least ( 1 4 − ǫ · n ) ·\n( OPTj 8 − 2ǫ · nH ) , running these m randomized SPMs in parallel generates expected revenue at least\n∑\nj∈[m]\n( 1\n4 − ǫ · n\n) · ( OPTj\n8 − 2ǫ · nH\n) = ( 1\n4 − ǫ · n\n) · ( SREV\n8 − 2ǫ ·mnH\n)\nunder D. Due to Theorem 10, we can construct in polynomial time such a randomized SPMMj for each item j based on ×i∈[n]D̂ij .\nNext, we show how to choose the entry fee based on D̂ = ×i,jD̂ij , so that the VCG with entry fee mechanism has revenue that approximates BREV under the true distribution D. More specifically, we use the median of i’s utility under D̂i = ×j∈[m]D̂ij as bidder i’s entry fee. We prove the result in two steps. We first show that if we can use an entry fee function such that every bidder i accepts her entry fee with probability between [1/2 − η, 1/2] for any possible bid profiles b−i of the other bidders, the expected revenue is at least (1/2 − η) · BREV. Second, we show how to compute in polynomial time such entry fee functions with η = O(mǫ) based on D̂.\nLemma 17. Suppose for every bidder i, di(·) : T−i 7→ R is a randomized entry fee function such that for any bid profile b−i ∈ T−i of the other bidders\nPr ti∼Di\n  ∑\nj∈[m]\n( tij −max\nk 6=i bkj\n)+ ≥ di(b−i)   ∈ [ 1\n2 − η,\n1\n2\n]\nwith probability at least 1 − δ. Then if we use di(·) as the entry fee function in the VCG with entry fee mechanism, the expected revenue is at least (1− δ − 2η) · BREV.\nProof. When Prti∼Di [∑ j∈[m] (tij −maxk 6=i bkj) + ≥ di(b−i) ] ∈ [ 1 2 − η, 1 2 ] , di(b−i) is no less than the original entry fee ei(b−i,Di) for any bid profile b−i of the other bidders. The expected revenue under the new entry fee functions is at least ((1− δ) · ( 1 2 − η ) · ∑ i∈[n] Eb−i∼D−i [ei(b−i,Di)] ≥ (1− δ − 2η) · BREV.\nLemma 18. For any bidder i and any bid profile b−i from the other bidders, let Fi,b−i and F̂i,b−i be the distri-\nbutions for the random variable ∑\nj∈[m] (tij −maxk 6=i bkj) + when ti is drawn from Di and D̂i respectively.\nIf ∣∣∣ ∣∣∣Dij − D̂ij ∣∣∣ ∣∣∣ K ≤ ǫ for all bidder i and item j, ∣∣∣ ∣∣∣Fi,b−i − F̂i,b−i ∣∣∣ ∣∣∣ K ≤ 2mǫ for all i and b−i. Moreover, when mǫ ≤ 1/16, we can compute a randomized mechanism whose expected revenue is at least BREV5 . Proof. For any real number x, consider event Ei,b−i,x = { ti ∣∣∣ ∑ j∈[m] (tij −maxk 6=i bkj) + ≥ x } . It is easy to see that Ei,b−i,x is single-intersecting for any any i, b−i and x. According to Lemma 3, ∣∣∣∣ Prti∼Di [ Ei,b−i,x ] − Pr\nti∼D̂i\n[ Ei,b−i,x ]∣∣∣∣ ≤ 2mǫ\nfor any i, b−i and x. Hence, ∣∣∣ ∣∣∣Fi,b−i − F̂i,b−i ∣∣∣ ∣∣∣ K ≤ 2mǫ.\nNext, we argue how to construct a randomized entry fee di(b−i) in polynomial time with only sample access of F̂i,b−i . Suppose we take k samples from F̂i,b−i and sort them in descending order s1 ≥ s2 ≥ · · · ≥ sk. Let the entry fee di(b−i) to be s⌈5k16 ⌉ . By the Chernoff bound, with probability at least 1− exp(−k/128) (over the randomness of the samples) Prti∼D̂i [∑ j∈[m] (tij −maxk 6=i bkj) + ≥ di(b−i) ] = Prti∼D̂i [ Ei,b−i,di(b−i) ]\nlies in [ 1 4 , 3 8 ] . Since Prti∼Di [ Ei,b−i,di(b−i) ] = Prti∼D̂i [ Ei,b−i,di(b−i) ] ± 2mǫ,\nPr ti∼Di\n[ Ei,b−i,di(b−i) ] ∈ [ 1\n8 , 1 2 ],\nif mǫ ≤ 1/16. According to Lemma 17, the expected revenue under our entry fee di(b−i) is at least( 1 4 − exp(−k/128) ) · BREV ≥ BREV5 if we choose k to be larger than some absolute constant. Clearly, the procedure above can be completed in polynomial time with access to D̂.\nCombining Lemma 16 and 18, we are ready to prove our main result of this section.\nTheorem 14. If all bidders have additive valuations, given distributions D̂ij where ∣∣∣ ∣∣∣D̂ij −Dij ∣∣∣ ∣∣∣ K ≤ ǫ for all i ∈ [n] and j ∈ [m], there is a polynomial time algorithm that constructs a mechanism whose expected revenue under D is at least OPT266 − 96ǫ ·mnH when ǫ ≤ 1 16max{m,n} .\nProof. Since ǫ ≤ 116max{m,n} , we can learn in polynomial time a randomized SPM whose revenue is at\nleast 316 · ( SREV 8 − 2ǫ ·mnH ) and a VCG with entry fee mechanism whose revenue is at least BREV/5. As OPT ≤ 6 · SREV + 2BREV (Theorem 6), the better of the two mechanisms we can learn in polynomial time has revenue at least OPT266 − 96ǫ ·mnH ."}, {"heading": "D Missing Details from Section 6", "text": "Proof of Lemma 5: We only sketch the proof here. Let POSTREV denote the highest revenue obtainable by any RSPM. In [13], Cai and Zhao constructed an upper bound of the optimal revenue using duality and separated the upper bound into three components: SINGLE, TAIL and CORE. Both SINGLE and TAIL are within constant times the POSTREV, and the ASPE(p∗, δ∗) is used to bound the CORE. It turns out one can use essentially the same proof as in [13] to prove that the mechanism ASPE(p′, δ′) has revenue at least a1(µ) · CORE − a2(µ) · POSTREV − a3(µ) · (n + m) · ǫ where a1(µ), a2(µ) and a3(µ) are functions that map µ to positive numbers. In other words, we can replace ASPE(p∗, δ∗) with ASPE(p′, δ′) and still obtain a constant factor approximation. ✷"}, {"heading": "D.1 Missing Proofs from Section 6.1", "text": "We formalize the first step of our algorithm in the following lemma.\nLemma 19. For any B > 0, ǫ > 0, η ∈ [0, 1] and µ ∈ [0, 14 ], suppose we take K = O\n( log 1\nη +logn+m log B ǫ\nµ2\n)\nsamples t(1), · · · , t(K) from D. For any collection of prices {pj}j∈[m] in the B-bounded ǫ-net, define the entry fee δ (p) i (S) of bidder i for set S under {pj}j∈[m] to be the median of ui(t (1) i , S), · · · , ui(t (K) i , S), where ui(ti, S) = maxS∗⊆S vi(ti, S ∗)− ∑ j∈S∗ pj . Then with probability 1−η, for any collection of prices {pj}j∈[m]\nin the B-bounded ǫ-net, { δ (p) i (·) } i∈[n] is a collection of µ-balanced entry fee functions.\nProof. For any fixed {pj}j∈[m], fixed bidder i and fixed set S, it is easy to argue that the probability for Prti∼Di [ui(ti, S) ≥ δ (p) i (S)] to be larger than 1 2 + µ or smaller than 1 2 − µ is at most 2exp(−2Kµ\n2) due to the Chernoff bound. Next, we take a union bound over all {pj}j∈[m] in the ǫ-net, all bidders and all possible subsets of [m], so the probability that for any collection of prices {pj}j∈[m] in the ǫ-net {δ (p) i (·)}i∈[n] is a\ncollection of µ-balanced entry fee functions is at least 1− 2 exp(−2Kµ2) · ( B ǫ )m · 2m · n. If we take K to be at least log 1 η +logn+m log B ǫ\nµ2 , the success probability is at least 1− η.\nNext, we formalize the second step of our learning algorithm.\nLemma 20. For any B ≥ 2G, ǫ, ǫ′ > 0, η ∈ [0, 1] and µ ∈ [0, 14 ], suppose for every collection of prices {pj}j∈[m] in the B-bounded ǫ-net, {δ (p) i (·)}i∈[n] is a collection of µ-balanced entry fee functions. We use S to denote the set that contains ASPE(p, δ(p)) for every p in the B-bounded ǫ-net. If we take\nK = O\n( log 1\nη +m log B ǫ\nǫ′2\n) samples t(1), · · · , t(K) from D and let ASPE(p′, δ(p ′)) be the mechanism that has\nthe highest revenue in S . Then with probability at least 1− η, the better of ASPE(p′, δ(p ′)) and the best RSPM achieves revenue at least OPTC1(µ) − C2(µ) · (m+ n) · ǫ− 2mnB · ǫ ′.\nProof. For any {pj}j∈[m] in the ǫ-net, define REV(p) to be the expected revenue of ASPE(p, δ (p)) and R̂EV(p) be the average revenue of ASPE(p, δ(p)) among the K samples. First, we argue that R̂EV(p) is a random variable that lies between [0,mnB]. The revenue from selling the items can be at most mB as there are only m items and pj ≤ B for all j ∈ [m]. How about the entry fee? For any bidder i,\nPr ti∼Di\n[vi(ti, [m]) ≥ mG] ≤ ∑\nj∈[m]\nPr tij∼Dij\n[Vi(tij) ≥ G] ≤ m\n5max{m,n} ≤\n1 5 .\nThe first inequality is because vi(ti, ·) is a subadditive function for every type ti ∈ Ti, so for vi(ti, [m]) to be greater than mG, there must exist a item j such that Vi(tij) ≥ G. The second inequality follows from the definition of G in Theorem 8.\nIf there exists a set S ⊆ [m] such that δ (p) i (S) > mG, we have\nPr ti∼Di [vi(ti, [m]) ≥ mG] ≥ Pr ti∼Di\n[ vi(ti, [m]) ≥ δ (p) i (S) ] ≥ 1\n2 − µ ≥\n1 4 .\nContradiction. Note that the second inequality is because δ (p) i (·) is µ-balanced. Hence, the entry fee is always upper bounded by mG and R̂EV(p) is at most mnG + mB ≤ mnB. Also, notice that the expectation of R̂EV(p) is exactly REV(p). By the Chernoff bound,\nPr [∣∣∣REV(p)− R̂EV(p) ∣∣∣ ≤ mnB · ǫ′ ] ≥ 1− 2 exp(−2K · ǫ′2)\nfor any fixed {pj}j∈[m]. By the union bound, the probability that for all {pj}j∈[m] in the ǫ-net ∣∣∣REV(p)− R̂EV(p) ∣∣∣ ≤ mnB · ǫ′ is at least 1− 2 exp(−2K · ǫ′2) · ( B ǫ )m , which is lower bounded by 1− η due to our choice of K . When this happens, the expected revenue of ASPE(p′, δ(p ′)) is at most 2mnB · ǫ′ less than the highest expected revenue achievable by any of these mechanisms, because\nREV(p′) ≥ R̂EV(p′)−mnB · ǫ′ ≥ R̂EV(p)−mnB · ǫ′ ≥ REV(p)− 2mnB · ǫ′\nfor any p in the ǫ-net. Combining this inequality with Corollary 2 completes our proof.\nNote that Lemma 19 and 20 hold for all distributions D. The reason we require D to be bounded or regular is because without these restrictions, we do not know how to approximate the best RSPM. In the following Theorem, we combine Lemma 19, 20 and Theorem 11 to obtain the sample complexity of our learning algorithm for bounded distributions.\nTheorem 15. When all bidders’ valuations are XOS over independent items and the random variable Vi(tij)\nis supported on [0,H] for any bidder i and any item j, with O (( mn ξ )2 · ( m · log m+nξ + log 1 δ )) samples\nfrom D, we can learn an RSPM and an ASPE such that with probability at least 1 − δ the better of the two mechanisms has revenue at least OPTc − ξ ·H for some absolute constant c > 1.\nProof. With O (( 1 ξ )2 ( m2n log n log 1ξ + log 1 δ )) samples, we can obtain an RSPM whose revenue is at\nleast 124 of the revenue of the best RSPM minus ξ 2 · H with probability 1 − δ/2 according to Theorem 11. Let µ be some fixed constant in [0, 14 ], B = 2H , ǫ = ξ·H 6C2(µ)(m+n) and ǫ′ = ξ12mn . According to Lemma 19,\ngiven O ( log 1δ + log n+m log m+n ξ ) samples, we can construct an entry fee function for each price vector in the B-bounded ǫ-net, such that all these entry fee functions are µ-balanced with probability at least 1− δ/4.\nAccording to Lemma 20, we can learn an ASPE with O (( mn ξ )2 · ( m · log m+nξ + log 1 δ )) fresh samples\nfrom D, such that the better of the ASPE we learned and the best RSPM has revenue of at least OPTC1(µ) − ξ 2 ·H with probability 1 − δ/4. Combining the statements above, we can learn with probability 1− δ a mechanism\nwhose revenue is at least OPTc − ξ ·H with O (( mn ξ )2 · ( m · log m+nξ + log 1 δ )) samples.\nIn the next Theorem, we combine Lemma 19, 20 and Theorem 12 to obtain the sample complexity of our\nlearning algorithm for regular distributions.\nTheorem 16. When all bidders’ valuations are XOS over independent items and the random variable Vi(tij) is regular for each item j ∈ [m] and bidder i ∈ [n], with O ( Z2m2n2 · ( m · log(m+ n) + log 1δ )) (Z = max{m,n}) samples from D, we can learn an RSPM and an ASPE such that with probability at least 1 − δ the better of the two mechanisms has revenue at least OPTc for some absolute constant c > 1.\nProof. According to Theorem 12, we can learn with probability 1 − δ/2 a randomized RSPM whose revenue is at least 133 of the optimal RSPM with O ( Z2m2n2 · log nmδ ) samples. Next, we learn an ASPE with high\nrevenue. With O ( Z2 · log nmδ ) samples from each Dij , we can estimate Wij such that\nPr tij∼Dij [Vi(tij) ≥ Wij] ∈\n[ 1\n6Z , 1 5Z\n]\nwith probability 1 − δ4nm . By the union bound, the probability that all Wij satisfy the requirement is at least 1− δ4 . So with probability at least 1− δ 4 ,Wij ≥ Gij for all i ∈ [n] and j ∈ [m].\nLetB = 2 ·maxi,j Wij , µ be some fixed constant in [0, 1 4 ], ǫ = ξ·B C2(µ)Z(m+n) and ǫ′ = ξ2mnZ for some small\nconstant ξ, which will be specified later. We know that given O ( log 1δ + log n+m log(m+ n) ) samples, we can construct µ-balanced entry fee functions for all price vectors in the B-bounded ǫ-net with probability 1− δ/8 due to Lemma 19. According to Lemma 20, we can learn an ASPE with\nO ( Z2m2n2 · ( m · log(m+ n) + log 1\nδ\n))\nfresh samples from D, such that the better of the ASPE we learned and the best RSPM has revenue of at least OPT C1(µ) − 2ξ·BZ with probability 1 − δ/8. Note that there exists a bidder i and an item j such that Wij = B/2, so OPT ≥ B2 · 1 6Z and for sufficiently small ξ, OPT C1(µ) − 2ξ·BZ ≥ OPT 2C1(µ) . Combining the statements above, we can learn with probability 1− δ a mechanism whose revenue is at least OPTc for some absolute constant c with O ( Z2m2n2 · ( m · log(m+ n) + log 1δ )) samples."}, {"heading": "E Learning Algorithms for Symmetric Bidders", "text": ""}, {"heading": "E.1 An Upper Bound of the Optimal Revenue for Symmetric Bidders", "text": "In this section, we introduce an upper bound to OPT based on duality [13], which is crucial for us to prove the approximation ratios of our learning algorithms. We first fix some notation. Let POSTREV be the highest revenue obtainable by any RSPM. As the bidders are symmetric, we drop the subscript i when there is no confusion. In particular, we use V (tij) to denote bidder i’s value for winning item j if her private information for item j is tij , and v(ti, S) to denote bidder i’s value for set S when her type is ti. We use Dj to denote the distribution of the private information about item j. Let σiS(t) be the interim probability for bidder i to receive exactly set S ⊆ [m] when her type is t.\nIn [13], an upper bound of the optimal revenue is derived using duality theory. Their upper bound applies to asymmetric bidders with valuations that are subadditive over independent items. When the bidders are symmetric, we can simplify their upper bound. First, we need the definition of b-balanced thresholds.\nDefinition 7 (b-balanced Thresholds). For any constant b ∈ (0, 1), a collection of positive real numbers {βj}j∈[m] is b-balanced if for all i ∈ [n] and j ∈ [m], Prtij∼Dj [V (tij) ≥ βj ] ∈ [ b n , b n−1 ].\nNote that when bidders are asymmetric, b-balanced thresholds are not guaranteed to exist, as there may not exist any βj that satisfies Prtij∼Dj [V (tij) ≥ βj ] ∈ [ b n , b n−1 ] for all bidder i simultaneously. Next, we define the COREη(β) which will be crucial for upper bounding the optimal revenue. 10 Definition 8 (CORE). Given any collection of thresholds {βj}j∈[n] and a nonnegative constant η ≤ 1 4 ,\n• if ∑\nj∈[m]Prtj∼Dj [V (tj) ≥ βj ] ≤ 1 2 − η, let cη(β) be 0;\n• otherwise, let cη(β) be a nonnegative number such that ∑ j∈[m]Prtj∼Dj [V (tj) ≥ βj + cη(β)] ∈ [ 1 2 − η, 1 2 ] .\nFor every type t, let Cη(t) = {j | V (tj) < βj + cη(β)}. Then,\nCOREη(β) = max σ∈P (D)\n∑\ni∈[n]\n∑\nti∈Ti\nf(ti) · ∑\nS⊆[m]\nσiS(ti) · v (ti, S ∩ Cη(ti)) ,\nwhere P (D) is the set of all feasible interim allocation rules. That is, COREη(β) is the maximum welfare a mechanism can extract out of the allocation of items whose individual value for the bidder they are allocated to is lower than the adjusted thresholds.\nIt was shown in [13] that every collection of thresholds induces an upper bound to the optimal revenue. In particular, for any choice of thresholds {βj}j∈[m] and η 11, the revenue REV(M) of any BIC mechanism M is upper bounded by\n2 · SINGLE(M,β) + 4 · TAILη(M,β) + 4 · COREη(M,β) (Adapted from Theorem 2 in [13]).\nThese terms depend on the choice of {βj}j∈[m], η as well as the mechanism M . We refer interested readers to [13] for the definitions of these terms. To obtain a benchmark/upper bound of the optimal revenue, one can simply replace the above expression with\n2 ·max M SINGLE(M,β) + 4 ·max M TAILη(M,β) + 4 ·max M COREη(M,β).\n10For readers that are familiar with the definition of the CORE in [13], COREη(β) is essentially the same term but adapted for symmetric bidders.\n11In [13], the thresholds are allowed to depend on the identity of the bidder. More specifically, for any i ∈ [n] and j ∈ [m], there is an associated threshold βij . Their upper bound applies to asymmetric thresholds as well. Indeed, when the bidders are asymmetric, their upper bound is induced by a set of asymmetric thresholds. As we only discuss symmetric bidders in this section, we focus on symmetric thresholds for simplicity. Regarding η, Cai and Zhao only considered the case when η = 0, but their analysis can be easily modified to accommodate any η ≤ 1/4. See Theorem 17 for the modified upper bound.\nIt is not hard to see that this benchmark may be impossible to approximate for certain choices of the thresholds. Just imagine the case when the thresholds are extremely high, thenmaxM COREη(M,β) becomes the optimal social welfare which can be arbitrarily large comparing to the optimal revenue. What Cai and Zhao [13] showed was that when the thresholds are b-balanced, this upper bound can indeed be approximated by the revenue of an RSPM and an ASPE. From now on, we only consider b-balanced thresholds.\nUsing results in [13], we can further simplify the benchmark. In particular, maxM SINGLE(M,β) is less than 6 · POSTREV for all choices of {βj}j∈[n] and maxM TAILη(M,β) is less than 2 1−b · POSTREV for any choice of η and b-balanced thresholds {βj}j∈[n]. Moreover, maxM COREη(M,β) ≤ COREη(β). Combining the inequalities above, we obtain the following Theorem.\nTheorem 17 (Adapted from [13]). When the bidders are symmetric and have valuations that are subadditive over independent items, for any constant b ∈ (0, 1), η ≤ 14 and a collection of b-balanced thresholds {βj}j∈[m],\nOPT ≤ ( 12 + 8\n1− b\n) · POSTREV + 4 · COREη(β)."}, {"heading": "E.2 Symmetric Bidders with XOS Valuations", "text": "In this section, we show how to learn in polynomial time an approximately optimal mechanism for symmetric bidders with XOS valuations given sample access to the distributions. According to Theorem 17, we only need to learn a mechanism that approximates POSTREV and COREη(β). From Section 5.1, we know how to approximated POSTREV in polynomial time, so we focus on learning a mechanism whose revenue approximates COREη(β). First, we need a crucial property about XOS valuations.\nLemma 21 (Supporting Prices [23]). If v(t, ·) is an XOS function, for any subset S ⊆ [m] there exists a\ncollection of supporting prices { θSj (t) } j∈S for v(t, S) such that\n1. v(t, S′) ≥ ∑\nj∈S′ θ S j (t) for all S ′ ⊆ S and\n2. ∑\nj∈S θ S j (t) = v(t, S).\nLet v′(ti, S) = v (ti, S ∩ Cη(ti)) and Fi be the distribution of the valuation v ′(ti, S). As the bidders are symmetric, Fi = Fi′ for any i and i ′. The COREη(β) is exactly the maximum expected social welfare if every bidder i’s valuation is drawn independently from Fi. Cai and Zhao [13] showed how to use an ASPE to approximate this term. In the next Lemma, we construct the prices used in their ASPE and show its relation to COREη(β).\nLemma 22. (Adapted from [13]) Let every bidder i’s valuation be v′(ti, S) = v (ti, S ∩ Cη(ti)) when her type is ti and σ\n∗ be a symmetric allocation that achieves α-fraction of the optimal social welfare with respect to v′(·, ·). For every item j ∈ [m], let\nQη,j = 1 2 · ∑\ni∈[n]\n∑\nti∈Ti\nf(ti) · ∑\nS:j∈S\nσ∗iS(ti) · θ S∩Cη(ti) j (ti),\nwhere { θ S∩Cη(ti) j (ti) } j∈S∩Cη(ti) is the supporting prices for v (ti, S ∩ Cη(ti)). Let\nu∗(t, S) = max S∗⊆S\nv(t, S∗)− ∑\nj∈S∗\nQη,j\nbe a bidder’s utility for the set of items S when her type is t. We define δ∗(S) to be the median of the random variable u∗(t, S) (with t ∼ ×j∈[m]Dj) for any set S ⊆ [m]. The revenue of ASPE ( {Qη,j}j∈[m], δ ∗ ) is at least\nα · COREη(β)\n2 − C(b, η) · POSTREV,\nwhere C(b, η) is a function that only depends on b and η.\nProof. We can essentially use the same proof in [13] to prove that the expected revenue of the ASPE is at least\n∑\nj∈[m]\nQη,j − C(b, η) · POSTREV.\nFor readers that are familiar with that proof, the only thing we need to make sure is that our choice of σ∗ and {βj}j∈[m] satisfy Lemma 5 in [13]. Since σ\n∗ is symmetric and {βj}j∈[m] is b-balanced, for all bidder i and item j ∑\nk 6=i\nPr tkj∼Dj\n[V (tkj) ≥ βj ] ≤ b\nn− 1 · (n − 1) = b,\nand\nPr tij∼Dj\n[V (tij) ≥ βj ] /b ≥ 1/n ≥ · ∑\nti∈Ti\nfi(ti) · ∑\nS:j∈S\nσ∗iS(ti).\nNext, we argue ∑\nj∈[m]Qη,j ≥ α·COREη(β) 2 . Observe that\n∑\nj∈[m]\nQη,j = 1 2 · ∑\ni∈[n]\n∑\nti∈Ti\nf(ti) · ∑\nS\nσ∗iS(ti) · v ′(ti, S) ≥ α · COREη(β).\nThe last inequality is because COREη(β) is the maximum social welfare under v ′(·, ·) and σ∗ achieves α fraction of that.\nLemma 23. For any ǫ > 0 and µ ∈ [0, 14 ], let {Qj}j∈[m] be a collection of prices such that |Qj −Qη,j | ≤ ǫ for all j ∈ [m]. Let δ(S) be the entry fee function such that Prt∼×j∈[m]Dj [u(t, S) ≥ δ(S)] ∈ [1/2−µ, 1/2+µ] for any set S ⊆ [m], where u(t, S) = maxS∗⊆S v(t, S ∗)− ∑\nj∈S∗ Qj . Then, the ASPE(Q, δ) achieves at least α·COREη(β)\nB1(µ) − B2(b, η, µ) · POSTREV − B3(µ) · (m + n) · ǫ revenue when bidders’ valuations are XOS over independent item. Both B1(µ) and B3(µ) are functions that only depend on µ and B2(b, η, µ) is a function that only depends on µ, b and η.\nProof. It turns out the proof in [13] is robust enough to accommodate the error ǫ and µ. We can prove the claim by following essentially the same analysis as in [13]. We do not include the details here."}, {"heading": "E.2.1 Leaning the ASPE in Polynomial Time", "text": "We first show how to learn a collection of b-balanced thresholds and the corresponding cη(β).\nLemma 24. For any positive constant b < 1 and η ≤ 14 , there is a polynomial time algorithm that computes a collection of b-balanced thresholds {βj}j∈[m] and cη(β) with probability 1−δ usingO ( m2n4 log mδ ) samples from distribution ×j∈[m]Dj .\nProof. GivenK = O ( m2n4 ( logm+ log 1δ )) samples t (1) j , . . . , t (K) j from distributionDj , we construct Fj as\nthe uniform distribution over V ( t (1) j ) , . . . , V ( t (K) j ) . According to the DKWTheorem [25], with probability at least 1− δ/m, ∣∣∣∣ Prtj∼Dj [V (tj) ≥ x]− Pr vj∼Fj [vj ≥ x] ∣∣∣∣ ≤ 1 c ·mn2 for all x (6)\nwhere c is a constant that will be specified later. From now on, we assume that Inequality (6) holds for every j, which happens with probability 1− δ.\nAs 1/K ≤ b 3n2 ≤ bn−1− b 3n2 − bn− b 3n2 , there must exist a sample t (ℓ) j such that Prvj∼Fj [ vj ≥ V ( t (ℓ) j )] ∈\n[ b n + b 3n2 , bn−1 − b 3n2 ] . Let βj = V ( t (ℓ) j ) . Note that\nPr tj∼Dj [V (tj) ≥ βj ] ∈\n[ Pr\nvj∼Fj [vj ≥ βj ]−\n1\nc ·mn2 , Pr vj∼Fj\n[vj ≥ βj ] + 1\nc ·mn2\n] .\nIf c is less than b3 , Prtj∼Dj [V (tj) ≥ βj] ∈ [ b n , b n−1 ] . Thus, βj is b-balanced for all item j.\nNext, we argue how to learn cη(β). If ∑ j∈[m]Prvj∼Fj [vj ≥ βj ] ≤ 1 2 − η 2 , let cη(β) = 0. This is a\nvalid choice, as ∑\nj Prtj∼Dj [V (tj) ≥ βj ] is at most 1 2 − η 2 + 1 cn2 ≤ 1 2 according to inequality (6). Sup-\npose ∑\nj∈[m]Prvj∼Fj [vj ≥ βj ] > 1 2 − η 2 , as m/K < η 4 , there must exist some item k ∈ [m] and a sam-\nple V ( t (ℓ) k ) ≥ βk such that ∑ j∈[m]Prvj∼Fj [ vj ≥ βj + V ( t (ℓ) k ) − βk ] ∈ [ 1 2 − η 4 , 1 2 − η 2 ] . Let cη(β) = V ( t (ℓ) k ) − βk. According to inequality (6),\n∑\nj∈[m]\nPr tj∼Dj [V (tj) ≥ βj + cη(β)] ∈\n[ 1\n2 −\nη 4 − 1 cn2 , 1 2 − η 2 + 1 cn2\n] .\nFor sufficiently large c, ∑ j Prtj∼Dj [V (tj) ≥ βj + cη(β)] ∈ [ 1 2 − η, 1 2 ] .\nFinding each βj takes O(K logK) time and finding the cη(β) takes O(mK) time. So we can learn in polynomial time a collection of b-balanced thresholds {βj}j∈[m] and cη(β) with probability 1 − δ using O ( m2n4 log mδ ) samples.\nNext, we show how to learn the prices of the ASPE. As showed by Feige [27], there exists a polynomial time algorithm that achieves 1− 1e fraction of the optimal social welfare when bidders have XOS valuations. We let σ∗ be the interim allocation rule induced by Feige’s algorithm and estimate the prices by running Feige’s algorithm on sampled valuation profiles. To run Feige’s algorithm, we need a demand oracle for bidder’s valuations. In the following Lemma, we argue that v′(t, ·) is an XOS function for any type t, and given a value (or demand, XOS) oracle for v(t, ·), we can construct in polynomial time the corresponding oracle for v′(t, ·). First, we define these oracles formally.\nDefinition 9. We consider the following three oracles for a bidder’s valuation function v(t, ·):\n• Value oracle: takes a set S ⊆ [m] as the input and returns v(t, S).\n• Demand oracle: takes a collection of prices {pj}j∈[m] as an input and returns the favorite set under these prices, that is, S∗ ∈ argmaxS∈[m] v(t, S)− ∑ j∈S pj .\n• XOS oracle (only when v(t, ·) is XOS): takes a set S ⊆ [m] as the input and returns the supporting prices {θSj (t)}j∈S for v(t, S).\nLemma 25. Given a collection of thresholds {βj}j∈[m] and cη(β). For any set S ⊆ [m], let v ′(t, S) = v(t, S ∩ Cη(t)). If v(t, ·) is an XOS function, v ′(t, ·) is also an XOS function. Given a value (or demand, XOS) oracle for v(t, ·), we can construct in polynomial time a value (or demand, XOS) oracle for v′(t, ·).\nProof. If v(t, ·) is an XOS function, v(t, ·) can be represented as the max of a collection of additive functions. Observe that if we change the values for items in Cη(t) to 0 in each of these additive functions, v\n′(t, ·) equals to the max of this new collection of additive functions. Hence, v′(t, ·) is also an XOS function.\nIf we are given a value oracle for v(t, ·), it is straightforward to construct a value oracle for v′(t, ·). If we are given a demand oracle for v(t, ·), here is how to construct a demand oracle for v′(t, ·). For every queried price vector {pj}j∈[m], we change the price for each item outside Cη(t) to 2v(t, [m]) and keep the prices for the items in Cη(t). Let this new price vector be p\n′. We query the demand oracle of v(t, ·) on p′. The output set should also be the demand set for v′(t, ·) under prices p, as the bidder can only afford items in Cη(t) and v ′(t, S) = v(t, S) for any set S ⊆ Cη(t). Finally, we consider the XOS oracle. For any set S,\nlet { θ S∩Cη(t) j (t) } j∈S∩Cη(t) be the supporting prices for v(t, S ∩ Cη(t)). Let γ S j (t) = θ S∩Cη(t) j for all item j in Cη(t) ∩ S and γ S j (t) = 0 for all item j in S − Cη(t). According to the definition of v\n′(t, ·), {γSj (t)}j∈S is the supporting price for v′(t, S). So given an XOS oracle for v(t, ·), we can compute the supporting price of any set S for v′(t, ·) in polynomial time.\nLemma 25 shows that v′(t, ·) is also an XOS function for any type t and with access to a demand oracle for v(t, ·) we can construct a demand oracle for v′(t, ·) in polynomial time. So we can indeed run Feige’s algorithm on v′. In the next Lemma, we show how to learn a collection of prices {Qj}j∈[m] and entry fee function δ(·, ·) such that the corresponding ASPE has high revenue.\nLemma 26. Given a collection of b-balanced thresholds {βj}j∈[m] and cη(β), and access to value, demand and XOS oracles for valuation v(t, ·) for every type t, there is a polynomial time algorithm that learns an ASPE({Qj}j∈[m], δ) whose revenue is at least COREη(β)\nK1 − g(b, η) · POSTREV −K2 · ξ · OPT with probability\nat least 1− ζ using O ( n3(m+ n)2 log mζ ) samples from ×j∈[m]Dj , where K1 and K2 are positive absolute constants, and g(b, η) is a function that only depends on b and η.\nProof. According to Lemma 25, we can construct value, demand and XOS oracles for valuation v′(t, ·) given access to the corresponding oracles for v(t, ·). We use {γSj (t)}j∈S to denote the output of the XOS oracle for v′(t, ·) on set S. In particular, γSj (t) = 0 for all j ∈ S − Cη(t) and γ S j (t) = θ S∩Cη(t) j (t) for all j ∈ S ∩ Cη(t), where {θ S∩Cη(t) j (t)}j∈S∩Cη(t) is the supporting prices for v(t, S ∩ Cη(t)). LetA(t) be the allocation computed by Feige’s algorithm on the valuation profile (v′(t1, ·), . . . , v ′(tn, ·)), whereAi(t) denotes the set of items that bidder i receives. Let σ∗ be the interim allocation rule induced by A(·) when bidders types are all drawn from ×j∈[m]Dj independently. That is, σ ∗ iS(ti) = Prt−i [Ai(t) = S]. We use the same definition for Qη,j as in Lemma 22. In other words, Qη,j is the contribution of item j to the social welfare under allocation rule σ ∗, so we can rewrite it as\n1 2 · Et\n ∑\ni∈[n]\n1 [j ∈ Ai(t)] · γ Ai(t) j (ti)\n  .\nLet t(1), . . . , t(K) be K sampled type profiles, and q(ℓ) = 12 ∑ i∈[n] 1 [ j ∈ Ai(t (ℓ)) ] · γ Ai(t(ℓ)) j (t (ℓ) i ). We\nset Qj to be 1 K · ∑ ℓ∈[K] q\n(ℓ). Since γSj (t) ≤ βj + cη(β) for any j, S and t, Qj ≤ βj + cη(β). By the Chernoff bound,\nPr [|Qj −Qη,j | ≤ ǫ · (βj + cη(β))] ≥ 1− 2 exp(−2K · ǫ 2).\nAs {βj}j∈[m] is a collection of b-balanced thresholds, we can obtain revenue βj · b n by only selling\nitem j to one bidder at price βj . Hence, βj ≤ n·OPT\nb . Now, consider a posted price mechanism that\nsells item j at price βj + cη(β). A single bidder will purchase at least one item with probability at least∑ j Prtj∼Dj [V (tj) ≥ βj + cη(β)] which is no less than 1 2 − η if cη(β) > 0. Hence, the revenue of this mech-\nanism is at least cη(β) · ( 1 2 − η ) . As η ≤ 14 , cη(β) ≤ 4OPT. If we let ǫ = ξ (m+n)·(n/b+4) for some small constant ξ which will be specified later and K = log 4m ζ 2ǫ2 , we have Pr [ |Qj −Qη,j| ≤ ξ m+n · OPT ] ≥ 1− ζ2m . In other words, with O ( n3(m+ n)2 log mζ ) samples from ×j∈[m]Dj (as each t ℓ costs n samples), we can learn in polynomial time a collection of prices {Qj}j∈[m] such that |Qj −Qη,j | ≤ ξ\nm+n · OPT for all item j with probability 1− ζ/2.\nNext, we consider the entry fee function. We use essentially the same argument as in Lemma 19. Suppose we take L samples t(1), · · · , t(L) from ×j∈[m]Dj . Define the entry fee δ(S) for set S under {Qj}j∈[m] to be the median of u(t(1), S), · · · , u(t(L), S), where u(t, S) = maxS∗⊆S v(t, S ∗)− ∑ j∈S∗ pj . Given any constant µ ∈ [0, 1/4], for any fixed set S, it is easy to argue that the probability for Prt∼×j∈[m]Dj [u(t, S) ≥ δ(S)] to be larger than 12 + µ or less than 1 2 − µ is at most 2 exp(−2Lµ 2) due to the Chernoff bound. If we let L to be a · m+log 1/ζ µ2 for a sufficiently large constant a, the probability that δ(·) is a µ-balanced entry fee function is at least 1− ζ/2 by the union bound.\nHence, with O ( n3(m+ n)2 log mζ ) samples from ×j∈[m]Dj , we can compute in polynomial time a col-\nlection of prices {Qj}j∈[m] and a entry fee function δ(·) such that the revenue of the ASPE ( {Qj}j∈[m], δ(·) ) is at least (1−1/e)·COREη(β)\nB1(µ) −B2(b, η, µ) ·POSTREV − ξ · B3(µ) ·OPT with probability 1− ζ due to Lemma 23.\nOur claim follows by fixing the value of µ to be some constant.\nTheorem 18. For symmetric bidders with valuations that are XOS over independent items,\n1. when V (tj) is upper bounded byH for any j ∈ [m] and any tj , with\nO ( ( n5 +m2n4 ) · log m\nδ +\n( 1\nǫ\n)2( m2n log n log 1\nǫ + log\n1\nδ\n))\nsamples from ×j∈[m]Dj , we can learn in polynomial time with probability 1 − δ a mechanism whose revenue is at least c1 · OPT− ǫ ·H for some absolute constant c1;\n2. when the distribution of random variable V (tj) with tj ∼ Dj is regular for all item j ∈ [m], with\nO ( n5 · log m\nδ +max{m,n}2m2n2 · log\nnm\nδ\n)\nsamples from ×j∈[m]Dj , we can learn in polynomial time with probability 1 − δ a mechanism whose revenue is at least c2 · OPT for some absolute constant c2.\nProof of Theorem 18: Combining Lemma 24, Lemma 26 and Theorem 17, we know how to compute in polynomial time an ASPE whose revenue is at least a1 · OPT − a2 · POSTREV with probability 1 − δ/2 for some absolute constant a1, a2, and we only needO (( n5 +m2n4 ) · log mδ ) samples from×j∈[m]Dj . When the distributions are bounded, we can learn in polynomial time an RSPM whose revenue is at least POSTREV144 − ξH\nwith probability 1− δ/2 using O (( 1 ξ )2 ( m2n log n log 1ǫ + log 1 δ )) samples (Theorem 11). By choosing the\nratio between ξ and ǫ to be the right constant, we can show the first part of our claim. When V (tj) is a regular random variable for every item j, we can learn in polynomial time an RSPMwhose revenue is at least POSTREV33\nwith probability 1 − δ/2 using O ( max{m,n}2m2n2 · log nmδ ) samples (Theorem 12). Therefore, we can learn a mechanism in polynomial time such that with probability 1 − δ whose revenue is at least a constant fraction of the OPT. This proves the second part of our claim.✷"}, {"heading": "E.3 Symmetric Bidders with Subadditive Valuations", "text": "In this section, we argue that if the bidders are symmetric and m = O(n), there exists a collection of bbalanced thresholds {βj}j∈[m] for a fixed constant b, such that POSTREV is within a constant fraction of the benchmark. Note that this argument only applies to symmetric bidders, as b-balanced thresholds may not even exist for asymmetric bidders.\nWe set η = 0 for this section and drop the subscript η when there is no confusion. We show how to upper bound CORE(β) with POSTREV by choosing a particular collection of b-balanced thresholds. Let Z = max{m,n} and b = n3Z . It is not hard to see that n 3Z -balanced thresholds exist, as we can choose βj such that Prtj∼Dj [V (tj) ≥ βj ] = 1 3Z .\nLemma 27. Let {βj}j∈[m] be a collection of n 3Z -balanced thresholds, then CORE(β) ≤ ∑ j∈[m] βj .\nProof. As {βj}j∈[m] are n 3Z -balanced, Prtij∼Dj [V (tij) ≥ βj ] ≤ n (n−1)·3Z ≤ 1 2Z . Therefore,\n∑\nj∈[m]\nPr tj∼Dj\n[V (tj) ≥ βj ] ≤ 1\n2 ,\nso c(β) = 0. Next, we upper bound CORE(β) by ∑\nj∈[m] βj .\nCORE(β) = max σ∈P (D)\n∑\ni∈[n]\n∑\nti∈Ti\nf(ti) · ∑\nS⊆[m]\nσiS(ti) · v(ti, S ∩ C(ti))\n≤ max σ∈P (D)\n∑\ni∈[n]\n∑\nti∈Ti\nf(ti) ·\n  ∑\nS⊆[m]\nσiS(ti) · ∑\nj∈S\nβj\n \n= max σ∈P (D)\n∑\ni∈[n]\n∑\nj∈[m]\nβj ·\n ∑\nti∈Ti\nf(ti) · ∑\nS:j∈S\nσiS(ti)\n \n= max σ∈P (D)\n∑\nj\nβj ·\n ∑\ni∈[n]\n∑\nti∈Ti\nfi(ti) · ∑\nS:j∈S\nσiS(ti)\n \n≤ ∑\nj\nβj\nThe first inequality is because v(ti, ·) is a subadditive function, so\nv(ti, S ∩ Ci(ti)) ≤ ∑\nj∈S∩Ci(ti)\nV (tij) ≤ ∑\nj∈S∩Ci(ti)\nβj ≤ ∑\nj∈S\nβj .\nThe last inequality is because ∑\ni∈[n] ∑ ti∈Ti fi(ti) · ∑\nS:j∈S σiS(ti) ≤ 1 is the ex-ante probability for bidder i to receive item j, and for any feasible interim allocation σ, the sum of all bidders’ ex-ante probabilities for receiving item j should not exceed 1.\nIn the following Lemma, we demonstrate that ∑\nj∈[m] βj is upper bounded by 9Z n · POSTREV.\nLemma 28. Let {βj}j∈[m] be a collection of n 3Z -balanced thresholds, POSTREV ≥ n 9Z · ∑ j∈[m] βj .\nProof. Let us consider an RSPM where the price for selling item j to bidder i is βj . Bidder i purchases item j if that is the only item she can afford and no one else can afford item j. As {βj}j∈[m] are n 3Z -balanced, the probability that no one else can afford item j is at least  1− ∑\nk 6=i\nPr tkj∼Dj [V (tkj) ≥ βj]\n  ≥ (1 − n\n3Z ) ≥\n2 3 .\nAlso, the probability that i cannot afford any item other than j is at least  1− ∑\nℓ 6=j\nPr tiℓ∼Dℓ [V (tiℓ) ≥ βℓ]\n  ≥ 1− n(m− 1)\n3Z(n− 1) ≥\n1 2 .\nTherefore, bidder i purchases item j with probability at least 13 Prtij∼Dj [V (tij ≥ βj)] ≥ 1 9Z . Whenever this event happens, it contributes βj to the revenue. So the total revenue is at least ∑\nj ∑ i βj 9Z = n 9Z · ∑ j βj .\nCombining Theorem 17, Lemma 27 and 28, we obtain the following Theorem.\nTheorem 19. For symmetric bidders with valuations that are subadditive over independent items,\nOPT ≤ ( 24 + 36max{n,m}\nn\n) · POSTREV.\nProof. Combining Lemma 27 and 28, we have POSTREV ≥ n9max{n,m} ·CORE(β) if {βj}j∈[m] is a collection of n3max{n,m} -balanced thresholds. By setting b to be n 3max{n,m} and replacing CORE(β) with 9max{n,m}\nn · POSTREV in Theorem 17, we have\nOPT ≤ ( 12 +\n8\n1− n3max{n,m} +\n36max{n,m}\nn\n) · POSTREV.\nAs n3max{n,m} ≤ 1/3,\nOPT ≤ ( 24 + 36max{n,m}\nn\n) · POSTREV."}, {"heading": "E.3.1 Learning an Approximately Optimal Mechanism for Symmetric Subadditive Bidders", "text": "With Theorem 19, we only need to learn a mechanism that approximates the optimal revenue obtainable by any RSPM. The next Lemma connects RSPMs with SPMs in an induced unit-demand setting.\nLemma 29. Consider n symmetric bidders whose types are drawn independently from ×mj=1Dj . Let Fj be the distribution for random variable V (tj) where tj ∼ Dj . We define an induced unit-demand setting with n symmetric unit-demand bidders whose values for item j are drawn independently from Fj . For any collection of prices {pij}i∈[n],j∈[m], the revenue of the RSPM with these prices in the original setting is exactly the same as the revenue of the SPM with these prices in the induced unit-demand setting.\nProof. As in an RSPM bidders can purchase at most one item, bidders behave exactly the same as in the induced unit-demand setting. Since the prices in the SPM and RSPM are the same, bidders purchase exactly the same items. Hence, the revenue is the same.\nCorollary 3. For symmetric bidders with valuations that are subadditive over independent items,\nOPTUD ≥ Ω ( n Z ) · OPT,\nwhere Z = max{m,n} and OPTUD is the optimal revenue for the induced unit-demand setting.\nProof. Combine Theorem 19 and Lemma 29.\nLemma 29 implies that learning an approximately optimal RSPM is equivalent as learning an approximately optimal SPM in the induced unit-demand setting. Next, we apply our results in Section 5.1 to the induced unit-demand setting to learn an RSMP that approximates the optimal revenue in the original setting.\nIn the next Theorem, we show that even though the bidders’ valuations could be complex set functions, e.g., submodular, XOS and subadditive, as long asm = O(n), the approximate distributions for the bidders’ values for winning any single item provides sufficient information to learn an approximately optimal mechanism.\nTheorem 20. For symmetric bidders with valuations that are subadditive over independent items, let Fj be the distribution of V (tj) where tj ∼ Dj . If Fj is supported on [0,H] for all j ∈ [m], given distributions F̂j\nwhere ∣∣∣ ∣∣∣F̂j −Fj ∣∣∣ ∣∣∣ K ≤ ǫ for all j ∈ [m], there is a polynomial time algorithm that constructs a randomized RSPM whose revenue under the true distribution D is at least ( 1\n4 − (n+m) · ǫ\n) · ( Ω ( n\nmax{m,n}\n) · OPT− 2ǫ ·mnH ) .\nProof. Let Z = max{m,n}. According to Corollary 3, OPTUD = Ω ( n Z ) · OPT. Since ||F̂j − Fj ||K ≤ ǫ for all j ∈ [m], we can learn a randomized SPM in the induced unit-demand setting whose revenue under the true distribution is at least ( 1 4 − (n+m) · ǫ ) · ( OPTUD 8 − 2ǫ ·mnH ) based on Theorem 10. By Lemma 29, we can construct an RSPM with the same collection of (randomized) prices and achieve revenue ( 1\n4 − (n+m) · ǫ ) · ( Ω ( n Z ) · OPT− 2ǫ ·mnH )\nin the original setting.\nIf we are given sample access to bounded distributions, we show in the following Theorem that a polyno-\nmial number of samples suffices to learn an approximately optimal mechanism, whenm = O(n).\nTheorem 21. For symmetric bidders with valuations that are subadditive over independent items, let Fj be the distribution of V (tj) where tj ∼ Dj . If Fj is supported on [0,H] for all j ∈ [m], there is a polynomial\ntime algorithm that learns an RSPM whose revenue is Ω (\nn max{m,n}\n) ·OPT− ǫH with probability 1− δ using\nO\n(( 1\nǫ\n)2 · ( m2n log n log 1\nǫ + log\n1\nδ\n))\nsamples. Proof. According to Corollary 3, OPTUD = Ω (\nn max{m,n}\n) · OPT. Due to Theorem 11,\nO\n(( 1\nǫ\n)2 · ( m2n log n log 1\nǫ + log\n1\nδ\n))\nsamples suffices to learn in polynomial time with probability 1−δ an SPMwith revenue at least Ω(OPTUD)− ǫ ·H for the induced unit-demand setting. By Lemma 29, we can construct an RSPM with the same collection\nof prices and achieve revenue Ω (\nn max{m,n}\n) · OPT− ǫH in the original setting.\nFinally, if the distribution of the random variable V (tj) with tj ∼ Dj is regular for all item j ∈ [m], we prove in the next theorem that there exists a prior-independent mechanism that achieves a constant fraction of the optimal revenue if m = O(n). Note that approximately optimal prior-independent mechanisms for symmetric unit-demand bidders are known due to the work by Devanur et al. [21] and Roughgarden et al. [39]. Our result is obtained by combining Theorem 19 and the afore-mentioned prior independent mechanisms.\nTheorem 22. For symmetric bidders with valuations that are subadditive over independent items, let Fj be the distribution of V (tj) where tj ∼ Dj . If Fj is regular for all j ∈ [m], there is a prior-independent mechanism\nwith revenue at least Ω (\nn max{m,n}\n) · OPT. Moreover, the mechanism can be implemented efficiently.\nProof. The mechanism in [21] or [39] provides an approximately optimal prior-independent mechanism in the induced unit-demand setting. Let us use M to denote this mechanism. Suppose we restrict every bidder to purchase at most one item in the original setting and then run mechanism M . The expected revenue is the same as M ’s expected revenue in the induced setting. Since M ’s expected revenue is Ω(OPTUD) and\nOPTUD = Ω (\nn max{m,n}\n) ·OPT, the mechanism we constructed has revenueΩ ( n\nmax{m,n}\n) ·OPT. SinceM can\nbe implemented efficiently for unit-demand bidders, our mechanism can also be implemented efficiently."}], "references": [{"title": "Bayesian Combinatorial Auctions: Expanding Single Buyer Mechanisms to Many Buyers", "author": ["Saeed Alaei"], "venue": "In the 52nd Annual IEEE Symposium on Foundations of Computer Science (FOCS),", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 2011}, {"title": "The Simple Economics of Approximately Optimal Auctions", "author": ["Saeed Alaei", "Hu Fu", "Nima Haghpanah", "Jason Hartline"], "venue": "In the 54th Annual IEEE Symposium on Foundations of Computer Science (FOCS),", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2013}, {"title": "Bayesian Optimal Auctions via Multi- to Single-agent Reduction", "author": ["Saeed Alaei", "Hu Fu", "Nima Haghpanah", "Jason Hartline", "Azarakhsh Malekian"], "venue": "In the 13th ACM Conference on Electronic Commerce (EC),", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 2012}, {"title": "Nonparametric approaches to auctions", "author": ["Susan Athey", "Philip Haile"], "venue": "Handbook of econometrics,", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 2007}, {"title": "A Simple and Approximately Optimal Mechanism for an Additive Buyer", "author": ["Moshe Babaioff", "Nicole Immorlica", "Brendan Lucier", "S. Matthew Weinberg"], "venue": "In the 55th Annual IEEE Symposium on Foundations of Computer Science (FOCS),", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 2014}, {"title": "Optimal auctions via the multiplicative weight method", "author": ["Anand Bhalgat", "Sreenivas Gollapudi", "Kamesh Munagala"], "venue": "In ACM Conference on Electronic Commerce, EC ’13,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2013}, {"title": "Extreme-Value Theorems for Optimal Multidimensional Pricing", "author": ["Yang Cai", "Constantinos Daskalakis"], "venue": "In the 52nd Annual IEEE Symposium on Foundations of Computer Science (FOCS),", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2011}, {"title": "An Algorithmic Characterization of Multi-Dimensional Mechanisms", "author": ["Yang Cai", "Constantinos Daskalakis", "S. Matthew Weinberg"], "venue": "In the 44th Annual ACM Symposium on Theory of Computing (STOC),", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 2012}, {"title": "Optimal Multi-Dimensional Mechanism Design: Reducing Revenue to Welfare Maximization", "author": ["Yang Cai", "Constantinos Daskalakis", "S. Matthew Weinberg"], "venue": "In the 53rd Annual IEEE Symposium on Foundations of Computer Science (FOCS),", "citeRegEx": "9", "shortCiteRegEx": "9", "year": 2012}, {"title": "Understanding Incentives: Mechanism Design becomes Algorithm Design", "author": ["Yang Cai", "Constantinos Daskalakis", "S. Matthew Weinberg"], "venue": "In the 54th Annual IEEE Symposium on Foundations of Computer Science (FOCS),", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 2013}, {"title": "A duality based unified approach to bayesian mechanism design", "author": ["Yang Cai", "Nikhil R. Devanur", "S. Matthew Weinberg"], "venue": "In the 48th Annual ACM Symposium on Theory of Computing (STOC),", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2016}, {"title": "Simple and Nearly Optimal Multi-Item Auctions", "author": ["Yang Cai", "Zhiyi Huang"], "venue": "In the 24th Annual ACM- SIAM Symposium on Discrete Algorithms (SODA),", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2013}, {"title": "Simple mechanisms for subadditive buyers via duality", "author": ["Yang Cai", "Mingfei Zhao"], "venue": "In the 49th Annual ACM Symposium on Theory of Computing (STOC),", "citeRegEx": "13", "shortCiteRegEx": "13", "year": 2017}, {"title": "Algorithmic Pricing via Virtual Valuations", "author": ["Shuchi Chawla", "Jason D. Hartline", "Robert D. Kleinberg"], "venue": "In the 8th ACM Conference on Electronic Commerce (EC),", "citeRegEx": "14", "shortCiteRegEx": "14", "year": 2007}, {"title": "Multi-Parameter Mechanism Design and Sequential Posted Pricing", "author": ["Shuchi Chawla", "Jason D. Hartline", "David L. Malec", "Balasubramanian Sivan"], "venue": "In the 42nd ACM Symposium on Theory of Computing (STOC),", "citeRegEx": "15", "shortCiteRegEx": "15", "year": 2010}, {"title": "Mechanism design for subadditive agents via an ex-ante relaxation", "author": ["Shuchi Chawla", "J. Benjamin Miller"], "venue": "In Proceedings of the 2016 ACM Conference on Economics and Computation, EC ’16,", "citeRegEx": "16", "shortCiteRegEx": "16", "year": 2016}, {"title": "The sample complexity of revenue maximization", "author": ["Richard Cole", "Tim Roughgarden"], "venue": "In Proceedings of the 46th Annual ACM Symposium on Theory of Computing,", "citeRegEx": "17", "shortCiteRegEx": "17", "year": 2014}, {"title": "Multi-item auctions defying intuition", "author": ["Constantinos Daskalakis"], "venue": "ACM SIGecom Exchanges,", "citeRegEx": "18", "shortCiteRegEx": "18", "year": 2015}, {"title": "Strong duality for a multiple-good monopolist", "author": ["Constantinos Daskalakis", "Alan Deckelbaum", "Christos Tzamos"], "venue": null, "citeRegEx": "19", "shortCiteRegEx": "19", "year": 2017}, {"title": "Revenue maximization and ex-post budget constraints", "author": ["Constantinos Daskalakis", "Nikhil R. Devanur", "S. Matthew Weinberg"], "venue": "In Proceedings of the Sixteenth ACM Conference on Economics and Computation, EC ’15,", "citeRegEx": "20", "shortCiteRegEx": "20", "year": 2015}, {"title": "Prior-independent multiparameter mechanism design", "author": ["Nikhil R. Devanur", "Jason D. Hartline", "Anna R. Karlin", "C. Thach Nguyen"], "venue": "In Internet and Network Economics - 7th International Workshop,", "citeRegEx": "21", "shortCiteRegEx": "21", "year": 2011}, {"title": "The sample complexity of auctions with side information", "author": ["NR Devanur", "Z Huang", "CA Psomas"], "venue": "In 48th Annual ACM SIGACT Symposium on Theory of Computing,", "citeRegEx": "22", "shortCiteRegEx": "22", "year": 2016}, {"title": "Approximation algorithms for combinatorial auctions with complement-free bidders", "author": ["Shahar Dobzinski", "Noam Nisan", "Michael Schapira"], "venue": "In STOC,", "citeRegEx": "23", "shortCiteRegEx": "23", "year": 2005}, {"title": "Sampling and representation complexity of revenue maximization", "author": ["Shaddin Dughmi", "Li Han", "Noam Nisan"], "venue": "In International Conference on Web and Internet Economics (WINE),", "citeRegEx": "24", "shortCiteRegEx": "24", "year": 2014}, {"title": "Asymptotic minimax character of the sample distribution function and of the classical multinomial estimator", "author": ["Aryeh Dvoretzky", "Jack Kiefer", "Jacob Wolfowitz"], "venue": "The Annals of Mathematical Statistics,", "citeRegEx": "25", "shortCiteRegEx": "25", "year": 1956}, {"title": "Designing and learning optimal finite support auctions", "author": ["Edith Elkind"], "venue": "In Proceedings of the eighteenth annual ACM-SIAM symposium on Discrete algorithms,", "citeRegEx": "26", "shortCiteRegEx": "26", "year": 2007}, {"title": "On maximizing welfare when utility functions are subadditive", "author": ["Uriel Feige"], "venue": "SIAM Journal on Computing,", "citeRegEx": "27", "shortCiteRegEx": "27", "year": 2009}, {"title": "A prior-independent revenue-maximizing auction for multiple additive bidders", "author": ["Kira Goldner", "Anna R. Karlin"], "venue": "InWeb and Internet Economics - 12th International Conference,", "citeRegEx": "28", "shortCiteRegEx": "28", "year": 2016}, {"title": "Efficient empirical revenue maximization in single-parameter auction environments", "author": ["Yannai A. Gonczarowski", "Noam Nisan"], "venue": "CoRR, abs/1610.09976,", "citeRegEx": "29", "shortCiteRegEx": "29", "year": 2016}, {"title": "Optimal nonparametric estimation of first-price auctions", "author": ["Emmanuel Guerre", "Isabelle Perrigne", "Quang Vuong"], "venue": null, "citeRegEx": "30", "shortCiteRegEx": "30", "year": 2000}, {"title": "Making the most of your samples", "author": ["Zhiyi Huang", "Yishay Mansour", "Tim Roughgarden"], "venue": "In Proceedings of the Sixteenth ACM Conference on Economics and Computation,", "citeRegEx": "31", "shortCiteRegEx": "31", "year": 2015}, {"title": "Matroid Prophet Inequalities", "author": ["Robert Kleinberg", "S. Matthew Weinberg"], "venue": "In the 44th Annual ACM Symposium on Theory of Computing (STOC),", "citeRegEx": "32", "shortCiteRegEx": "32", "year": 2012}, {"title": "Learning theory and algorithms for revenue optimization in second price auctions with reserve", "author": ["Mehryar Mohri", "Andres Munoz Medina"], "venue": "In ICML,", "citeRegEx": "33", "shortCiteRegEx": "33", "year": 2014}, {"title": "The pseudo-dimension of near-optimal auctions", "author": ["Jamie Morgenstern", "Tim Roughgarden"], "venue": "arXiv preprint arXiv:1506.03684,", "citeRegEx": "34", "shortCiteRegEx": "34", "year": 2015}, {"title": "Learning simple auctions", "author": ["Jamie Morgenstern", "Tim Roughgarden"], "venue": "Proceedings of the 29th Conference on Learning Theory, COLT 2016,", "citeRegEx": "35", "shortCiteRegEx": "35", "year": 2016}, {"title": "Optimal Auction Design", "author": ["Roger B. Myerson"], "venue": "Mathematics of Operations Research,", "citeRegEx": "36", "shortCiteRegEx": "36", "year": 1981}, {"title": "An introduction to the structural econometrics of auction data", "author": ["Harry J Paarsch", "Han Hong"], "venue": "MIT Press Books,", "citeRegEx": "37", "shortCiteRegEx": "37", "year": 2006}, {"title": "Ironing in the dark", "author": ["Tim Roughgarden", "Okke Schrijvers"], "venue": "In Proceedings of the 2016 ACM Conference on Economics and Computation,", "citeRegEx": "38", "shortCiteRegEx": "38", "year": 2016}, {"title": "Supply-limiting mechanisms", "author": ["Tim Roughgarden", "Inbal Talgam-Cohen", "Qiqi Yan"], "venue": "In 13th ACM Conference on Electronic Commerce (EC),", "citeRegEx": "39", "shortCiteRegEx": "39", "year": 2012}, {"title": "Simple mechanisms for a subadditive buyer and applications to revenue monotonicity", "author": ["Aviad Rubinstein", "S. Matthew Weinberg"], "venue": "In Proceedings of the Sixteenth ACM Conference on Economics and Computation, EC ’15,", "citeRegEx": "40", "shortCiteRegEx": "40", "year": 2015}, {"title": "Comparison of threshold stop rules and maximum for independent nonnegative random variables", "author": ["Ester Samuel-Cahn"], "venue": "Ann. Probab., 12(4):1213–1216,", "citeRegEx": "41", "shortCiteRegEx": "41", "year": 1984}, {"title": "An n-to-1 bidder reduction for multi-item auctions and its applications", "author": ["Andrew Chi-Chih Yao"], "venue": "In SODA,", "citeRegEx": "42", "shortCiteRegEx": "42", "year": 2015}], "referenceMentions": [{"referenceID": 27, "context": "They also generalize and improve upon recent works of Goldner and Karlin [28] and Morgenstern and Roughgarden [35], which have provided algorithms that learn approximately optimal multi-item mechanisms in more restricted settings with additive, subadditive and unit-demand valuations using sample access to distributions.", "startOffset": 73, "endOffset": 77}, {"referenceID": 34, "context": "They also generalize and improve upon recent works of Goldner and Karlin [28] and Morgenstern and Roughgarden [35], which have provided algorithms that learn approximately optimal multi-item mechanisms in more restricted settings with additive, subadditive and unit-demand valuations using sample access to distributions.", "startOffset": 110, "endOffset": 114}, {"referenceID": 35, "context": "Already 36 years ago, a breakthrough result by Myerson identified the optimal single-item auction when bidder values are independent [36], and the ensuing decades saw a great deal of further understanding and practical applications of single-item auctions, importantly in online settings.", "startOffset": 133, "endOffset": 137}, {"referenceID": 17, "context": "It has been recognized that revenue-optimal multi-item auctions can be really complex, may exhibit counter-intuitive properties, and be fragile to changes in the underlying distributions; for a discussion and examples see survey [18].", "startOffset": 229, "endOffset": 233}, {"referenceID": 18, "context": "As such, it is doubtful that there is a crisp characterization of the structure of optimal multi-item auctions, at least not beyond single-bidder settings [19].", "startOffset": 155, "endOffset": 159}, {"referenceID": 13, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 14, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 0, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 6, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 2, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 7, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 8, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 11, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 9, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 1, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 5, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 19, "context": "On the other hand, there has been significant recent progress in efficient computation of revenue-optimal auctions [14, 15, 1, 7, 3, 8, 9, 12, 10, 2, 6, 20].", "startOffset": 115, "endOffset": 156}, {"referenceID": 4, "context": "Importantly, this progress has enabled identifying simple auctions (mostly variations of sequential posted pricing mechanisms) that achieve constant factor approximations to the revenue of the optimum [5, 42, 11, 16, 13], under the item-independence assumption of Definition 1 and Example 1.", "startOffset": 201, "endOffset": 220}, {"referenceID": 41, "context": "Importantly, this progress has enabled identifying simple auctions (mostly variations of sequential posted pricing mechanisms) that achieve constant factor approximations to the revenue of the optimum [5, 42, 11, 16, 13], under the item-independence assumption of Definition 1 and Example 1.", "startOffset": 201, "endOffset": 220}, {"referenceID": 10, "context": "Importantly, this progress has enabled identifying simple auctions (mostly variations of sequential posted pricing mechanisms) that achieve constant factor approximations to the revenue of the optimum [5, 42, 11, 16, 13], under the item-independence assumption of Definition 1 and Example 1.", "startOffset": 201, "endOffset": 220}, {"referenceID": 15, "context": "Importantly, this progress has enabled identifying simple auctions (mostly variations of sequential posted pricing mechanisms) that achieve constant factor approximations to the revenue of the optimum [5, 42, 11, 16, 13], under the item-independence assumption of Definition 1 and Example 1.", "startOffset": 201, "endOffset": 220}, {"referenceID": 12, "context": "Importantly, this progress has enabled identifying simple auctions (mostly variations of sequential posted pricing mechanisms) that achieve constant factor approximations to the revenue of the optimum [5, 42, 11, 16, 13], under the item-independence assumption of Definition 1 and Example 1.", "startOffset": 201, "endOffset": 220}, {"referenceID": 25, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 16, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 32, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 30, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 33, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 21, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 37, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 28, "context": "This work has lead to an almost complete picture for the single-item (and the more general single-parameter) setting where Myerson’s theory applies, showing how near-optimal mechanisms can be learned from polynomially many (in the approximation and the number of bidders) samples [26, 17, 33, 31, 34, 22, 38, 29].", "startOffset": 280, "endOffset": 312}, {"referenceID": 34, "context": "Recent work of Morgenstern and Roughgarden [35] has taken a computational learning theory approach to identify the sample complexity required to optimize over classes of simple auctions.", "startOffset": 43, "endOffset": 47}, {"referenceID": 34, "context": "While well-suited for identifying the sample complexity required to optimize over a class of simple mechanisms, which is a perfectly reasonable goal to have but not the one in this paper, the approach taken in [35] is arguably imperfect towards proving polynomial sample bounds for learning approximately optimal auctions in the settings where simple mechanisms are known to perform well in the first place.", "startOffset": 210, "endOffset": 214}, {"referenceID": 34, "context": "(ii) On the other hand, the computational learning techniques employed in [35], and in particular bounding the pseudo-dimension of a class of auctions, are not fine enough to discern the difference in sample complexity required to optimize under item-independence and without itemindependence.", "startOffset": 74, "endOffset": 78}, {"referenceID": 41, "context": "In this setting, the approximately optimal auctions that are known are the best of selling the items separately or running a VCG mechanism with entry fees [42, 11], as described in Section 5.", "startOffset": 155, "endOffset": 163}, {"referenceID": 10, "context": "In this setting, the approximately optimal auctions that are known are the best of selling the items separately or running a VCG mechanism with entry fees [42, 11], as described in Section 5.", "startOffset": 155, "endOffset": 163}, {"referenceID": 27, "context": "Is this exponential sample size really necessary or an artifact of the approach? Recent work of Goldner and Karlin [28] gives us hope that it is the latter.", "startOffset": 115, "endOffset": 119}, {"referenceID": 34, "context": "In particular, our results constitute vast extensions of known results on the polynomial learnability of approximately optimal auctions in multi-item settings [35, 28].", "startOffset": 159, "endOffset": 167}, {"referenceID": 27, "context": "In particular, our results constitute vast extensions of known results on the polynomial learnability of approximately optimal auctions in multi-item settings [35, 28].", "startOffset": 159, "endOffset": 167}, {"referenceID": 23, "context": "It is known that some restriction needs to be made on the distribution to gain polynomial sample complexity, as otherwise exponential lower bounds are known for learning approximately optimal auctions even for a single unit-demand bidder [24].", "startOffset": 238, "endOffset": 242}, {"referenceID": 23, "context": "We note again that without the standard item-independence (or some other) restriction on the distributions, we cannot hope to learn approximately optimal auctions from sub-exponentially many samples, even for a single unit-demand bidder [24].", "startOffset": 237, "endOffset": 241}, {"referenceID": 29, "context": "Often we can observe the actions used by bidders in non-truthful auctions that were previously run, and use these observations to estimate the distributions over valuations using econometric methods [30, 37, 4].", "startOffset": 199, "endOffset": 210}, {"referenceID": 36, "context": "Often we can observe the actions used by bidders in non-truthful auctions that were previously run, and use these observations to estimate the distributions over valuations using econometric methods [30, 37, 4].", "startOffset": 199, "endOffset": 210}, {"referenceID": 3, "context": "Often we can observe the actions used by bidders in non-truthful auctions that were previously run, and use these observations to estimate the distributions over valuations using econometric methods [30, 37, 4].", "startOffset": 199, "endOffset": 210}, {"referenceID": 24, "context": "For example, given sample access to any single-item marginal, the DKW inequality [25] implies that O(log(1/δ)/ǫ2) samples suffice to learn it to within ǫ in Kolmogorov distance, with probability at least 1 − δ.", "startOffset": 81, "endOffset": 85}, {"referenceID": 10, "context": "Our results for mechanisms make use of recent work on the revenue guarantees of simple mechanisms, which are mainly variants of sequential posted pricing mechanisms [11, 13].", "startOffset": 165, "endOffset": 173}, {"referenceID": 12, "context": "Our results for mechanisms make use of recent work on the revenue guarantees of simple mechanisms, which are mainly variants of sequential posted pricing mechanisms [11, 13].", "startOffset": 165, "endOffset": 173}, {"referenceID": 0, "context": "In particular, our sample-based result for unit-demand bidders robustifies the ex-ante relaxation of the revenue maximization problem from [1] and its conversion to a sequential posted pricing mechanism from [15], and makes use of the extreme-value theorem for regular distributions from [7].", "startOffset": 139, "endOffset": 142}, {"referenceID": 14, "context": "In particular, our sample-based result for unit-demand bidders robustifies the ex-ante relaxation of the revenue maximization problem from [1] and its conversion to a sequential posted pricing mechanism from [15], and makes use of the extreme-value theorem for regular distributions from [7].", "startOffset": 208, "endOffset": 212}, {"referenceID": 6, "context": "In particular, our sample-based result for unit-demand bidders robustifies the ex-ante relaxation of the revenue maximization problem from [1] and its conversion to a sequential posted pricing mechanism from [15], and makes use of the extreme-value theorem for regular distributions from [7].", "startOffset": 288, "endOffset": 291}, {"referenceID": 41, "context": "Our sample-based result for additive bidders shows how to use samples to design mechanisms that approximate the revenue of Yao’s VCG with entry fees mechanism [42].", "startOffset": 159, "endOffset": 163}, {"referenceID": 12, "context": "Our sample-based results for XOS bidders show how to use samples to approximate the parameters of the RSPM and ASPE mechanisms of [13], and argue, by re-doing their duality proofs, that their revenue guarantees are robust to errors in the approximation.", "startOffset": 130, "endOffset": 134}, {"referenceID": 12, "context": "Finally, our sample based result for symmetric subadditive bidders is based on a new, duality based, approximation, showing how to eliminate the use of ASPEs from the result of [13].", "startOffset": 177, "endOffset": 181}, {"referenceID": 39, "context": "[40] For every bidder i, whose type ti is drawn from a product distribution Fi = ×jFij , her distribution, Vi, over valuation functions vi(ti, ·) is subadditive over independent items if: vi(·, ·) has no externalities, i.", "startOffset": 0, "endOffset": 4}, {"referenceID": 39, "context": "[40] We may instantiate Definition 1 to define restricted families of subadditive valuations as follows.", "startOffset": 0, "endOffset": 4}, {"referenceID": 27, "context": "additive [28] n regular Ω(OPT) 1 additive n arbitrary [0,H] Ω(OPT)− ǫ ·H poly(n,m, 1/ǫ)", "startOffset": 9, "endOffset": 13}, {"referenceID": 34, "context": "unit-demand [35] n arbitrary [0,H] Ω(OPT)− ǫ ·H poly(n,m, 1/ǫ) unit-demand n regular Ω(OPT) poly(n,m)", "startOffset": 12, "endOffset": 16}, {"referenceID": 34, "context": "subadditive [35] 1 arbitrary [0,H] Ω(OPT)− ǫ ·H poly(m, 1/ǫ) subadditive n i.", "startOffset": 12, "endOffset": 16}, {"referenceID": 24, "context": "In fact, our sample complexity bound can be improved to O ( d2 ǫ2 · log d δ ) , as O ( log 1 δ ǫ2 ) samples suffice to guarantee (ǫ, δ)-uniform convergence for all intervals in R due to the DKW inequality [25].", "startOffset": 205, "endOffset": 209}, {"referenceID": 12, "context": "Cai and Zhao [13] recently showed that if the bidders’ valuations are XOS", "startOffset": 13, "endOffset": 17}, {"referenceID": 12, "context": "Proving that the total variation distance between L and L̂ is no more than 2m · ξ is the same as proving that for any K ≤ 2|S|, ∣∣ PrD [ t ∈ ⋃K l=1 ERl ] − PrD̂ [ t ∈ ⋃K l=1 ERl ∣∣ ≤ 2m · ξ where R1, · · ·RK are arbitrary distinct subsets of Cai and Zhao [13] showed that the best ASPE or RSPM achieves a constant fraction of the optimal revenue.", "startOffset": 255, "endOffset": 259}, {"referenceID": 14, "context": "It is shown in a sequence of works [15, 32, 11] that there exists a sequential posted price mechanism (SPM see Algorithm 2 for details) that achieves at least 1 24 of the optimal revenue when bidders are unit-demand.", "startOffset": 35, "endOffset": 47}, {"referenceID": 31, "context": "It is shown in a sequence of works [15, 32, 11] that there exists a sequential posted price mechanism (SPM see Algorithm 2 for details) that achieves at least 1 24 of the optimal revenue when bidders are unit-demand.", "startOffset": 35, "endOffset": 47}, {"referenceID": 10, "context": "It is shown in a sequence of works [15, 32, 11] that there exists a sequential posted price mechanism (SPM see Algorithm 2 for details) that achieves at least 1 24 of the optimal revenue when bidders are unit-demand.", "startOffset": 35, "endOffset": 47}, {"referenceID": 34, "context": "Sample Access to Bounded Distributions: the result is due to Morgenstern and Roughgarden [35].", "startOffset": 89, "endOffset": 93}, {"referenceID": 0, "context": "Direct Access to Approximate Distributions: we first consider a convex program based on D (see Figure 1) which is usually referred to as the ex-ante relaxation of the revenue maximization problem [1], and use its optimum as a proxy for OPT.", "startOffset": 196, "endOffset": 199}, {"referenceID": 14, "context": "[15] to convert the optimal solution of the second convex program into a randomized SPM.", "startOffset": 0, "endOffset": 4}, {"referenceID": 6, "context": "We show how to use the Extreme Value theorem in [7] to truncate the distributions without hurting the revenue by much.", "startOffset": 48, "endOffset": 51}, {"referenceID": 41, "context": "It is known that the better of the following two mechanisms achieves at least 18 of the optimal revenue when all bidders have additive valuations [42, 11]: Selling Separately: the mechanism sells each item separately using Myerson’s optimal auction.", "startOffset": 146, "endOffset": 154}, {"referenceID": 10, "context": "It is known that the better of the following two mechanisms achieves at least 18 of the optimal revenue when all bidders have additive valuations [42, 11]: Selling Separately: the mechanism sells each item separately using Myerson’s optimal auction.", "startOffset": 146, "endOffset": 154}, {"referenceID": 41, "context": "Indeed, only counting the revenue from the entry fee in the second mechanism and the optimal revenue from selling the items separately already suffices to provide an 8-approximation [42, 11].", "startOffset": 182, "endOffset": 190}, {"referenceID": 10, "context": "Indeed, only counting the revenue from the entry fee in the second mechanism and the optimal revenue from selling the items separately already suffices to provide an 8-approximation [42, 11].", "startOffset": 182, "endOffset": 190}, {"referenceID": 10, "context": "Theorem 6 ([11]).", "startOffset": 11, "endOffset": 15}, {"referenceID": 27, "context": "Goldner and Karlin [28] showed that one sample suffices to learn a mechanism that achieves a constant fraction of the optimal revenue when Dij is regular for all i ∈ [n] and j ∈ [m].", "startOffset": 19, "endOffset": 23}, {"referenceID": 27, "context": "Sample Access to Bounded Distributions: Goldner and Karlin’s proof [28] can be directly applied to the bounded distributions to show a single sample suffices to learn a mechanism whose expected revenue approximates the BREV.", "startOffset": 67, "endOffset": 71}, {"referenceID": 34, "context": "Then as SREV is the revenue of m separate single-item auctions, we can use the result in [35] to approximate it.", "startOffset": 89, "endOffset": 93}, {"referenceID": 41, "context": "The entry fee function defined in [42, 11] is slightly different.", "startOffset": 34, "endOffset": 42}, {"referenceID": 10, "context": "The entry fee function defined in [42, 11] is slightly different.", "startOffset": 34, "endOffset": 42}, {"referenceID": 12, "context": "The better of the following two mechanisms is known to achieve a constant fraction of the optimal revenue, when bidders have valuations that are XOS over independent items [13].", "startOffset": 172, "endOffset": 176}, {"referenceID": 12, "context": "[13] There exists a collection of prices {pj}j∈[m], such that if we set the entry fee function δ∗ i (S) to be the median of bidder i’s utility for set S, either the ASPE(p ∗, δ∗) or the best RSPM achieves at least a constant fraction of the optimal revenue when bidders’ valuations are XOS over independent items.", "startOffset": 0, "endOffset": 4}, {"referenceID": 13, "context": "For any ǫ > 0 and μ ∈ [0, 14 ], let {p ′ j}j∈[m] be a collection of prices such that |p ′ j − p ∗ j | ≤ ǫ for all j ∈ [m], where {pj}j∈[m] is the collection of prices in Theorem 8.", "startOffset": 22, "endOffset": 30}, {"referenceID": 0, "context": "For bidders with valuations that are XOS over independent items and any ǫ > 0, there exists a collection of prices {pj}j∈[m] in the 2G-bounded ǫ-net such that for any μ-balanced entry fee functions {δi(·)}i∈[n] with μ ∈ [0, 1 4 ], either the ASPE(p, δ) or the best RSPM achieves revenue at least OPT C1(μ) − C2(μ) · (m+ n) · ǫ.", "startOffset": 220, "endOffset": 229}, {"referenceID": 3, "context": "For bidders with valuations that are XOS over independent items and any ǫ > 0, there exists a collection of prices {pj}j∈[m] in the 2G-bounded ǫ-net such that for any μ-balanced entry fee functions {δi(·)}i∈[n] with μ ∈ [0, 1 4 ], either the ASPE(p, δ) or the best RSPM achieves revenue at least OPT C1(μ) − C2(μ) · (m+ n) · ǫ.", "startOffset": 220, "endOffset": 229}, {"referenceID": 12, "context": "estimates all the parameters needed to run the RSPM and ASPE used in [13].", "startOffset": 69, "endOffset": 73}, {"referenceID": 0, "context": "For any single dimensional distribution D with cdf F , we define its revenue curve RD : [0, 1] 7→ R≥0 as RD(q) =maxx · ̄ q · F(1− ̄ q) + (1− x) · q̄ · F(1− q̄) s.", "startOffset": 88, "endOffset": 94}, {"referenceID": 0, "context": "x · ̄ q + (1− x) · q̄ = q x, ̄ q, q̄ ∈ [0, 1]", "startOffset": 39, "endOffset": 45}, {"referenceID": 0, "context": "Let φij(·) and φ̂ij(·) be the ironed virtual value function for distribution Dij and D̂ij respectively, then for any q ∈ [0, 1], RDij (q) = ∫H F ij (1−q) φ(x)dF (x) and RD̂ij(q) = ∫H F̂ ij (1−q) φ̂(x)dF (x).", "startOffset": 121, "endOffset": 127}, {"referenceID": 14, "context": "Single-Dimensional Copies Setting: In the analysis for unit-demand bidders in [15, 11], the optimal revenue is upper bounded by the optimal revenue in the single-dimensional copies setting defined in [15].", "startOffset": 78, "endOffset": 86}, {"referenceID": 10, "context": "Single-Dimensional Copies Setting: In the analysis for unit-demand bidders in [15, 11], the optimal revenue is upper bounded by the optimal revenue in the single-dimensional copies setting defined in [15].", "startOffset": 78, "endOffset": 86}, {"referenceID": 14, "context": "Single-Dimensional Copies Setting: In the analysis for unit-demand bidders in [15, 11], the optimal revenue is upper bounded by the optimal revenue in the single-dimensional copies setting defined in [15].", "startOffset": 200, "endOffset": 204}, {"referenceID": 10, "context": "As shown in [11], OPT ≤ 4OPT.", "startOffset": 12, "endOffset": 16}, {"referenceID": 14, "context": "[15] showed that OPT ≤ ∑ i,j RDij (qij).", "startOffset": 0, "endOffset": 4}, {"referenceID": 14, "context": "This is exactly the copies setting used in [15], if every bidder i is unit-demand and has value Vi(tij) with type ti.", "startOffset": 43, "endOffset": 47}, {"referenceID": 14, "context": "If we know all Fij exactly, we can solve the convex program (Figure 1) and use the optimal solution to construct an SPM via an approach provided in [15, 11].", "startOffset": 148, "endOffset": 156}, {"referenceID": 10, "context": "If we know all Fij exactly, we can solve the convex program (Figure 1) and use the optimal solution to construct an SPM via an approach provided in [15, 11].", "startOffset": 148, "endOffset": 156}, {"referenceID": 0, "context": "For any bidder i and item j, let ̄ q∗ ij, q̄ ∗ ij and xij ∈ [0, 1] be the numbers satisfy that xij · ̄ q∗ ij ·Fij (1− ̄ q∗ ij)+(1−xij)· q̄ ∗ ij ·Fij (1− q̄∗ ij) = RDij (q ∗ ij) and xij · ̄ q∗ ij+(1−xij)· q̄ ∗ ij = q ∗ ij .", "startOffset": 60, "endOffset": 66}, {"referenceID": 0, "context": "For any bidder i and item j, let ̄ qij, q̄ij and xij ∈ [0, 1] be the numbers satisfying xij · ̄ qij · F̂ −1 ij (1− ̄ qij)+(1−xij) · q̄ij · F̂ −1 ij (1− q̄ij) = RD̂ij (qij) and xij ̄ qij +(1−xij) · q̄ij = qij .", "startOffset": 55, "endOffset": 61}, {"referenceID": 34, "context": "[35] WhenDij is supported on [0,H] for all bidder i and item j, the sample complexity for (ǫ, δ)uniformly learning the revenue of SPMs for unit-demand bidders isO (( 1 ǫ )2 ( m2n log n log 1ǫ + log 1 δ )) .", "startOffset": 0, "endOffset": 4}, {"referenceID": 6, "context": "[7] For any regular distribution F , let RF (·) be the corresponding revenue curve.", "startOffset": 0, "endOffset": 3}, {"referenceID": 24, "context": "According to the Dvoretzky-Kiefer-Wolfowitz (DKW) inequality [25], if we take O ( d2Z2n2m2 · log nm δ ) samples fromD′ ij (we can take samples fromDij then cap the samples at Hij) and let D̂ ′ ij be the uniform distribution over the samples, ∣∣ ∣∣D′ ij − D̂′ ij ∣∣ ∣∣ K ≤ 1 d·Znm with probability 1− δ 2nm .", "startOffset": 61, "endOffset": 65}, {"referenceID": 27, "context": "As shown by Goldner and Karlin [28], one sample suffices to design a mechanism that approximates BREV.", "startOffset": 31, "endOffset": 35}, {"referenceID": 34, "context": "The first half of the Lemma was proved by Morgenstern and Roughgarden [35].", "startOffset": 70, "endOffset": 74}, {"referenceID": 40, "context": "By the prophet inequality [41], there exists an SPM for selling item j with a collection of prices {pij}i∈[n] that achieves revenue at least OPTj/2.", "startOffset": 26, "endOffset": 30}, {"referenceID": 0, "context": "lies in [ 1 4 , 3 8 ] .", "startOffset": 8, "endOffset": 21}, {"referenceID": 3, "context": "lies in [ 1 4 , 3 8 ] .", "startOffset": 8, "endOffset": 21}, {"referenceID": 2, "context": "lies in [ 1 4 , 3 8 ] .", "startOffset": 8, "endOffset": 21}, {"referenceID": 7, "context": "lies in [ 1 4 , 3 8 ] .", "startOffset": 8, "endOffset": 21}, {"referenceID": 0, "context": "Pr ti∼Di [ Ei,b−i,di(b−i) ] ∈ [ 1 8 , 1 2 ],", "startOffset": 30, "endOffset": 43}, {"referenceID": 7, "context": "Pr ti∼Di [ Ei,b−i,di(b−i) ] ∈ [ 1 8 , 1 2 ],", "startOffset": 30, "endOffset": 43}, {"referenceID": 0, "context": "Pr ti∼Di [ Ei,b−i,di(b−i) ] ∈ [ 1 8 , 1 2 ],", "startOffset": 30, "endOffset": 43}, {"referenceID": 1, "context": "Pr ti∼Di [ Ei,b−i,di(b−i) ] ∈ [ 1 8 , 1 2 ],", "startOffset": 30, "endOffset": 43}, {"referenceID": 12, "context": "In [13], Cai and Zhao constructed an upper bound of the optimal revenue using duality and separated the upper bound into three components: SINGLE, TAIL and CORE.", "startOffset": 3, "endOffset": 7}, {"referenceID": 12, "context": "It turns out one can use essentially the same proof as in [13] to prove that the mechanism ASPE(p′, δ′) has revenue at least a1(μ) · CORE − a2(μ) · POSTREV − a3(μ) · (n + m) · ǫ where a1(μ), a2(μ) and a3(μ) are functions that map μ to positive numbers.", "startOffset": 58, "endOffset": 62}, {"referenceID": 0, "context": "For any B > 0, ǫ > 0, η ∈ [0, 1] and μ ∈ [0, 1 4 ], suppose we take K = O ( log 1 η +logn+m log B ǫ μ2 )", "startOffset": 26, "endOffset": 32}, {"referenceID": 0, "context": "For any B > 0, ǫ > 0, η ∈ [0, 1] and μ ∈ [0, 1 4 ], suppose we take K = O ( log 1 η +logn+m log B ǫ μ2 )", "startOffset": 41, "endOffset": 50}, {"referenceID": 3, "context": "For any B > 0, ǫ > 0, η ∈ [0, 1] and μ ∈ [0, 1 4 ], suppose we take K = O ( log 1 η +logn+m log B ǫ μ2 )", "startOffset": 41, "endOffset": 50}, {"referenceID": 0, "context": "For any B ≥ 2G, ǫ, ǫ′ > 0, η ∈ [0, 1] and μ ∈ [0, 14 ], suppose for every collection of prices {pj}j∈[m] in the B-bounded ǫ-net, {δ (p) i (·)}i∈[n] is a collection of μ-balanced entry fee functions.", "startOffset": 31, "endOffset": 37}, {"referenceID": 13, "context": "For any B ≥ 2G, ǫ, ǫ′ > 0, η ∈ [0, 1] and μ ∈ [0, 14 ], suppose for every collection of prices {pj}j∈[m] in the B-bounded ǫ-net, {δ (p) i (·)}i∈[n] is a collection of μ-balanced entry fee functions.", "startOffset": 46, "endOffset": 54}, {"referenceID": 0, "context": "Let μ be some fixed constant in [0, 1 4 ], B = 2H , ǫ = ξ·H 6C2(μ)(m+n) and ǫ′ = ξ 12mn .", "startOffset": 32, "endOffset": 41}, {"referenceID": 3, "context": "Let μ be some fixed constant in [0, 1 4 ], B = 2H , ǫ = ξ·H 6C2(μ)(m+n) and ǫ′ = ξ 12mn .", "startOffset": 32, "endOffset": 41}, {"referenceID": 0, "context": "LetB = 2 ·maxi,j Wij , μ be some fixed constant in [0, 1 4 ], ǫ = ξ·B C2(μ)Z(m+n) and ǫ′ = ξ 2mnZ for some small constant ξ, which will be specified later.", "startOffset": 51, "endOffset": 60}, {"referenceID": 3, "context": "LetB = 2 ·maxi,j Wij , μ be some fixed constant in [0, 1 4 ], ǫ = ξ·B C2(μ)Z(m+n) and ǫ′ = ξ 2mnZ for some small constant ξ, which will be specified later.", "startOffset": 51, "endOffset": 60}, {"referenceID": 12, "context": "In this section, we introduce an upper bound to OPT based on duality [13], which is crucial for us to prove the approximation ratios of our learning algorithms.", "startOffset": 69, "endOffset": 73}, {"referenceID": 12, "context": "In [13], an upper bound of the optimal revenue is derived using duality theory.", "startOffset": 3, "endOffset": 7}, {"referenceID": 12, "context": "It was shown in [13] that every collection of thresholds induces an upper bound to the optimal revenue.", "startOffset": 16, "endOffset": 20}, {"referenceID": 12, "context": "2 · SINGLE(M,β) + 4 · TAILη(M,β) + 4 · COREη(M,β) (Adapted from Theorem 2 in [13]).", "startOffset": 77, "endOffset": 81}, {"referenceID": 12, "context": "We refer interested readers to [13] for the definitions of these terms.", "startOffset": 31, "endOffset": 35}, {"referenceID": 12, "context": "For readers that are familiar with the definition of the CORE in [13], COREη(β) is essentially the same term but adapted for symmetric bidders.", "startOffset": 65, "endOffset": 69}, {"referenceID": 12, "context": "In [13], the thresholds are allowed to depend on the identity of the bidder.", "startOffset": 3, "endOffset": 7}, {"referenceID": 12, "context": "What Cai and Zhao [13] showed was that when the thresholds are b-balanced, this upper bound can indeed be approximated by the revenue of an RSPM and an ASPE.", "startOffset": 18, "endOffset": 22}, {"referenceID": 12, "context": "Using results in [13], we can further simplify the benchmark.", "startOffset": 17, "endOffset": 21}, {"referenceID": 12, "context": "Theorem 17 (Adapted from [13]).", "startOffset": 25, "endOffset": 29}, {"referenceID": 22, "context": "Lemma 21 (Supporting Prices [23]).", "startOffset": 28, "endOffset": 32}, {"referenceID": 12, "context": "Cai and Zhao [13] showed how to use an ASPE to approximate this term.", "startOffset": 13, "endOffset": 17}, {"referenceID": 12, "context": "(Adapted from [13]) Let every bidder i’s valuation be v(ti, S) = v (ti, S ∩ Cη(ti)) when her type is ti and σ ∗ be a symmetric allocation that achieves α-fraction of the optimal social welfare with respect to v′(·, ·).", "startOffset": 14, "endOffset": 18}, {"referenceID": 12, "context": "We can essentially use the same proof in [13] to prove that the expected revenue of the ASPE is at least ∑", "startOffset": 41, "endOffset": 45}, {"referenceID": 12, "context": "For readers that are familiar with that proof, the only thing we need to make sure is that our choice of σ∗ and {βj}j∈[m] satisfy Lemma 5 in [13].", "startOffset": 141, "endOffset": 145}, {"referenceID": 0, "context": "For any ǫ > 0 and μ ∈ [0, 1 4 ], let {Qj}j∈[m] be a collection of prices such that |Qj −Qη,j | ≤ ǫ for all j ∈ [m].", "startOffset": 22, "endOffset": 31}, {"referenceID": 3, "context": "For any ǫ > 0 and μ ∈ [0, 1 4 ], let {Qj}j∈[m] be a collection of prices such that |Qj −Qη,j | ≤ ǫ for all j ∈ [m].", "startOffset": 22, "endOffset": 31}, {"referenceID": 12, "context": "It turns out the proof in [13] is robust enough to accommodate the error ǫ and μ.", "startOffset": 26, "endOffset": 30}, {"referenceID": 12, "context": "We can prove the claim by following essentially the same analysis as in [13].", "startOffset": 72, "endOffset": 76}, {"referenceID": 24, "context": "According to the DKWTheorem [25], with probability at least 1− δ/m, ∣∣∣∣ Pr tj∼Dj [V (tj) ≥ x]− Pr vj∼Fj [vj ≥ x] ∣∣∣∣ ≤ 1 c ·mn2 for all x (6)", "startOffset": 28, "endOffset": 32}, {"referenceID": 26, "context": "As showed by Feige [27], there exists a polynomial time algorithm that achieves 1− 1e fraction of the optimal social welfare when bidders have XOS valuations.", "startOffset": 19, "endOffset": 23}, {"referenceID": 20, "context": "[21] and Roughgarden et al.", "startOffset": 0, "endOffset": 4}, {"referenceID": 38, "context": "[39].", "startOffset": 0, "endOffset": 4}, {"referenceID": 20, "context": "The mechanism in [21] or [39] provides an approximately optimal prior-independent mechanism in the induced unit-demand setting.", "startOffset": 17, "endOffset": 21}, {"referenceID": 38, "context": "The mechanism in [21] or [39] provides an approximately optimal prior-independent mechanism in the induced unit-demand setting.", "startOffset": 25, "endOffset": 29}], "year": 2017, "abstractText": "We provide algorithms that learn simple auctions whose revenue is approximately optimal in multi-item multi-bidder settings, for a wide range of bidder valuations including unit-demand, additive, constrained additive, XOS, and subadditive. We obtain our learning results in two settings. The first is the commonly studied setting where sample access to the bidders’ distributions over valuations is given, for both regular distributions and arbitrary distributions with bounded support. Here, our algorithms require polynomially many samples in the number of items and bidders. The second is a more general max-min learning setting that we introduce, where we are given “approximate distributions,” and we seek to compute a mechanism whose revenue is approximately optimal simultaneously for all “true distributions” that are close to the ones we were given. These results are more general in that they imply the sample-based results, and are also applicable in settings where we have no sample access to the underlying distributions but have estimated them indirectly via market research or by observation of bidder behavior in previously run, potentially non-truthful auctions. All our results hold for valuation distributions satisfying the standard (and necessary) independenceacross-items property. They also generalize and improve upon recent works of Goldner and Karlin [28] and Morgenstern and Roughgarden [35], which have provided algorithms that learn approximately optimal multi-item mechanisms in more restricted settings with additive, subadditive and unit-demand valuations using sample access to distributions. We generalize these results to the complete unit-demand, additive, and XOS setting, to i.i.d. subadditive bidders, and to the max-min setting. Our results are enabled by new uniform convergence bounds for hypotheses classes under product measures. Our bounds result in exponential savings in sample complexity compared to bounds derived by bounding the VC dimension, and are of independent interest.", "creator": "LaTeX with hyperref package"}}}