{"id": "1206.6867", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Jun-2012", "title": "Axiomatic Foundations for a Class of Generalized Expected Utility: Algebraic Expected Utility", "abstract": "Expected Utility: Algebraic Expected Utility In always paper, we help taking axiomatizations which constants for controls, which is from particular implies while utility, throughout a hagens Neumann - Morgenstern full, i. telegram. deepening representation appears exactly would be gave and visit but now regarded saw a plausibility resolution 50,000 on of semiring, or unable be partially officials. We appears that axioms structure to more taking week purchasing entail only preferences more constituency by latter algorithms end utility. This algebraic self need many previous priori (expected utility, spectral possibilistic utility, .. .) as rest theocratic another made from general framework however proves that in obtained utility deserves while once fun features when unlikely insurance: westernisation, dynamic persistence, autoduality of form depends worsening action, autoduality a all clear canonical although yet called modeling decision cola ' ends conscious continuing disappointment.", "histories": [["v1", "Wed, 27 Jun 2012 16:29:06 GMT  (120kb)", "http://arxiv.org/abs/1206.6867v1", "Appears in Proceedings of the Twenty-Second Conference on Uncertainty in Artificial Intelligence (UAI2006)"]], "COMMENTS": "Appears in Proceedings of the Twenty-Second Conference on Uncertainty in Artificial Intelligence (UAI2006)", "reviews": [], "SUBJECTS": "cs.AI cs.GT", "authors": ["paul weng"], "accepted": false, "id": "1206.6867"}, "pdf": {"name": "1206.6867.pdf", "metadata": {"source": "CRF", "title": "Axiomatic Foundations for a Class of Generalized Expected Utility: Algebraic Expected Utility", "authors": ["Paul Weng"], "emails": [], "sections": [{"heading": null, "text": "In this paper, we provide two axiomatizations of algebraic expected utility, which is a particular generalized expected utility, in a von NeumannMorgenstern setting, i.e. uncertainty representation is supposed to be given and here to be described by a plausibility measure valued on a semiring, which could be partially ordered. We show that axioms identical to those for expected utility entail that preferences are represented by an algebraic expected utility. This algebraic approach allows many previous propositions (expected utility, binary possibilistic utility,...) to be unified in a same general framework and proves that the obtained utility enjoys the same nice features as expected utility: linearity, dynamic consistency, autoduality of the underlying uncertainty representation, autoduality of the decision criterion and possibility of modeling decision maker’s attitude toward uncertainty."}, {"heading": "1 INTRODUCTION", "text": "Axiomatic justification of a decision model is essential as it underlines the properties of the decision model and reveals what decision behavior it can or cannot describe. The seminal work presented in von Neumann and Morgenstern (1944) made expected utility (EU) the first axiomatized decision model. This axiomatization was then reformulated and simplified (Fishburn (1970); Machina (1988)). In von Neumann-Morgenstern (vNM) like axiomatizations, (objective) probabilities are assumed to be given. This assumption is relaxed in the axiomatization proposed by Savage (1954). In such a setting, (subjective) probabilities are constructed from the preferences of the decision maker if and only if some required axioms are satisfied. However the assumption that the uncertainty is represented by objective probability (vNM setting) or the requirement of axioms leading to the construction of subjective probability\n(Savagean setting) can be debatable in some situations, especially those where data are imprecise and/or scarce (Ellsberg (1961)). Moreover, even when the decision problem imposes probability as the natural uncertainty measure, it can be difficult to assess.\nTo tackle these difficulties, other models for uncertainty have been proposed as generalizations of probability: belief functions (Shafer (1976)), κ-rankings (Spohn (1988); Goldszmidt and Pearl (1992)), possibility theory (Dubois and Prade (1990)), symbolic probability (Darwiche and Ginsberg (1992)) to name a few. They are all instances of plausibility measures (not to be confused with plausibility functions) introduced by Friedman and Halpern (1995).\nFor all these uncertainty representations, decision models have been proposed (Jaffray and Wakker (1993); Giang and Shenoy (2000); Dubois and Prade (1995),...). Some of these already proposed criteria share some formal similarities. This fact has been recently underlined in Giang and Sandilya (2004) who axiomatically justified a general decision model based on symbolic probabilities. Earlier, Dubois et al. (1996) studied a general class of real-valued decision criteria based on triangular norms (Klement et al. (2000)). One of the motivations of our work is to formally highlight the similarities of this class of criteria exploiting generalized expected utility introduced by Chu and Halpern (2003a,b). This is a very general decision criterion, built on top of plausibility measures.\nMore specifically, we provide two axiomatizations in a vNM setting for a class of generalized expected utility: algebraic expected utility (AEU). Uncertainty representation is supposed to be given and modeled by plausibility measures valued on a semiring, which could be partially ordered. Approaches relying on semirings have proved to be able to offer a unified treatment to many variations of the same problem (see Gondran et al. (1984) for graph problems, Bistarelli et al. (1999) for constraint satisfaction problems and Perny et al. (2005) for Markov decision processes). The first axiomatization, similar to that of Luce and Raiffa (1957), is a reformulation in a vNM setting of the one proposed in Giang and Sandilya (2004). The sec-\nond one inspired by that of Machina (1988) is based on simpler and more natural postulates but requires two solvability assumptions. This algebraic treatment allows the counterpart of expected utility to be formulated for many uncertainty representations, thus unifying many different models in a same general formalization. Moreover this unification emphasizes that these decision models all enjoy the same nice formal properties as expected utility: linearity, dynamic consistency allowing an easy integration of AEU in sequential decision making, especially in algebraic Markov decision processes (Perny et al. (2005)), autoduality of the underlying uncertainty representation, autoduality of the decision criterion and possibility of modeling decision maker’s attitude toward uncertainty.\nThe rest of the paper is divided as follows. In Section 2 we introduce the required definitions: formalization of a decision problem, plausibility measures, semiring, binary scale and generalized expected utility. In Section 3 we present the two sets of axioms and the two representation theorems for algebraic expected utility. Then we underline its properties in Section 4. In Section 5 we compare our approach with related works. Finally we wrap up in Section 6."}, {"heading": "2 FRAMEWORK", "text": "In decision making under uncertainty, an agent has to make a choice among a set of alternatives or acts that are functions from a set of states of the world to a set of consequences. A state of the world can be thought of as a complete description of the environment. Uncertainty about the exact consequence of an act results from the fact that the decision maker does not know in which state he/she is. It is thus modeled as uncertainty about the actual state of the world. This can be formalized by: • X = {x1, . . . , xn} a finite set of consequences with a\nbest consequence x and a worst one x. • S a set of states of the world. • A a set of acts defined as XS . The decision maker’s preference relation (which is simply a binary relation) over the set of acts is denoted by %, which reads “at least as good as”. Acts will be denoted f, g, . . . Relation % restricted to constant acts (consequences) is denoted %X . Relations ≻ and ∼ denote respectively the asymmetric and the symmetric part of %.\nEvents in this context are defined as elements of an algebra F of subsets of S, i.e. a set of subsets closed under finite union and complementation. Events will be denoted A,B, . . . We assume that uncertainty about the actual state is captured by plausibility measures (Friedman and Halpern (1995)). A plausibility measure Pl is a function from F to a (possibly partially) ordered scale P such that Pl(∅) = 0P , Pl(S) = 1P and ∀A,B ∈ F , B ⊆ A ⊆ S ⇒ Pl(A)≥Pl(B). Scale P is assumed to be endowed with two internal operators ⊕ and ⊗ (the analogs of + and\n× in probability theory), a (possibly partial) order relation ≥, and two special elements 0P and 1P . Elements of this scale will be denoted λ, µ, . . . We assume here that Pl is decomposable, i.e. Pl(A ∪ B) = Pl(A)⊕Pl(B) for any pair A,B of disjoint events and Pl(A ∩ B) = Pl(A)⊗Pl(B) for any pair A,B of plausibilistically independent events.\nFrom now on, structure (P,⊕,⊗, 0P , 1P ) is assumed to be a semiring (see Gondran et al. (1984)).\nDefinition 1 A semiring (P,⊕,⊗,0,1) is a set P with two binary operations ⊕ and ⊗, such that:\nA1 (P,⊕,0) is a commutative semigroup with 0 as neutral element (a⊕b = b⊕a, (a⊕b)⊕c = a⊕(b⊕c), a⊕0 = a)."}, {"heading": "A2 (P,⊗,1) is a semigroup with 1 as neutral element, and for which 0 is an absorbing element (i.e. (a ⊗ b) ⊗ c =", "text": "a⊗ (b⊗ c), a⊗ 1 = 1 ⊗ a = a, a⊗ 0 = 0 ⊗ a = 0)."}, {"heading": "A3 ⊗ is distributive with respect to ⊕ (i.e. (a ⊕ b) ⊗ c =", "text": "(a⊗ c)⊕ (b⊗ c), a⊗ (b⊕ c) = (a⊗ b)⊕ (a⊗ c)).\nIn this setting, order ≥ is related to ⊕ and we have ∀λ, µ ∈ P, λ≥µ ⇒ ∃µ′ ∈ P, λ = µ⊕µ′. These requirements or some variants of them were also imposed in Darwiche and Ginsberg (1992); Friedman and Halpern (1995); Weydert (1994) from general scales and in Weber (1984); Dubois et al. (1996) for real scales. All these conditions are quite natural and are verified by many plausibility measures. Here are some examples. For each of them, we explicit the associated semiring. Probability is defined on semiring (R+,+,×, 0, 1). Qualitative possibility is defined on (L,max,min, 0L, 1L) where L is a finite qualitative scale with lowest element denoted 0L and greatest element 1L. Quantitative possibility is defined on ([0, 1],max,×, 0, 1). κ-rankings is defined on (N ∪ {+∞},min,+,+∞, 0). Symbolic probability is defined on (S,⊞,⊠,⊥,⊤) where S is a support set containing two special elements ⊥ and ⊤ and operators ⊞ and ⊠ play similar roles as ⊕ and ⊗.\nFrom P , a particular binary scale P2 can be constructed.\nP2 = {〈λ, µ〉 ∈ P × P : λ⊕µ = 1P }.\nElements of P2 will be denoted α, β, . . . where α = (α1, α2), β = (β1, β2) with α1, α2, β1, β2 in P . The couples in this set can be interpreted as plausibility values. The first (resp. second) element of a couple would measure the plausibility of getting the best (resp. worst) outcome. Then a natural order ≥2 can be defined over P2 from ≥ of P , i.e.\n〈λ, µ〉≥2〈λ ′, µ′〉 ⇔ (λ≥λ′ and µ′≥µ).\nOperator ⊕ is extended as an operator on P2 × P2 as follows: 〈λ, µ〉⊕〈λ′, µ′〉 = 〈λ⊕λ′, µ⊕µ′〉. And operator ⊗ is extended as an operator on P × P2 as follows: λ′⊗〈λ, µ〉 = 〈λ′⊗λ, λ′⊗µ〉. The overloading of the operators should not pose a problem as context will make clear if operands are in scale P or scale P2.\nWe now define the artifacts by which acts are compared. A simple lottery π, which is just a plausibility distribution,\nis defined as a function from the set of consequences X to the qualitative scale P , such that ⊕\nx∈X π(x) = 1P . The set of all such lotteries is denoted by Π(X) = {π ∈ PX : ⊕\nx∈X π(x) = 1P }. Recursively we define the set of compound lotteries that are lotteries over lotteries: Π1(X) = Π(X) and Πk(X) = Πk−1(Π(X)),∀k > 1. The set of all (simple and compound) lotteries is then denoted by Π∞(X) = ∪∞k=1Π\nk(X). For ease of notation, x denotes both an element of X and the degenerated lottery πx ∈ Π(X) such that πx(x) = 1P and πx(z) = 0P ,∀z 6= x. As the set of consequences is finite, a simple lottery π can be written: [λ1/x1, . . . , λn/xn] where ⊕n\ni=1 λi = 1P . And more generally, a compound lottery with k outcomes is written: [λ1/π1, . . . , λk/πk] where ⊕k\ni=1 λi = 1P and ∀i = 1 . . . k, πi ∈ Π ∞(X).\nAny act is associated with a unique lottery. For an act f ∈ A, the associated lottery πf is defined by πf (x) = Pl({s ∈ S : f(s) = x}),∀x ∈ X . We assume that comparing acts is equivalent to comparing their associated lotteries. Then the preference relation over acts induces a preference relation over lotteries, which we also denote %. From now on, we work directly on lotteries.\nUsing plausibility measures, Chu and Halpern (2003a,b) proposed generalized expected utility (GEU) as a decision criterion. In this model, a set U endowed with %U describes the tastes of the decision maker about consequences and a set V endowed with %V , which is the valuation set for GEU, describes the preferences of the decision maker about acts. Then GEU is defined over an expectation domain (U,P, V,⊕g,⊗g) where ⊕g : V × V → V and ⊗g : P × U → V are the counterparts of + and × in probabilistic expected utility, and the four following conditions are required:\nB1 (x⊕ g y)⊕g z = x⊕g (y ⊕g z), B2 x⊕ g y = y ⊕g x, B3 1P ⊗ g x = x,\nB4 (U,%U ) is a substructure of (V,%V ).\nFor any act, GEU writes:\nGEU(π) = ⊕\nx∈X\ng\nπ(x)⊗g u(x)\nwhere u : X → U is a basic utility assignment.\nGEU is a very general decision model and as shown in their papers, GEU can represent any preference relation. As an example, the expectation domain of EU is ([0, 1], [0, 1], [0, 1],+,×). Exploiting this framework, we want to construct the counterpart of expected utility for plausibility measures satisfying requirements A1-A3."}, {"heading": "3 ALGEBRAIC EU", "text": "Algebraic expected utility (AEU) is a GEU defined on the expectation domain (P2, P, P2,⊕,⊗). It writes:\nAEU(π) = ⊕\nx∈X π(x)⊗u(x)\nwhere u : X → P2 is a basic utility assignment.\nAs (P,⊕,⊗, 0P , 1P ) is a semiring, conditions B1-B4 are naturally satisfied. Our framework makes clear how the expectation domain is constructed.\nWe now introduce the first set of axioms, which is a reformulation in a vNM setting of axioms presented in Giang and Sandilya (2004) and are similar to those of Luce and Raiffa (1957):\nR (Reduction of lotteries) ∀x ∈ X, [λ1/π1, . . . , λm/πm](x) = m ⊕\ni=1\nλi⊗πi(x).\nC1 (Preorder) % is reflexive and transitive.\nC2 (Order over binary lotteries) α≥2β ⇔ [α1/x, α2/x]%[β1/x, β2/x].\nC3 (Substitutability) ∀i = 1 . . . k, πi∼π′i, λi ∈ P , s.t. ⊕k\ni=1 λi = 1P ⇒ [λ1/π1, . . . , λk/πk] ∼ [λ1/π ′ 1, . . . , λk/π ′ k]. C4 (Continuity on consequences) ∀x ∈ X,∃α ∈ P2 s.t. x∼[α1/x, α2/x].\nAxiom R allows compound lotteries to be reduced to simple lotteries. Under this condition, we have Π(X) = Π∞(X). Axiom C1 is a typical ordering assumption. The preorder is not assumed to be complete. Axiom C2 enforces an order over binary lotteries, i.e. lotteries having only two outcomes, the best and the worst consequences. This can be considered quite natural as it says that lotteries with a high plausibility of getting the best consequence and a low plausibility of getting the worst one are preferred. Axiom C3 states that replacing sublotteries by equivalent ones in a compound lottery yields equivalent compound lotteries. Axiom C4 says that any sure consequence is equivalent to a binary lottery.\nBased on this set of axioms, the following representation theorem for AEU can be stated:\nTheorem 1 Under condition R, preference relation % over Π∞(X) satisfies axioms C1-C4 iff there exists a basic utility assignment u : X → P2 such that ∀π, π′ ∈ Π∞(X), π % π′ ⇔ AEU(π)≥2AEU(π ′).\nProof. We only give a sketch of the proof, which is quite classic. The necessary part follows from the definition of AEU and binary scale P2. For the sufficient part, axiom C4 says that for any degenerated lottery, i.e. any consequence, one can find an equivalent binary lottery. Under condition R, axiom C3 entails that any lottery can also be reduced to a binary lottery. Axiom C1 states that comparing lotteries is equivalent to comparing their associated binary lotteries. Finally axiom C2 gives the order over binary lotteries.\nWe now present the second set of axioms.\nD1 (Preorder) % is reflexive and transitive.\nD2 (Non triviality) [λ/x, µ/x]∼[λ′/x, µ′/x]⇒ (λ = λ′ and µ = µ′)\nD3 (Weak independence) π1%π2 ⇒ ∀α ∈ P2, [α1/π1, α2/π]%[α1/π2, α2/π].\nD4 (Continuity) π1≻π2≻π3 ⇒ ∃α ∈ P2, [α1/π1, α2/π3]∼π2.\nAxiom D1 is similar to axiom C1. Axiom D2 precludes the trivial case where all lotteries are equivalent. The other axioms are inspired by the set of axioms presented by Machina (1988). Axiom D3 states that in a compound lottery replacing a sublottery by a preferred one cannot worsen that lottery. In sequential decision making, this axiom has a natural interpretation. It says that if an alternative is preferred to another one at one point in time, it will remain so at any other point. Remark that axiom D3 stated with k sublotteries would yield a stronger axiom than C3 as it would imply it. However using explicitly this axiom allows this property of AEU to be highlighted. Axiom D4 states that any two lotteries can be combined to be equivalent to any other lottery in between them. This axiom is stronger than C4 and could be replaced by it. However using this stronger version underlines another property of AEU. These axioms are well-known in decision theory and focus on how the decision maker constructs his/her preferences. Note that in this set of axioms, the order over binary lotteries is not imposed. It will result from them.\nFor this set of axioms, we need to add two requirements to enable that some equations are solvable in semiring P .\nE1 ∀α, β ∈ P2, α≥β ⇒ ∃λ ∈ P,\n{\nα1 = β1⊕λ β2 = α2⊕λ\nE2 ∀λ, µ ∈ P , ∃α ∈ P2, (λ⊕µ)⊗α = 〈λ, µ〉.\nCondition E1 says that for any two couples in P2, it is possible to degrade the best one and to upgrade the worst one to get the same couple. Condition E2 is a regularity requirement. Any sum of two elements of P can be decomposed with a couple in P2. These conditions entails that semiring P behaves well. They are naturally satisfied for all the examples of plausibility measures given in Section 2, except for symbolic probability.\nThe two following lemmas will be useful to prove the second theorem. The first one states that under certain conditions, axiom D3 implies C3.\nLemma 1 Conditions R, E1, E2 and axiom D3 ⇒ C3.\nProof. First, we prove by recursion that condition E2 can be stated on any number of elements: ∀i = 1 . . . k, λi ∈ P , ∃αi ∈ P , ⊕k i=1 αi = 1P , s.t. ( ⊕k\ni=1 λi)⊗αi = λi,∀i = 1 . . . k. This is true for k = 2 by E2. Assume that it is true for k. Take ∀i = 1 . . . k + 1, λi ∈ P . Apply the case k = 2 on ⊕k\ni=1 λi and λk+1. We get\nβ ∈ P2 such that ( ⊕k+1 i=1 λi)⊗β = 〈 ⊕k\ni=1 λi, λk+1〉. Now apply the recursion assumption on λi,∀i = 1 . . . k. We get ∀i = 1 . . . k, γi ∈ P , ⊕k\ni=1 γi = 1P , ∀i = 1 . . . k, ( ⊕k\ni=1 λi)⊗γi = λi. Then with ∀i = 1 . . . k, αi = β1⊗γi and αk+1 = β2, the property is verified.\nNow again by recursion over k, the lemma can be proved. For k = 2, this is true by axiom D3. Assume that it is true for k. Take ∀i = 1 . . . k + 1, πi, π′i ∈ Π ∞(X), πi∼π ′ i and ∀i = 1 . . . k + 1, λi ∈ P, ⊕k\ni=1 λi = 1P . Apply the extension of condition D2 on λi,∀i = 1 . . . k. We get the αi. Apply the recursion assumption on the lotteries with indices i = 1 . . . k and the αi. We have [α1/π1, . . . , αk/πk]∼[α1/π ′ 1, . . . , αk/π ′\nk]. Now apply the case k = 2 with ⊕k\ni=1 λi and λk+1. By axiom R, we obtain the desired property.\nThe second lemma says that lotteries with a high plausibility on the best consequence and a low plausibility on the worst consequence are preferred. It gives one of the implications of axiom C2.\nLemma 2 Under conditions R, E1 and E2, axioms D1 and D3, for any α, β ∈ P2, we have (α1≥β1 and β2≥α2) ⇒ [α1/x, α2/x] % [β1/x, β2/x].\nProof. By assumption, x%x. By D3, for all π in Π(X), (λ, µ) in P2, [λ/x, µ/π]%[λ/wX,µ/π]. Choose lottery π = [λ′/x, µ′/x]. By condition R, [λ⊕µ⊗λ′/x, µ⊗µ′/x]%[µ⊗λ′/x, λ⊕µ⊗µ′/x]. We want to solve the following system of equations: α1 = λ⊕β1 (1) β1 = µ⊗λ ′ (2) α2 = µ⊗µ ′ (3) β2 = λ⊕α2 (4)\nEquations 2 and 3 give µ = α2⊕β1. Conditions E1 and E2 give λ, λ′ and µ′.\nThe second representation theorem can then be stated.\nTheorem 2 Under conditions R, E1 and E2, preference relation % over Π∞(X) satisfies axioms D1-D4 iff there exists a basic utility assignment u : X → P2 such that ∀π, π′ ∈ Π∞(X), π % π′ ⇔ AEU(π)≥2AEU(π ′).\nProof. For the necessary part, assume that AEU represents the preference relation. Axioms D1 and D2 are naturally satisfied. Axiom D3 results from the semiring structure of P (distributivity of ⊗ over ⊕) and condition R. For axiom D4, let π1≻π2≻π3 with AEU(π1) = α, AEU(π2) = β and AEU(π3) = γ. For 〈λ, µ〉 ∈ P2, compute AEU([λ/π1, µ/π3]) = 〈λ⊗α1⊕µ⊗γ1, λ⊗α2⊕µ⊗γ2〉. We want to find a couple 〈λ, µ〉 ∈ P2 such that λ⊗α1⊕µ⊗γ1 = β1 and λ⊗α2⊕µ⊗γ2 = β2 By assumption, α≥2β≥2γ. Then there exist ν, ξ ∈ P such that\n〈α1, α2⊕ν〉 = 〈β1⊕ν, β2〉 and 〈β1, β2⊕ξ〉 = 〈γ1⊕ξ, γ2〉. Rearranging these equations, we get 〈α1, α2⊕ν⊕ξ〉 = 〈γ1⊕ν⊕ξ, γ2〉. Using these equalities and assuming that λ⊕µ = 1P , the system of equations becomes: {\nγ1⊕λ⊗(ν⊕ξ) = γ1⊕ξ α2⊕µ⊗(ν⊕ξ) = α2⊕ν\nThen if a solution exists for these two equations:\nλ⊗(ν⊕ξ) = ξ µ⊗(ν⊕ξ) = ν\na solution exists for the first system. By condition E2, there exists 〈λ, µ〉 ∈ P2 verifying the previous equations. This finishes the proof of axiom D4.\nNow we outline the proof of the sufficient part as it is quite classic. Axiom D4 implies that for any degenerated lottery, i.e. any consequence, one can find an equivalent binary lottery. Then Lemma 1 and axiom R entail that any lottery can also be reduced to a binary lottery. Axiom D1 states that comparing lotteries is equivalent to comparing their associated binary lotteries. Finally axiom D2 along with Lemma 2 gives the opposite implication of the lemma. This defines the order on Π∞(X).\nTheorem 2 is based on simpler axioms than Theorem 1 but it needs two solvability conditions. Both theorems allow an AEU criterion to be derived as soon as one has an uncertainty representation satisfying our conditions. The obtained criterion would be the counterpart of EU in the chosen uncertainty representation. As an example of the interest of our result, we give two simple applications. Weydert (1994) proposed quasi-measures as general uncertainty measures. To the best of our knowledge, no decision model have been proposed for these measures. They satisfy all the conditions of Theorem 2. Then AEU can be constructed using quasi-measures. Blume et al. (1991) have considered lexicographic probabilities (which are vector of probabilities that are compared lexicographically) and derived lexicographic expected utility. It is easy to check that their model can be seen as an algebraic expected utility. In the same vein, one could consider lexicographic plausibility measures and derive lexicographic algebraic expected utility thanks to the previous theorem. Such decision models have not been studied yet."}, {"heading": "4 PROPERTIES OF AEU", "text": "Algebraic expected utility satisfies the same properties as expected utility: linearity, dynamic consistency, autoduality of the underlying uncertainty representation, autoduality of the decision criterion and modeling of decision maker’s attitude toward uncertainty1.\n1We thank Patrice Perny for the suggestion of this feature."}, {"heading": "4.1 Linearity and Dynamic Consistency", "text": "First, obviously, AEU follows the linearity property. In the case of two consequences, this property states that for any two elements λ, µ ∈ P and any x, x′ ∈ X , we have AEU([λ/x, µ/x′]) = λ⊗AEU(x)⊕µ⊗AEU(x′). This formula can of course be extended to any finite number of consequences. Remark that this is entailed by the independence axiom.\nThis property can be extended to Π∞(X). For compound lotteries with two outcomes, it states that for any 〈λ, µ〉 in P2 and any two lotteries π, π′ ∈ Π∞(X), we have AEU([λ/π, µ/π′]) = λ⊗AEU(π)⊕µ⊗AEU(π′). Again, this can be easily extended to any compound lotteries with any number of outcomes. This property implies that AEU satisfies dynamic consistency. Dynamic consistency is a very nice property in sequential decision making. It states that if a decision maker prefers an alternative to another one at some step in the decision process then he/she will at any other step. This nice property allows AEU to be naturally integrated in sequential decision models, such as Markov decision processes (see Perny et al. (2005))."}, {"heading": "4.2 Autoduality of the Uncertainty Representation", "text": "The dual of the preorder %S over events F is the relation %S T defined by ∀A,B ∈ F , A%S TB if and only if B%SA where A and B denote the complements of A and B. Naturally the dual of the dual of a preorder is the preorder itself.\nPreorder %S is said autodual if and only if for two events A and B, A%SB ⇔ B%SA. For such autodual preorder, this means that A is more plausible than B if and only if the complement of B is more plausible than that of A.\nDuality and autoduality can be naturally extended to plausibility measures. A plausibility measure is the dual of another one if their induced preorders over events are duals of one another. As examples, possibility measures are the duals of necessity measures (Dubois and Prade (1980)) and belief and plausibility functions (Shafer (1976)) are the duals of one another. A plausibility measure is autodual if its induced preorder is autodual. A probability distribution is autodual.\nAn autodual measure gives more information than a non autodual one. Indeed if an autodual measure says that A is more plausible than B then it says also that the complement of B is more plausible than that of A and vice versa. In the case of a non autodual measure, there is no relation between the two facts: A more plausible than B and the complement of B more plausible than that of A. And having A more plausible than B does not give any information on A and B. Thus a non autodual plausibility measure does not use all the available information at hand since it could be refined with its dual measure. Therefore autodual plausibility measure should be exploited whenever possible.\nHopefully, from a non autodual measure Pl, there is an easy way to build an autodual measure. Indeed one just has to take the measure σPl defined by the couple σPl(A) = 〈Pl(A),Pl(A)〉,∀A ∈ F . These values are compared using order ≥2. It can be checked that it is an autodual plausibility measure. In general, it does not give a complete order over events, even when Pl defines a complete order. For instance, this is the case with the couple of belief and plausibility functions. Note that if Pl is a probability distribution, then the measure defined by the couple σPl gives the same information as Pl and they are thus equivalent.\nWe now show that a decision maker using AEU has an autodual uncertainty representation. For two events A,B, consider binary acts xAx and xBx where act xAx gives the best consequence x when event A occurs and the worst consequence x otherwise and act xBx gives x when B occurs and x otherwise. Act xAx is preferred to xBx means that the decision maker believes that A is more plausible than B. Thus comparing such binary acts defines a preorder over events. Note that AEU(xAx) = σPl(A) = 〈Pl(A),Pl(A)〉. Consequently even if the decision maker started with a non autodual plausibility measure Pl, he/she implicitly uses all the information provided by Pl to rank events when making decision with AEU with σPl. This feature of AEU is particularly of interest when non autodual measures are used to represent uncertainty."}, {"heading": "4.3 Autoduality of the Decision Criterion", "text": "The properties of duality and autoduality can be also stated on preference relation over acts. As the preorder over consequences is not assumed to be complete, the extension of the definitions is a bit tricky. We need to suppose that preferences over acts results from preferences over consequences. For any preorder % over acts A and any preorder %X over consequences X , let %(%X) denote the preorder over acts when consequences are considered in their natural order and %(-X) the preorder over acts when consequences are considered in their reversed order, i.e. bad outcomes are supposed to be more attractive than good ones.\nThe dual of a preference relation %(%X), which is denoted %T (%X) is defined by f%\nT (%X)g ⇔ g%(-X)f . Roughly speaking when an act f is preferred to an act g in the sense of %T (%X), it means that when attracted by bad consequences, g is better ranked than f . Again, the dual of the dual of a preference relation is the relation itself. By extension, we say that a decision criterion is the dual of another one if the preference relation defined by the former decision criterion is the dual of the relation defined by the latter. As an example, pessimistic utility is the dual of optimistic utility.\nA preference relation is autodual if and only if %T (%X) = %(%X), which means that for any two acts f , g, f%(%X)g ⇔ g%(-X)f . Again, by extension, a decision criterion is\nautodual if its induced preference relation is autodual. Intuitively, this means that the decision criterion when comparing two acts looks at how well and how bad these two acts perform. As previously, any non autodual decision criterion does not use all the information at hand since it could be possible to refine with the dual of the decision criterion. In this sense a rational decision maker would rather use an autodual decision criterion. As an example, EU is autodual. Being defined as a couple, one element focusing on the best consequence and the other on the worst one, it can be easily checked that AEU is also autodual."}, {"heading": "4.4 Modeling of Decision Maker’s Attitude", "text": "With EU, attitude towards risk can be integrated to the model by means of the shape of the basic utility assignment. When the utility assignment is concave, the decision maker is risk averse. He/she would prefer sure consequences to risky consequences. On the contrary when the utility assignment is convex, the decision maker is riskseeking. The modeling of the decision maker attitude toward risk relies on how utility is affected to consequences. By shaping the basic utility assignment, one can integrate the decision maker’s attitude into the decision model.\nThis idea can be naturally transposed in AEU. The choice of the basic utility assignment allows the decision maker’s attitude to be taken into account. We illustrate this property by a simple example. Let y1, y2, y3 three consequences such that y1≻Xy2≻Xy3. Let π = [λ/y1, µ/y3]. Let u= : X → P2 a basic utility assignment such that AEUu=(π) = u(y2). A decision maker whose preferences and attitude toward uncertainty are modeled by u= considers that uncertain alternative π and sure consequence y are equivalent. Now consider u+ : X → P2 a basic utility assignment such that ∀x ∈ X,u+(x) = u=(x) if y2%Xx and u+(x)≥2u=(x) otherwise. Then obviously, AEUu+(π)≥2u\n+(y2) by monotony of the operators. A decision maker whose preferences are modeled by u+ will favor the uncertain alternative to the sure consequence. In this sense, he/she is more uncertainty-seeking than a decision maker using u=. On the contrary, with u− : X → P2 a basic utility assignment such that ∀x ∈ X,u−(x) = u=(x) if x%Xy2 and u=(x)≥2u−(x) otherwise, sure consequence y2 will be preferred. Such a attitude is more uncertainty averse than that obtained with u=.\nThis is exactly the case with binary possibilistic utility. Giang and Shenoy (2001) showed that when all the basic utilities are high, binary possibilistic utility reduces to pessimistic utility. On the contrary, when all the basic utilities are low, binary possibilistic utility reduces to optimistic utility. In addition to their result, our work suggests that the degree of optimism or pessimism can be controlled more finely by how much the basic utilities are shifted."}, {"heading": "5 RELATED WORKS", "text": "Many proposed decision models are instances of algebraic expected utilities. We list here some examples: • standard expected utility, • lexicographic expected utility introduced by Blume et al.\n(1991), • the decision criteria proposed by Giang and Shenoy\n(2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al. (2000a) as proved by Weng (2005), it is a binary utility, • refined possibilistic utility proposed by Weng (2005), • the decision model proposed by Wilson (1995) on ex-\ntended reals. Our work gives an axiomatic foundation of his proposal. • the decision criterion proposed by Giang and Sandilya (2004) as symbolic probability is a plausibility measure.\nGiang and Shenoy (2003) proposed a decision criterion for partially consonant belief functions, which are generalizations of both probability and possibility measures. More specifically, they considered partially consonant belief functions in the form of probability distributions over possibility distributions over consequences. For these twolevel measures, they applied the idea of binary utility twice getting a decision criterion that is formally close to algebraic expected utility, as it can be seen as a two-level AEU. This suggests that we could define more general decision criteria using plausibility distribution defined over plausibility distributions over consequences and applying Theorem 2 twice. An interesting work would be to study the possibility to find a one-level plausibility measure that would yield an AEU equivalent to a two-level AEU.\nGiang and Sandilya (2004) recently proposed a general decision model similar to ours using symbolic probability as uncertainty representation. They lead their axiomatization in a setting similar to Schmeidler (1989) who used the framework presented by Anscombe and Aumann (1963). This setting is justified if one wants to justify axiomatically the use of subjective probability or more generally the use of subjective plausibility measures. Indeed in the context of decision problems, Anscombe and Aumann derived subjective additive probabilities and axiomatized subjective expected utility. Schmeidler generalized the result by relaxing some of these axioms and obtained subjective nonadditive probabilities and Choquet expected utility (CEU). However in this setting, Giang and Sandilya (2004) did not\nderive subjective symbolic probabilities. Thus the choice of this setting is not, in our opinion, the most suitable for an axiomatization of a general criterion in contexts where plausibility measures are given. In this case, a vNM setting is a preferable framework. Consequently, our two axiomatizations are formulated in such a setting. The first is very similar to theirs as we simply restated their axioms in a vNM setting. The second axiomatization requiring two solvability requirements is based on simpler axioms and give a better understanding of the properties of AEU. In this second set of axioms, B2, which enforces the order on binary lotteries, is not artificially imposed. This order naturally results from the set of axioms, i.e. from the behavior of the decision maker.\nWhen the scale is [0, 1], our semiring requirements implies that operators ⊕ and ⊗ are respectively a t-conorm and a t-norm. Decomposable plausibility measures in such contexts and integrals of the form of AEU have been extensively studied (Klement et al. (2000); Dubois et al. (1996)). Interestingly, in this totally ordered case, the semiring requirements, especially that of distributivity, enforce +/×, max/t-norm mixtures or ordinal sums of these two (Dubois et al. (2000c,b). AEU encompasses these integrals and our work gives an axiomatic foundations (in a decisiontheoretic sense) to them as a decision criterion. Our proposal is stated on more general scales, which can be only partially ordered. It would be interesting to investigate the possibility of revealing the family of mixtures enforced by the semiring requirements in this case.\nAs a final remark, our work shows that AEU is formally different of CEU as CEU uses a non additive plausibility measure. Therefore there is no operator ⊕ and ⊗ satisfying the required conditions for AEU."}, {"heading": "6 CONCLUSION", "text": "We provided two axiomatic justifications for a class of generalized expected utility that we named algebraic expected utility. These axiomatizations have been lead in a vNM setting, i.e. the uncertainty representation is supposed to be given and it is here assumed to be captured by a plausibility measure. Our second axiomatization is particularly of interest. Though requiring two solvability conditions, it is based on simple and natural axioms (preorder, non triviality, weak independence and continuity), which are similar to those presented in Machina (1988) for EU.\nOur general algebraic approach allowed all the previous propositions similar to expected utility to be unified in a same formalization. From any uncertainty representation satisfying our conditions, an algebraic expected utility can be constructed. This is especially of interest for uncertainty representation for which decision models have not yet been proposed.\nWe showed that having standard expected utility as a special case, AEU enjoys the same nice properties as EU: linearity, dynamic consistency, autoduality of the underlying uncertainty representation, autoduality of the decision criterion, modeling of decision maker’s attitude towards uncertainty. As a side point, it can be highlighted that this decision criterion can be used in sequential decision making, especially with Markov decision processes (see Perny et al. (2005)).\nAs a future work, we plan to generalize AEU in the same direction as Schmeidler did with EU to get CEU. Many experiments showed that axioms of EU are violated in many situations. This proves therefore that EU cannot be used as a criterion to model these decision situations. In these cases, CEU can be used as it has a much higher power of description than EU. Generalization of AEU in the direction of CEU should also offer a greater flexibility in decision behavior modeling. Interestingly, in the case of possibilistic utility, optimistic and pessimistic utilities can be generalized to get Sugeno integrals, which are qualitative counterpart of CEU."}], "references": [{"title": "A definition of subjective probability", "author": ["F. Anscombe", "R. Aumann"], "venue": "The annals of mathematical statistics 34:199–205.", "citeRegEx": "Anscombe and Aumann,? 1963", "shortCiteRegEx": "Anscombe and Aumann", "year": 1963}, {"title": "Semiring-based CSPs and valued CSPs: Frameworks, properties and comparison", "author": ["S. Bistarelli", "U. Montanari", "F. Rossi", "T. Schiex", "G. Verfaillie", "H. Fargier"], "venue": "Constraints 4:199– 240.", "citeRegEx": "Bistarelli et al\\.,? 1999", "shortCiteRegEx": "Bistarelli et al\\.", "year": 1999}, {"title": "Lexicographic probabilities and choice uncertainty", "author": ["L. Blume", "A. Brandenburger", "E. Dekel"], "venue": "Econometrica 59(1):61–", "citeRegEx": "Blume et al\\.,? 1991", "shortCiteRegEx": "Blume et al\\.", "year": 1991}, {"title": "On the axiomatization of qualitative decision criteria", "author": ["R. Brafman", "M. Tennenholtz"], "venue": "AAAI. vol. 14, 76–81.", "citeRegEx": "Brafman and Tennenholtz,? 1997", "shortCiteRegEx": "Brafman and Tennenholtz", "year": 1997}, {"title": "Great expectations", "author": ["F. Chu", "J. Halpern"], "venue": "part i: On the customizability of generalized expected utility. In IJCAI. vol. 18, 291–296.", "citeRegEx": "Chu and Halpern,? 2003a", "shortCiteRegEx": "Chu and Halpern", "year": 2003}, {"title": "Great expectations", "author": ["F. Chu", "J. Halpern"], "venue": "part ii: Generalized expected utility as a universal decision rule. In IJCAI. vol. 18, 297–302.", "citeRegEx": "Chu and Halpern,? 2003b", "shortCiteRegEx": "Chu and Halpern", "year": 2003}, {"title": "A symbolic generalization of probability theory", "author": ["A. Darwiche", "M. Ginsberg"], "venue": "AAAI. vol. 10, 622–627.", "citeRegEx": "Darwiche and Ginsberg,? 1992", "shortCiteRegEx": "Darwiche and Ginsberg", "year": 1992}, {"title": "Aggregation of decomposable measures with application to utility theory", "author": ["D. Dubois", "J. Fodor", "H. Prade", "M. Roubens"], "venue": "Theory and Decision 41:59–95.", "citeRegEx": "Dubois et al\\.,? 1996", "shortCiteRegEx": "Dubois et al\\.", "year": 1996}, {"title": "Advances in qualitative decision theory: refined rankings", "author": ["D. Dubois", "L. Godo", "H. Prade", "A. Zapico"], "venue": "Lecture notes in AI 1952(11):427–436.", "citeRegEx": "Dubois et al\\.,? 2000a", "shortCiteRegEx": "Dubois et al\\.", "year": 2000}, {"title": "Hybrid probabilisticpossibilistic measures and applications to utility functions", "author": ["D. Dubois", "E. Pap", "H. Prade"], "venue": "IPMU.", "citeRegEx": "Dubois et al\\.,? 2000b", "shortCiteRegEx": "Dubois et al\\.", "year": 2000}, {"title": "Hybrid probabilisticpossibilistic mixtures and utility functions", "author": ["D. Dubois", "E. Pap", "H. Prade"], "venue": "Preferences and decisions under incomplete knowledge. 51–73.", "citeRegEx": "Dubois et al\\.,? 2000c", "shortCiteRegEx": "Dubois et al\\.", "year": 2000}, {"title": "Fuzzy sets and systems: theory and applications", "author": ["D. Dubois", "H. Prade"], "venue": "Academy press.", "citeRegEx": "Dubois and Prade,? 1980", "shortCiteRegEx": "Dubois and Prade", "year": 1980}, {"title": "An introduction to possibilistic and fuzzy logics", "author": ["D. Dubois", "H. Prade"], "venue": "Readings in Uncertain Reasoning, Morgan Kaufmann. 742–761.", "citeRegEx": "Dubois and Prade,? 1990", "shortCiteRegEx": "Dubois and Prade", "year": 1990}, {"title": "Possibility theory as a basis of qualitative decision theory", "author": ["D. Dubois", "H. Prade"], "venue": "IJCAI. vol. 14, 1925–1930.", "citeRegEx": "Dubois and Prade,? 1995", "shortCiteRegEx": "Dubois and Prade", "year": 1995}, {"title": "Risk, ambiguity, and the savage axioms", "author": ["D. Ellsberg"], "venue": "Quarterly Journal of Economics 75:643–669.", "citeRegEx": "Ellsberg,? 1961", "shortCiteRegEx": "Ellsberg", "year": 1961}, {"title": "Utility theory for decision making", "author": ["P. Fishburn"], "venue": "Wiley.", "citeRegEx": "Fishburn,? 1970", "shortCiteRegEx": "Fishburn", "year": 1970}, {"title": "Plausibility measures: A user’s guide", "author": ["N. Friedman", "J. Halpern"], "venue": "UAI. vol. 11, 175–184.", "citeRegEx": "Friedman and Halpern,? 1995", "shortCiteRegEx": "Friedman and Halpern", "year": 1995}, {"title": "Decision making for symbolic probability", "author": ["P. Giang", "S. Sandilya"], "venue": "UAI. vol. 20, 185–192.", "citeRegEx": "Giang and Sandilya,? 2004", "shortCiteRegEx": "Giang and Sandilya", "year": 2004}, {"title": "A qualitative linear utility theory for spohn’s theory of epistemic beliefs", "author": ["P. Giang", "P. Shenoy"], "venue": "UAI. vol. 16, 220– 229.", "citeRegEx": "Giang and Shenoy,? 2000", "shortCiteRegEx": "Giang and Shenoy", "year": 2000}, {"title": "A comparison of axiomatic approaches to qualitative decision making using possibility theory", "author": ["P. Giang", "P. Shenoy"], "venue": "UAI. vol. 17, 162–170.", "citeRegEx": "Giang and Shenoy,? 2001", "shortCiteRegEx": "Giang and Shenoy", "year": 2001}, {"title": "Statistical decisions using likelihood information without prior probabilities", "author": ["P. Giang", "P. Shenoy"], "venue": "UAI. vol. 18, 170–178.", "citeRegEx": "Giang and Shenoy,? 2002", "shortCiteRegEx": "Giang and Shenoy", "year": 2002}, {"title": "Decision making with partially consonant belief functions", "author": ["P. Giang", "P. Shenoy"], "venue": "UAI. vol. 19, 272–280.", "citeRegEx": "Giang and Shenoy,? 2003", "shortCiteRegEx": "Giang and Shenoy", "year": 2003}, {"title": "Rank-based systems: a simple approach to belief revision, belief update and reasoning about evidence and actions", "author": ["M. Goldszmidt", "J. Pearl"], "venue": "KR. vol. 3, 661–672.", "citeRegEx": "Goldszmidt and Pearl,? 1992", "shortCiteRegEx": "Goldszmidt and Pearl", "year": 1992}, {"title": "Graphs and algorithms", "author": ["M. Gondran", "M. Minoux", "S. Vajda"], "venue": "John Wiley & Sons, Inc.", "citeRegEx": "Gondran et al\\.,? 1984", "shortCiteRegEx": "Gondran et al\\.", "year": 1984}, {"title": "Decision making with belief functions: Compatibility and incompatibility with the surething principle", "author": ["J. Jaffray", "P. Wakker"], "venue": "J. of Risk and Uncertainty 7(3):255–71.", "citeRegEx": "Jaffray and Wakker,? 1993", "shortCiteRegEx": "Jaffray and Wakker", "year": 1993}, {"title": "Games and Decisions", "author": ["R. Luce", "H. Raiffa"], "venue": "J. Wiley, New York.", "citeRegEx": "Luce and Raiffa,? 1957", "shortCiteRegEx": "Luce and Raiffa", "year": 1957}, {"title": "Expected utility hypothesis", "author": ["M. Machina"], "venue": "J. Eatwell, M. Milgate, and P. Newman (eds.), The New Palgrave: A Dictionary of Economics, Macmillan. 232–239.", "citeRegEx": "Machina,? 1988", "shortCiteRegEx": "Machina", "year": 1988}, {"title": "Theory of games and economic behavior", "author": ["J. von Neumann", "O. Morgenstern"], "venue": "Princeton university press.", "citeRegEx": "Neumann and Morgenstern,? 1944", "shortCiteRegEx": "Neumann and Morgenstern", "year": 1944}, {"title": "Algebraic markov decision processes", "author": ["P. Perny", "O. Spanjaard", "P. Weng"], "venue": "IJCAI. vol. 19, 1372–1377.", "citeRegEx": "Perny et al\\.,? 2005", "shortCiteRegEx": "Perny et al\\.", "year": 2005}, {"title": "The foundations of statistics", "author": ["L. Savage"], "venue": "J. Wiley and sons.", "citeRegEx": "Savage,? 1954", "shortCiteRegEx": "Savage", "year": 1954}, {"title": "Subjective probability and expected utility without additivity", "author": ["D. Schmeidler"], "venue": "Econometrica 57:571–587.", "citeRegEx": "Schmeidler,? 1989", "shortCiteRegEx": "Schmeidler", "year": 1989}, {"title": "A mathematical theory of evidence", "author": ["G. Shafer"], "venue": "Princeton university press.", "citeRegEx": "Shafer,? 1976", "shortCiteRegEx": "Shafer", "year": 1976}, {"title": "A general non-probabilistic theory of inductive reasoning", "author": ["W. Spohn"], "venue": "UAI. vol. 4.", "citeRegEx": "Spohn,? 1988", "shortCiteRegEx": "Spohn", "year": 1988}, {"title": "⊥-decomposable measures and integrals for achimedian t-conorms ⊥", "author": ["S. Weber"], "venue": "J. Math. Anal. Appl. 101:114–138.", "citeRegEx": "Weber,? 1984", "shortCiteRegEx": "Weber", "year": 1984}, {"title": "Qualitative decision making under possibilistic uncertainty: Toward more discriminating criteria", "author": ["P. Weng"], "venue": "UAI. vol. 21.", "citeRegEx": "Weng,? 2005", "shortCiteRegEx": "Weng", "year": 2005}, {"title": "General belief measures", "author": ["E. Weydert"], "venue": "UAI. vol. 10, 575–582.", "citeRegEx": "Weydert,? 1994", "shortCiteRegEx": "Weydert", "year": 1994}, {"title": "An order of magnitude calculus", "author": ["N. Wilson"], "venue": "UAI. vol. 11, 548–555.", "citeRegEx": "Wilson,? 1995", "shortCiteRegEx": "Wilson", "year": 1995}], "referenceMentions": [{"referenceID": 25, "context": "The seminal work presented in von Neumann and Morgenstern (1944) made expected utility (EU) the first axiomatized decision model.", "startOffset": 34, "endOffset": 65}, {"referenceID": 15, "context": "This axiomatization was then reformulated and simplified (Fishburn (1970); Machina (1988)).", "startOffset": 58, "endOffset": 74}, {"referenceID": 15, "context": "This axiomatization was then reformulated and simplified (Fishburn (1970); Machina (1988)).", "startOffset": 58, "endOffset": 90}, {"referenceID": 15, "context": "This axiomatization was then reformulated and simplified (Fishburn (1970); Machina (1988)). In von Neumann-Morgenstern (vNM) like axiomatizations, (objective) probabilities are assumed to be given. This assumption is relaxed in the axiomatization proposed by Savage (1954). In such a setting, (subjective) probabilities are constructed from the preferences of the decision maker if and only if some required axioms are satisfied.", "startOffset": 58, "endOffset": 273}, {"referenceID": 25, "context": "To tackle these difficulties, other models for uncertainty have been proposed as generalizations of probability: belief functions (Shafer (1976)), κ-rankings (Spohn (1988); Goldszmidt and Pearl (1992)), possibility theory (Dubois and Prade (1990)), symbolic probability (Darwiche and Ginsberg (1992)) to name a few.", "startOffset": 131, "endOffset": 145}, {"referenceID": 25, "context": "To tackle these difficulties, other models for uncertainty have been proposed as generalizations of probability: belief functions (Shafer (1976)), κ-rankings (Spohn (1988); Goldszmidt and Pearl (1992)), possibility theory (Dubois and Prade (1990)), symbolic probability (Darwiche and Ginsberg (1992)) to name a few.", "startOffset": 131, "endOffset": 172}, {"referenceID": 17, "context": "To tackle these difficulties, other models for uncertainty have been proposed as generalizations of probability: belief functions (Shafer (1976)), κ-rankings (Spohn (1988); Goldszmidt and Pearl (1992)), possibility theory (Dubois and Prade (1990)), symbolic probability (Darwiche and Ginsberg (1992)) to name a few.", "startOffset": 173, "endOffset": 201}, {"referenceID": 10, "context": "To tackle these difficulties, other models for uncertainty have been proposed as generalizations of probability: belief functions (Shafer (1976)), κ-rankings (Spohn (1988); Goldszmidt and Pearl (1992)), possibility theory (Dubois and Prade (1990)), symbolic probability (Darwiche and Ginsberg (1992)) to name a few.", "startOffset": 223, "endOffset": 247}, {"referenceID": 6, "context": "To tackle these difficulties, other models for uncertainty have been proposed as generalizations of probability: belief functions (Shafer (1976)), κ-rankings (Spohn (1988); Goldszmidt and Pearl (1992)), possibility theory (Dubois and Prade (1990)), symbolic probability (Darwiche and Ginsberg (1992)) to name a few.", "startOffset": 271, "endOffset": 300}, {"referenceID": 6, "context": "To tackle these difficulties, other models for uncertainty have been proposed as generalizations of probability: belief functions (Shafer (1976)), κ-rankings (Spohn (1988); Goldszmidt and Pearl (1992)), possibility theory (Dubois and Prade (1990)), symbolic probability (Darwiche and Ginsberg (1992)) to name a few. They are all instances of plausibility measures (not to be confused with plausibility functions) introduced by Friedman and Halpern (1995).", "startOffset": 271, "endOffset": 455}, {"referenceID": 12, "context": "For all these uncertainty representations, decision models have been proposed (Jaffray and Wakker (1993); Giang and Shenoy (2000); Dubois and Prade (1995),.", "startOffset": 79, "endOffset": 105}, {"referenceID": 10, "context": "For all these uncertainty representations, decision models have been proposed (Jaffray and Wakker (1993); Giang and Shenoy (2000); Dubois and Prade (1995),.", "startOffset": 106, "endOffset": 130}, {"referenceID": 7, "context": "For all these uncertainty representations, decision models have been proposed (Jaffray and Wakker (1993); Giang and Shenoy (2000); Dubois and Prade (1995),.", "startOffset": 131, "endOffset": 155}, {"referenceID": 7, "context": "For all these uncertainty representations, decision models have been proposed (Jaffray and Wakker (1993); Giang and Shenoy (2000); Dubois and Prade (1995),...). Some of these already proposed criteria share some formal similarities. This fact has been recently underlined in Giang and Sandilya (2004) who axiomatically justified a general decision model based on symbolic probabilities.", "startOffset": 131, "endOffset": 301}, {"referenceID": 7, "context": "Earlier, Dubois et al. (1996) studied a general class of real-valued decision criteria based on triangular norms (Klement et al.", "startOffset": 9, "endOffset": 30}, {"referenceID": 7, "context": "Earlier, Dubois et al. (1996) studied a general class of real-valued decision criteria based on triangular norms (Klement et al. (2000)).", "startOffset": 9, "endOffset": 136}, {"referenceID": 23, "context": "Approaches relying on semirings have proved to be able to offer a unified treatment to many variations of the same problem (see Gondran et al. (1984) for graph", "startOffset": 128, "endOffset": 150}, {"referenceID": 1, "context": "problems, Bistarelli et al. (1999) for constraint satisfaction problems and Perny et al.", "startOffset": 10, "endOffset": 35}, {"referenceID": 1, "context": "problems, Bistarelli et al. (1999) for constraint satisfaction problems and Perny et al. (2005) for Markov decision pro-", "startOffset": 10, "endOffset": 96}, {"referenceID": 24, "context": "The first axiomatization, similar to that of Luce and Raiffa (1957), is a reformulation in a vNM setting of the one proposed in Giang and Sandilya (2004).", "startOffset": 45, "endOffset": 68}, {"referenceID": 17, "context": "The first axiomatization, similar to that of Luce and Raiffa (1957), is a reformulation in a vNM setting of the one proposed in Giang and Sandilya (2004). The sec-", "startOffset": 128, "endOffset": 154}, {"referenceID": 26, "context": "ond one inspired by that of Machina (1988) is based on simpler and more natural postulates but requires two solv-", "startOffset": 28, "endOffset": 43}, {"referenceID": 28, "context": "Moreover this unification emphasizes that these decision models all enjoy the same nice formal properties as expected utility: linearity, dynamic consistency allowing an easy integration of AEU in sequential decision making, especially in algebraic Markov decision processes (Perny et al. (2005)), autoduality of the underlying uncertainty representation, autoduality of the decision criterion and possibility of modeling decision maker’s attitude toward uncertainty.", "startOffset": 276, "endOffset": 296}, {"referenceID": 16, "context": "We assume that uncertainty about the actual state is captured by plausibility measures (Friedman and Halpern (1995)).", "startOffset": 88, "endOffset": 116}, {"referenceID": 23, "context": "From now on, structure (P,⊕,⊗, 0P , 1P ) is assumed to be a semiring (see Gondran et al. (1984)).", "startOffset": 74, "endOffset": 96}, {"referenceID": 6, "context": "These requirements or some variants of them were also imposed in Darwiche and Ginsberg (1992); Friedman and Halpern (1995); Weydert (1994) from general scales and in Weber (1984); Dubois et al.", "startOffset": 65, "endOffset": 94}, {"referenceID": 6, "context": "These requirements or some variants of them were also imposed in Darwiche and Ginsberg (1992); Friedman and Halpern (1995); Weydert (1994) from general scales and in Weber (1984); Dubois et al.", "startOffset": 65, "endOffset": 123}, {"referenceID": 6, "context": "These requirements or some variants of them were also imposed in Darwiche and Ginsberg (1992); Friedman and Halpern (1995); Weydert (1994) from general scales and in Weber (1984); Dubois et al.", "startOffset": 65, "endOffset": 139}, {"referenceID": 6, "context": "These requirements or some variants of them were also imposed in Darwiche and Ginsberg (1992); Friedman and Halpern (1995); Weydert (1994) from general scales and in Weber (1984); Dubois et al.", "startOffset": 65, "endOffset": 179}, {"referenceID": 6, "context": "These requirements or some variants of them were also imposed in Darwiche and Ginsberg (1992); Friedman and Halpern (1995); Weydert (1994) from general scales and in Weber (1984); Dubois et al. (1996) for real scales.", "startOffset": 65, "endOffset": 201}, {"referenceID": 17, "context": "We now introduce the first set of axioms, which is a reformulation in a vNM setting of axioms presented in Giang and Sandilya (2004) and are similar to those of Luce and Raiffa (1957):", "startOffset": 107, "endOffset": 133}, {"referenceID": 17, "context": "We now introduce the first set of axioms, which is a reformulation in a vNM setting of axioms presented in Giang and Sandilya (2004) and are similar to those of Luce and Raiffa (1957):", "startOffset": 107, "endOffset": 184}, {"referenceID": 26, "context": "The other axioms are inspired by the set of axioms presented by Machina (1988). Axiom D3 states that in a compound lottery replacing a sublottery by a preferred one cannot worsen that lottery.", "startOffset": 64, "endOffset": 79}, {"referenceID": 34, "context": "Weydert (1994) proposed quasi-measures as general uncertainty measures.", "startOffset": 0, "endOffset": 15}, {"referenceID": 2, "context": "Blume et al. (1991) have considered lexicographic probabilities (which are vector of probabilities that are compared lexicographically) and derived lexicographic expected utility.", "startOffset": 0, "endOffset": 20}, {"referenceID": 28, "context": "This nice property allows AEU to be naturally integrated in sequential decision models, such as Markov decision processes (see Perny et al. (2005)).", "startOffset": 127, "endOffset": 147}, {"referenceID": 11, "context": "As examples, possibility measures are the duals of necessity measures (Dubois and Prade (1980)) and belief and plausibility functions (Shafer (1976)) are the duals of one another.", "startOffset": 71, "endOffset": 95}, {"referenceID": 11, "context": "As examples, possibility measures are the duals of necessity measures (Dubois and Prade (1980)) and belief and plausibility functions (Shafer (1976)) are the duals of one another.", "startOffset": 71, "endOffset": 149}, {"referenceID": 18, "context": "Giang and Shenoy (2001) showed that when all the basic utilities are high, binary possibilistic utility reduces to pessimistic utility.", "startOffset": 0, "endOffset": 24}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al.", "startOffset": 76, "endOffset": 96}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al.", "startOffset": 76, "endOffset": 316}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al.", "startOffset": 76, "endOffset": 399}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al.", "startOffset": 76, "endOffset": 478}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al. (2000a) as proved by Weng (2005), it is a binary utility, • refined possibilistic utility proposed by Weng (2005), • the decision model proposed by Wilson (1995) on extended reals.", "startOffset": 76, "endOffset": 638}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al. (2000a) as proved by Weng (2005), it is a binary utility, • refined possibilistic utility proposed by Weng (2005), • the decision model proposed by Wilson (1995) on extended reals.", "startOffset": 76, "endOffset": 663}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al. (2000a) as proved by Weng (2005), it is a binary utility, • refined possibilistic utility proposed by Weng (2005), • the decision model proposed by Wilson (1995) on extended reals.", "startOffset": 76, "endOffset": 744}, {"referenceID": 2, "context": "• standard expected utility, • lexicographic expected utility introduced by Blume et al. (1991), • the decision criteria proposed by Giang and Shenoy (2000, 2001, 2002) for respectively κ-rankings, qualitative possibility and quantitative possibility, • optimistic and pessimistic utilities (Dubois and Prade (1995)) as they are particular cases of the criterion proposed by Giang and Shenoy (2001), • maximax and maximin criteria (axiomatized by Brafman and Tennenholtz (1997)) as they are particular cases of optimistic and pessimistic utilities, • pessimistic utility refined by optimistic utility axiomatized by Dubois et al. (2000a) as proved by Weng (2005), it is a binary utility, • refined possibilistic utility proposed by Weng (2005), • the decision model proposed by Wilson (1995) on extended reals.", "startOffset": 76, "endOffset": 792}, {"referenceID": 0, "context": "They lead their axiomatization in a setting similar to Schmeidler (1989) who used the framework presented by Anscombe and Aumann (1963). This setting is justified if one wants to justify axiomatically the use of subjective probability or more generally the use of subjective plausibility measures.", "startOffset": 109, "endOffset": 136}, {"referenceID": 0, "context": "They lead their axiomatization in a setting similar to Schmeidler (1989) who used the framework presented by Anscombe and Aumann (1963). This setting is justified if one wants to justify axiomatically the use of subjective probability or more generally the use of subjective plausibility measures. Indeed in the context of decision problems, Anscombe and Aumann derived subjective additive probabilities and axiomatized subjective expected utility. Schmeidler generalized the result by relaxing some of these axioms and obtained subjective nonadditive probabilities and Choquet expected utility (CEU). However in this setting, Giang and Sandilya (2004) did not derive subjective symbolic probabilities.", "startOffset": 109, "endOffset": 653}, {"referenceID": 7, "context": "(2000); Dubois et al. (1996)).", "startOffset": 8, "endOffset": 29}, {"referenceID": 26, "context": "Though requiring two solvability conditions, it is based on simple and natural axioms (preorder, non triviality, weak independence and continuity), which are similar to those presented in Machina (1988) for EU.", "startOffset": 188, "endOffset": 203}, {"referenceID": 28, "context": "As a side point, it can be highlighted that this decision criterion can be used in sequential decision making, especially with Markov decision processes (see Perny et al. (2005)).", "startOffset": 158, "endOffset": 178}], "year": 2006, "abstractText": "In this paper, we provide two axiomatizations of algebraic expected utility, which is a particular generalized expected utility, in a von NeumannMorgenstern setting, i.e. uncertainty representation is supposed to be given and here to be described by a plausibility measure valued on a semiring, which could be partially ordered. We show that axioms identical to those for expected utility entail that preferences are represented by an algebraic expected utility. This algebraic approach allows many previous propositions (expected utility, binary possibilistic utility,...) to be unified in a same general framework and proves that the obtained utility enjoys the same nice features as expected utility: linearity, dynamic consistency, autoduality of the underlying uncertainty representation, autoduality of the decision criterion and possibility of modeling decision maker’s attitude toward uncertainty.", "creator": "dvips(k) 5.94b Copyright 2004 Radical Eye Software"}}}