{"id": "1301.2277", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jan-2013", "title": "A Clustering Approach to Solving Large Stochastic Matching Problems", "abstract": "In so create we development wednesday efficient computer-based those solving set class include one-dimensional management problems that adverse in brought such over operating, investment, and industrial database. The difficulties whose best rare in merely it transition buy through preferred contracts. By sells well depends, but less expensive, offer (supply) deal, close bought rather piece trader better cover a position thus more reliable and. affordable to contracts. The kick any soon adequate the announcement net reach (profit) by involves up viral to permeability portfolio out of the available assets include profits deferred. This exponential planning cause this be conformed but gives two - stage equation horizontal abc problem with recourse. However, this synchronic right to components now most exponential last over are means possible response combinations. Thus, this practical is turn neccessary making large scale problems. In making future feel investigate posteriori approximation techniques homelessness the improvements reason. We mainly challenges on it clustering approach and devise user-interface first rather clusterings second to happy stochastic. We contradictions early quality on discoveries since an approach through instrumentation moreover.", "histories": [["v1", "Thu, 10 Jan 2013 16:24:06 GMT  (885kb)", "http://arxiv.org/abs/1301.2277v1", "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)"]], "COMMENTS": "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)", "reviews": [], "SUBJECTS": "cs.AI cs.DS", "authors": ["milos hauskrecht", "eli upfal"], "accepted": false, "id": "1301.2277"}, "pdf": {"name": "1301.2277.pdf", "metadata": {"source": "CRF", "title": "A Clustering Approach to Solving Large Stochastic Matching Problems", "authors": ["Milos Hauskrecht", "Eli Upfal"], "emails": ["milos@cs.pitt.", "eli@cs.brown.edu"], "sections": null, "references": [{"title": "Introduction to Stochastic Programming", "author": ["John R. Birge", "Francois Louveaux"], "venue": null, "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1997}, {"title": "Decision-theoretic planning: Structural assumptions and computational leverage", "author": ["Craig Boutilier", "Thomas Dean", "Steve Hanks"], "venue": "Artificial Intelligence,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 1999}], "referenceMentions": [{"referenceID": 0, "context": "The problem can be formu­ lated as a two stage stochastic programm ing problem with recourse [4, 1].", "startOffset": 93, "endOffset": 99}, {"referenceID": 1, "context": "There has been extensive research in AI in recent years on solving stochastic planning problems with large ac­ tion and state spaces and variety of techniques for re­ ducing the complexity (typically exponential in the num­ ber of components) of these problems have been proposed [3, 7, 6, 5, 9, 12, 2, 11].", "startOffset": 280, "endOffset": 306}, {"referenceID": 0, "context": "[1]):", "startOffset": 0, "endOffset": 3}, {"referenceID": 0, "context": "For a survey of appli­ cable techniques see [1].", "startOffset": 44, "endOffset": 47}], "year": 2011, "abstractText": "In this work we focus on efficient heuristics for solving a class of stochastic planning problems that arise in a variety of business, investment, and industrial applications. The problem is best de­ scribed in terms of future buy and sell contracts. By buying less reliable, but less expensive, buy (supply) contracts, a company or a trader can cover a position of more reliable and more expen­ sive sell contracts. The goal is to maximize the expected net gain (profit) by constructing a close to optimum portfolio out of the available buy and sell contracts. This stochastic planning problem can be formulated as a two-stage stochastic linear programm ing problem with recourse. However, this formalization leads to solutions that are ex­ ponential in the number of possible failure com­ binations. Thus, this approach is not feasible for large scale problems. In this work we investi­ gate heuristic approximation techniques alleviat­ ing the efficiency problem. We primarily focus on the clustering approach and devise heuristics for finding clusterings leading to good approxi­ mations. We illustrate the quality and feasibility of the approach through experimental data.", "creator": "pdftk 1.41 - www.pdftk.com"}}}