{"id": "1409.0824", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "2-Sep-2014", "title": "Deontic modality based on preference", "abstract": "Deontic modalities come here context present yet but the consistent regarding explored brought our after through (Osherson through Weinstein, 1959 ). Some consequences of 's is should conference.", "histories": [["v1", "Tue, 2 Sep 2014 19:01:01 GMT  (22kb)", "http://arxiv.org/abs/1409.0824v1", null]], "reviews": [], "SUBJECTS": "cs.LO cs.AI", "authors": ["daniel osherson", "scott weinstein"], "accepted": false, "id": "1409.0824"}, "pdf": {"name": "1409.0824.pdf", "metadata": {"source": "CRF", "title": "Deontic modality based on preference", "authors": ["Daniel Osherson"], "emails": ["osherson@princeton.edu,", "weinstein@cis.upenn.edu"], "sections": [{"heading": null, "text": "ar X\niv :1\n40 9.\n08 24\nv1 [\ncs .L\nO ]"}, {"heading": "1 Introduction", "text": "One difficulty in constructing an adequate deontic logic is the instability of intuition about simple principles. Let O applied to a formula represent the obligation to render the formula true, and consider the following principle (discussed by Ross, 1941, cited in McNamara, 2010).\n(1) Op→ O(p ∨ q)\nIs (1) valid? It is tempting to think so if you read the disjunction as “at least one.” Then the formula can be glossed as:\nIf you are obliged to see to it that p is true then you are obliged to see to it that at least one of p, q is true.\nOn the other hand, (1) seems unpersuasive if p stands for a nice state of affairs (you contribute to the Red Cross) and q for something bad (you pinch the cat). In this case, p ∨ q does not appear to represent a distinct obligation; at least, satisfying the\n∗Contact: osherson@princeton.edu, weinstein@cis.upenn.edu\ndisjunction with q seems not to meet any moral requirement. [The logic advanced below will declare (1) to be invalid.]\nSeveral other challenges to the development of deontic logic are discussed in McNamara (2010, §4). They encourage a tolerant attitude about alternative systems in the expectation that distinct approaches will prove necessary in different contexts (for example, legal versus technological; see Meyer et al., 1994). It is in this spirit that we here offer a deontic system built upon the preference logic advanced in Osherson and Weinstein (2012). The plan is to define deontic modalities like obligation in terms of the preference relation, then examine the consequences that follow from the underlying preference logic. The idea of deriving obligation from preference is based on Hansson (2002), and explored more thoroughly in Hansson (2013, §6.2). Our system differs from earlier work because of its distinctive logic of preference.\nA survey of deontic logics is available in Hilpinen and McNamara (2013), including discussion of the familiar Kripke-style semantics for obligation. A very different approach, based on default logic, is advanced in Horty (2012, Ch. 3). The logic of preference is reviewed in Hansson (2001), and more recently in Liu (2008); Dietrich and List (2009). Our system builds upon the concept of “selecting” a possible world to represent a formula; this technique was introduced by Stalnaker (1968) for the analysis of counterfactuals. The idea of attaching values to possible worlds in order to analyze preference among statements (pivotal in our system) appears in Rescher (1967) and elsewhere. An alternative perspective on preference is advanced in de Jongh and Liu (2009).\nWe proceed to a summary of our approach to preference logic, then return to deontic modality. The appendix sketches the proofs of the propositions that follow."}, {"heading": "2 A preference logic", "text": "We consider only the most elementary system formulated in Osherson and Weinstein (2012), leaving generalizations to one side. Also, the non-modal basis of the logic will be limited to the sentential calculus; extension to quantifiers is discussed in Osherson and Weinstein (2013)."}, {"heading": "2.1 Language", "text": "The language L of our preference logic is built from a nonempty set S of sentential variables, the unary connective ¬, the binary connectives ∧ and , along with the two parentheses. Formulas are defined inductively via:\np ∈ S | ¬ϕ | (ϕ ∧ ψ) | (ϕ ψ)\nWe rely on the following abbreviations.\n(ϕ ∨ ψ) for ¬(¬ϕ ∧ ¬ψ)\n(ϕ→ ψ) for (¬ϕ ∨ ψ)\n(ϕ↔ ψ) for ((ϕ→ ψ) ∧ (ψ → ϕ))\n(ϕ ≻ ψ) for (ϕ ψ) ∧ ¬(ψ ϕ)\n(ϕ ≈ ψ) for (ϕ ψ) ∧ (ψ ϕ)\n(ϕ ψ) for (ψ ϕ)\n(ϕ ≺ ψ) for (ψ ≻ ϕ)\n⊤ for (p→ p)\n⊥ for ¬⊤\nTo perceive the intended meaning of ϕ ≻ ψ, fix an agent A whose reasoning is at issue. Then ϕ ≻ ψ is true if and only if\nA envisions a situation in which ϕ is true and that otherwise differs little from her actual situation (if ϕ is already true then A’s actual situation may well be the one she envisions). Likewise, A envisions a second situation that is like her actual situation except that ψ is true. Finally, the utility of the first imagined situation exceeds that of the second.\nIn our formal semantics, the appeal to utility is underwritten by a function that maps possible worlds into real numbers. Several generalizations involving just an ordering of worlds are explored in Osherson and Weinstein (2012). Also, the latter paper represents utility as fractionated into separate scales thought of as reasons for preference. For example, if A is contemplating a political career, different considerations might compete in her mind, leading to a final evaluation of the options proceed or desist. To keep the present system as simple as possible, we here dispense with the issue of utility aggregation (explored in Osherson and Weinstein, 2012, 2013), letting embody relative value “all things considered.”\nThe appeal to alternative situations is based on a selection function of the kind envisioned by Stalnaker (1968), namely, as mapping a world-plus-proposition into another\nworld that satisfies the proposition. Intuitively, the chosen world is “similar” to the original world; it might even be the original world if the proposition is true in it. To enforce similarity, we will ultimately impose a powerful condition on selection functions.\nNote that L allows embedded occurrences of ≻ as in: p ≻ (q ≻ r). If p is loneliness, q is amassing great wealth, and r is finding true love then the formula would be true of A if she would rather be lonely than prefer riches to love (a real romantic)."}, {"heading": "2.2 Models", "text": "Models for L are built from a nonempty set W that embodies the imaginative possibilities (“worlds”) available to an agent in the course of practical deliberation. Subsets of W are called propositions. Selection functions are defined as follows.\n(2) Definition: A selection function s over W is a mapping from W × {A ⊆ W | A 6= ∅} to W such that for all w ∈ W and ∅ 6= A ⊆ W, s(w,A) ∈ A.\nThus, s(w,A) is a choice of world to represent A, where the choice depends on w. Next, each world is evaluated according to the model’s utility function.\n(3) Definition: A utility function over W is a mapping from W to the real numbers.\nRecall that S is the set of sentential variables in L. The last component of a model is an assignment of proposition to each variable in S.\n(4) Definition: A truth-assignment over W is a mapping from S to the power set of W.\nModels are defined as follows.\n(5) Definition: A model is a quadruple (W, s, u, t) where\n(a) W is a nonempty set of worlds;\n(b) s is a selection function over W;\n(c) u is a utility function over W;\n(d) t is a truth-assignment over W;"}, {"heading": "2.3 Semantics", "text": "It remains to specify the proposition (set of worlds) expressed by a formula ϕ in a model M. This proposition is denoted ϕ[M ], and defined inductively as follows.\n(6) Definition: Let ϕ ∈ L and model M = (W, s, u, t) be given.\n(a) If ϕ ∈ S then ϕ[M ] = t(ϕ).\n(b) If ϕ is the negation ¬θ then ϕ[M ] = W \\ θ[M ].\n(c) If ϕ is the conjunction (θ ∧ ψ) then ϕ[M ] = θ[M ] ∩ ψ[M ].\n(d) If ϕ has the form (θ ψ) then ϕ[M ] = ∅ if either θ[M ] = ∅ or ψ[M ] = ∅. Otherwise:\nϕ[M ] = {w ∈ W | u(s(w, θ[M ])) ≥ u(s(w,ψ[M ]))}.\nObserve that (θ ψ)[M ] is defined to be empty if there is no world that satisfies θ or none that satisfies ψ. Thus, we read (θ ψ) with existential import (“the θ-world is weakly better than the ψ-world,” where the definite description is Russellian). In the nontrivial case, let A 6= ∅ be the proposition expressed by θ in M, and B 6= ∅ the one expressed by ψ. Then (intuitively) world w satisfies (θ ψ) in M iff the world selected from A as closest to w has utility no less than that of the world selected from B as closest to w.\nLet ϕ,ψ ∈ L be given. Then (in the standard way), we say that ϕ implies ψ (ϕ |= ψ) just in case for every model M = (W, s, u, t), ϕ[M ] ⊆ ψ[M ]. Also, ϕ is valid (|= ϕ) just in case for every model M = (W, s, u, t), ϕ[M ] = W. To illustrate, it is easy to show that for all ϕ,ψ, θ ∈ L:\n|= ϕ ϕ\n(ϕ ψ) ∧ (ψ θ) |= ϕ θ\n|= ¬(⊥ ϕ) and |= ¬(ϕ ⊥)\nThe foregoing definitions relativize in the obvious way to subclasses of models. For example, ϕ implies ψ in a given class C of models just in case for every model M ∈ C, ϕ[M ] ⊆ ψ[M ]. In this case, we write ϕ |=C ψ."}, {"heading": "2.4 Alethic modality", "text": "Our logic allows expression of the global modality (see Blackburn et al. 2001, §2.1). For ϕ ∈ L, let:\n(7) ϕ def = ¬(¬ϕ ¬ϕ) and ♦ϕ def = (ϕ ϕ).\nThen unwinding clause (6)d of our semantic definition yields:\n(8) Proposition: For all ϕ ∈ L and models M = (W, s, u, t):\n(a) ϕ[M ] 6= ∅ iff ϕ[M ] = W iff ϕ[M ] = W.\n(b) ♦ϕ[M ] 6= ∅ iff ♦ϕ[M ] = W iff ϕ[M ] 6= ∅.\nFrom the proposition, we obtain that the axioms of S5 are valid for and ♦. Here are some other results involving modality. For all ϕ,ψ, θ ∈ L:\n|= ϕ↔ ¬♦¬ϕ |= ♦ϕ↔ ¬ ¬ϕ\n♦ϕ ∧ ♦ψ |= (ϕ ψ) ∨ (ψ ϕ)\n|= (♦ϕ ∧ ♦ψ) ↔ (¬(ϕ ψ) ↔ (ψ ≻ ϕ))\n|= ♦ϕ→ (ϕ ≈ ψ) if |= (ϕ↔ ψ)."}, {"heading": "3 A deontic system", "text": "We now offer definitions of deontic modalities in terms of . The definitions will be successful if they imply a rich set of principles about obligation while avoiding dubious claims."}, {"heading": "3.1 The primacy of conditional obligation", "text": "Suppose that p, q stand for the sentences below.\n(9) p : Life expectancy rises.\nq : Social Security revenues are enhanced.\nThen a situation satisfying p ought to satisfy q as well (according to progressives). Let us denote this judgment by C(p, q), where C is the dyadic modality of conditional obligation. It might be thought that monadic obligation (denoted by O) is more fundamental than C, allowing the latter to be defined in one of the ways shown here:\n(10) (a) C(p, q) def = O(p→ q)\n(b) C(p, q) def = p→ Oq\nBut neither definition is satisfactory. Since p → q is equivalent to ¬q → ¬p, the first suggests that C(p, q) if and only if C(¬q,¬p). Letting p, q be given by (9), we see that, to the contrary, C(p, q) can be true and C(¬q,¬p) false. For in a situation where Social Security revenues are not enhanced we are not obliged to lower life expectancy. The second definition in (10) entails that C(p, q) ∨C(¬p, q) is a logical truth, which is odd. (Neither attending baseball games nor failing to requires that I root for the Red Sox.)\nMore discussion of the obstacles to representing conditional obligation by a composite of O and the material conditional is available in McNamara (2010, §4.5). We here follow the consensus opinion (first articulated in Chisholm, 1964) that conditional obligation is the fundamental deontic concept, monadic obligation being derivative to it."}, {"heading": "3.2 Deontic definitions", "text": "So let us begin with conditional obligation.\n(11) Definition: For all ϕ,ψ ∈ L,\nC(ϕ,ψ) def = (ϕ ∧ ψ) ≻ (ϕ ∧ ¬ψ)\nContinuing with the example (9), Definition (11) glosses C(p, q) as:\nLife expectancy rises and Social Security revenues are enhanced is better than life expectancy rises and Social Security revenues are not enhanced.\nThe obligation is conditional in the sense that neither p nor q is rendered obligatory by C(p, q). We will not attempt to survey all the alternatives to (11) that come to mind but are unsuitable. One illustration suffices. The definition\nC(ϕ,ψ) def = ¬ϕ ≻ (ϕ ∧ ¬ψ)\nseems promising at first. (ϕ carries committment to ψ if it’s better that ϕ be false than be true without ψ.) But consider:\np : You save someone from drowning.\nq : You exhibit modesty when subsequently interviewed.\nFor these sentences, C(p, q) is plausible but ¬p ≻ (p∧¬q) is not since it’s better to save someone and brag about it than to let the victim drown.\nDefinition (11), as well as its competitors, is open to concerns about relevance. If p is tying your shoelaces, and q is saving a rainforest then p ∧ q is better than p ∧ ¬q. Yet it seems strange to believe that p carries the obligation q. It is not the mission of our logic, however, to keep track of all the circumstances giving rise to obligations; there may well be a back story that connects your shoelaces to the fate of a rain forest. Definition (11) should rather be assessed in terms of the plausibility of its consequences on the assumption that p carries the obligation q. Moreover, in a given application of deontic logic, all the concepts in play might be relevant to each other.\nFollowing Hilpinen (2001, p. 171), the two monadic modalities (obligation and permission) may be derived from C.\n(12) Definition: For all ψ ∈ L,\nOψ def = C(⊤, ψ) Pψ def = ¬O¬ψ\nThus, ψ is obligatory if it is required by the logically true proposition. ψ is permissible if its negation is not obligatory. Unravelling the definitions yields:\n(13) Proposition: For all ψ ∈ L,\n(a) |= (Oψ) ↔ (ψ ≻ ¬ψ)\n(b) |= (Pψ) ↔ (ψ ¬ψ)\nThat is, ψ is obligatory if its truth makes for a better world than does its falsity; ψ is permitted provided its truth doesn’t make things worse. The semantics of presented in Section 2.3, along with Definitions (11) and (12), will be called the basic system. Easy consequences of the basic system include:\n(14) Proposition: For all θ, ψ ∈ L,\n(a) ♦(θ) ∧ ♦(¬θ) |= P(θ) ∨ P(¬θ)\n(b) Oθ |= Pθ\n(c) |= ¬((Oθ) ∧O(¬θ))\n(d) |= ¬O⊤ |= ¬O⊥ |= ¬P⊥ |= ¬P⊤\n(e) C(θ, ψ) |= ♦(θ ∧ ψ) ∧ ♦(θ ∧ ¬ψ).\nGlosses for (14) are straightforward; for example, (14)e asserts that conditional obligations involve contingent propositions. The same is true for monadic obligation, as seen in (14)d — which already distinguishes the basic system from deontic logic based on Kripke models. The principles in (14) can be questioned but they are not outlandish. Nonetheless, the harvest of deontic principles in (14) is rather meager. Richer results will emerge in Section 4.1 when we relativize validity to a narrower class of models."}, {"heading": "3.3 Axiomatization", "text": "The weakness of the basic system is reflected in the simplicity of the formulas needed to axiomatize it. Axioms include all instances of any standard schematic axiomatization of S5 [using the modality defined in (7)], together with all instances of the following additional schemata.\n(15) (a) ((ϕ ψ) ∧ (ψ θ)) → (ϕ θ)\n(b) (♦ϕ ∧ ♦ψ) ↔ ((ϕ ψ) ∨ (ψ ϕ))\n(c) (ϕ↔ ψ) → (((ϕ θ) ↔ (ψ θ)) ∧ ((θ ϕ) ↔ (θ ψ)))\nThe axioms express little more than the preordering imposed by , a substitution property, and the S5 apparatus. The set of theorems is obtained from the closure of the axioms under modus ponens and necessitation. Of course, the deontic content of a theorem must be extracted via Definitions (11) and (12).\nIt follows from results demonstrated in Osherson and Weinstein (2013, §3) that the set of theorems is exactly the class of valid formulas of the basic system. Proofs of the decidability of this class, along with other metatheorems, are available in Osherson and Weinstein (2012, §6) and Osherson and Weinstein (2013, §4)."}, {"heading": "3.4 Chisolm’s paradox", "text": "We pause to consider Chisolm’s paradox (reviewed in McNamara, 2010, §4.5) which turns on the following statements.\n(16) (a) It ought to be that Jones goes to the assistance of his neighbors.\n(b) It ought to be that if Jones goes then he tells them he is coming.\n(c) If Jones doesn’t go then he ought not tell them he is coming.\n(d) Jones doesn’t go.\nA straightforward formalization of (16) in terms of O and the material conditional — for example, statement (16)c as ¬g → O¬t — leads to contradiction within the usual Kripke style semantics for deontic logic. (For Kripke semantics, see Chellas, 1980, Ch. 6). This is unwelcome inasmuch as the four statements seem perfectly compatible. In the present system, however, (16) goes over to:\n(17) (a) Og\n(b) C(g, t)\n(c) C(¬g,¬t)\n(d) ¬g\nThe formulas in (17) are satisfiable not only in the basic system but also in the class of models that we now introduce."}, {"heading": "4 Models based on symmetric difference", "text": "A class of models will now be introduced that gives sharper meaning to the idea that an envisioned world is “close” to the actual one."}, {"heading": "4.1 ∆ models", "text": "Recall that S is the set of propositional variables that underlie our modal language L. We henceforth identify the class W of worlds in a model with the power set of S. Also, the map t from variables to propositions will always be given by:\nt(p) = {w ∈ W | p ∈ w}, for every p ∈ S.\nThat is, p is mapped to the set of worlds that include p as a member.\nThe symmetric difference between sets X,Y is standardly denoted X∆Y and defined to be (X \\ Y ) ∪ (Y \\ X). Thus, the disagreement between two worlds w0, w1 may be represented by w0∆w1. We call a selection function s ∆-based if for all w0 ∈ W and propositions A there is no w1 ∈ A with w0∆w1 ⊂ w0∆s(w0, A). (Here, ⊂ is used in the “proper” sense.)\nTo illustrate ∆-based selection, let A = {w ∈ W | p ∈ w, q 6∈ w}. Suppose that world w0 includes both p and q. Then ∆-based s(w0, A) returns the world just like w0 except that q is excluded. In particular, r ∈ s(w0, A) iff r ∈ w0, and likewise for all other variables distinct from p, q. If w1 excludes both p and q then s(w1, A) returns the world just like w1 except that p is present. If w2 includes p but not q then w2 ∈ A and s(w2, A) = w2. (In this sense, ∆-based selection is “reflexive.”) If B is the set of worlds that includes either p or q or both, and w3 excludes both p and q then s must make a choice. Either s(w3, B) is just like w3 except for including p, or s(w3, B) is just like w3 except for including q. Note that s(w3, B) cannot return a world in which both p and q are present because B includes closer alternatives to w3, for example, the world just like w3 except for including p.\nSummarizing:\n(18) Definition: A model (W, s, u, t) is called ∆ just in case\n(a) W is the power set of S;\n(b) for all p ∈ S, t(p) = {w ∈ W | p ∈ w};\n(c) s is ∆-based.\nObserve that ∆ models place no restriction on the utility function u; it remains an arbitrary mapping of W to the reals."}, {"heading": "4.2 Validity in ∆", "text": "All the facts about the basic system that are recorded in Proposition (14) carry over when relativized to ∆. We also have the following facts (not derivable in the basic system).\n(19) Proposition:\n(a) Op ∧ (¬p ≻ ¬q) |=∆ Oq\n(b) Oq ∧ (p ≻ q) |=∆ Op\n(c) C(p, q) ∧ p |=∆ Oq\n(d) C(p ∧ r, q) ∧ C(p ∧ ¬r, q) |=∆ C(p, q)\n(e) C(p, q) |=∆ C(p ∧ r, q) ∨ C(p ∧ ¬r, q)\n(f) O(p ∧ q) ∧ (O(p ∧ ¬q) |=∆ Op\nFact (19)a is close to the “contranegativity” principle discussed in Hansson (2002). Hansson’s principle is plausible: If p is obligatory while missing out on q is worse than missing out on p then q should also be obligatory. The positive version (19)b seems equally reasonable. Fact (19)c is an expected detachment principle for conditional obligation. The next two facts can be interpreted as factorization properties of conditional obligation. Likewise, (19)f expresses factorization for monadic obligation.\nBut notice that we are missing the analog of (19)e for monadic obligation — namely, the inference from Op to O(p∧q)∨(O(p∧¬q) — which would complement (19)f. Indeed, the foregoing inference is invalid in ∆. Likewise, ∆ fails to validate other attractive principles, such as the inference from C(p, q) ∧ C(r, q) to C(p ∨ r, q). In response, we now introduce a weaker criterion of validity which performs better at classifying deontic principles."}, {"heading": "5 ∆-models that incorporate weight", "text": ""}, {"heading": "5.1 Weighting functions", "text": "The distance between worlds w0, w1 has so far been measured qualitatively in terms of symmetric difference. A more nuanced reckoning would allow some variables to affect distance more than others. For this purpose, we define a weighting function to be any map of S (the set of sentential variables) to the positive real numbers. In the context of such a map, the distance between two worlds may be defined as follows.\n(20) Definition: Let weighting function p, and worlds w0, w1 ⊆ S be given. Then:\np-distance(w0, w1) def =\n∑\nv∈w0∆w1\np(v).\nThus, p-distance is given by the sum of the weights of each variable that has different membership status in the two worlds at issue. (The p stands for poids, the use of w inviting confusion with worlds.)"}, {"heading": "5.2 Selection functions sensitive to weight", "text": "Let p be a weighting function. A selection function s is said to be p-based if for all w ∈ W and nonempty A ⊆ W, s(w,A) is chosen from among the p-nearest worlds to w in A. In other words, for s to be p-based, there must be no w′ ∈ A with p-distance(w,w′) < p-distance(w, s(w,A)). Intuitively, the greater the weight that p attaches to a variable q, the more reluctant is a p-based selection function to return a world in which q has changed its truth-value. Since weighting functions return positive numbers, it is easy to verify:\n(21) Fact: Every p-based selection function is ∆-based.\n5.3 P-validities\nBecause of (21), weighting functions can be used to define subclasses of ∆ models.\n(22) Definition: Let P be a class of weighting functions. For ϕ,ψ ∈ L, we write ϕ |= P ψ just in case for every p ∈ P, every p-based selection function s, and every ∆ model M with s as selection function, ϕ[M ] ⊆ ψ[M ].\nAs a special case, ∅ |=P ψ just in case for every p ∈ P, every p-based selection function s, and every ∆-based model M with s as selection function, ψ[M ] = W.\nIt is easy to see that the validities appearing in Propositions (14) and (19) are also valid in the sense of Definition (22), for any class P of weighting functions. If P is chosen with care, we obtain further principles, as in the following.\n(23) Proposition: Let P be the class of weighting functions that assign greater weight to q than to p and to r. Then:\n(a) C(r, p) |= P C(r, p ∧ q) ∨ C(r, p ∧ ¬q)\n(b) Op |= P O(p ∧ q) ∨ (O(p ∧ ¬q)\n(c) Pp |= P P(p ∧ q) ∨ P(p ∧ ¬q)\n(d) P(p ∧ q) ∧ (P(p ∧ ¬q) |= P Pp\n(e) C(q, p) ∧ C(r, p) |= P C(q ∨ r, p)\n(f) C(p ∨ q, r) |= P C(p, r) ∨C(q, r)\n(g) O(p ∧ q) ∧ p |= P Oq\n(h) O(p ∨ q) ∧ ¬q |= P Op\nIf the variables in these principles are permuted, the class P of weighting functions must be adjusted accordingly. The proposition only informs us that each of the principles is reliable in a broad and simple class of weighting functions, reflecting the relative importance of conserving the polarity of a certain variable when exploring possible worlds. It is hoped that this goes some way towards explaining the deontic appeal of the principles in the proposition.\nIndeed, (23)a-d express plausible fractionation properties of conditional obligation, monadic obligation, and permission; they complement the list provided by Proposition (19). Item (23)e commits an agent to leaving a tip if she goes to either of two fine restaurants on the assumption that she should leave a tip if she goes to the first and leave a tip if she goes to the second. This seems reasonable. Item (23)f is a partial converse. Suppose that the agent is comitted to paying U.S. taxes on the assumption that she lives in one of Chicago or Moscow. Then either she is commited to paying U.S. taxes on the assumption of living in Chicago or she is so committed on the assumption of living in Moscow. Concerning (23)g, if Johnny is obliged to feed the cat and straighten his room but the cat is already fed, then Johnny is left with the obligation to straighten his room. To illustrate (23)h, if the government must either build a tunnel or build a bridge and a bridge is not built, then the government must build a tunnel."}, {"heading": "5.4 Invalidity", "text": "The facts presented above suggest that our logic validates many deontically acceptable principles, or at least validates them relative to a large and coherent class of weighting functions. But a satisfactory deontic logic is also required to mark unacceptable principles as invalid. The natural choice for such a mark is invalidity with respect to every weighting function. We then have the following.\n(24) Proposition: For every weighting function p:\n(a) C(p ∨ q, r) 6|= {p} C(p, r) ∧ C(q, r)\n(b) O(p ∧ q) 6|= {p} Oq\n(c) O(p ∨ q) ∧O(¬q) 6|= {p} Op\n(d) C(p, q) 6|= {p} C(p ∧ r, q)\n(e) C(p, q) ∧Op 6|= {p} Oq\n(f) O(p→ q) 6|= {p} O(p) → O(q)\n(g) C(p, q) ∧ C(q, r) 6|= {p} C(p, r)\n(h) Op ∧Oq 6|= {p} O(p ∧ q)\n(i) C(p, q) ∧ C(p, r) 6|= {p} C(p, q ∧ r)\n(j) OOp 6|= {p} Op\n(k) C(p, q) ∧ C(r, q) 6|= {p} C(p ∧ r, q)\n(l) ∅ 6|= {p} O(Op→ p)\n(m) Op 6|= {p} O(p ∨ q)\nLet us try to jutify the items in (24). The same illustration used before shows that strengthening (23)f to (24)a fails. Being comitted to paying U.S. taxes on the assumption that you live in one of Chicago or Moscow leaves open the possibility that the commitment arises from living in Chicago, and this does not entail a commitment to paying U.S. taxes if one lives in Moscow. Similarly, (23)g cannot be strengthened to (24)b. A medical team may have the obligation to apply anesthetic and make an incision. This does not engender the unqualified obligation to make an incision for, despite their obligations, they might not have applied anesthetic. The same consideration underlies the inability to rewrite (23)h as (24)c. Suppose you’re obliged to throw either Tom or Harry out of the life boat. Because of his saintly character, you’re obliged not to do this to Harry. But it does not follow that you’re obliged to throw Tom into the sea. It depends on whether you fulfilled your obligation to Harry. If Harry has already been thrown overboard (despite your obligation), then you’re not required to make Tom join him.\nItem (24)d is undermined by setting p = I’m invited to a party honoring a close friend, q = I go to the party, and r = the police advise me not to go. For (24)e, consider p = I go to church, and q = I shout hallelujah. Although it may be true that going to my particular church obliges me to shout hallelujah, and that I am obliged to go to church, it doesn’t follow that I’m obliged to shout hallelujah, for I might not have fulfilled my obligation to go to church (and shouting hallelujah outside of church annoys people). The contrasting case with p rather than Op is listed among the ∆-validities as (19)c, above. Item (24)f is open to the same kind of counter example as (24)e; we rehearse it in the Discussion section in light of the centrality of the principle to standard deontic logic.\nA similar consideration undermines (24)g, a putative transitivity principle for conditional obligation. Suppose that an invasion by the enemy obliges us to stand and fight, and that the latter obliges us to blow up the bridges. It doesn’t follow that an invasion obliges us to blow up the bridges. It depends on whether we stand and fight\nor capitulate, that is, whether we live up to our first conditional obligation. If not, we shouldn’t blow up the bridges, violating transitivity.\nItem (24)h raises the issue of contradictory obligations. Perhaps a person could have the obligation to spend Saturday morning at the office (due to unfinished work that people are waiting for), and also the obligation to spend Saturday morning with her children. We might nonetheless resist the idea that the impossible conjunction of the two duties is obligatory. Such is the view of the logic developed here, which restricts obligation to contingent propositions. [Cf. (14)d]. Similar remarks apply to the related principle (24)i. For deeper discussion of moral conflict, see Horty (2012, Ch. 4).\nThe modal collapse envisioned in (24)j does not seem deontically viable. Let p = No one consumes more than 500 calories per day. It would be good if that were good since we would save on groceries. But it would not be good that p, since that would leave everyone malnourished. Regarding (24)k, let p be that you promise marriage to Joan, r be that you promise marriage to Jane, and q that you go to City Hall to swear monogamy. Each promise separately requires the oath of monogamy but their conjunction seems not to. Next, the formula O(Op → p) appearing in (24)l is initially attractive; it says that it is good that if p is good then p is true. But let p be that global temperature is stable, and consider the equivalent formulation: O(¬p→ P¬p) — which says (dubiously) it is good that if temperatures are unstable then this is permissible. Moreover, there might be conflicting good things as in p = The nation is united behind candidate Jones, q = The nation is united behind candidate Smith. Each of p, q might be good (to avoid political deadlock) but it can’t be good for their individual goodness to make each true since their joint truth is impossible.\nThis brings us to (24)m. The item may seem to be misclassified as invalid if read as the inference from “p is obligatory” to “at least one of p, q is obligatory.” But the appeal of the latter inference might rely on the illicit interpretation of “at least one of p, q is obligatory” as “either p is obligatory or q is obligatory (or both), a different assertion [see (25)b below]. Observe that if O(p) entails O(p ∨ q) then surely O(¬p) entails O(¬p ∨ ¬q) hence P(p ∧ q) entails P(q). But the latter assertion is open to the same objection raised against (24)b. That is, it might be permissible for a medical team to anaesthetize and make an incision without it being permitted tout court to make an incision; for, the incision is forbidden in case the anaesthetic was forgotten. Note also that the substitution of ¬p for q in the conclusion of (24)m yields O(⊤) which might be considered objectionable [as mentioned above in connection with (14)d].\nFurther invalid inferences are provided by the next proposition. Their deontic implausibility can be easily seen from examples like those deployed above. Some of the items in (25) have rather scant plausibility. They are included as evidence that our\nlogic does not “over-generate.”\n(25) Proposition: For every weighting function p:\n(a) Pp ∧ Pq 6|= {p} P(p ∧ q)\n(b) O(p ∨ q) 6|= {p} Op ∨Oq (c) p→ q 6|= {p} Op→ Oq\n(d) Op 6|= {p} O(p ∧ q)\n(e) Pp 6|= {p} P(p ∧ q)\n(f) ∅ 6|= {p} C(p, q) ∨ C(q, p)\n(g) O(p ∨ q) 6|= {p} Op\n(h) Op 6|= {p} p\n(i) Pp 6|= {p} POp\n(j) (¬q ≻ ¬p) ∧Op 6|= {p} Oq"}, {"heading": "6 Discussion", "text": "Via the foregoing developments, we have attempted to construct deontic modality from binary preference. Three systems were examined. The most basic embraces arbitrary models of the underlying preference logic and hence yields the fewest deontic validities [e.g., those exhibited in Proposition (14)]. The ∆ system narrows the class of models by identifying worlds with subsets of propositional variables, and requiring selection to minimize the symmetric difference between chosen and candidate worlds. New theorems emerge [see Proposition (19)]. The third system imposes an additional constraint on selection by declaring some variables to be more stable than others when choosing a possible world. This yields further validities [Proposition (23)].\nAt the same time, many implausible deontic principles are invalid even in the most constrained, third system [see Propositions (24), (25)]. Indeed, we hope to have shown that preference-based deontic logic makes tenable distinctions between validity and invalidity, especially when the impact of an obligation is distinguished from the impact of actually fulfilling the obligation [as already noted in Hintikka (1971)]. To illustrate the latter point one more time, consider again (24)f:\nO(p→ q) therefore O(p) → O(q)\nThis inference is central to standard deontic logic (McNamara, 2010, §2.1) but is invalid in our framework. Its intuitive invalidity is revealed by the instances:\np = I promise to call this evening.\nq = I call this evening.\nFor these statements, O(p→ q) may well be true (promise keeping). But Op is nonetheless insufficient to secure Oq; for, O(p → q) ∧Op is consistent with my failing to fulfill Op (even though it’s my obligation). In this case, the obligation Oq is not in force (or at least, not for promise reasons). Other points of divergence between standard deontic logic and the system advanced here include the inference from Op to O(p∨q), discussed in the Introduction and in connection with Proposition (24)m.\nThe goal, of course, is not to construct the uniquely accurate deontic logic; there is too much variability in judgment for such a project. Rather, we hope to populate the space of credible systems by starting from a novel semantics, namely, the preference semantics elaborated in Osherson and Weinstein (2012). A wide range of deontic logics may prove helpful in analyzing obligation and related concepts, as well as facilitating applications to Decision Science, jurisprudence, etc.\nThe underlying preference semantics can be enriched in several ways, each generating a distinct deontic system. As mentioned earlier, we have here exploited only a single utility scale whereas a plurality might be envisioned, measuring different aspects of morality (fairness, well being of the least favored, etc.). The question then arises how the scales should be combined; see the discussion in Osherson and Weinstein (2012, §5.3), Osherson and Weinstein (2013, §8-9). Likewise, new constraints on models may be introduced, and the language can be enriched with quantifiers (op. cit.). In each case, a wealth of axiomatic and decidability issues arise."}, {"heading": "Appendix: Remarks on demonstrations", "text": "Proposition (13) is evident, and implies Proposition (14)a,b. The last four items of Proposition (14) follow from clause (d) of Definition (6). For the harder propositions, we provide some partial proofs.\nProof of Proposition (19)\nWe illustrate the proof of Proposition (19) by doing clause (a):\nOp ∧ (¬p ≻ ¬q) |=∆ Oq\nTo prove this assertion it must be shown that Op∧ (¬p ≻ ¬q)[M ] ⊆ Oq[M ], for all ∆ models M. Let ϕ be (p ≻ ¬p)∧(¬p ≻ ¬q), and let ψ be q ≻ ¬q. By Proposition (13)a it suffices to show that ϕ[M ] ⊆ ψ[M ] for all ∆ models M. Let ∆ model M = (W, s, u, t) be given. We partition W into four cosets:\n(26) (a) worlds that include both p and q.\n(b) worlds that include p but not q.\n(c) worlds that include q but not p. and\n(d) worlds that include neither p nor q.\nArbitrary worlds of these four types will be denoted by [pq], [pq̄], [p̄q], and [p̄q̄]. We consider in turn the four kinds of worlds distinguished in (26). In each case it must be shown that if the world belongs to ϕ[M ] then it belongs to ψ[M ].\nTo begin, choose a world [pq] of type (26)a. Because s is ∆-based, we have:\n(27) (a) s([pq], p[M ]) = [pq]\n(b) s([pq], q[M ]) = [pq]\n(c) s([pq],¬p[M ]) = [p̄q]\n(d) s([pq],¬q[M ]) = [pq̄]\nwhere for all variables v not equal to p or q, v belongs to one of [pq], [pq̄], [p̄q] iff v belongs to all three of them. Suppose that [pq] ∈ ϕ[M ]. Then:\n(28) (a) u(s([pq],¬p[M ])) > u(s([pq],¬q[M ]))\n(b) u(s([pq], p[M ])) > u(s([pq],¬p[M ]))\nSo by (27) and (28):\n(29) (a) u([p̄q]) > u([pq̄])\n(b) u([pq]) > u([p̄q])\nDirectly from (29):\nu([pq]) > u([pq̄]),\nhence by (27):\n(30) u(s([pq], q[M ])) > u(s([pq],¬q[M ]))\nAnd (30) implies that [pq] ∈ ψ[M ].\nNext, choose a world [pq̄] of type (26)b. Because s is ∆-based, we have:\n(31) (a) s([pq̄], p[M ]) = [pq̄]\n(b) s([pq̄], q[M ]) = [pq]\n(c) s([pq̄],¬p[M ]) = [p̄q̄]\n(d) s([pq̄],¬q[M ]) = [pq̄]\nwhere for all variables v not equal to p or q, v belongs to one of [pq], [pq̄], [p̄q̄] iff v belongs to all three of them. Suppose that [pq̄] ∈ ϕ[M ]. Then:\n(32) (a) u(s([pq̄],¬p[M ])) > u(s([pq̄],¬q[M ]))\n(b) u(s([pq̄], p[M ])) > u(s([pq̄],¬p[M ]))\nSo by (31) and (32):\n(33) (a) u([p̄q̄]) > u([pq̄])\n(b) u([pq̄]) > u([p̄q̄])\nBut (33) is impossible, contradicting [pq̄] ∈ ϕ[M ]. Thus, [pq̄] is not a counter example to ϕ[M ] ⊆ ψ[M ].\nNext, choose a world [p̄q] of type (26)c. Because s is ∆-based, we have:\n(34) (a) s([p̄q], p[M ]) = [pq]\n(b) s([p̄q], q[M ]) = [p̄q]\n(c) s([p̄q],¬p[M ]) = [p̄q]\n(d) s([p̄q],¬q[M ]) = [p̄q̄]\nwhere for all variables v not equal to p or q, v belongs to one of [pq], [p̄q], [p̄q̄] iff v belongs to all three of them. Suppose that [p̄q] ∈ ϕ[M ]. Then:\n(35) (a) u(s([p̄q],¬p[M ])) > u(s([p̄q],¬q[M ]))\n(b) u(s([p̄q], p[M ])) > u(s([p̄q],¬p[M ]))\nSo by (34) and (35):\n(36) (a) u([p̄q]) > u([p̄q̄])\n(b) u([pq]) > u([p̄q])\nDirectly from (36)a and (34)b,d:\n(37) u(s([p̄q], q[M ])) > u(s([p̄q],¬q[M ]))\nAnd (37) implies that [p̄q] ∈ ψ[M ].\nFinally, choose a world [p̄q̄] of type (26)d. Because s is ∆-based, we have:\n(38) (a) s([p̄q̄], p[M ]) = [pq̄]\n(b) s([p̄q̄], q[M ]) = [p̄q]\n(c) s([p̄q̄],¬p[M ]) = [p̄q̄]\n(d) s([p̄q̄],¬q[M ]) = [p̄q̄]\nwhere for all variables v not equal to p or q, v belongs to one of [pq̄], [p̄q], [p̄q̄] iff v belongs to all three of them. Suppose that [p̄q̄] ∈ ϕ[M ]. Then:\n(39) (a) u(s([p̄q̄],¬p[M ])) > u(s([p̄q̄],¬q[M ]))\n(b) u(s([p̄q̄], p[M ])) > u(s([p̄q̄],¬p[M ]))\nSo by (38)c,d and (39)a:\nu([p̄q̄]) > u([p̄q̄]).\nBut this is impossible, contradicting [p̄q̄] ∈ ϕ[M ]. Thus, [p̄q̄] is not a counter example to ϕ[M ] ⊆ ψ[M ]. 2\nProof of Proposition (23)\nWe illustrate the proof of Proposition (23) by doing clause (h):\nO(p ∨ q) ∧ ¬q |= P Op\nwhere P is the class of weighting function that assign greater value to q than to either p or r. To prove the assertion it must be shown that O(p ∨ q) ∧ ¬q[M ] ⊆ Op[M ], for all ∆ models with p-based selection function drawn from P. Let ϕ be (((p ∨ q) ≻ (¬p ∧ ¬q)) ∧ ¬q), and let ψ be p ≻ ¬p. By Proposition (13)a it suffices to show that ϕ[M ] ⊆ ψ[M ] for all ∆ models with p-based selection function drawn from P. Let M be such a model. We partition W into the four cosets indicated in (26), and denote their members using the same notation as before. Observe that for all worlds w of types [pq] or [p̄q], w 6∈ ϕ[M ]. It thus suffices to show that if [pq̄] ∈ ϕ[M ] then [pq̄] ∈ ψ[M ], and that if [p̄q̄] ∈ ϕ[M ] then [p̄q̄] ∈ ψ[M ]. First consider [pq̄]. Because s is P-based (and hence ∆), we have:\n(40) (a) s([pq̄],¬p ∧ ¬q[M ]) = [p̄q̄]\n(b) s([pq̄], p[M ]) = [pq̄]\n(c) s([pq̄],¬p[M ]) = [p̄q̄]\n(d) s([pq̄], p ∨ q[M ]) = [pq̄]\nwhere for all variables v not equal to p or q, v belongs to one of [p̄q̄], [pq̄] iff v belongs to both of them. Suppose that [pq̄] ∈ ϕ[M ]. Then:\n(41) u(s([pq̄], p ∨ q[M ])) > u(s([pq̄],¬p ∧ ¬q[M ]))\nSo by (40) and (41):\n(42) u([pq̄]) > u([p̄q̄])\nhence by (40):\n(43) u(s([pq̄], p[M ])) > u(s([pq̄],¬p[M ]))\nAnd (43) implies that [pq̄] ∈ ψ[M ].\nNow consider [p̄q̄]. Because s is P-based, we have:\n(44) (a) s([p̄q̄],¬p ∧ ¬q[M ]) = [p̄q̄]\n(b) s([p̄q̄], p[M ]) = [pq̄]\n(c) s([p̄q̄],¬p[M ]) = [p̄q̄]\n(d) s([p̄q̄], p ∨ q[M ]) = [pq̄]\nwhere for all variables v not equal to p or q, v belongs to one of [p̄q̄], [pq̄] iff v belongs to both of them. Note that (44)d relies on our choice of weighting function. Since the function gives greater weight to q than to p, the polarity of q is preserved rather than that of p when a choice between the two must be made.\nSuppose that [p̄q̄] ∈ ϕ[M ]. Then:\n(45) u(s([p̄q̄], p ∨ q[M ])) > u(s([p̄q̄],¬p ∧ ¬q[M ]))\nSo by (44) and (45):\n(46) u([pq̄]) > u([p̄q̄])\nhence by (44):\n(47) u(s([p̄q̄], p[M ])) > u(s([p̄q̄],¬p[M ]))\nAnd (47) implies that [p̄q̄] ∈ ψ[M ]. 2\nProof of Propositions (24) and (25)\nWe do (24)f:\nFor every weighting function p: O(p→ q) 6|= {p} O(p) → O(q)\nLet ϕ = (p → q) ≻ (p ∧ ¬q) and ψ = (p ≻ ¬p) → (q ≻ ¬q). By Proposition (13)a it suffices to show that for every weighting function p, there is ∆ model M = (W, s, u, t) with p-based selection function such that for some w ∈ W: w ∈ ϕ[M ] but w 6∈ ψ[M ]. We partition W into the four cosets indicated in (26), and denote their members using the same notation as before. Pick a world of form [p̄q], Let M = (W, s, u, t) be such that:\n(48) (a) s([p̄q], p → q[M ]) = [p̄q]\n(b) s([p̄q], p ∧ ¬q[M ]) = [pq̄]\n(c) s([p̄q], p[M ]) = [pq]\n(d) s([p̄q],¬p[M ]) = [p̄q]\n(e) s([p̄q], q[M ]) = [p̄q]\n(f) s([p̄q],¬q[M ]) = [p̄q̄]\nwhere for all variables v not equal to p or q, v belongs to one of [p̄q], [pq̄], [pq], [p̄q̄] iff v belongs to all four of them. It is clear from (48) that s may be chosen to be p-based for any weighting function p inasmuch as all of the selections are dictated exclusively by minimizing symmetric difference of variables in the sense of subset. (See Section 4.1 above.)\nLet utility function u be such that:\n(49) (a) u(s([p̄q], p→ q[M ])) = u([p̄q]) = 2\n(b) u(s([p̄q], p ∧ ¬q[M ])) = u([pq̄]) = 1\n(c) u(s([p̄q], p[M ])) = u([pq]) = 3\n(d) u(s([p̄q],¬p[M) ]) = u([p̄q]) = 2\n(e) u(s([p̄q], q[M ])) = u([p̄q]) = 2\n(f) u(s([p̄q],¬q[M) ]) = u([p̄q̄]) = 4\nThen u(s([p̄q], p → q[M ])) = 2 > 1 = u(s([p̄q], p ∧ ¬q[M ])) so [p̄q] ∈ ϕ[M ]. On the other hand, u(s([p̄q], p[M ])) = 3 > 2 = u(s([p̄q],¬p[M) ]) but u(s([p̄q], q[M ])) = 2 < 4 = u(s([p̄q],¬q[M) ]). Hence, [p̄q] 6∈ ψ[M ]. 2"}], "references": [{"title": "Modal Logic", "author": ["P. Blackburn", "M. de Rijke", "Y. Venema"], "venue": null, "citeRegEx": "Blackburn et al\\.,? \\Q2001\\E", "shortCiteRegEx": "Blackburn et al\\.", "year": 2001}, {"title": "Modal logic: An introduction", "author": ["B. Chellas"], "venue": null, "citeRegEx": "Chellas.,? \\Q1980\\E", "shortCiteRegEx": "Chellas.", "year": 1980}, {"title": "The ethics of requirement", "author": ["R.M. Chisholm"], "venue": "American Philosophical Quarterly,", "citeRegEx": "Chisholm.,? \\Q1964\\E", "shortCiteRegEx": "Chisholm.", "year": 1964}, {"title": "Preference, priorities and belief", "author": ["D. de Jongh", "F. Liu"], "venue": "Preference Change: Approaches from Philosophy, Economics and Psychology. Springer,", "citeRegEx": "Jongh and Liu.,? \\Q2009\\E", "shortCiteRegEx": "Jongh and Liu.", "year": 2009}, {"title": "A reason-based theory of rational choice", "author": ["Franz Dietrich", "Christian List"], "venue": "Technical Report, London School of Economics,", "citeRegEx": "Dietrich and List.,? \\Q2009\\E", "shortCiteRegEx": "Dietrich and List.", "year": 2009}, {"title": "Semantics for more plausible deontic logics", "author": ["S. Hansson"], "venue": "DEON 02, Imperial College London,", "citeRegEx": "Hansson.,? \\Q2002\\E", "shortCiteRegEx": "Hansson.", "year": 2002}, {"title": "Alternative semantics for deontic logic", "author": ["Sven Ove Hansson"], "venue": "Handbook of Deontic Logic and Normative Systems.,", "citeRegEx": "Hansson.,? \\Q2013\\E", "shortCiteRegEx": "Hansson.", "year": 2013}, {"title": "Deontic logic: A historical survey and introduction", "author": ["Risto Hilpinen", "Paul McNamara"], "venue": "Handbook of Deontic Logic and Normative Systems.,", "citeRegEx": "Hilpinen and McNamara.,? \\Q2013\\E", "shortCiteRegEx": "Hilpinen and McNamara.", "year": 2013}, {"title": "Some main problems of deontic logic", "author": ["J. Hintikka"], "venue": "D. Reidel, Dordrecht,", "citeRegEx": "Hintikka.,? \\Q1971\\E", "shortCiteRegEx": "Hintikka.", "year": 1971}, {"title": "Reasons as Defaults", "author": ["John F. Horty"], "venue": null, "citeRegEx": "Horty.,? \\Q2012\\E", "shortCiteRegEx": "Horty.", "year": 2012}, {"title": "Changing for the Better: Preference Dynamics and Agent Diversity", "author": ["F. Liu"], "venue": "PhD thesis, ILLC, University of Amsterdam,", "citeRegEx": "Liu.,? \\Q2008\\E", "shortCiteRegEx": "Liu.", "year": 2008}, {"title": "The paradoxes of deontic logic revisited: A computer science perspective", "author": ["J.-J. Ch. Meyer", "F.P.M. Dignum", "R.J. Wieringa"], "venue": "Technical Report 38,", "citeRegEx": "Meyer et al\\.,? \\Q1994\\E", "shortCiteRegEx": "Meyer et al\\.", "year": 1994}, {"title": "Preference based on reasons", "author": ["Daniel Osherson", "Scott Weinstein"], "venue": "The Review of Symbolic Logic,", "citeRegEx": "Osherson and Weinstein.,? \\Q2012\\E", "shortCiteRegEx": "Osherson and Weinstein.", "year": 2012}, {"title": "Modal logic for preference based on reasons, pages 516–541", "author": ["Daniel Osherson", "Scott Weinstein"], "venue": "Number 8000 in LNCS. Springer,", "citeRegEx": "Osherson and Weinstein.,? \\Q2013\\E", "shortCiteRegEx": "Osherson and Weinstein.", "year": 2013}, {"title": "Semantic foundations for a the logic of preference", "author": ["N. Rescher"], "venue": null, "citeRegEx": "Rescher.,? \\Q1967\\E", "shortCiteRegEx": "Rescher.", "year": 1967}, {"title": "A theory of conditionals", "author": ["R. Stalnaker"], "venue": "Studies in logical theory. Blackwell, Oxford UK,", "citeRegEx": "Stalnaker.,? \\Q1968\\E", "shortCiteRegEx": "Stalnaker.", "year": 1968}], "referenceMentions": [{"referenceID": 12, "context": "Abstract Deontic modalities are here defined in terms of the preference relation explored in our previous work (Osherson and Weinstein, 2012).", "startOffset": 111, "endOffset": 141}, {"referenceID": 4, "context": "They encourage a tolerant attitude about alternative systems in the expectation that distinct approaches will prove necessary in different contexts (for example, legal versus technological; see Meyer et al., 1994). It is in this spirit that we here offer a deontic system built upon the preference logic advanced in Osherson and Weinstein (2012). The plan is to define deontic modalities like obligation in terms of the preference relation, then examine the consequences that follow from the underlying preference logic.", "startOffset": 194, "endOffset": 346}, {"referenceID": 3, "context": "The idea of deriving obligation from preference is based on Hansson (2002), and explored more thoroughly in Hansson (2013, §6.", "startOffset": 60, "endOffset": 75}, {"referenceID": 3, "context": "The idea of deriving obligation from preference is based on Hansson (2002), and explored more thoroughly in Hansson (2013, §6.2). Our system differs from earlier work because of its distinctive logic of preference. A survey of deontic logics is available in Hilpinen and McNamara (2013), including discussion of the familiar Kripke-style semantics for obligation.", "startOffset": 60, "endOffset": 287}, {"referenceID": 3, "context": "The idea of deriving obligation from preference is based on Hansson (2002), and explored more thoroughly in Hansson (2013, §6.2). Our system differs from earlier work because of its distinctive logic of preference. A survey of deontic logics is available in Hilpinen and McNamara (2013), including discussion of the familiar Kripke-style semantics for obligation. A very different approach, based on default logic, is advanced in Horty (2012, Ch. 3). The logic of preference is reviewed in Hansson (2001), and more recently in Liu (2008); Dietrich and List (2009).", "startOffset": 60, "endOffset": 505}, {"referenceID": 3, "context": "The idea of deriving obligation from preference is based on Hansson (2002), and explored more thoroughly in Hansson (2013, §6.2). Our system differs from earlier work because of its distinctive logic of preference. A survey of deontic logics is available in Hilpinen and McNamara (2013), including discussion of the familiar Kripke-style semantics for obligation. A very different approach, based on default logic, is advanced in Horty (2012, Ch. 3). The logic of preference is reviewed in Hansson (2001), and more recently in Liu (2008); Dietrich and List (2009).", "startOffset": 60, "endOffset": 538}, {"referenceID": 3, "context": "The logic of preference is reviewed in Hansson (2001), and more recently in Liu (2008); Dietrich and List (2009). Our system builds upon the concept of “selecting” a possible world to represent a formula; this technique was introduced by Stalnaker (1968) for the analysis of counterfactuals.", "startOffset": 88, "endOffset": 113}, {"referenceID": 3, "context": "The logic of preference is reviewed in Hansson (2001), and more recently in Liu (2008); Dietrich and List (2009). Our system builds upon the concept of “selecting” a possible world to represent a formula; this technique was introduced by Stalnaker (1968) for the analysis of counterfactuals.", "startOffset": 88, "endOffset": 255}, {"referenceID": 3, "context": "The logic of preference is reviewed in Hansson (2001), and more recently in Liu (2008); Dietrich and List (2009). Our system builds upon the concept of “selecting” a possible world to represent a formula; this technique was introduced by Stalnaker (1968) for the analysis of counterfactuals. The idea of attaching values to possible worlds in order to analyze preference among statements (pivotal in our system) appears in Rescher (1967) and elsewhere.", "startOffset": 88, "endOffset": 438}, {"referenceID": 3, "context": "An alternative perspective on preference is advanced in de Jongh and Liu (2009). We proceed to a summary of our approach to preference logic, then return to deontic modality.", "startOffset": 59, "endOffset": 80}, {"referenceID": 12, "context": "2 A preference logic We consider only the most elementary system formulated in Osherson and Weinstein (2012), leaving generalizations to one side.", "startOffset": 79, "endOffset": 109}, {"referenceID": 12, "context": "2 A preference logic We consider only the most elementary system formulated in Osherson and Weinstein (2012), leaving generalizations to one side. Also, the non-modal basis of the logic will be limited to the sentential calculus; extension to quantifiers is discussed in Osherson and Weinstein (2013).", "startOffset": 79, "endOffset": 301}, {"referenceID": 12, "context": "Several generalizations involving just an ordering of worlds are explored in Osherson and Weinstein (2012). Also, the latter paper represents utility as fractionated into separate scales thought of as reasons for preference.", "startOffset": 77, "endOffset": 107}, {"referenceID": 12, "context": "Several generalizations involving just an ordering of worlds are explored in Osherson and Weinstein (2012). Also, the latter paper represents utility as fractionated into separate scales thought of as reasons for preference. For example, if A is contemplating a political career, different considerations might compete in her mind, leading to a final evaluation of the options proceed or desist. To keep the present system as simple as possible, we here dispense with the issue of utility aggregation (explored in Osherson and Weinstein, 2012, 2013), letting embody relative value “all things considered.” The appeal to alternative situations is based on a selection function of the kind envisioned by Stalnaker (1968), namely, as mapping a world-plus-proposition into another", "startOffset": 77, "endOffset": 719}, {"referenceID": 5, "context": "Fact (19)a is close to the “contranegativity” principle discussed in Hansson (2002). Hansson’s principle is plausible: If p is obligatory while missing out on q is worse than missing out on p then q should also be obligatory.", "startOffset": 69, "endOffset": 84}, {"referenceID": 8, "context": "Indeed, we hope to have shown that preference-based deontic logic makes tenable distinctions between validity and invalidity, especially when the impact of an obligation is distinguished from the impact of actually fulfilling the obligation [as already noted in Hintikka (1971)].", "startOffset": 262, "endOffset": 278}, {"referenceID": 12, "context": "Rather, we hope to populate the space of credible systems by starting from a novel semantics, namely, the preference semantics elaborated in Osherson and Weinstein (2012). A wide range of deontic logics may prove helpful in analyzing obligation and related concepts, as well as facilitating applications to Decision Science, jurisprudence, etc.", "startOffset": 141, "endOffset": 171}], "year": 2014, "abstractText": "Deontic modalities are here defined in terms of the preference relation explored in our previous work (Osherson and Weinstein, 2012). Some consequences of the system are discussed.", "creator": "LaTeX with hyperref package"}}}