{"id": "1410.7856", "review": {"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "29-Oct-2014", "title": "A Statistical Decision-Theoretic Framework for Social Choice", "abstract": "In. making, does does giving epidemiological give - pre-defined contradiction opened ideas choice, putting similar focus where the will they be up on claim between a systems especially smugglers. In means framework, not often given a department ranking model, a decision space, and in loss wherein distinction off (formula_37, decision) pairs, such formulate context but inhibit as consider subject did vulnerability planned loss. This instance puts general solution not one design only examining part house social choice protocols. We surely Bayesian covariance, which minimize Bayesian reach combined, for the Mallows model still now Condorcet concept respectively, such the Kemeny passed. We consider various heterodox properties, in addition with computational complexity both asymptotic physical. In particular, we theme made where Bayesian estimator for is Condorcet conventional probability some desired types primarily another comment, safeguarding, same shelvock, if be decomposition throughout formula_45 came, often is similis typically half it mainly two stringent during the data are generates which several Condorcet design for all ground true parameter.", "histories": [["v1", "Wed, 29 Oct 2014 01:46:50 GMT  (166kb,D)", "https://arxiv.org/abs/1410.7856v1", "Full version of a NIPS-14 paper under the same title"], ["v2", "Sat, 12 Mar 2016 05:11:50 GMT  (166kb,D)", "http://arxiv.org/abs/1410.7856v2", "Full version of a NIPS-14 paper under the same title, fixed a typo in Theorem 1"]], "COMMENTS": "Full version of a NIPS-14 paper under the same title", "reviews": [], "SUBJECTS": "cs.AI cs.MA", "authors": ["hossein azari soufiani", "david c parkes", "lirong xia"], "accepted": true, "id": "1410.7856"}, "pdf": {"name": "1410.7856.pdf", "metadata": {"source": "CRF", "title": "A Statistical Decision-Theoretic Framework for Social Choice", "authors": ["Hossein Azari Soufiani", "David C. Parkes", "Lirong Xia"], "emails": ["azari@google.com,", "parkes@eecs.harvard.edu,"], "sections": [{"heading": "1 Introduction", "text": "Social choice studies the design and evaluation of voting rules (or rank aggregation rules). There have been two main perspectives: reach a compromise among subjective preferences of agents, or make an objectively correct decision. The former has been extensively studied in classical social choice in the context of political elections, while the latter is relatively less developed, even though it can be dated back to the Condorcet Jury Theorem in the 18th century [9].\nIn many multi-agent and social choice scenarios the main consideration is to achieve the second objective, and make an objectively correct decision. Meanwhile, we also want to respect agents’ preferences and opinions, and require the voting rule to satisfy well-established normative properties in social choice. For example, when a group of friends vote to choose a restaurant for dinner, perhaps the most important goal is to find an objectively good restaurant, but it is also important to use a good voting rule in the social choice sense. Even for applications with less societal context, e.g. using voting rules to aggregate rankings in meta-search engines [12], recommender systems [15], crowdsourcing [23], semantic webs [27], some social choice normative properties are still desired. For example, monotonicity may be desired, which requires that raising the position of an alternative in any vote does not hurt the alternative in the outcome of the voting rule. In addition, we require voting rules to be efficiently computable.\nSuch scenarios propose the following new challenge: How can we design new voting rules with good statistical properties as well as social choice normative properties?\nTo tackle this challenge, we develop a general framework that adopts statistical decision theory [3]. Our approach couples a statistical ranking model with an explicit decision space and loss function. ∗azari@google.com, Google Research, New York, NY 10011, USA. The work was done when the author was at Harvard University. †parkes@eecs.harvard.edu, Harvard University, Cambridge, MA 02138, USA. ‡xial@cs.rpi.edu, Rensselaer Polytechnic Institute, Troy, NY 12180, USA.\nar X\niv :1\n41 0.\n78 56\nv2 [\ncs .A\nI] 1\n2 M\nar 2\n01 6\nGiven these, we can adopt Bayesian estimators as social choice mechanisms, which make decisions to minimize the expected loss w.r.t. the posterior distribution on the parameters (called the Bayesian risk). This provides a principled methodology for the design and analysis of new voting rules.\nTo show the viability of the framework, we focus on selecting multiple alternatives (the alternatives that can be thought of as being “tied” for the first place) under a natural extension of the 0-1 loss function for two models: letM1ϕ denote the Mallows model with fixed dispersion [22], and letM2ϕ denote the Condorcet model proposed by Condorcet in the 18th century [9, 34]. In both models the dispersion parameter, denoted ϕ, is taken as a fixed parameter. The difference is that in the Mallows model the parameter space is composed of all linear orders over alternatives, while in the Condorcet model the parameter space is composed of all possibly cyclic rankings over alternatives (irreflexive, antisymmetric, and total binary relations).M2ϕ is a natural model that captures real-world scenarios where the ground truth may contain cycles, or agents’ preferences are cyclic, but they have to report a linear order due to the protocol. More importantly, as we will show later, a Bayesian estimator on M2ϕ is superior from a computational viewpoint. Through this approach, we obtain two voting rules as Bayesian estimators and then evaluate them with respect to various normative properties, including anonymity, neutrality, monotonicity, the majority criterion, the Condorcet criterion and consistency. Both rules satisfy anonymity, neutrality, and monotonicity, but fail the majority criterion, Condorcet criterion,1 and consistency. Admittedly, the two rules do not enjoy outstanding normative properties, but they are not bad either. We also investigate the computational complexity of the two rules. Strikingly, despite the similarity of the two models, the Bayesian estimator forM2ϕ can be computed in polynomial time, while computing the Bayesian estimator forM1ϕ is P NP || -hard, which means that it is at least NP-hard. Our results are summarized in Table 1.\nWe also compare the asymptotic outcomes of the two rules with the Kemeny rule for winners, which is a natural extension of the maximum likelihood estimator of M1ϕ proposed by Fishburn [14]. It turns out that when n votes are generated underM1ϕ, all three rules select the same winner asymptotically almost surely (a.a.s.) as n → ∞. When the votes are generated according toM2ϕ, the rule forM1ϕ still selects the same winner as Kemeny a.a.s.; however, for some parameters, the winner selected by the rule forM2ϕ is different with non-negligible probability. These are confirmed by experiments on synthetic datasets.\nRelated work. Along the second perspective in social choice (to make an objectively correct decision), in addition to Condorcet’s statistical approach to social choice [9, 34], most previous work in economics, political science, and statistics focused on extending the theorem to heterogeneous, correlated, or strategic agents for two alternatives, see [25, 1] among many others. Recent work in computer science views agents’ votes as i.i.d. samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7]. A limitation of these approaches is that they estimate the parameters of the model, but may not directly inform the right decision to make in the multi-agent context. The main approach has been to return the modal rank order implied by the estimated parameters, or the alternative with the highest, predicted marginal probability of being ranked in the top position.\nThere have also been some proposals to go beyond MLE in social choice. In fact, Young [34] proposed to select a winning alternative that is “most likely to be the best (i.e., top-ranked in the true ranking)” and provided formulas to compute it for three alternatives. This idea has been formalized\n1The new voting rule forM1ϕ fails them for all ϕ < 1/ √ 2.\nand extended by Procaccia et al. [29] to choose a given number of alternatives with highest marginal probability under the Mallows model. More recently, independent to our work, Elkind and Shah [13] investigated a similar question for choosing multiple winners under the Condorcet model. We will see that these are special cases of our proposed framework in Example 2. Pivato [26] conducted a similar study to Conitzer and Sandholm [10], examining voting rules that can be interpreted as expect-utility maximizers.\nWe are not aware of previous work that frames the problem of social choice from the viewpoint of statistical decision theory, which is our main conceptual contribution. Technically, the approach taken in this paper advocates a general paradigm of “design by statistics, evaluation by social choice and computer science”. We are not aware of a previous work following this paradigm to design and evaluate new rules. Moreover, the normative properties for the two voting rules investigated in this paper are novel, even though these rules are not really novel. Our result on the computational complexity of the first rule strengthens the NP-hardness result by Procaccia et al. [29], and the complexity for the second rule (Theorem 5) was independently discovered by Elkind and Shah [13].\nThe statistical decision-theoretic framework is quite general, allowing considerations such as estimators that minimize the maximum expected loss, or the maximum expected regret [3]. In a different context, focused on uncertainty about the availability of alternatives, Lu and Boutilier [20] adopt a decision-theoretic view of the design of an optimal voting rule. Caragiannis et al. [8] studied the robustness of social choice mechanisms w.r.t. model uncertainty, and characterized a unique social choice mechanism that is consistent w.r.t. a large class of ranking models.\nA number of recent papers in computational social choice take utilitarian and decision-theoretical approaches towards social choice [28, 6, 4, 5]. Most of them evaluate the joint decision w.r.t. agents’ subjective preferences, for example the sum of agents’ subjective utilities (i.e. the social welfare). We don’t view this as fitting into the classical approach to statistical decision theory as formulated by Wald [30]. In our framework, the joint decision is evaluated objectively w.r.t. the ground truth in the statistical model. Several papers in machine learning developed algorithms to compute MLE or Bayesian estimators for popular ranking models [18, 19, 21], but without considering the normative properties of the estimators."}, {"heading": "2 Preliminaries", "text": "In social choice, we have a set of m alternatives C = {c1, . . . , cm} and a set of n agents. Let L(C) denote the set of all linear orders over C. For any alternative c, let Lc(C) denote the set of linear orders over C where c is ranked at the top. Agent j uses a linear order Vj ∈ L(C) to represent her preferences, called her vote. The collection of agents votes is called a profile, denoted by P = {V1, . . . , Vn}. A (irresolute) voting rule r : L(C)n → (2C \\ ∅) selects a set of winners that are “tied” for the first place for every profile of n votes.\nFor any pair of linear orders V,W , let Kendall(V,W ) denote the Kendall-tau distance between V and W , that is, the number of different pairwise comparisons in V and W . The Kemeny rule (a.k.a. Kemeny-Young method) [17, 35] selects all linear orders with the minimum Kendall-tau distance from the preference profile P , that is, Kemeny(P ) = arg minW Kendall(P,W ). The most well-known variant of Kemeny to select winning alternatives, denoted by KemenyC , is due to Fishburn [14], who defined it as a voting rule that selects all alternatives that are ranked in the top position of some winning linear orders under the Kemeny rule. That is, KemenyC(P ) = {top(V ) : V ∈ Kemeny(P )}, where top(V ) is the top-ranked alternative in V . Voting rules are often evaluated by the following normative properties. An irresolute rule r satisfies:\n• anonymity, if r is insensitive to permutations over agents; • neutrality, if r is insensitive to permutations over alternatives; • monotonicity, if for any P , c ∈ r(P ), and any P ′ that is obtained from P by only raising the positions of c in one or multiple votes, then c ∈ r(P ′); • Condorcet criterion, if for any profile P where a Condorcet winner exists, it must be the unique winner. A Condorcet winner is the alternative that beats every other alternative in pair-wise elections.\n• majority criterion, if for any profile P where an alternative c is ranked in the top positions for more than half of the votes, then r(P ) = {c}. If r satisfies Condorcet criterion then it also satisfies the majority criterion.\n• consistency, if for any pair of profiles P1, P2 with r(P1)∩r(P2) 6= ∅, r(P1∪P2) = r(P1)∩r(P2). For any profile P , its weighted majority graph (WMG), denoted by WMG(P ), is a weighted directed graph whose vertices are C, and there is an edge between any pair of alternatives (a, b) with weight wP (a, b) = #{V ∈ P : a V b} −#{V ∈ P : b V a}. A parametric modelM = (Θ,S,Pr) is composed of three parts: a parameter space Θ, a sample space S composing of all datasets, and a set of probability distributions over S indexed by elements of Θ: for each θ ∈ Θ, the distribution indexed by θ is denoted by Pr(·|θ).2\nGiven a parametric modelM, a maximum likelihood estimator (MLE) is a function fMLE : S → Θ such that for any data P ∈ S, fMLE(P ) is a parameter that maximizes the likelihood of the data. That is, fMLE(P ) ∈ arg maxθ∈Θ Pr(P |θ). In this paper we focus on parametric ranking models. Given C, a parametric ranking modelMC = (Θ,Pr) is composed of a parameter space Θ and a distribution Pr(·|θ) over L(C) for each θ ∈ Θ, such that for any number of voters n, the sample space is Sn = L(C)n, where each vote is generated i.i.d. from Pr(·|θ). Hence, for any profile P ∈ Sn and any θ ∈ Θ, we have Pr(P |θ) =∏ V ∈P Pr(V |θ). We omit the sample space because it is determined by C and n. Definition 1 In the Mallows model [22], a parameter is composed of a linear order W ∈ L(C) and a dispersion parameter ϕ with 0 < ϕ < 1. For any profile P and θ = (W,ϕ), Pr(P |θ) =∏ V ∈P 1 Zϕ Kendall(V,W ), where Z is the normalization factor with Z = ∑ V ∈L(C) ϕ Kendall(V,W ).\nStatistical decision theory [30, 3] studies scenarios where the decision maker must make a decision d ∈ D based on the data P generated from a parametric model, generallyM = (Θ,S,Pr). The quality of the decision is evaluated by a loss functionL : Θ×D → R, which takes the true parameter and the decision as inputs.\nIn this paper, we focus on the Bayesian principle of statistical decision theory to design social choice mechanisms as choice functions that minimize the Bayesian risk under a prior distribution over Θ. More precisely, the Bayesian risk, RB(P, d), is the expected loss of the decision d when the parameter is generated according to the posterior distribution given data P . That is, RB(P, d) = Eθ|PL(θ, d). Given a parametric model M, a loss function L, and a prior distribution over Θ, a (deterministic) Bayesian estimator fB is a decision rule that makes a deterministic decision in D to minimize the Bayesian risk, that is, for any P ∈ S , fB(P ) ∈ arg mindRB(P, d). We focus on deterministic estimators in this work and leave randomized estimators for future research. Example 1 When Θ is discrete, an MLE of a parametric modelM is a Bayesian estimator of the statistical decision problem (M,D = Θ, L0-1) under the uniform prior distribution, where L0-1 is the 0-1 loss function such that L0-1(θ, d) = 0 if θ = d, otherwise L0-1(θ, d) = 1.\nIn this sense, all previous MLE approaches in social choice can be viewed as the Bayesian estimators of a statistical decision-theoretic framework for social choice whereD = Θ, a 0-1 loss function, and the uniform prior."}, {"heading": "3 Our Framework", "text": "Our framework is quite general and flexible because we can choose any parametric ranking model, any decision space, any loss function, and any prior to use the Bayesian estimators social choice mechanisms. Common choices of both Θ and D are L(C), C, and (2C \\ ∅). Definition 2 A statistical decision-theoretic framework for social choice is a tuple F = (MC ,D, L), where C is the set of alternatives, MC = (Θ,Pr) is a parametric ranking model, D is the decision space, and L : Θ×D → R is a loss function.\nLet B(C) denote the set of all irreflexive, antisymmetric, and total binary relations over C. For any c ∈ C, let Bc(C) denote the relations in B(C) where c a for all a ∈ C − {c}. It follows\n2This notation should not be taken to mean a conditional distribution over S unless we are taking a Bayesian point of view.\nthat L(C) ⊆ B(C), and moreover, the Kendall-tau distance can be defined to count the number of pairwise disagreements between elements of B(C). In the rest of the paper, we focus on the following two parametric ranking models, where the dispersion is a fixed parameter. Definition 3 (Mallows model with fixed dispersion, and the Condorcet model) Let M1ϕ denote the Mallows model with fixed dispersion, where the parameter space is Θ = L(C) and given any W ∈ Θ, Pr(·|W ) is Pr(·|(W,ϕ)) in the Mallows model, where ϕ is fixed. In the Condorcet model,M2ϕ, the parameter space is Θ = B(C). For any W ∈ Θ and any profile P , we have Pr(P |W ) = ∏ V ∈P ( 1 Zϕ Kendall(V,W ) ) , where Z is the normalization factor such that\nZ = ∑ V ∈B(C) ϕ Kendall(V,W ), and parameter ϕ is fixed.3\nM1ϕ and M2ϕ degenerate to the Condorcet model for two alternatives [9]. The Kemeny rule that selects a linear order is an MLE ofM1ϕ for any ϕ.\nWe now formally define two statistical decision-theoretic frameworks associated withM1ϕ andM2ϕ, which are the focus of the rest of our paper. Definition 4 For Θ = L(C) or B(C), any θ ∈ Θ, and any c ∈ C, we define a loss function Ltop(θ, c) such that Ltop(θ, c) = 0 if for all b ∈ C, c b in θ; otherwise Ltop(θ, c) = 1. Let F1ϕ = (M1ϕ, 2C \\ ∅, Ltop) and F2ϕ = (M2ϕ, 2C \\ ∅, Ltop), where for any C ⊆ C, Ltop(θ, C) =∑ c∈C Ltop(θ, c)/|C|. Let f1B (respectively, f2B) denote the Bayesian estimators of F1ϕ (respectively, F2ϕ) under the uniform prior.\nWe note that Ltop in the above definition takes a parameter and a decision in 2C \\ ∅ as inputs, which makes it different from the 0-1 loss function L0-1 that takes a pair of parameters as inputs, as the one in Example 1. Hence, f1B and f 2 B are not the MLEs of their respective models, as was the case in Example 1. We focus on voting rules obtained by our framework with Ltop. Certainly our framework is not limited to this loss function. Example 2 Bayesian estimators f1B and f2B coincide with Young [34]’s idea of selecting the alternative that is “most likely to be the best (i.e., top-ranked in the true ranking)”, under F1ϕ and F2ϕ respectively. This gives a theoretical justification of Young’s idea and other followups under our framework. Specifically, f1B is similar to rule studied by Procaccia et al. [29] and f 2 B was independently studied by Elkind and Shah [13].\nThe following lemma provides a convenient way to compute the likelihood inM1ϕ andM2ϕ from the WMG. Lemma 1 InM1ϕ (respectively,M2ϕ), for any W ∈ L(C) (respectively, W ∈ B(C)) and any profile P , Pr(P |W ) ∝ ∏ c W b ϕ −wP (c,b)/2.\nProof: For any c W b, the number of times b c in P is (n − wP (c, b))/2, which means that Pr(P |W ) = ϕn2(n−1)/4 ∏ c W b ϕ −wP (c,b)/2."}, {"heading": "4 Normative Properties of Bayesian Estimators", "text": "In this section, we compare f1B , f 2 B , and the Kemeny rule (for alternatives) w.r.t. various normative properties. We will frequently use the following lemma, whose proof follows directly from Bayes’ rule. We recall that Lc(C) is the set of all linear orders where c is ranked in the top, and Bc(C) is the set of binary relations in B(C) where c is ranked in the top. Lemma 2 In F1ϕ under the uniform prior, for any profile P and any c, b ∈ C, RB(P, c) ≤ RB(P, b) if and only if ∑ V ∈Lc(C) Pr(P |V ) ≥ ∑ V ∈Lb(C) Pr(P |V ). In F2ϕ under the uniform prior, for any profile P and any c, b ∈ C, RB(P, c) ≤ RB(P, b) if and only if ∑ V ∈Bc(C) Pr(P |V ) ≥ ∑ V ∈Bb(C) Pr(P |V ).\n3In the Condorcet model the sample space is B(C)n [31]. We study a variant with sample space L(C)n.\nTheorem 1 For any ϕ, f1B satisfies anonymity, neutrality, and monotonicity. It does not satisfy majority or the Condorcet criterion for all ϕ > 1√\n2 ,4 and it does not satisfy consistency.\nProof: Anonymity and neutrality are obviously satisfied.\nMonotonicity. Suppose c ∈ f1B(P ). To prove that f1B satisfies monotonicity, it suffices to prove that for any profile P ′ obtained from P by raising the position of c in one vote, c ∈ f1B(P ′). We first prove the following lemma. Lemma 3 For any c ∈ C, let P ′ denote a profile obtained from P by raising the position of c in one vote. For any W ∈ Lc(C), Pr(P ′|W ) = Pr(P |W )/ϕ; for any b ∈ C and any V ∈ Lb(C), Pr(P ′|V ) ≤ Pr(P |V )/ϕ. For any W ′ ∈ Bc(L), Pr(P ′|W ′) ≤ Pr(P |W ′)/ϕ; for any b ∈ C and any V ′ ∈ Bb(C), Pr(P ′|V ′) ≤ Pr(P |V ′)/ϕ.\nProof: For W ∈ Lc(C), the lemma holds because Kendall(P ′,W ) = Kendall(P,W ) − 1, and for V ∈ Lb(C), the lemma holds because Kendall(P ′, V ) ≥ Kendall(P, V ) − 1. The proof for Bc and Bb is similar. Therefore, for any b 6= c, by Lemma 3, we have ∑ W∈Lc(C) Pr(P\n′|W ) =∑ W∈Lc(C) Pr(P |W )/ϕ ≥ ∑ V ∈Lb(C) Pr(P |V )/ϕ ≥ ∑ V ∈Lb(C) Pr(P\n′|V ), which proves that c ∈ f1B(P ′) following Lemma 2. Majority and the Condorcet criterion. Let C = {c, b, c3, . . . , cm}. We construct a profile P ∗ where c is ranked in the top positions for more than half of the votes, which means that c is the Condorcet winner, but c 6∈ f1B(P ). For any k, let P ∗ denote a profile composed of k + 1 copies of [c b c3 · · · cm] and k − 1 copies of [b c3 · · · cm c]. It is not hard to verify that the WMG of P ∗ is as in Figure 1.\nLemma 4 ∑ V∈Lc(C) Pr(P ∗|V )∑\nW∈Lb(C) Pr(P∗|W ) =\n1+ϕ2k+···+ϕ2k(m−2) 1+ϕ2+···+ϕ2(m−2) · 1 ϕ2\nProof: Let L−c = L − {c} and let P |−c denote the profile where c is removed from all rankings.∑ V ∈Lc(C) Pr(P ∗|V ) ∝ϕ−m+1 ∑ V ′∈L(C−c) ϕKendall(P |−c,V ′)\n∝ϕ−m+1 ∑\nV ′∈L(C−c) ∏ a,d∈C−{c}:a V ′d ϕ−wP∗ (a,d)/2\n∝ϕ−m+1 m−2∑ t=0 ( m− 2 t ) t!(m− 2− t)!ϕktϕ−k(m−2−t) (1)\n∝ϕ−(m−2)k−m+1 m−2∑ t=0 ϕ2kt\nIn (1), t is the number of alternatives in {c3, . . . , cm} ranked above b in V ′. There are ( m−2 t ) such combinations, for each of which there are t! rankings among alternatives ranked above b and (m − 2 − t)! rankings among alternatives ranked below t. Notice that there are no edges between alternatives in C − {c, b} in the WMG, which means that for any V ′ where exactly t alternatives are ranked above b, the probability is proportional to ϕktϕ−k(m−2−t) by Lemma 1. Similarly,∑ V ∈Lb(C) Pr(P ∗|V ) ∝ ϕ−k(m−2)+1−(m−2) ∑m−2 t=0 ϕ 2t.\n4Whether f1B satisfies majority and Condorcet criterion for ϕ ≤ 1√2 is an open question.\nSince limm→∞ limk→∞ 1+ϕ 2k+···+ϕ2k(m−2)\n1+ϕ2+···+ϕ2(m−2) · 1 ϕ2 = 1−ϕ2 ϕ2 , for any ϕ > 1√ 2 , we can choose m and\nk so that ∑\nV∈Lc(C) Pr(P |V )∑ W∈Lb(C) Pr(P |W ) < 1. By Lemma 4, c is the Condorcet winner in P ∗ but it does not\nminimize the Bayesian risk underM1ϕ, which means that it is not a winner under f1B .\nConsistency. We construct an example to show that f1B does not satisfy consistency. In our construction m and n are even, and C = {c, b, c3, c4}. Let P1 and P2 denote profiles whose WMGs are as shown in Figure 2, respectively.\nWe provide the following lemma to compare the Bayesian risk of c and d. The proof is similar to the proof of Lemma 4.\nLemma 5 Let P ∈ {P1, P2}, ∑\nV∈Lc(C) Pr(P |V )∑ W∈Lb(C) Pr(P |W ) = 3(1+ϕ4k) 2(1+ϕ2k+ϕ4k)\nProof: Let P = P1 or P2.∑ V ∈Lc(C) Pr(P |V ) ∝ϕ−2k ∑ V ′∈L(C−c) ϕKendall(P |C−c ,V ′)\n∝ϕ−2k3(ϕ−2k + ϕ2k) Similarly ∑ V ∈Lb(C) Pr(P |V ) ∝ ϕ −2k2(ϕ−2k + 1 + ϕ2k).\nFor any 0 < ϕ < 1, 3(1+ϕ 4k)\n2(1+ϕ2k+ϕ4k) > 1 for all k. It is not hard to verify that f1B(P1) = f 1 B(P2) =\n{c}. However, it is not hard to verify that f1B(P1 ∪ P2) = {c, b}, which means that f1B is not consistent. This completes the proof of the theorem. Theorem 2 For any ϕ, f2B satisfies anonymity, neutrality, and monotonicity. It does not satisfy majority, the Condorcet criterion, or consistency.\nProof: Anonymity and neutrality are obvious. The proof for monotonicity is similar to the proof for f1B and uses the second part of Lemma 3.\nMajority and Condorcet criterion. We prove that f2B does not satisfy majority or the Condorcet criterion for the same profile P ∗ as used in the proof of Theorem 1. By Theorem 5 in the next section, we have:∑\nV ∈Bc(C) Pr(P ∗|V )∑\nW∈Bb(C) Pr(P ∗|W )\n= ( 11+ϕ2 )\nm−1\n( 1 1+ϕ2k )m−2( 11+ϕ−2 ) = (\n1 + ϕ2k\n1 + ϕ2 )m−2 · 1 + ϕ\n−2\n1 + ϕ2 (2)\nFor any k ≥ 2, there exits m such that (2)< 1, which means that the Condorcet winner c is not in f2B(P ∗).\nConsistency. We use the same profiles P1 and P2 as in the proof of Theorem 1 (see Figure 2). For P = P1 or P2, we have:∑\nV ∈Bc(C) Pr(P |V )∑ W∈Bb(C) Pr(P |W ) = ( 11+1 )( 1 1+ϕ2k )2 ( 11+1 ) 2( 1 1+ϕ4k ) = 2(1 + ϕ4k) (1 + ϕ2k)2 (3)\nFor any k and m, we have that the value of (3) is strictly greater than 1. It is not hard to verify that f2B(P1) = f 2 B(P2) = {c} and f2B(P1 ∪ P2) = {c, d}, which means that f2B is not consistent.\nBy Theorem 1 and 2, f1B and f 2 B do not satisfy as many desired normative properties as the Kemeny rule (for winners). On the other hand, they minimize Bayesian risk under F1ϕ and F2ϕ, respectively, for which Kemeny does neither. In addition, neither f1B nor f 2 B satisfy consistency, which means that they are not positional scoring rules."}, {"heading": "5 Computational Complexity", "text": "We consider the following two types of decision problems. Definition 5 In the BETTER BAYESIAN DECISION problem for a statistical decision-theoretic framework (MC ,D, L) under a prior distribution, we are given d1, d2 ∈ D, and a profile P . We are asked whether RB(P, d1) ≤ RB(P, d2).\nWe are also interested in checking whether a given alternative is the optimal decision. Definition 6 In the OPTIMAL BAYESIAN DECISION problem for a statistical decision-theoretic framework (MC ,D, L) under a prior distribution, we are given d ∈ D and a profile P . We are asked whether d minimizes the Bayesian risk RB(P, ·).\nPNP|| is the class of decision problems that can be computed by a P oracle machine with polynomial number of parallel calls to an NP oracle. A decision problem A is PNP|| -hard, if for any P NP || problem B, there exists a polynomial-time many-one reduction from B to A. It is known that PNP|| -hard problems are NP-hard. Theorem 3 For any ϕ, BETTER BAYESIAN DECISION and OPTIMAL BAYESIAN DECISION for F1ϕ under uniform prior are PNP|| -hard.\nProof: The hardness of both problems is proved by a unified polynomial-time many-one reduction from the KEMENY WINNER problem, which was proved to be PNP|| -complete by Hemaspaandra et al. [16]. In a KEMENY WINNER instance, we are given a profile and an alternative c, and we are asked if c is ranked in the top of at least one V ∈ L(C) that minimizes Kendall(P, V ). For any alternative c, the Kemeny score of c underM1ϕ is the smallest distance between the profile P and any linear order where c is ranked in the top. We prove that when ϕ < 1m! , the Bayesian risk of c is largely determined by the Kemeny score of c: Lemma 6 For any ϕ < 1m! and c, b ∈ C, if the Kemeny score of c is strictly smaller than the Kemeny score of b, then RB(P, c) < RB(P, b) forM1ϕ. Proof: Let kc and kb denote the Kemeny scores of c and b, respectively. We have∑ V ∈Lc(C) Pr(P |V ) > 1 Znϕ kc > 1Znm!ϕ kc−1 ≥ ∑ V ∈Lb(C) Pr(P |V ), which means that RB(P, c) < RB(P, b) by Lemma 2.\nWe note that ϕ may be larger than 1m! . In our reduction, we will duplicate the input profile so that effectively we are computing the problems for a small ϕ. Let t be any natural number such that ϕt < 1m! . For any KEMENY WINNER instance (P, c) for alternatives C\n′, we add two more alternatives {a, b} and define a profile P ′ whose WMG is as shown in Figure 3 using McGarvey’s trick [24]. The WMG of P ′ contains the WMG(P ) as a subgraph, where the weights are 6 times of the weights of WMG(P ); for all c′ ∈ C′, the weight of a→ c′ is 6; for all c′ ∈ C′ − {c}, the weight of b→ c′ is 6; the weight of c→ b is 4 and the weight of b→ a is 2.\nThen, we let P ∗ = tP , which is t copies of P . It follows that for any V ∈ L(C), Pr(P ∗|V, ϕ) = Pr(P ′|V, ϕt). By Lemma 6, if an alternative e has the strictly lowest Kemeny score for profile P ′, then it the unique alternative that minimizes the Bayesian risk for P ′ and dispersion parameter ϕt, which means that e minimizes the Bayesian risk for P ∗ and dispersion parameter ϕ.\nLet O denote the set of linear orders over C′ that minimizes the Kendall tau distance from P and let k denote this minimum distance. Choose an arbitrary V ′ ∈ O. Let V = [b a V ′]. It follows that Kendall(P ′, V ) = 4 + 6k. If there exists W ′ ∈ O where c is ranked in the top position, then\nwe let W = [a c b (V ′ − {c})]. We have Kendall(P ′,W ) = 2 + 6k. If c is not a Kemeny winner in P , then for any W where b is not ranked in the top position, Kendall(P ′,W ) ≥ 6 + 6k. Therefore, a minimizes the Bayesian risk if and only if c is a Kemeny winner in P , and if c does not minimizes the Bayesian risk, then b does. Hence BETTER DECISION (checking if a is better than b) and OPTIMAL BAYESIAN DECISION (checking if a is the optimal alternative) are PNP|| -hard.\nWe note that the OPTIMAL BAYESIAN DECISION for the framework in Theorem 3 is equivalent to checking whether a given alternative c is in f1B(P ). We do not know whether these problems are PNP|| -complete.\nTheorem 4 For any rational number ϕ,5 BETTER BAYESIAN DECISION and OPTIMAL BAYESIAN DECISION for F2ϕ under uniform prior are in P.\nThe theorem is a corollary of the following stronger theorem that provides a closed-form formula for Bayesian loss for F2ϕ.6 We recall that for any profile P and any pair of alternatives c, b, wP (c, b) is the weight on c→ b in the weighted majority graph of P .\nTheorem 5 For F2ϕ under uniform prior, for any c ∈ C, RB(P, c) = 1− ∏ b 6=c\n1\n1 + ϕwP (c,b) .\nProof: Given a profile P , for any c, b ∈ C, we let P (c b) denote the number of times c is preferred to b in P . For any c, b ∈ C, let K{c,b} = ϕP (c b) + ϕP (b c). The theorem is equivalent to proving\nthat ∑ V ∈Bc(C) Pr(V |P ) = ∏ b 6=c ϕP (b c)\nK{c,b} . We first calculate Pr(P ).\nPr(P ) = ∑\nW∈Bc(C)\nPr(P |W ) · Pr(W )\n=Pr(W ) · 1 Zn · ∏ {c,b} (ϕP (c b) + ϕP (b c))\n=Pr(W ) · 1 Zn · ∏ {c,b} K{c,b}\nFor any c ∈ C, we have:∑ W∈Bc(C) Pr(W |P ) = ∑ W∈Bc(C) Pr(P |W ) · Pr(W ) Pr(P )\n= Pr(W ) Pr(P ) · 1 Zn · ∏ b6=c ϕP (b c) ∑ V ′∈B(C−{c}) ϕKendall(P |C−c ,V ′)\n= Pr(W ) Pr(P ) · 1 Zn · ∏ b6=c ϕP (b c) ∏ b,e6=c (ϕP (e b) + ϕP (b e)) = ∏ b 6=c ϕP (b c) K{c,b}\nThe comparisons of Kemeny, f1B , and f 2 B are summarized in Table 1. According to the criteria we considered, none of the three outperforms the others. Kemeny does well in normative properties, but does not minimize Bayesian risk under either F1ϕ or F2ϕ, and is hard to compute. f1B minimizes the Bayesian risk under F1ϕ, but is hard to compute. We would like to highlight f2B , which minimizes the Bayesian risk under F2ϕ, and more importantly, can be computed in polynomial time despite the similarity between F1ϕ and F2ϕ. This makes f2B a practical voting rule that is also justified by Condorcet’s model.\n5We require ϕ to be rational to avoid representational issues. 6The formula resembles Young’s calculation for three alternatives [34], where it was not clear whether the\ncalculation was done for F2ϕ. Recently it was clarified by Xia [31] that this is indeed the case."}, {"heading": "6 Asymptotic Comparisons", "text": "In this section, we ask the following question: as the number of voters, n → ∞, what is the probability that Kemeny, f1B , and f 2 B choose different winners?\nWe show that when the data is generated from M1ϕ, all three methods are equal asymptotically almost surely (a.a.s.), that is, they are equal with probability 1 as n→∞. Theorem 6 Let Pn denote a profile of n votes generated i.i.d. fromM1ϕ given W ∈ Lc(C). Then, Prn→∞(Kemeny(Pn) = f1B(Pn) = f 2 B(Pn) = c) = 1.\nProof sketch: It is not hard to see that asymptotically almost surely, for any pair of alternatives a, b ∈ C, the number of times a b in Pn is (1 + o(1))nPr(a b|W ). As a corollary of a stronger theorem by [7], as n → ∞, c is the Condorcet winner, which means that Prn→∞(Kemeny(Pn) = c) = 1.\nWe now prove a lemma that will be useful for f1B and f 2 B . Lemma 7 For any W ∈ Lc(C), any alternatives a, b that are different from c, Pr(c b|W ) > Pr(a b|W ).\nProof: We have Pr(c b|W )− Pr(a b|W ) = Pr(c b a|W )− Pr(a b c|W ). For any linear order Vc b a where c b a, we let Va b c denote the linear order obtained from Vc b a by switching the positions of c and a. It follows that Kendall(Vc b a,W ) < Kendall(Va b c,W ), which means that Pr(c b|W ) > Pr(a b|W ). To prove the theorem for f1B , it suffices to prove that for any b 6= c and any 0 < ϕ < 1, asymptotically almost surely, we have ∑ V ∈Lc(C) ϕ Kendall(Pn,V ) > ∑ V ∈Lb(C) ϕ\nKendall(Pn,V ). For any Vc ∈ Lc(C), we let Vb denote the linear order obtained from Vc by exchanging the positions of c and b, which means that Vb ∈ Lb(C). Lemma 8 Prn→∞(Kendall(Pn, Vc) < Kendall(Pn, Vb)) = 1.\nProof: Given Vc, let C′ denote the set of alternatives between c and b in Vc. We have Kendall(Pn, Vb) − Kendall(Pn, Vc) = ∑ a∈C′ [wPn(a, b) − wPn(a, c)] + wPn(c, b) =∑\na∈C′ 2n[Pr(a b|W ) − Pr(a c|W )] + n(2 Pr(c b|W ) − 1) + o(n), where we recall that wPn(a b) = Pn(a b) − Pn(b a). By Lemma 7, for all a that is different from b and c, Pr(c a|W ) > Pr(b a|W ), which means Pr(a b|W ) − Pr(a c|W ) > 0. Since c is the Condorcet winner asymptotically almost sure, Pr(c b|W ) > 1/2. This proofs the claim. By Lemma 8, Prn→∞(∀Vc ∈ Lc(C),Kendall(Pn, Vc) < Kendall(Pn, Vd)) = 1, which means that\nPr n→∞\n( ∀Vc ∈ Lc(C), ϕKendall(Pn,Vc) < ϕKendall(Pn,Vd) ) = 1\nHence, Prn→∞( ∑ V ∈Lc(C) ϕ Kendall(Pn,V ) > ∑ V ∈Ld(C) ϕ\nKendall(Pn,V )) = 1. This proves the theorem for f1B .\nWe use Theorem 5 and Lemma 7 to prove the theorem for f2B . We note that ϕPn(b c)\nK{c,b} =\n1 1+ϕPn(c b)−Pn(b c) = 1 1+ϕ2Pn(c b)−n . By Lemma 7, Pr(c b|W ) > Pr(a b|W ), which means that asymptotically almost surely, we have the following steps of reasoning:\n(1) Pn(c b) > Pn(a b) for all a, b. (2) 1\n1+ϕ2Pn(c b)−n > 1 1+ϕ2Pn(a b)−n for all a and b.\n(3) ϕ Pn(b c)\nK{c,b} > ϕ\nPn(b a) K{a,b} .\n(4) For any a 6= c, ∏ b 6=c ϕPn(b c) K{c,b} > ∏ b 6=a ϕPn(b a) K{a,b} .\nFinally, applying Theorem 5 to (4), c is the unique winner asymptotically almost surely. This completes the proof of the theorem. Theorem 7 For any W ∈ B(C) and any ϕ, f1B(Pn) = Kemeny(Pn) a.a.s. as n → ∞ and votes in Pn are generated i.i.d. fromM2ϕ given W .\nFor any m ≥ 5, there exists W ∈ B(C) such that for any ϕ, there exists > 0 such that with probability at least , f1B(Pn) 6= f2B(Pn) and Kemeny(Pn) 6= f2B(Pn) as n → ∞ and votes in Pn are generated i.i.d. fromM2ϕ given W .\nProof sketch: Due to the Central Limit Theorem, for any V,W ∈ B(C), |Kendall(Pn, V ) − Kendall(Pn,W )| = Ω( √ n) a.a.s. By Lemma 1 and Lemma 2, any f1B winner c maximizes∑\nVc∈Lc(C) ϕ Kendall(Pn,Vc) ≈ maxVc∈Lc(C) ϕKendall(Pn,Vc) a.a.s. This means that c is the Kemeny\nwinner a.a.s.\nFor the second part, we sketch a proof for m = 5. Other cases can be proved similarly. Let W denote the binary relation as shown in Figure 4.\nIt can be verified that for all i ≤ 5, Pr(ci ci+1|W ) (we let c1 = c6) are the same and are larger than 1/2, denoted by p1; for all i ≤ 5, Pr(ci ci+2|W ) are the same and are larger than 1/2, denoted by p2. We define a random variable Xc b for any c W b such that for any V ∈ L(C), if c V b then Xc b = 1 otherwise Xc b = −1.\nLemma 9 {Xc b : c W b} are not linearly correlated.\nProof: Suppose for the sake of contradiction {Xc b : c W b} are linearly correlated. For anyXc b whose coefficient is non-zero, there exists a linear order V where c and b are ranked adjacently. Let V ′ denote the linear order obtained from V by switching the positions of c and b. We note thta Xc b(V ) = −Xc b(V ′), and other random variables in {Xc b : c W b} take the same values at V and V ′, this leads to a contradiction.\nThen, it follows from the multivariate Lindeberg-Lévy Central Limit Theorem (CLT) [? , Theorem D.18A] that {( ∑n j=1Xc b − pn)/ √ n : c W b} converges in distribution to a multivariate normal distribution N (0,Σ), where Σ is the covariance matrix, and is non-singular by Lemma 9. We note that ∑n j=1Xc b = Pn(c b).\nHence, with positive probability the following hold at the same time in WMG(Pn): • 0 < wPn(c5, c1)− (2p1 − 1)n < √ n; 0 < wPn(c4, c1)− (2p2 − 1)n < √ n. • √ n < wPn(c1, c2) − (2p1 − 1)n < 2 √ n; √ n < wPn(c5, c2) − (2p2 − 1)n < 2 √ n; 0 <\nwPn(c1, c3)− (2p2 − 1)n < √ n. • For any other ci W cj not mentioned above, 5 √ n < wPn(ci, cj)− (2 Pr(ci cj |W )− 1)n.\nIf Pn satisfies all above conditions, then by Theorem 5 f2B(Pn) = {c1}. Meanwhile, Kemeny(Pn) = f1B(Pn) = {c2} with [c2 c3 c4 c5 c1] minimizing the total Kendall-tau distance. This shows that f2B(Pn) 6= Kemeny(Pn) with non-negligible probability as n → ∞, and completes the proof of the theorem.\nTheorem 6 suggests that, when n is large and the votes are generated fromM1ϕ, all of f1B , f2B , and Kemeny will choose the alternative ranked in the top of the ground truth as the winner. Similar observations have been made for other voting rules by [7]. On the other hand, Theorem 7 tells us that when the votes are generated from M2ϕ, interestingly, for some ground truth parameter f2B is different from the other two with non-negligible probability, and as we will see in the next subsection, we are very confident that such probability is quite large (about 30% for given W shown in Figure 4)."}, {"heading": "6.1 Experiments", "text": "By Theorem 6 and 7, Kemeny and f1B are asymptotically equal when the data are generated from M1ϕ orM2ϕ. Hence, we focus on the comparison between rule f2B and Kemeny using synthetic data generated fromM2ϕ given the binary relation W illustrated in Figure 4.\nBy Theorem 5, the exact computation of Bayesian risk involves computing ϕΩ(n), which is exponentially small for large n since ϕ < 1. Hence, we need a special data structure to handle the computation of f2B , because a straightforward implementation easily loses precision. In our experiments, we use the following approximation for f2B :\nDefinition 7 For any c ∈ C and profile P , let s(c, P ) = ∑ b:wP (b,c)>0\nwP (b, c). Let g be the voting rule such that for any profile P , g(P ) = arg minc s(c, P ).\nIn words, g selects the alternative c with the minimum total weight on the incoming edges in the WMG. By Theorem 5, a f2B winner c maximizes ∏ b6=c ϕP (b c) K{c,b} = ∏ b 6=c 1 1+ϕwP (c,b) ,\nwhich means that c minimizes ∏ b 6=c(1 + ϕ wP (c,b)). In our experiments, ∏ b 6=c(1 + ϕ wP (c,b)) is\n(1 + o(1))ϕ ∑\nb:wP (b,c)>0 wP (b,c) for reasonably large n. Therefore, g is a good approximation of f2B\nwith reasonably large n. Formally, this is stated in the following theorem.\nTheorem 8 For any W ∈ B(C) and any ϕ, f2B(Pn) = g(Pn) a.a.s. as n→∞ and votes in Pn are generated i.i.d. fromM2ϕ given W .\nIn our experiments, data are generated by M2ϕ given W in Figure 4 for m = 5, n ∈ {100, 200, . . . , 2000}, and ϕ ∈ {0.1, 0.5, 0.9}. For each setting we generate 1500 profiles, and calculate the percentage for g and Kemeny to be different. The results are shown in Figuire 5. We observe that for ϕ = 0.1 and 0.5, the probability for g(Pn) 6= Kemeny(Pn) is about 30% for most n in our experiments; when ϕ = 0.9, the probability is about 10%. In light of Theorem 8, these results confirm Theorem 7. We have also conducted similar experiments forM1ϕ, and found that the g winner is the same as the Kemeny winner in all 10000 randomly generated profiles with m = 5, n = 100. This provides a sanity check for Theorem 6."}, {"heading": "7 Conclusions", "text": "There are some immediate open questions for future work, including the characterization of the exact computational complexity of f1B , and the normative properties of g. More generally, it is interesting to study the design and analysis of new voting rules using the proposed statistical decision-theoretic framework under alternative probabilistic models, e.g. random utility models, other loss functions, e.g. a smoother loss function, and other sample spaces including partial orders of a fixed set of k alternatives. We also plan to design and evaluate randomized estimators, and estimators that minimizes the maximum expected loss or the maximum expected regret [3]."}, {"heading": "8 Acknowledgments", "text": "We thank Shivani Agarwal, Craig Boutilier, Yiling Chen, Vincent Conitzer, Edith Elkind, Ariel Procaccia, and anonymous reviewers of AAAI-14 and NIPS-14 for helpful suggestions and discussions. Azari Soufiani acknowledges Siebel foundation for the scholarship in his last year of PhD studies. Parkes was supported in part by NSF grant CCF #1301976 and the SEAS TomKat fund. Xia acknowledges an RPI startup fund for support."}], "references": [{"title": "Information Aggregation, Rationality, and the Condorcet Jury Theorem", "author": ["David Austen-Smith", "Jeffrey S. Banks"], "venue": "The American Political Science Review,", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1996}, {"title": "Random utility theory for social choice", "author": ["Hossein Azari Soufiani", "David C. Parkes", "Lirong Xia"], "venue": "In Proc. NIPS,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2012}, {"title": "Statistical Decision Theory and Bayesian Analysis", "author": ["James O. Berger"], "venue": "Springer, 2nd edition,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 1985}, {"title": "Probabilistic and Utility-theoretic Models in Social Choice: Challenges for Learning, Elicitation, and Manipulation", "author": ["Craig Boutilier", "Tyler Lu"], "venue": "Workshop on Social Choice and AI,", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 2011}, {"title": "Optimal social choice functions: A utilitarian view", "author": ["Craig Boutilier", "Ioannis Caragiannis", "Simi Haber", "Tyler Lu", "Ariel D. Procaccia", "Or Sheffet"], "venue": "In Proc. EC,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 2012}, {"title": "Voting Almost Maximizes Social Welfare Despite Limited Communication", "author": ["Ioannis Caragiannis", "Ariel D. Procaccia"], "venue": "Artificial Intelligence,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2011}, {"title": "When do noisy votes reveal the truth", "author": ["Ioannis Caragiannis", "Ariel Procaccia", "Nisarg Shah"], "venue": "In Proc. EC,", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2013}, {"title": "Modal Ranking: A Uniquely Robust Voting Rule", "author": ["Ioannis Caragiannis", "Ariel D. Procaccia", "Nisarg Shah"], "venue": "In Proc. AAAI,", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 2014}, {"title": "Common voting rules as maximum likelihood estimators", "author": ["Vincent Conitzer", "Tuomas Sandholm"], "venue": "In Proc. UAI,", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 2005}, {"title": "Preference functions that score rankings and maximum likelihood estimation", "author": ["Vincent Conitzer", "Matthew Rognlie", "Lirong Xia"], "venue": "In Proc. IJCAI,", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2009}, {"title": "Rank aggregation methods for the web", "author": ["Cynthia Dwork", "Ravi Kumar", "Moni Naor", "D. Sivakumar"], "venue": "In Proc. WWW,", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2001}, {"title": "How to Pick the Best Alternative Given Noisy Cyclic Preferences", "author": ["Edith Elkind", "Nisarg Shah"], "venue": "In Proc. UAI,", "citeRegEx": "13", "shortCiteRegEx": "13", "year": 2014}, {"title": "Condorcet social choice functions", "author": ["Peter C. Fishburn"], "venue": "SIAM Journal on Applied Mathematics,", "citeRegEx": "14", "shortCiteRegEx": "14", "year": 1977}, {"title": "Voting for movies: the anatomy of a recommender system", "author": ["Sumit Ghosh", "Manisha Mundhe", "Karina Hernandez", "Sandip Sen"], "venue": "In Proc. AAMAS,", "citeRegEx": "15", "shortCiteRegEx": "15", "year": 1999}, {"title": "The complexity of Kemeny elections", "author": ["Edith Hemaspaandra", "Holger Spakowski", "Jörg Vogel"], "venue": "Theoretical Computer Science,", "citeRegEx": "16", "shortCiteRegEx": "16", "year": 2005}, {"title": "Learning to Rank from Bayesian Decision Inference", "author": ["Jen-Wei Kuo", "Pu-Jen Cheng", "Hsin-Min Wang"], "venue": "In Proc. CIKM,", "citeRegEx": "18", "shortCiteRegEx": "18", "year": 2009}, {"title": "Active Learning for Ranking Through Expected Loss Optimization", "author": ["Bo Long", "Olivier Chapelle", "Ya Zhang", "Yi Chang", "Zhaohui Zheng", "Belle Tseng"], "venue": "In Proc. SIGIR,", "citeRegEx": "19", "shortCiteRegEx": "19", "year": 2010}, {"title": "The Unavailable Candidate Model: A Decision-theoretic View of Social Choice", "author": ["Tyler Lu", "Craig Boutilier"], "venue": "In Proc. EC,", "citeRegEx": "20", "shortCiteRegEx": "20", "year": 2010}, {"title": "Learning mallows models with pairwise preferences", "author": ["Tyler Lu", "Craig Boutilier"], "venue": "In Proc. ICML,", "citeRegEx": "21", "shortCiteRegEx": "21", "year": 2011}, {"title": "Non-null ranking model", "author": ["Colin L. Mallows"], "venue": "Biometrika, 44(1/2):114–130,", "citeRegEx": "22", "shortCiteRegEx": "22", "year": 1957}, {"title": "Better human computation through principled voting", "author": ["Andrew Mao", "Ariel D. Procaccia", "Yiling Chen"], "venue": "In Proc. AAAI,", "citeRegEx": "23", "shortCiteRegEx": "23", "year": 2013}, {"title": "A theorem on the construction of voting", "author": ["David C. McGarvey"], "venue": "paradoxes. Econometrica,", "citeRegEx": "24", "shortCiteRegEx": "24", "year": 1953}, {"title": "The significance of independent decisions in uncertain dichotomous choice situations", "author": ["Shmuel Nitzan", "Jacob Paroush"], "venue": "Theory and Decision,", "citeRegEx": "25", "shortCiteRegEx": "25", "year": 1984}, {"title": "Voting rules as statistical estimators", "author": ["Marcus Pivato"], "venue": "Social Choice and Welfare,", "citeRegEx": "26", "shortCiteRegEx": "26", "year": 2013}, {"title": "Ontology Merging as Social Choice: Judgment Aggregation under the Open World Assumption", "author": ["Daniele Porello", "Ulle Endriss"], "venue": "Journal of Logic and Computation,", "citeRegEx": "27", "shortCiteRegEx": "27", "year": 2013}, {"title": "The Distortion of Cardinal Preferences in Voting", "author": ["Ariel D. Procaccia", "Jeffrey S. Rosenschein"], "venue": "In Proc. CIA,", "citeRegEx": "28", "shortCiteRegEx": "28", "year": 2006}, {"title": "A maximum likelihood approach for selecting sets of alternatives", "author": ["Ariel D. Procaccia", "Sashank J. Reddi", "Nisarg Shah"], "venue": "In Proc. UAI,", "citeRegEx": "29", "shortCiteRegEx": "29", "year": 2012}, {"title": "Statistical Decision Function", "author": ["Abraham Wald"], "venue": "New York: Wiley,", "citeRegEx": "30", "shortCiteRegEx": "30", "year": 1950}, {"title": "Deciphering young’s interpretation of condorcet’s model", "author": ["Lirong Xia"], "venue": "ArXiv,", "citeRegEx": "31", "shortCiteRegEx": "31", "year": 2014}, {"title": "A maximum likelihood approach towards aggregating partial orders", "author": ["Lirong Xia", "Vincent Conitzer"], "venue": "In Proc. IJCAI,", "citeRegEx": "32", "shortCiteRegEx": "32", "year": 2011}, {"title": "Aggregating preferences in multi-issue domains by using maximum likelihood estimators", "author": ["Lirong Xia", "Vincent Conitzer", "Jérôme Lang"], "venue": "In Proc. AAMAS,", "citeRegEx": "33", "shortCiteRegEx": "33", "year": 2010}, {"title": "Condorcet’s theory of voting", "author": ["H. Peyton Young"], "venue": "American Political Science Review,", "citeRegEx": "34", "shortCiteRegEx": "34", "year": 1988}, {"title": "A consistent extension of Condorcet’s election principle", "author": ["H. Peyton Young", "Arthur Levenglick"], "venue": "SIAM Journal of Applied Mathematics,", "citeRegEx": "35", "shortCiteRegEx": "35", "year": 1978}], "referenceMentions": [{"referenceID": 10, "context": "using voting rules to aggregate rankings in meta-search engines [12], recommender systems [15], crowdsourcing [23], semantic webs [27], some social choice normative properties are still desired.", "startOffset": 64, "endOffset": 68}, {"referenceID": 13, "context": "using voting rules to aggregate rankings in meta-search engines [12], recommender systems [15], crowdsourcing [23], semantic webs [27], some social choice normative properties are still desired.", "startOffset": 90, "endOffset": 94}, {"referenceID": 20, "context": "using voting rules to aggregate rankings in meta-search engines [12], recommender systems [15], crowdsourcing [23], semantic webs [27], some social choice normative properties are still desired.", "startOffset": 110, "endOffset": 114}, {"referenceID": 24, "context": "using voting rules to aggregate rankings in meta-search engines [12], recommender systems [15], crowdsourcing [23], semantic webs [27], some social choice normative properties are still desired.", "startOffset": 130, "endOffset": 134}, {"referenceID": 2, "context": "To tackle this challenge, we develop a general framework that adopts statistical decision theory [3].", "startOffset": 97, "endOffset": 100}, {"referenceID": 19, "context": "To show the viability of the framework, we focus on selecting multiple alternatives (the alternatives that can be thought of as being “tied” for the first place) under a natural extension of the 0-1 loss function for two models: letMφ denote the Mallows model with fixed dispersion [22], and letMφ denote the Condorcet model proposed by Condorcet in the 18th century [9, 34].", "startOffset": 282, "endOffset": 286}, {"referenceID": 31, "context": "To show the viability of the framework, we focus on selecting multiple alternatives (the alternatives that can be thought of as being “tied” for the first place) under a natural extension of the 0-1 loss function for two models: letMφ denote the Mallows model with fixed dispersion [22], and letMφ denote the Condorcet model proposed by Condorcet in the 18th century [9, 34].", "startOffset": 367, "endOffset": 374}, {"referenceID": 12, "context": "We also compare the asymptotic outcomes of the two rules with the Kemeny rule for winners, which is a natural extension of the maximum likelihood estimator of Mφ proposed by Fishburn [14].", "startOffset": 183, "endOffset": 187}, {"referenceID": 31, "context": "Along the second perspective in social choice (to make an objectively correct decision), in addition to Condorcet’s statistical approach to social choice [9, 34], most previous work in economics, political science, and statistics focused on extending the theorem to heterogeneous, correlated, or strategic agents for two alternatives, see [25, 1] among many others.", "startOffset": 154, "endOffset": 161}, {"referenceID": 22, "context": "Along the second perspective in social choice (to make an objectively correct decision), in addition to Condorcet’s statistical approach to social choice [9, 34], most previous work in economics, political science, and statistics focused on extending the theorem to heterogeneous, correlated, or strategic agents for two alternatives, see [25, 1] among many others.", "startOffset": 339, "endOffset": 346}, {"referenceID": 0, "context": "Along the second perspective in social choice (to make an objectively correct decision), in addition to Condorcet’s statistical approach to social choice [9, 34], most previous work in economics, political science, and statistics focused on extending the theorem to heterogeneous, correlated, or strategic agents for two alternatives, see [25, 1] among many others.", "startOffset": 339, "endOffset": 346}, {"referenceID": 8, "context": "samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7].", "startOffset": 111, "endOffset": 137}, {"referenceID": 9, "context": "samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7].", "startOffset": 111, "endOffset": 137}, {"referenceID": 30, "context": "samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7].", "startOffset": 111, "endOffset": 137}, {"referenceID": 29, "context": "samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7].", "startOffset": 111, "endOffset": 137}, {"referenceID": 1, "context": "samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7].", "startOffset": 111, "endOffset": 137}, {"referenceID": 26, "context": "samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7].", "startOffset": 111, "endOffset": 137}, {"referenceID": 6, "context": "samples from a statistical model, and computes the MLE to estimate the parameters that maximize the likelihood [10, 11, 33, 32, 2, 29, 7].", "startOffset": 111, "endOffset": 137}, {"referenceID": 31, "context": "In fact, Young [34] proposed to select a winning alternative that is “most likely to be the best (i.", "startOffset": 15, "endOffset": 19}, {"referenceID": 26, "context": "[29] to choose a given number of alternatives with highest marginal probability under the Mallows model.", "startOffset": 0, "endOffset": 4}, {"referenceID": 11, "context": "More recently, independent to our work, Elkind and Shah [13] investigated a similar question for choosing multiple winners under the Condorcet model.", "startOffset": 56, "endOffset": 60}, {"referenceID": 23, "context": "Pivato [26] conducted a similar study to Conitzer and Sandholm [10], examining voting rules that can be interpreted as expect-utility maximizers.", "startOffset": 7, "endOffset": 11}, {"referenceID": 8, "context": "Pivato [26] conducted a similar study to Conitzer and Sandholm [10], examining voting rules that can be interpreted as expect-utility maximizers.", "startOffset": 63, "endOffset": 67}, {"referenceID": 26, "context": "[29], and the complexity for the second rule (Theorem 5) was independently discovered by Elkind and Shah [13].", "startOffset": 0, "endOffset": 4}, {"referenceID": 11, "context": "[29], and the complexity for the second rule (Theorem 5) was independently discovered by Elkind and Shah [13].", "startOffset": 105, "endOffset": 109}, {"referenceID": 2, "context": "The statistical decision-theoretic framework is quite general, allowing considerations such as estimators that minimize the maximum expected loss, or the maximum expected regret [3].", "startOffset": 178, "endOffset": 181}, {"referenceID": 17, "context": "In a different context, focused on uncertainty about the availability of alternatives, Lu and Boutilier [20] adopt a decision-theoretic view of the design of an optimal voting rule.", "startOffset": 104, "endOffset": 108}, {"referenceID": 7, "context": "[8] studied the robustness of social choice mechanisms w.", "startOffset": 0, "endOffset": 3}, {"referenceID": 25, "context": "A number of recent papers in computational social choice take utilitarian and decision-theoretical approaches towards social choice [28, 6, 4, 5].", "startOffset": 132, "endOffset": 145}, {"referenceID": 5, "context": "A number of recent papers in computational social choice take utilitarian and decision-theoretical approaches towards social choice [28, 6, 4, 5].", "startOffset": 132, "endOffset": 145}, {"referenceID": 3, "context": "A number of recent papers in computational social choice take utilitarian and decision-theoretical approaches towards social choice [28, 6, 4, 5].", "startOffset": 132, "endOffset": 145}, {"referenceID": 4, "context": "A number of recent papers in computational social choice take utilitarian and decision-theoretical approaches towards social choice [28, 6, 4, 5].", "startOffset": 132, "endOffset": 145}, {"referenceID": 27, "context": "We don’t view this as fitting into the classical approach to statistical decision theory as formulated by Wald [30].", "startOffset": 111, "endOffset": 115}, {"referenceID": 15, "context": "Several papers in machine learning developed algorithms to compute MLE or Bayesian estimators for popular ranking models [18, 19, 21], but without considering the normative properties of the estimators.", "startOffset": 121, "endOffset": 133}, {"referenceID": 16, "context": "Several papers in machine learning developed algorithms to compute MLE or Bayesian estimators for popular ranking models [18, 19, 21], but without considering the normative properties of the estimators.", "startOffset": 121, "endOffset": 133}, {"referenceID": 18, "context": "Several papers in machine learning developed algorithms to compute MLE or Bayesian estimators for popular ranking models [18, 19, 21], but without considering the normative properties of the estimators.", "startOffset": 121, "endOffset": 133}, {"referenceID": 32, "context": "Kemeny-Young method) [17, 35] selects all linear orders with the minimum Kendall-tau distance from the preference profile P , that is, Kemeny(P ) = arg minW Kendall(P,W ).", "startOffset": 21, "endOffset": 29}, {"referenceID": 12, "context": "The most well-known variant of Kemeny to select winning alternatives, denoted by KemenyC , is due to Fishburn [14], who defined it as a voting rule that selects all alternatives that are ranked in the top position of some winning linear orders under the Kemeny rule.", "startOffset": 110, "endOffset": 114}, {"referenceID": 19, "context": "Definition 1 In the Mallows model [22], a parameter is composed of a linear order W ∈ L(C) and a dispersion parameter φ with 0 < φ < 1.", "startOffset": 34, "endOffset": 38}, {"referenceID": 27, "context": "Statistical decision theory [30, 3] studies scenarios where the decision maker must make a decision d ∈ D based on the data P generated from a parametric model, generallyM = (Θ,S,Pr).", "startOffset": 28, "endOffset": 35}, {"referenceID": 2, "context": "Statistical decision theory [30, 3] studies scenarios where the decision maker must make a decision d ∈ D based on the data P generated from a parametric model, generallyM = (Θ,S,Pr).", "startOffset": 28, "endOffset": 35}, {"referenceID": 31, "context": "Example 2 Bayesian estimators f B and f B coincide with Young [34]’s idea of selecting the alternative that is “most likely to be the best (i.", "startOffset": 62, "endOffset": 66}, {"referenceID": 26, "context": "[29] and f 2 B was independently studied by Elkind and Shah [13].", "startOffset": 0, "endOffset": 4}, {"referenceID": 11, "context": "[29] and f 2 B was independently studied by Elkind and Shah [13].", "startOffset": 60, "endOffset": 64}, {"referenceID": 28, "context": "In the Condorcet model the sample space is B(C) [31].", "startOffset": 48, "endOffset": 52}, {"referenceID": 14, "context": "[16].", "startOffset": 0, "endOffset": 4}, {"referenceID": 21, "context": "For any KEMENY WINNER instance (P, c) for alternatives C ′, we add two more alternatives {a, b} and define a profile P ′ whose WMG is as shown in Figure 3 using McGarvey’s trick [24].", "startOffset": 178, "endOffset": 182}, {"referenceID": 31, "context": "The formula resembles Young’s calculation for three alternatives [34], where it was not clear whether the calculation was done for F φ.", "startOffset": 65, "endOffset": 69}, {"referenceID": 28, "context": "Recently it was clarified by Xia [31] that this is indeed the case.", "startOffset": 33, "endOffset": 37}, {"referenceID": 6, "context": "As a corollary of a stronger theorem by [7], as n → ∞, c is the Condorcet winner, which means that Prn→∞(Kemeny(Pn) = c) = 1.", "startOffset": 40, "endOffset": 43}, {"referenceID": 6, "context": "Similar observations have been made for other voting rules by [7].", "startOffset": 62, "endOffset": 65}, {"referenceID": 2, "context": "We also plan to design and evaluate randomized estimators, and estimators that minimizes the maximum expected loss or the maximum expected regret [3].", "startOffset": 146, "endOffset": 149}], "year": 2016, "abstractText": "In this paper, we take a statistical decision-theoretic viewpoint on social choice, putting a focus on the decision to be made on behalf of a system of agents. In our framework, we are given a statistical ranking model, a decision space, and a loss function defined on (parameter, decision) pairs, and formulate social choice mechanisms as decision rules that minimize expected loss. This suggests a general framework for the design and analysis of new social choice mechanisms. We compare Bayesian estimators, which minimize Bayesian expected loss, for the Mallows model and the Condorcet model respectively, and the Kemeny rule. We consider various normative properties, in addition to computational complexity and asymptotic behavior. In particular, we show that the Bayesian estimator for the Condorcet model satisfies some desired properties such as anonymity, neutrality, and monotonicity, can be computed in polynomial time, and is asymptotically different from the other two rules when the data are generated from the Condorcet model for some ground truth parameter.", "creator": "LaTeX with hyperref package"}}}