{"id": "1502.05375", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "18-Feb-2015", "title": "On learning k-parities with and without noise", "abstract": "We 2000 consider while example particular learning $ subset $ - devaluate in. brought - route 'm - being introducing: result taking onto invariant $ 98 \\ in \\ {2-0, 1 \\} ^ n $ took $ | 2 | = formula_2 $ and man encoded following \" comments \" $ 9,946, a_2, .. . \\ entered \\ {1-0, 2002 \\} ^ n $, central into algorithm them statements intended separate mean with $ & comm; a_i, (& gt; \\ pmod 26 $, perhaps entire an make misjudgment although since ten similar how did saw the algorithm their based same structural? We establishing long 2002 world already both Buhrman mémoires salah. began any $ \\ trv (α) $ term also full as parameters.", "histories": [["v1", "Wed, 18 Feb 2015 20:36:19 GMT  (16kb)", "http://arxiv.org/abs/1502.05375v1", null]], "reviews": [], "SUBJECTS": "cs.DS cs.DM cs.LG", "authors": ["arnab bhattacharyya", "ameet gadekar", "ninad rajgopal"], "accepted": false, "id": "1502.05375"}, "pdf": {"name": "1502.05375.pdf", "metadata": {"source": "CRF", "title": "On learning k-parities with and without noise", "authors": ["Arnab Bhattacharyya", "Ameet Gadekar", "Ninad Rajgopal"], "emails": [], "sections": [{"heading": null, "text": "ar X\niv :1\n50 2.\n05 37\n5v 1\n[ cs\n.D S]\n1 8\nFe b\nWe first consider the problem of learning k-parities in the on-line mistake-bound model: given a hidden vector x ∈ {0, 1}n with |x| = k and a sequence of “questions” a1, a2, · · · ∈ {0, 1}\nn, where the algorithm must reply to each question with 〈ai, x〉 (mod 2), what is the best tradeoff between the number of mistakes made by the algorithm and its time complexity? We improve the previous best result of Buhrman et. al. [BGM10] by an exp(k) factor in the time complexity.\nSecond, we consider the problem of learning k-parities in the presence of classification noise of rate η ∈ (0, 1/2). A polynomial time algorithm for this problem (when η > 0 and k = ω(1)) is a longstanding challenge in learning theory. Grigorescu et al. [GRV11] showed an algorithm running in time (\nn k/2\n)1+4η2+o(1) . Note that this algorithm inherently requires time (\nn k/2\n)\neven when the noise rate η is poly-\nnomially small. We observe that for sufficiently small noise rate, it is possible to break the ( n k/2 ) barrier. In particular, if for some function f(n) = ω(1) and α ∈ [1/2, 1), k = n/f(n) and η = o(f(n)−α/ log n), then there is an algorithm for the problem with running time poly(n) · (\nn k )1−α · e−k/4.01."}, {"heading": "1 Introduction", "text": "By now, the “Parity Problem” of Blum, Kalai and Wasserman [BKW03] has acquired widespread notoriety. The question is simple enough to be in our second sentence: in order to learn a hidden vector x ∈ {0, 1}n, what is the least number of random examples (a, ℓ) that need to be seen, where a is uniformly chosen from {0, 1}n and ℓ = ∑\ni aixi (mod 2) with probability at least 1 − η? Information-theoretically, x can be recovered only after O(n) examples, even if the noise rate η is close to 1/2. But if we add the additional constraint that the running time of the learning algorithm be minimized, the barely subexponential running time of [BKW03]’s algorithm, 2O(n/ log n), still holds the record of being the fastest known for this problem!\nLearning parities with noise is a central problem in theoretical computer science. It has incarnations in several different areas of computer science, including coding theory as the problem of learning random binary linear codes and cryptography as the “learning with errors” problem that underlies lattice-based cryptosystems [Reg09, BV11]. In learning theory, the special case of the problem where the hidden vector x is known to be supported on a set of size k much smaller than n has great relevance. We refer to this problem as learning k-parity with noise or k-LPN. Feldman et al. [FGKP09] showed that learning k-juntas, as well as learning 2k-term DNFs from uniformly random examples and variants of these problems in which the noise is adversarial instead of random, all reduce to the k-LPN problem. For the k-LPN problem, the current record is that of Grigorescu, Reyzin and Vempala [GRV11] who showed a learning algorithm that succeeds with constant probability, takes (\nn k/2 )1+(2η)2+o(1) time and uses k logn(1−2η)2 · ω(1) samples. When the\n∗Supported in part by DST Ramanujan Fellowship. Email: arnabb@csa.iisc.ernet.in †Email: ameet.gadekar@csa.iisc.ernet.in ‡Email: ninad.rajgopal@csa.iisc.ernet.in\nnoise rate η is close to 1/2, this running time is improved by an algorithm due to G. Valiant [Val12] that runs in time n0.8k · poly( 11−2η ). It is a wide open challenge to find a polynomial time algorithm for k-LPN for growing k or to prove a negative result.\nAnother outstanding challenge in machine learning is the problem of learning parities without noise in the “attribute-efficient” setting [Blu96]. The algorithm is given access to a source of examples (a, ℓ) where a is chosen uniformly from {0, 1}n and ℓ = ∑\ni aixi (mod 2) with no noise, and the question is to learn x while simultaneously reducing the time complexity and the number of examples drawn by the algorithm. Again, we focus on the case where x has sparsity k ≪ n. Information-theoretically, of course, O(k logn) examples should be sufficient, as each linearly independent example reduces the number of consistent k-parities by a factor of 2. But the fastest known algorithm making O(k logn) samples runs in time Õ( (\nn k/2\n)\n) [KS06], and it\nis open whether there exists a polynomial time algorithm for learning parities that is attribute-efficient, i.e. it makes poly(k logn) samples. Buhrman, Garćıa-Soriano and Matsliah [BGM10] give the current best tradeoffs between the sample complexity and running time for learning parities in this noiseless setting. Notice that with O(n) samples, it is easy to learn the k-parity in polynomial time using Gaussian elimination."}, {"heading": "1.1 Our Results", "text": "We first study the noiseless setting. Our main technical result is an improved tradeoff between the sample complexity and runtime for learning parities.\nTheorem 1.1. Let k, t : N → N be two functions1 satisfying log logn ≪ k(n) ≪ t(n) ≪ n. For any δ > 0, there is an algorithm that learns the concept class of k-parities on n variables with confidence parameter δ, using O(kn/t + log (\nt k\n) + log(1/δ)) uniformly random examples and e−k/4.01 ( t k )\n· poly(n) · log(1/δ) running time2.\nActually, we prove our result in the mistake-bound model [Lit89] that is stronger than the PAC model discussed above (in fact, strictly stronger assuming the existence of one-way functions [Blu94]). As a consequence, a theorem of the above form also holds when the examples come from an arbitrary distribution. We defer the statement of the result for the mistake-bound model to Section 3.\nFor comparison, let us quote the closely related result of Buhrman et. al.:\nTheorem 1.2 (Theorem 2.1 of [BGM10]). Let k, t : N → N be two functions satisfying k(n) 6 t(n) 6 n. For any δ > 0, there is an algorithm that learns the concept class of k-parities on n variables with confidence parameter δ, using O(kn/t+log (\nt k\n) +log(1/δ)) uniformly random examples and ( t k )\n·poly(n)·log(1/δ) running time.\nThus, in the comparable regime, our Theorem 1.1 improves the runtime complexity of Theorem 3.2 by an exp(k) factor while its sample complexity remains the same upto constant factors. Note that as t approaches k, our algorithm makes O(n) samples and takes poly(n) time which is the complexity of the Gaussian elimination approach. On the other hand, if t = n/ log(n/k), our algorithm makes O(k log(n/k)) samples and takes3 exp(−k) · (\nn/k k\n)\ntime (ignoring polynomial factors), compared to the trivial approach which explicitly keeps track of the subset of all the k-weight parities consistent with examples given so far and which makes O(k log(n/k)) samples and takes O( (\nn k\n)\n) time. We next examine the noisy setting. Here, our contribution is a simple, general observation that does not\nseem to have been explicitly made before.\nTheorem 1.3. Given an algorithm A that learns PAR(k) over the uniform distribution with confidence parameter δ using s(δ) samples and running time t(δ),there is an algorithm A′ that solves the k-LPN problem with noise rate η ∈ (0, 1/3), using O(s(δ/2) log(1/δ)) examples and running time exp(O(H(3η/2) · s(δ/2) · log(1/δ)))) · (t(δ/2) + s(δ/2) log(1/δ)) and with confidence parameter δ.\n1We assume throughout, as in [BGM10], that k and t are constructible in quadratic time. 2The “4.01” can be replaced by any constant more than 4. 3By exp(·), we mean 2O(·).\nIn the above, H : [0, 1] → [0, 1] denotes the binary entropy function H(p) = p log2 1 p + (1 − p) log2 1 1−p . The main conceptual message carried by Theorem 1.3 is that improving the sample complexity for efficient learning of noiseless parity improves the running time for learning of noisy parity. For instance, if we use Spielman’s algorithm as A, reported in [KS06], that learns k-parity using O(k logn) samples and O( (\nn k/2\n)\n)\nrunning time, we immediately get the following:\nCorollary 1.4. For any η ∈ (0, 1/3) and constant confidence parameter, there is an algorithm for k-LPN with sample complexity O(k log n) and running time (\nn k/2 )1+O(H(1.5η)) .\nFor comparison, the current best result of [GRV11] has runtime ( n k/2\n)1+4η2+o(1) and sample complex-\nity ω(k logn). In the regime under consideration, our algorithm’s runtime has a worse exponent but an asymptotically better sample complexity.\nThe result of [GRV11] requires ( n k/2 ) time regardless of how small η is. We show via Theorem 1.3 and\nTheorem 1.1 that it is possible to break the ( n k/2 ) barrier when η is a small enough function of n.\nCorollary 1.5. Suppose k(n) = n/f(n) for some function f : N → N for which f(n) ≪ n/ log logn, and suppose η(n) = o( 1((f(n))α logn) ) for some α ∈ [1/2, 1). Then, for constant confidence parameter, there exists an algorithm for k-LPN with noise rate η with running time e−k/4.01+o(k) · (\nn k )1−α · poly(n) and sample\ncomplexity O(k(f(n))α).\nWe note that because of the results of Feldman et. al. [FGKP09], the above results for k-LPN also extend to the setting where the example source adversarially mislabels examples instead of randomly but with the same rate η."}, {"heading": "1.2 Our Techniques", "text": "We first give an algorithm to learn parities in the noiseless setting in the mistake bound model. We use the same approach as that of [BGM10] (which was itself inspired by [APY09]). The idea is to consider a family S of subsets of {0, 1}n such that the hidden k-sparse vector is contained inside one of the elements of S. We maintain this invariant throughout the algorithm. Now, each time an example comes, it specifies a halfspace H of {0, 1}n inside which the hidden vector is lying. So, we can update S by taking the intersection of each of its elements with H . If we can ensure that the set of points covered by the elements of S is decreasing by a constant factor at every round, then after O(log ∑\nS∈S |S|) examples, the hidden vector is learned. The runtime is determined by the number of sets in S times the cost of taking the intersection of each set with a halfspace.\nOne can think of the argument of Buhrman et al. [BGM10] as essentially initializing S to be the set of all (\nn k\n)\nsubspaces spanned by k standard basis vectors. The intersections of these subspaces with a halfspace can be computed efficiently by Gaussian elimination. Our idea is to reduce the number of sets in S. Note that we can afford to make the size of each set in S larger by some factor C because this only increases the sample complexity by an additive logC. Our approach is (essentially) to take S to be a random collection of subspaces spanned by αk standard basis vectors, where α > 1 is a sufficiently large constant. We show that it is sufficient for the size of S to be smaller than (\nn/α k\n)\nby a factor that is exponential in k, so that the running time is also improved by the same factor. Moreover, the sample complexity increases by only a lower-order additive term.\nOur second main contribution is a reduction from noiseless parity learning to noisy parity learning. The algorithm is a simple exhaustive search which guesses the location of the mislabelings, corrects those labels, applies the learner for noiseless parity and then verifies whether the output hypothesis matches the examples by drawing a few more samples. Surprisingly, this seemingly immediate algorithm allows us to devise the first algorithm which has a better running time than (\nn k/2\n)\nin the presence of a non-trivial amount of noise.\nThe lesson seems to be that if we hope to beat ( n k/2 ) for constant noise rates, we should first address the open question of Blum [Blu96] of devising an attribute-efficient algorithm to learn parity without noise."}, {"heading": "2 Preliminaries", "text": "Let PAR(k) be the class of all f ∈ {0, 1}n of Hamming weight k. So, |PAR(k)| = ( n k )\n. With each vector f ∈ PAR(k), we associate a parity function f : {0, 1}n → {0, 1} defined by f(a) =\n∑n i=1 xiai (mod 2).\nLet C be a concept class of Boolean functions on n variables, such as PAR(k). We discuss two models of learning in this work. One is Littlestone’s online mistake bound model [Lit89]. Here, learning proceeds in a series of rounds, where in each round, the learner is given an unlabeled boolean example a ∈ {0, 1}n and must predict the value f(a) of an unknown target function f ∈ C. Once the learner predicts the value of f(a), the true value of f(a) is revealed to the learner by the teacher. The mistake bound of a learning algorithm is the worst-case number of mistakes that the algorithm makes over all sequences of examples and all possible target functions f ∈ C.\nThe second model of learning we consider is Valiant’s famous PAC model [Val84] of learning from random examples. Here, for an unknown target function f ∈ C, the learner has access to a source of examples (a, f(a)) where a is chosen independently from a distribution D on {0, 1}n. A learning algorithm is said to PAC-learn C with sample complexity s, running time t, approximation parameter ε and confidence parameter δ if for all distributions D and all target functions f ∈ C, the algorithm draws at most s samples from the example source, runs for time at most t and outputs a function f∗ such that, with a probability at least 1− δ:\nPr a←D\n[f(a) 6= f∗(a)] < ε\nOften in this paper (e.g., all of the Introduction), we consider PAC-learning over the uniform distribution, in which case D is fixed to be uniform on {0, 1}n. Notice that for learning PAR(k) over the uniform distribution, we can take ε = 12 because any two distinct parities differ on half of {0, 1}\nn. There are standard conversion techniques which can be used to transform any mistake-bound algorithm\ninto a PAC learning algorithm (over arbitrary distributions):\nTheorem 2.1 ([Ang88, Hau88, Lit89]). Any algorithm A that learns a concept class C in the mistake-bound model with mistake bound m and running time t per round can be converted into an algorithm A′ that PAClearns C with sample complexity O(1εm+ 1 ε log 1 δ ), running time O( 1 εmt+ t ε log 1 δ ), approximation parameter ε, and confidence parameter δ.\nThe k-LPN problem with noise rate η, introduced in Section 1, corresponds to the problem of PAClearning PAR(k) under the uniform distribution, when the example source can mislabel examples with a rate η ∈ (0, 1/2). More generally, one can study the k-LPN problem over D, an arbitrary distribution. [GRV11] show the following for this problem:\nTheorem 2.2 (Theorem 5 of [GRV11]). For any ε, δ, η ∈ (0, 1/2), and distribution D over {0, 1}n, the k-LPN problem over D with noise rate η can be solved using k log(n/δ)ω(1)ε2(1−2η)2 samples in time 1\nε2(1−2η)2 · (\nn k/2\n)1+( η ε+η−2εη )2+o(1) , where ε and δ are the approximation and confidence parameters respectively."}, {"heading": "3 In the absence of noise", "text": "We state the main result of this section.\nTheorem 3.1. Let k, t : N → N be two functions such that log logn ≪ k(n) ≪ t(n) ≪ n. Then for every n ∈ N, there is an algorithm that learns PAR(k) in the mistake-bound model, with mistake bound at most (1 + o(1))knt + log ( t k ) and running time per round e−k/4.01 · ( t k ) · Õ ( (kn/t) 2 ) .\nUsing Theorem 1.3, we directly obtain Theorem 1.1. In fact, since Theorem 1.3 produces a PAClearner over any distribution, a statement of the form of Theorem 1.1 holds for examples obtained from any distribution.\nFor comparison, we quote the relevant result of [BGM10] in the mistake-bound model.\nTheorem 3.2 (Theorem 2.1 of [BGM10]). Let k, t : N → N be two functions such that k(n) 6 t(n) 6 n. Then for every n ∈ N, there is a deterministic algorithm that learns PAR(k) in the mistake-bound model, with mistake bound at most k⌈nt ⌉+ log ( t k ) and running time per round ( t k ) · O((kn/t) 2 ).\nNote that their mistake bound is better by a lower-order term which we do not see how to avoid in our setup. This slack is not enough though to recover Theorem 3.1 from Theorem 3.2: dividing t by C roughly multiplies the sample complexity by C and divides the running time by Ck in [BGM10]’s algorithm, whereas in our algorithm, dividing t by C roughly multiplies the sample complexity by C and divides the running time by (1.28C)k."}, {"heading": "3.1 The Algorithm", "text": "Let f ∈ {0, 1}n be the hidden vector of sparsity k that the learning algorithm is trying to learn. Let e = {e1, e2, · · · , en} be the set of standard basis of the vector space {0, 1}\nn. Let α be a large constant we set later, and let T = αt. Note that T ≪ n. We define an arbitrary partition π = C1, C2, · · · , CT on the set e into T parts, each of size at most ⌈n/T ⌉. Next, let S1, . . . , Sm ⊂ [T ] be m random subsets of [T ], each of size αk. We choose m to ensure the following:\nClaim 3.3. If m = Õ\n(\n( Tαk) ( T−kαk−k)\n)\n, then with nonzero probability, for every set A ⊂ [T ] of size k, A ⊂ Si for\nsome i ∈ [m].\nProof. This follows from the simple observation that for any fixed i ∈ [m], Pr[A ⊂ Si] = ( T−k αk−k )/( T αk )\n, and so,\nPr[∃i ∈ [m], A 6⊂ Si] =\n(\n1−\n(\nT − k\nαk − k\n)/(\nT\nαk\n))m\n6 e−m( T−k αk−k)/( T αk)\nChoosing m = 2 ( Tαk) ( T−kαk−k) log ( T k ) and applying the union bound finishes the proof.\nWe fix some choice of S1, . . . , Sm ⊂ [T ] that satisfies the conclusion of Claim 3.3 for what follows. In fact, the rest is exactly [BGM10]’s algorithm, which we reproduce for completeness.\nFor every i ∈ [m], let Mi ⊂ {0, 1} n be the span of\n⋃\nj∈Si Cj . Note that\n∣ ∣ ∣ ⋃\nj∈Si Cj\n∣ ∣ ∣ 6 αk⌈n/T ⌉ 6\nαk · ( n T + 1 ) 6 knt + αk = (1 + o(1))kn/t, as t ≪ n and α is a constant. So, Mi is a linear subspace containing at most 2(1+o(1))kn/t points. Note that every f ∈ {0, 1}n with |f | = k is contained in some Mi. This is simply because every set of k standard basis vectors is contained in at most k of the T parts in the partition π, and by Claim 3.3, every subset of [T ] of size k is contained in some Si.\nInitially, the unknown target vector f can be in any of the Mi’s. Consider what happens when the learner sees an example a ∈ {0, 1}n and a label y ∈ {0, 1}. For i ∈ [m], let Mi(a, y) = {f ∈ Mi : f(a) = y}. Mi(a, y) may be of size 0, |Mi| or |Mi|/2. Note that the size of Mi(a, y) can be efficiently found using Gaussian elimination.\nWe are now ready to describe the algorithm:\n– Initialization: The learning algorithm begins with a set of affine spaces Ni, i ∈ [m] represented by a system of linear equations. Initialize the affine spaces Ni = Mi for all i ∈ [m].\n– On receiving an example a ∈ {0, 1}n: Predict its label ŷ ∈ {0, 1} such that ∑\ni∈[m] |Ni(a, ŷ)| > ∑\ni∈[m] |Ni(a, 1− ŷ)|.\n– On receiving the answer from the teacher y = f(a): Update Ni to Ni(a, y) for each i ∈ [m]."}, {"heading": "3.2 Analysis", "text": "Before we analyze the algorithm, we first establish a combinatorial claim that is the crux of our improvement:\nLemma 3.4. If α is a large enough constant, (\nT αk\n)\n(\nT−k αk−k\n) 6 e−k/4.01 ·\n(\nt\nk\n)\nProof.\n1 (\nt k\n) ·\n(\nT αk\n)\n(\nT−k αk−k\n) =\nk−1 ∏\ni=0\nk − i t− i · T − i αk − i\n=\nk−1 ∏\ni=0\nαt− i αk − i · k − i t− i\n=\nk−1 ∏\ni=1\n 1− i ( 1− 1α )\n(\n1 k−i − 1 t−i\n)\n1 + ik−i ( 1− 1α )\n\n\n6\nk−1 ∏\ni=1\n(\n1− 0.999\n1 + k−ii α α−1\n)\nwhere the equalities are routine calculation and the inequality is using that k(n) ≪ t(n). Each individual term in the product is strictly less than 1. So, the above is bounded by:\n6\nk−1 ∏\ni=k/(2−ε)\n(\n1− 0.999\n1 + k−ii α α−1\n)\n6\n(\n1− 0.999\n1 + (1− ε) αα−1\n) 1−ε 2−ε k\n6 exp\n(\n− lg e · 0.999(1− ε)\n(2 − ε)(1 + (1− ε) αα−1 ) k\n)\n6 e−k/4.01\nfor a small enough constant ε > 0 and large enough constant α > 1.\nProof of Theorem 3.1. Fix α to be a constant that makes the conclusion of Lemma 3.4 true. We first check that the invariant is maintained throughout the algorithm that f ∈ ∪i∈[m]Ni. This holds at initiation by the argument given earlier. After that, obviously, if f ∈ Ni, then f ∈ Ni(a, f(a)) for any a ∈ {0, 1}n, and so the invariant holds. Therefore, if the algorithm terminates, it will find the hidden vector f and return it as the solution. The rate of convergence is precisely captured by the number of mistakes learning algorithm makes, which we describe next.\nMistake Bound. Notice that when the algorithm begins, the sum of the sizes of all the affine spaces, ∑\ni |Ni| 6 Õ\n(\n( Tαk) ( T−kαk−k)\n)\n2(1+o(1))kn/t. Now whenever the learner makes a mistake by predicting ŷ 6= y, the size\nof all affine spaces ∑\ni |Ni| reduces by a factor of at least 2. This is due to the definition of ŷ and the fact that |Ni(a, ŷ)|+ |Ni(a, 1− ŷ)| = |Ni|.\nHence, using Lemma 3.4, after at most\nlog\n(\n∑\ni\n|Ni|\n)\n6 log\n[\nÕ\n(\n(\nT αk\n)\n(\nT−k αk−k\n)\n)\n2(1+o(1))kn/t\n]\n6 (1 + o(1))kn/t+ log\n(\nt\nk\n)\n− Ω(k) + logO\n(\nlog\n(\nt\nk\n))\nmistakes, the size of ∪s∈SNs will decrease to 1, which by the invariant above will imply that ∪s∈SNs = {f}, and hence the learner makes no more mistakes. . Since we assume k ≫ log logn and t ≪ n, we can bound the number of mistakes by: (1 + o(1))kn/t+ log (\nt k\n)\nRunning Time. We analyze the running time of the learner for each round. At each round, for a question a ∈ {0, 1}n, we need to compute |Ni(a, 0)| and |Ni(a, 1)| as well as store a representation of the updated Ni. Now, since for each Ni is spanned by at most ℓ = (1 + o(1))kn/t basis vectors, we can treat each Ni as a linear subspace in {0, 1}ℓ. Ni(a, 0) and Ni(a, 1) can be computed by performing Gaussian elimination on a system of linear equations involving ℓ variables, which takes O(ℓ2) time. Thus, the total running time is O(mℓ2), which using Lemma 3.4 is exactly the bound claimed in Theorem 3.1."}, {"heading": "4 In the presence of noise", "text": "Recall the k-LPN problem. In this section, we show a reduction from k-LPN to noiseless learning of PAR(k) and its applications."}, {"heading": "4.1 The Reduction", "text": "We focus on the case when the noise rate η is bounded by a constant less than half.\nTheorem 1.3 (recalled) Given an algorithm A that learns PAR(k) over the uniform distribution with confidence parameter δ using s(δ) samples and running time t(δ),there is an algorithm A′ that solves the k-LPN problem with noise rate η ∈ (0, 1/3), using O(s(δ/2) log(1/δ)) examples and running time exp(O(H(3η/2) · s(δ/2) · log(1/δ)))) · (t(δ/2) + s(δ/2) log(1/δ)) and with confidence parameter δ.\nLet A(δ) be a PAC-learning algorithm over the uniform distribution for PAR(k) of length n with confidence parameter δ that draws s(δ) examples and runs in time t(δ). Below is our algorithm for k-LPN. Here, H denotes the binary entropy function p 7→ p log2(1/p) + (1− p) log2(1/(1− p)).\nNoisy(δ, η)\n1: Draw s′ = 20s(δ/2) log(1/δ) random examples (a1, ℓ1), . . . , (as′ , ℓs′) ∈ {0, 1} n × {0, 1}. 2: for all S ⊆ [s′], |S| 6 32ηs ′ do 3: for i ∈ [s′] do 4: if i ∈ S then ℓ̃i ← 1− ℓi 5: else ℓ̃i ← ℓi 6: end if 7: end for 8: xS ← A(δ/2) applied to examples (a1, ℓ̃1), . . . , (as′ , ℓ̃s′). 9: end for\n10: Draw s′′ = 600(s′ ·H(3η/2) + log(8/δ)) random examples (b1,m1), . . . , (bs′′ ,ms′′) ∈ {0, 1} n × {0, 1} 11: S∗ ← argmaxS⊂[s′],|S|63εs′/2 |{i ∈ [s ′′] : 〈bi, xS〉 = mi}| 12: return xS∗\nProof of Theorem 1.3.\nLemma 4.1. The sample complexity of Noisy is s′ + s′′ = O(s(δ/2) log(1/δ)).\nProof. Immediate.\nLemma 4.2. The running time of Noisy is 2O(H(3η/2)s(δ/2) log(1/δ)) · (t(δ/2) + s(δ/2) log(1/δ))).\nProof. We use the standard estimate ∑αx\ni=0\n(\nx i\n)\n6 2H(α)x for α 6 12 . The bound is then immediate.\nLemma 4.3. If x is the hidden vector and x∗ is output by Noisy(δ), then with probability at least 1 − δ, x∗ = x.\nProof. We make the assumption throughout that η = Ω(1/s(δ/2)), as otherwise, with high probability, the example source won’t mislabel any of s(δ/2) samples and so the reduction is trivial.\nLet T = {i ∈ [s′] : 〈ai, x〉 6= ℓi} be the subset of the s ′ samples drawn in line 1 that are mislabeled by the example source. By the Chernoff bound: Pr[|T | > 3ηs′/2] 6 e−ηs ′/12 6 δ/4. If |T | 6 3ηs′/2, we have with probability at least 1− δ/2, xT = x. Thus, for any i ∈ [s ′′],Prbi [〈xT , bi〉 6= mi] 6 η. On the other hand, for all xS 6= xT , Prbi [〈xS , bi〉 6= 〈x, bi〉] = 1/2, and so Prbi [〈xS , bi〉 6= mi] = 1/2 as the noise is random. Again, using Chernoff bounds,\nPr[∃S 6= T s.t.|{i ∈ [s′′] : 〈bi, xS〉 6= mi}| 6 5s ′′/12] 6 2H(3η/2)s\n′ · e−s ′′/450 <\nδ\n8\nOn the other hand, for xT itself, Pr[|{i ∈ [s ′′] : 〈bi, xT 〉 6= mi}| > 5s ′′/12] < δ8 by a similar use of Chernoff bounds. So, in all, with probability at least 1− δ, xT will be returned in step 12.\nWhen the noise rate η is more than 1/3, a similar reduction can be given by adjusting the parameters accordingly. Also, when the distribution is arbitrary but the noise rate is less than 1/4, a similar reduction can be made to work. In the latter case, A is invoked with a smaller approximation parameter than the one given to Noisy so that the filtering step in line 10 works."}, {"heading": "4.2 Applications", "text": "An immediate application of Theorem 1.3 is obtained by letting A be the current fastest known attributeefficient algorithm for learning PAR(k), the algorithm due to Spielman4 [KS06] that makesO(k logn) samples and takes O( (\nn k/2\n)\n) time (for constant confidence parameter δ). (We ignore the confidence parameter in this\nsection for simplicity.)\nCorollary 1.4 (recalled) For any η ∈ (0, 1/3) and constant confidence parameter, there is an algorithm for k-LPN with sample complexity O(k logn) and running time (\nn k/2 )1+O(H(1.5η)) .\nProof. Immediate from Theorem 1.3.\nOur next application of Theorem 1.1 uses our improved PAR(k) learning algorithm from Section 3.\nCorollary 1.5 (recalled) Suppose k(n) = n/f(n) for some function f : N → N for which 1 ≪ f(n) ≪ n/ log logn, and suppose η(n) = o(1/((f(n))α logn)) for some α ∈ [1/2, 1). Then, for constant confidence parameter, there exists an algorithm for k-LPN with noise rate η with running time e−k/4.01+o(k) · (\nn k )1−α ·\npoly(n) and sample complexity O(k(f(n))α).\nProof. Let A be the algorithm of Theorem 1.1 with t(n) = ⌈n/(f(n))α⌉. The running time of A is e−k/4.01 · (\nn k )1−α · poly(n) and its sample complexity is O(k · f(n))α). Now, applying Theorem 1.3, we see that since H(1.5η) = o((f(n))−α), the running time for Noisy is only a 2o(k) factor times the running time of A. This yields our desired result.\n4Though a similar algorithm was also proposed by Hopper and Blum [HB01]"}], "references": [{"title": "Queries and concept learning", "author": ["Dana Angluin"], "venue": "Mach. Learn.,", "citeRegEx": "Angluin.,? \\Q1988\\E", "shortCiteRegEx": "Angluin.", "year": 1988}, {"title": "Deterministic approximation algorithms for the nearest codeword problem", "author": ["Noga Alon", "Rina Panigrahy", "Sergey Yekhanin"], "venue": "Algorithms and Techniques,", "citeRegEx": "Alon et al\\.,? \\Q2009\\E", "shortCiteRegEx": "Alon et al\\.", "year": 2009}, {"title": "Learning parities in the mistakebound model", "author": ["Harry Buhrman", "David Garćıa-Soriano", "Arie Matsliah"], "venue": "Inform. Process. Lett.,", "citeRegEx": "Buhrman et al\\.,? \\Q2010\\E", "shortCiteRegEx": "Buhrman et al\\.", "year": 2010}, {"title": "Noise tolerant learning, the parity problem, and the statistical query model", "author": ["Avrim Blum", "Adam Kalai", "Hal Wasserman"], "venue": "J. ACM,", "citeRegEx": "Blum et al\\.,? \\Q2003\\E", "shortCiteRegEx": "Blum et al\\.", "year": 2003}, {"title": "Separating distribution-free and mistake-bound learning models over the boolean domain", "author": ["Avrim Blum"], "venue": "SIAM J. on Comput.,", "citeRegEx": "Blum.,? \\Q1994\\E", "shortCiteRegEx": "Blum.", "year": 1994}, {"title": "On-line algorithms in machine learning", "author": ["Avrim Blum"], "venue": "In Workshop on on-line algorithms,", "citeRegEx": "Blum.,? \\Q1996\\E", "shortCiteRegEx": "Blum.", "year": 1996}, {"title": "Efficient fully homomorphic encryption from (standard) LWE", "author": ["Zvika Brakerski", "Vinod Vaikuntanathan"], "venue": "In Proc. 52nd Annual IEEE Symposium on Foundations of Computer Science,", "citeRegEx": "Brakerski and Vaikuntanathan.,? \\Q2011\\E", "shortCiteRegEx": "Brakerski and Vaikuntanathan.", "year": 2011}, {"title": "On agnostic learning of parities, monomials, and halfspaces", "author": ["Vitaly Feldman", "Parikshit Gopalan", "Subhash Khot", "Ashok Kumar Ponnuswami"], "venue": "SIAM J. on Comput.,", "citeRegEx": "Feldman et al\\.,? \\Q2009\\E", "shortCiteRegEx": "Feldman et al\\.", "year": 2009}, {"title": "On noise-tolerant learning of sparse parities and related problems. In Algorithmic Learning Theory, pages 413–424", "author": ["Elena Grigorescu", "Lev Reyzin", "Santosh Vempala"], "venue": null, "citeRegEx": "Grigorescu et al\\.,? \\Q2011\\E", "shortCiteRegEx": "Grigorescu et al\\.", "year": 2011}, {"title": "Space efficient learning algorithms", "author": ["David Haussler"], "venue": "Technical Report UCSC-CRL-88-2, University of California at Santa Cruz,", "citeRegEx": "Haussler.,? \\Q1988\\E", "shortCiteRegEx": "Haussler.", "year": 1988}, {"title": "Secure human identification protocols", "author": ["Nicholas J Hopper", "Manuel Blum"], "venue": "In Advances in cryptology–ASIACRYPT", "citeRegEx": "Hopper and Blum.,? \\Q2001\\E", "shortCiteRegEx": "Hopper and Blum.", "year": 2001}, {"title": "Toward attribute efficient learning of decision lists and parities", "author": ["Adam R Klivans", "Rocco A Servedio"], "venue": "J. Mach. Learn. Res.,", "citeRegEx": "Klivans and Servedio.,? \\Q2006\\E", "shortCiteRegEx": "Klivans and Servedio.", "year": 2006}, {"title": "From on-line to batch learning", "author": ["Nick Littlestone"], "venue": "In Proc. 2nd Annual ACM Workshop on Computational Learning Theory,", "citeRegEx": "Littlestone.,? \\Q1989\\E", "shortCiteRegEx": "Littlestone.", "year": 1989}, {"title": "On lattices, learning with errors, random linear codes, and cryptography", "author": ["Oded Regev"], "venue": "J. ACM,", "citeRegEx": "Regev.,? \\Q2009\\E", "shortCiteRegEx": "Regev.", "year": 2009}, {"title": "A theory of the learnable", "author": ["Leslie G Valiant"], "venue": "Comm. Assn. Comp. Mach.,", "citeRegEx": "Valiant.,? \\Q1984\\E", "shortCiteRegEx": "Valiant.", "year": 1984}, {"title": "Finding correlations in subquadratic time, with applications to learning parities and juntas", "author": ["Gregory Valiant"], "venue": "In Proc. 53rd Annual IEEE Symposium on Foundations of Computer Science,", "citeRegEx": "Valiant.,? \\Q2012\\E", "shortCiteRegEx": "Valiant.", "year": 2012}], "referenceMentions": [], "year": 2015, "abstractText": "We first consider the problem of learning k-parities in the on-line mistake-bound model: given a hidden vector x ∈ {0, 1} with |x| = k and a sequence of “questions” a1, a2, · · · ∈ {0, 1} , where the algorithm must reply to each question with 〈ai, x〉 (mod 2), what is the best tradeoff between the number of mistakes made by the algorithm and its time complexity? We improve the previous best result of Buhrman et. al. [BGM10] by an exp(k) factor in the time complexity. Second, we consider the problem of learning k-parities in the presence of classification noise of rate η ∈ (0, 1/2). A polynomial time algorithm for this problem (when η > 0 and k = ω(1)) is a longstanding challenge in learning theory. Grigorescu et al. [GRV11] showed an algorithm running in time ( n k/2 )1+4η+o(1) . Note that this algorithm inherently requires time ( n k/2 ) even when the noise rate η is polynomially small. We observe that for sufficiently small noise rate, it is possible to break the ( n k/2 ) barrier. In particular, if for some function f(n) = ω(1) and α ∈ [1/2, 1), k = n/f(n) and η = o(f(n)/ log n), then there is an algorithm for the problem with running time poly(n) · ( n k )1−α · e.", "creator": "LaTeX with hyperref package"}}}