{"id": "1506.02585", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "8-Jun-2015", "title": "Optimal Sparse Kernel Learning for Hyperspectral Anomaly Detection", "abstract": "In may material, place dickens fully still spatially kernel learning will Support Vector Data Description (SVDD) similar anomaly ultrasound. date. In this bringing, allocation spaces features selection all detectable lidar refers first modeled soon just Mixed Integer Programming (MIP) problem. Due still the preposterously with agent-based perceptual means the MIP, done is relaxed broken part Quadratically Constrained Linear Programming (QCLP) problem. The QCLP has can under has seemingly solved by for came error-prone discrete method, well since multiple maximal main include fewer manually several and parties come a complete one-dimensional. The QCLP - represents iterative lifecycle problem rather precisely started a finite capable although the \\ emph {Empirical Kernel Feature Space} (EKFS) making but been the specific space than \\ emph {Reproducing Kernel Hilbert Space} (RKHS ). This is possible any one over know done the geometrical properties result the EKFS the it e.g. RKHS concerned followed having. Now, being mention electrodynamics coercion example the precise time puts generalization EKFS referred logically, is poll years optimal character state. Experimental conclusions for take full thermoregulatory view show already that opposed therapeutic whenever provides develop limited face where current state - following - form - arts techniques.", "histories": [["v1", "Mon, 8 Jun 2015 16:51:40 GMT  (523kb,D)", "http://arxiv.org/abs/1506.02585v1", "4 pages, 1 figure, 5th workshop on Hyperspectral image and signal processing: evolution in remote sensing"]], "COMMENTS": "4 pages, 1 figure, 5th workshop on Hyperspectral image and signal processing: evolution in remote sensing", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["zhimin peng", "prudhvi gurram", "heesung kwon", "wotao yin"], "accepted": false, "id": "1506.02585"}, "pdf": {"name": "1506.02585.pdf", "metadata": {"source": "CRF", "title": "OPTIMAL SPARSE KERNEL LEARNING FOR HYPERSPECTRAL ANOMALY DETECTION", "authors": ["Prudhvi Gurram", "Heesung Kwon", "Zhimin Peng", "Wotao Yin"], "emails": [], "sections": [{"heading": null, "text": "Index Terms— Sparse kernel learning, Optimal feature selection, Empirical kernel feature space, Empirical kernel map"}, {"heading": "1. INTRODUCTION", "text": "Feature selection for learning algorithms aims to find a relevant subset of features that can improve the learning performance by discarding features not useful or even harmful for the given tasks. In the case of kernel-based anomaly detection, such as SVDD, the feature selection requires the accurate estimation of the contribution of each feature to the objective function, i.e., the radius of a hypersphere in the RKHS.\nIn this paper, a new framework of optimal sparse kernel learning for SVDD-based anomaly detection (OSKLAD) is proposed. The proposed OSKLAD optimally extends the feature selection technique used for the kernel-based learning approaches [1] into SVDD-based anomaly detection by fully\noptimizing the feature selection method for nonlinear kernels in a newly defined finite space called the EKFS [2]. Hence, the OSKLAD can be considered as a fully optimized version of the wrapper approach to the SVDD-based anomaly detection with nonlinear kernels. The initial objective of the proposed OSKLAD begins with finding a single subset of original features that can be used to build an optimal hypersphere in the RKHS. This objective can be modeled as a Mixed Integer Programming (MIP) problem. However, the MIP problem is NP-hard, and so the MIP model is relaxed into a Quadratically Constrained Linear Programming (QCLP) problem [3] by converting the objective function of the MIP problem into lower bounded quadratic inequality constraints. This QCLP problem is yet intractable due to the prohibitively large number of the inequality constraints. To address this issue, a cutting plane method based on the restricted master problem coupled with Multiple Kernel Leaning (MKL) [4] is iteratively used. The goal is to find only a small subset of the inequality constraints that are actively used to define the feasible region of the parameters of the given QCLP problem.\nThe active constraints are effectively identified by finding the most violating constraints instead whose half-planes maximally violate the corresponding inequality constraints. Therefore, the task becomes finding multiple subsets of most violated features associated with the corresponding most violating constraints given the objective function, such as the radius of a hypersphere in the RKHS. However, finding the most violating constraints also becomes a combinatorial problem, if nonlinear kernels, such as Gaussian RBF kernel or high order polynomial kernels, are used, due to the prohibitively large number of possible combinations (subsets) of the original features. To tackle this issue, in the proposed OSKLAD, the most violated features are found in the EKFS. The EKFS is a finite space linearly spanned by basis vectors, which are generated by a map, called the Empirical Kernel Map (EKM). It is shown that the EKHS and the corresponding RKHS constructed by using the same kernel function have the same geometrical property. This means that solutions of any optimization problem obtained from either space are identical. In the proposed OSKLAD, the subsets of the most violated feaar X iv :1\n50 6.\n02 58\n5v 1\n[ cs\n.L G\n] 8\nJ un\n2 01\ntures are optimally found in the EKFS since individual feature ranking in terms of contribution to the radius in the EKFS can be performed optimally based on the property of canonical dot product and the finite dimensionality of the space."}, {"heading": "2. OPTIMAL SPARSE KERNEL LEARNING", "text": "In this section, we present an optimal sparse kernel learning for anomaly detection (OSKLAD) using SVDD as a basic building block. Inspired by the feature selection approach for the kernel-based classification [1], the OSKLAD addresses the problem of the optimal feature selection for the SVDDbased anomaly detection. The basic formulation of OSKLAD is to minimize the radius of the enclosing hypersphere while allowing outliers except that in OSKLAD, only a subset of features is used. So, the model is described as a mixed integer programming problem:\nmin d min R,ξi,a R2 + C · N∑ i=1 ξi\nsubject to ‖Φ(x̃i)− a‖2 ≤ R2 + ξi ξi ≥ 0 x̃i = xi d, i = 1, 2, ..., N,\n(1)\nwhere d ∈ D = {d|dj ∈ {0, 1}, ∑M j=1 dj = B, j = 1, 2, ...,M}, and represents elementwise product. Here B is a threshold that controls the number of features that are selected. If one assumes that d is fixed in Eq. 1, it turns into a continuous constrained optimization problem just like a standard SVDD. By applying the Langrange multipliers and KKT conditions to it, we can derive the dual problem (similar to standard SVDD) as:\nmin d max αi N∑ i=1 αik(x̃i, x̃i)− N∑ i=1 N∑ j=1 αiαjk(x̃i, x̃j) subject to N∑ i=1 αi = 1\n0 ≤ αi ≤ C x̃i = xi d, i = 1, 2, ..., N.\n(2)\nHowever, one should notice that Eq. 2 is still a mixed interger programming (MIP) problem due to the last constraint, which is computationally expensive to solve. In order to solve this problem, it can be converted into a Quadratically Constrained Linear Programming (QCLP). We define S(α,d) =∑N i=1 αik(x̃i, x̃i) − ∑N i,j=1 αiαjk(x̃i, x̃j), and introduce an additional parameter t to obtain the QCLP equivalent of (2)\nas follows:\nmax a,t t\nsubject to N∑ i=1 αi = 1\n0 ≤ αi ≤ C t ≤ S(α,d), ∀ d ∈ D.\n(3)\nThough Eq. 3 is convex, a large number of inequality constraints (last condition in Eq. 3) makes it impractical to be solved by existing techniques. The number becomes huge if the features reside in a high dimensional space. Note that not all the inequality constraints used in Eq. 3 are actively used in defining the feasible region of the optimization problem. In fact, only a small number of the constraints are useful and directly used to solve the optimization problem. Therefore, an iterative algorithm can be used, in which instead of solving Eq. 3 at once, an intermediate solution pair (t, α) is iteratively updated based on a limited subset of previously found active constraints. This optimization problem is called the restricted master problem, which is closely related to the cutting plane algorithm described in [5]. The restricted master problem consists of two steps [6]: 1) (t, α) are optimized based on a previously found restricted subset I of features, which maximally violates the constraints; and 2) a new vector d of the most violated features is obtained based on newly optimized (t, α) in step 1 and added to the restricted subset I = I ⋃ d. These two steps are iterated until convergence [7]. Finding d of the most violated features is detailed in the next subsection.\nThe intermediate solution pair (t, α) is now obtained from the following optimization problem\nmax a,t t\nsubject to N∑ i=1 αi = 1,\n0 ≤ αi ≤ C, t ≤ S(α,dl), dl ∈ I.\n(4)\nLet µl ≥ 0 be the dual variable for each constraint in Eq. 4. The Lagrangian of Eq. 4 can be written as:\nL(t, µ) = t+ p∑ l=1 µlS(α,dl). (5)\nBy setting ∂L∂t = 0, we have ∑p l=1 µl = 1. The Lagrangian L(t, µ), after applying this partial KKT condition, can be rewritten as L(t, µ) = ∑p l=1 µlS(α,d l), which transforms\n(3) to the following problem:\nmax α min µ p∑ l=1 µlS(α,dl)\nsubject to N∑ i=1 αi = 1\n0 ≤ αi ≤ C for i = 1, 2..., N p∑ l=1 µl = 1, µl ≥ 0 for l = 1, 2..., p.\n(6)\nOne can observe that can be solved using a two-step iterative process to obtain optimal sparse weights of individual kernels µ and optimal lagrange multipliers α∗ (which define the support vectors or the enclosing hypersphere)."}, {"heading": "3. OPTIMAL FEATURE SELECTION: FINDING", "text": "MAXIMALLY VIOLATING FEATURES\nFor updating d, the features that maximally violate the last constraint in Eq. 3 need to be determined. Since the goal of Eq. 3 is to maximize t, and it is upper-bounded by S(α,d) according to the constraint, the features that maximally violate this constraint will minimize S(α,d). One has to solve the following optimization problem:\nmin d S(α,d)\nsubject to M∑ i=1 di = B\ndi ∈ {0, 1}.\n(7)\nIn this section, we describe the method to find these feature vectors for both linear kernel and non-linear kernel."}, {"heading": "3.1. Linear Kernel", "text": "If a linear kernel is used, since k (xi, xj) = 〈xi, xj〉, we have S(α,d) = ∑M j=1 djcj , where cj = ∑N i=1 αix 2 ij +\n( ∑N i=1 αixij)\n2. S(α,d) is a linear function of d. Once we have optimal support vectors, the global solution of d can be easily obtained by sorting cj’s in ascending order and setting the first B corresponding elements in d, dj to 1 and the rest to 0. Once the optimal feature subset is chosen for a kernel, optimal α and µ are updated by solving Eq. 6. These two steps are repeated until the algorithm converges."}, {"heading": "3.2. Non-linear Kernel", "text": "If a Gaussian RBF kernel is used, S(α,d) is not a linear function of d. We cannot solve the problem in Eq. 7 optimally because of the large number of combinations of features that have to be considered. So, the data is tranformed from infinte\ndimensional RKHS into another space called empirical kernel feature space (EKFS) with finite dimensionality using empirical kernel map (EKM). This will allow us to select subsets of features optimally while still preserving the nonlinear correlations among the features. For a given set of training data points {xi}ni=1, the map defined by\nΦn : Rn → Rn where x 7→ k (·, x) = (k (x1, x) , . . . , k (xn, x))T (8) is called the EKM with respect to {xi}ni=1 [2]. However, the kernel function k used to build kernel matrices in previous subsections cannot be represented using Φn, since they do not form an orthonormal system. The dot product to use in the representation of k is the not the canonical dot product in the EKFS Rn. In order to turn Φn into a feature map associated with k, EKFS is endowed with a dot product 〈·, ·〉n such that k(xi, xj) = 〈Φn (xi) ,Φn (xj)〉n. After analyzing certain conditions using this equality as shown in [2], the dot product 〈·, ·〉n can be converted to a canonical dot product by merely whitening the EKFS and using the new basis functions as features. It can be represented as\nk(xi, xj) = 〈Φwn (xi) ,Φwn (xj)〉 , (9)\nwhere the feature map in whitened EKFS is given by\nΦwn : x 7→ K− 1 2 (k (x1, x) , . . . , k (xn, x)) T . (10)\nwhereK is the Gram matrix andKi,j = k(xi, xj). The kernel function in Eq. 9 is used to build the kernel matrices in Eqs. 2-7. Hence, the feature subset selection problem turns exactly into (7) (linear version) except for the fact that in this case the features are selected in EKFS. Similar to the OSKLAD with a linear kernel, the overall Optimal Sparse Kernel Learning for Anomaly Detection (OSKLAD) in the EKFS is described in Algorithm 1.\nAlgorithm 1 OSKLAD with nonlinear kernel 1: Map the data points into the EKFS by using a certain ker-\nnel k 2: Initialized: α = 1N 1, find the maximally violating feature\nsubset d, and set I = {d}. 3: Run SKAD based on the kernel matrices generated by I\nand optimize for α and µ. 4: Find the next maximally violated feature subset d based\non the current α and µ and set I = I ⋃ {d}.\n5: Repeat steps 3-4 until convergence."}, {"heading": "4. SIMULATION RESULTS", "text": "In this section, the performance of OSKLAD is evaluated on a hyperspectral digital imagery collection experiment(HYDICE) image, which contains 30 small painted pannels located in the background. We chose a small patch\n(69 pixels × 10 pixels) as the background data set, which is used to obtain the radius R and the center of the hypersphere. The distance of each test pixel in the image to the center of the hypersphere is determined. If the distance is greater than R, the pixel is considered as an anomaly, otherwise, it is a background pixel. In our experiments, the performance of SVDD, SKAD [8]1 and OSKLAD with both linear and Gaussian RBF kernels are compared with one another. For SVDD and SKAD, both linear and Gaussian RBF kernel are used in the input space. For OSKLAD with linear kernel, feature selection is performed in the input space. However, for OSKLAD with Gaussian RBF kernel, the input vector is first mapped into EKFS using EKM. At this point, we can just use linear kernel in EKFS, which translates to using Gaussian RBF kernel in the input space as described in the previous sections. The kernel bandwidth parameter is determined by implementing the minimax technique on randomly selected 10 regions of the image to represent the background as done in [9]. The same value is used over all the test pixels in the image for all the algorithms.\nThe number of features used for each hypersphere of SKAD with both linear and Gaussian RBF kernel and OSKLAD with linear kernel is 75, which is half of the total number of features. For OSKLAD in the EKFS, the total number of features available after mapping the pixels from input space to EKFS is reduced to 96, and we have used 48 features for each hypersphere. Fig.1 shows the anomaly detection results for SVDD, SKAD and OSKLAD with both linear and Gaussian RBF kernels. The value of each pixel in the results is the ratio of the distance between the pixel and the radius of the hypersphere. For comparison, we normalize the scaled in all the resulting images to be between 0 and 1. One can see that all the six methods are able to identify the first two rows of anomalies, but OSKLAD in EKFS can identifies anomalies with much less noise (clean background) and it is also able to detect the small targets in the third row."}, {"heading": "5. CONCLUSIONS", "text": "In the proposed work, to achieve optimality in kernel-based feature selection for anomaly detection using SVDD, the QCLP problem is optimally solved in a new finite space called the Empirical Kernel Feature Space (EKFS) instead of the RKHS. Experimental result show that by optimally selecting features, significant improvements can be made in hyperspectral anomaly detection in EKFS rather than the original input space."}, {"heading": "6. REFERENCES", "text": "[1] M. Tan, L. Wang, and I. W. Tsang, “Learning sparse SVM for feature selection on very high dimensional datasets,”\n1Sparse kernel-based anomaly detection (SKAD) has been developed by two of the current authors\nin ICML, Haifa, Israel, June 2010, pp. 1047–1054.\n[2] B. Schölkopf and A. J. Smola, Learning with Kernels, The MIT Press, Massachusetts, 2002.\n[3] R. Hettich and K. O. Kortanek, “Semi-infinite programming: Theory, methods, and applications,” SIAM Review, vol. 35, no. 3, pp. 380–429, Sept. 1993.\n[4] A. Rakotomamonjy, F. R. Bach, S. Canu, and Y. Grandvalet, “Simplemkl,” J. Machine Learning Research, vol. 9, pp. 2491–2521, 2008.\n[5] J. E. Kelly, “The cutting plane method for solving convex problems,” J. Soc. Indust. Appl. Math., vol. 8, no. 4, Dec. 1960.\n[6] J. Chen and J. Ye, “Training SVM with indefinite kernels,” in ICML, Helsinki, June 2008, pp. 136–143.\n[7] P. Gurram, Z. Peng, H. Kwon, and W. Yin, “Optimal sparse kernel learning for anomaly detection,” Pattern Recognition, under review.\n[8] P. Gurram, H. Kwon, and T. Han, “Sparse kernel-based hyperspectral anomaly detection,” vol. 9, no. 5, pp. 943– 947, Sept. 2012.\n[9] Amit Banerjee, Philippe Burlina, and Chris Diehl, “A support vector method for anomaly detection in hyperspectral imagery,” Geoscience and Remote Sensing, IEEE Transactions on, vol. 44, no. 8, pp. 2282–2291, 2006."}], "references": [{"title": "Learning sparse SVM for feature selection on very high dimensional datasets", "author": ["M. Tan", "L. Wang", "I.W. Tsang"], "venue": "1Sparse kernel-based anomaly detection (SKAD) has been developed by two of the current authors  (a) SVDD – linear kernel (b) SVDD – RBF kernel (c) SKAD – linear kernel (d) SKAD – RBF kernel (e) OSKLAD – linear kernel (f) OSKLAD – EKFS Fig. 1. Anomaly detection results of the HYDICE image using SVDD, SKAD and OSKLAD in ICML, Haifa, Israel, June 2010, pp. 1047–1054.", "citeRegEx": "1", "shortCiteRegEx": null, "year": 2010}, {"title": "Learning with Kernels", "author": ["B. Schölkopf", "A.J. Smola"], "venue": "The MIT Press, Massachusetts,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2002}, {"title": "Semi-infinite programming: Theory, methods, and applications", "author": ["R. Hettich", "K.O. Kortanek"], "venue": "SIAM Review, vol. 35, no. 3, pp. 380–429, Sept. 1993.", "citeRegEx": "3", "shortCiteRegEx": null, "year": 1993}, {"title": "Simplemkl", "author": ["A. Rakotomamonjy", "F.R. Bach", "S. Canu", "Y. Grandvalet"], "venue": "J. Machine Learning Research, vol. 9, pp. 2491–2521, 2008.", "citeRegEx": "4", "shortCiteRegEx": null, "year": 2008}, {"title": "The cutting plane method for solving convex problems", "author": ["J.E. Kelly"], "venue": "J. Soc. Indust. Appl. Math., vol. 8, no. 4, Dec. 1960.", "citeRegEx": "5", "shortCiteRegEx": null, "year": 1960}, {"title": "Training SVM with indefinite kernels", "author": ["J. Chen", "J. Ye"], "venue": "ICML, Helsinki, June 2008, pp. 136–143.", "citeRegEx": "6", "shortCiteRegEx": null, "year": 2008}, {"title": "Optimal sparse kernel learning for anomaly detection", "author": ["P. Gurram", "Z. Peng", "H. Kwon", "W. Yin"], "venue": "Pattern Recognition, under review.", "citeRegEx": "7", "shortCiteRegEx": null, "year": 0}, {"title": "Sparse kernel-based hyperspectral anomaly detection", "author": ["P. Gurram", "H. Kwon", "T. Han"], "venue": "vol. 9, no. 5, pp. 943– 947, Sept. 2012.", "citeRegEx": "8", "shortCiteRegEx": null, "year": 2012}, {"title": "A support vector method for anomaly detection in hyperspectral imagery", "author": ["Amit Banerjee", "Philippe Burlina", "Chris Diehl"], "venue": "Geoscience and Remote Sensing, IEEE Transactions on, vol. 44, no. 8, pp. 2282–2291, 2006.", "citeRegEx": "9", "shortCiteRegEx": null, "year": 2006}], "referenceMentions": [{"referenceID": 0, "context": "The proposed OSKLAD optimally extends the feature selection technique used for the kernel-based learning approaches [1] into SVDD-based anomaly detection by fully optimizing the feature selection method for nonlinear kernels in a newly defined finite space called the EKFS [2].", "startOffset": 116, "endOffset": 119}, {"referenceID": 1, "context": "The proposed OSKLAD optimally extends the feature selection technique used for the kernel-based learning approaches [1] into SVDD-based anomaly detection by fully optimizing the feature selection method for nonlinear kernels in a newly defined finite space called the EKFS [2].", "startOffset": 273, "endOffset": 276}, {"referenceID": 2, "context": "However, the MIP problem is NP-hard, and so the MIP model is relaxed into a Quadratically Constrained Linear Programming (QCLP) problem [3] by converting the objective function of the MIP problem into lower bounded quadratic inequality constraints.", "startOffset": 136, "endOffset": 139}, {"referenceID": 3, "context": "To address this issue, a cutting plane method based on the restricted master problem coupled with Multiple Kernel Leaning (MKL) [4] is iteratively used.", "startOffset": 128, "endOffset": 131}, {"referenceID": 0, "context": "Inspired by the feature selection approach for the kernel-based classification [1], the OSKLAD addresses the problem of the optimal feature selection for the SVDDbased anomaly detection.", "startOffset": 79, "endOffset": 82}, {"referenceID": 4, "context": "This optimization problem is called the restricted master problem, which is closely related to the cutting plane algorithm described in [5].", "startOffset": 136, "endOffset": 139}, {"referenceID": 5, "context": "The restricted master problem consists of two steps [6]: 1) (t, α) are optimized based on a previously found restricted subset I of features, which maximally violates the constraints; and 2) a new vector d of the most violated features is obtained based on newly optimized (t, α) in step 1 and added to the restricted subset I = I ⋃ d.", "startOffset": 52, "endOffset": 55}, {"referenceID": 6, "context": "These two steps are iterated until convergence [7].", "startOffset": 47, "endOffset": 50}, {"referenceID": 1, "context": ", k (xn, x)) (8) is called the EKM with respect to {xi}i=1 [2].", "startOffset": 59, "endOffset": 62}, {"referenceID": 1, "context": "After analyzing certain conditions using this equality as shown in [2], the dot product 〈·, ·〉n can be converted to a canonical dot product by merely whitening the EKFS and using the new basis functions as features.", "startOffset": 67, "endOffset": 70}, {"referenceID": 7, "context": "In our experiments, the performance of SVDD, SKAD [8]1 and OSKLAD with both linear and Gaussian RBF kernels are compared with one another.", "startOffset": 50, "endOffset": 53}, {"referenceID": 8, "context": "The kernel bandwidth parameter is determined by implementing the minimax technique on randomly selected 10 regions of the image to represent the background as done in [9].", "startOffset": 167, "endOffset": 170}], "year": 2015, "abstractText": "In this paper, a novel framework of sparse kernel learning for Support Vector Data Description (SVDD) based anomaly detection is presented. In this work, optimal sparse feature selection for anomaly detection is first modeled as a Mixed Integer Programming (MIP) problem. Due to the prohibitively high computational complexity of the MIP, it is relaxed into a Quadratically Constrained Linear Programming (QCLP) problem. The QCLP problem can then be practically solved by using an iterative optimization method, in which multiple subsets of features are iteratively found as opposed to a single subset. The QCLP-based iterative optimization problem is solved in a finite space called the Empirical Kernel Feature Space (EKFS) instead of in the input space or Reproducing Kernel Hilbert Space (RKHS). This is possible because of the fact that the geometrical properties of the EKFS and the corresponding RKHS remain the same. Now, an explicit nonlinear exploitation of the data in a finite EKFS is achievable, which results in optimal feature ranking. Experimental results based on a hyperspectral image show that the proposed method can provide improved performance over the current state-of-the-art techniques.", "creator": "LaTeX with hyperref package"}}}