{"id": "1601.06738", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "25-Jan-2016", "title": "A Label Semantics Approach to Linguistic Hedges", "abstract": "We introduce any model for the geographic hedges ` better ' more ` quite ' entire next show equations achieve, as combination with the prototype and transformations spaces theories its concepts. The proposal identical seems sometimes to for representational framework we must. as significant, has any clear semantic over-water. We did containments other most stocks available way show however would can be composed set themselves and now particular functions, make on once process their conduct leaving for limit among composition.", "histories": [["v1", "Mon, 25 Jan 2016 19:38:37 GMT  (240kb,D)", "http://arxiv.org/abs/1601.06738v1", null]], "reviews": [], "SUBJECTS": "cs.AI cs.CL", "authors": ["martha lewis", "jonathan lawry"], "accepted": false, "id": "1601.06738"}, "pdf": {"name": "1601.06738.pdf", "metadata": {"source": "CRF", "title": "A Label Semantics Approach to Linguistic Hedges", "authors": ["Martha Lewis", "Jonathan Lawry"], "emails": ["martha.lewis@bristol.ac.uk,", "j.lawry@bristol.ac.uk"], "sections": [{"heading": "1 Introduction", "text": "The modelling of natural language relies on the idea that languages are compositional, i.e. that the meaning of a sentence is a function of the meanings of the words in the sentence, as proposed by [13]. Whether or not this principle tells the whole story, it is certainly important as we undoubtedly manage to create and understand novel combinations of words. Fuzzy set theory has long been considered a useful framework for the modelling of natural language expressions, as it provides a functional calculus for concept combination [30, 32].\nA simple example of compositionality is hedged concepts. Hedges are words such as ‘very’, ‘quite’, ‘more or less’, ‘extremely’. They are usually modelled as transforming the membership function of a base concept to either narrow or broaden the extent of application of that concept. So, given a concept ‘short’, the term ‘very short’ applies to fewer objects than ‘short’, and ‘quite short’ to more. Modelling a hedge as a transformation of a concept allows us to determine membership of an object in the hedged concept as a function of its membership in the base concept, rather than building the hedged concept from scratch [31].\nLinguistic hedges have been widely applied, including in fuzzy classifiers [6, 7, 20, 22] and database queries [1, 3]. Using linguistic hedges in these applications allows increased accuracy in rules or queries whilst maintaining human interpretability of results [4, 23]. This motivates the need for a semantically grounded account of linguistic hedges: if hedged results are more interpretable then the hedges used must themselves be meaningful.\nIn the following we provide an account of linguistic hedges that is both functional, and semantically grounded. In its most basic formulation, the operation requires no additional parameters, although we also show that the formulae can be generalised if necessary. Our account of linguistic hedges uses the label semantics framework to model concepts [17]. This is a random set approach which quantifies an agent’s subjective uncertainty about the extent of application of a concept. We refer to this uncertainty as semantic uncertainty [19] to emphasise that it concerns the definition of concepts and categories, in contrast to stochastic uncertainty which concerns the state of the world. In [19] the label semantics approach is combined with conceptual spaces [14] and prototype theory [25], to give a formalisation of concepts as based on a prototype and a threshold, located in a conceptual space. This approach is discussed in detail in section 2. An outline of the paper is then as follows: section 3 discusses different approaches to linguistic hedges\nar X\niv :1\n60 1.\n06 73\n8v 1\n[ cs\n.A I]\n2 5\nJa n\nfrom the literature, and compares these with our model. Subsequently, in section 4, we give formulations of the hedges ‘very’ and ‘quite’. These are formed by considering the dependence of the threshold of a hedged concept on the threshold of the original concept. We give a basic model and two generalisations, show that the models can be composed and investigate the behaviour in the limit of composition. Section 5 compares our results to those in the literature and proposes further lines of research."}, {"heading": "2 Theoretical approach to concepts", "text": ""}, {"heading": "2.1 Prototype theory and fuzzy set theory", "text": "Prototype theory views concepts as being defined in terms of prototypes, rather than by a set of necessary and sufficient conditions. Elements from an underlying metric space then have graded membership in a concept depending on their similarity to a prototype for the concept. There is some evidence that humans use natural categories in this way, as shown in experiments reported in [25]. Fuzzy set theory [30] was proposed as a calculus for combining and modifying concepts with graded membership, and extended these ideas in [32] to linguistic variables as variables taking words as values, rather than numbers. For example, ‘height’ can be viewed as a linguistic variable taking values ‘short,’ ‘tall’, ‘very tall’, etc. The variable relates to an underlying universe of discourse Ω, which for the concept ‘tall’ could be R+. Then each value L of the variable is associated with a fuzzy subset of Ω, and a function µL : Ω → [0, 1] associates with each x ∈ Ω the value of its membership in L. Prototype theory gives a semantic basis to fuzzy sets through the notion of similarity to a prototype, as described in [10]. In this context, concepts are represented by fuzzy sets and membership of an element in a concept is quantified by its similarity to the prototype. In this situation the fuzziness of the concept is seen as inherent to the concept. An alternative interpretation for fuzzy sets is random set theory, see [10] for an exposition. Here, the fuzziness of a set comes from uncertainty about a crisp set, i.e. semantic uncertainty, rather than fuzziness inherent in the world. This second approach is the stance taken by [19], and which we now adopt in this paper."}, {"heading": "2.2 Conceptual Spaces", "text": "Conceptual spaces are proposed by Gärdenfors in [14] as a framework for representing information at the conceptual level. Gärdenfors contrasts his theory with both a symbolic, logical approach to concepts, and an associationist approach where concepts are represented as associations between different kinds of basic information elements. Rather, conceptual spaces are geometrical structures based on quality dimensions such as weight, height, hue, brightness, etc. It is assumed that conceptual spaces are metric spaces, with an associated distance measure. This might be Euclidean distance, or any other appropriate metric. The distance measure can be used to formulate a measure of similarity, as needed for prototype theory - similar objects are close together in the conceptual space, very different objects are far apart.\nTo develop the conceptual space framework, Gärdenfors also introduces the notion of integral and separable dimensions. Dimensions are integral if assignment of a value in one dimension implies assignment of a value in another, such as depth and breadth. Conversely, separable dimensions are those where there is no such implication, such as height and sweetness. A domain is then defined as a set of quality dimensions that are separable from all other dimensions, and a conceptual space is defined as a collection of one or more domains.\nGärdenfors goes on to define a property as a convex region of a domain in a conceptual space. A concept is defined as a set of such regions that are related via a set of salience weights. This casting of (at least) properties as convex regions of a domain sits very well with prototype theory, as Gärdenfors points out. If properties are convex regions of a space, then it is possible to say that an object is more or less central to that region. Because the region is convex, its centroid will lie within the region, and this centroid can be seen as the prototype of the property."}, {"heading": "2.3 Label Semantics", "text": "The label semantics framework was proposed by [17] and related to prototype theory and conceptual spaces in [19]. In this framework, agents use a set of labels LA = {L1, L2, ..., Ln} to describe an underlying conceptual space Ω which has a distance metric d(x, y) between points. In fact, it is sufficient that d(x, y) be a pseudo-distance. When x or y is a set, say Y , we take d(x, Y ) = min{d(x, y) : y ∈ Y }. In this case, the set Y is seen as an ontic set, i.e., a set where all elements are jointly prototypes, as opposed to an epistemic set describing a precise but unknown prototype, as described in [11]. Each label Li is associated with firstly a set of prototype values Pi ⊆ Ω, and secondly a threshold εi, about which the agents are uncertain. The thresholds εi are drawn from probability distributions δεi . Labels Li are associated with neighbourhoods N εiLi = {x ∈ Ω : d(x, Pi) ≤ εi}. The neighbourhood can be seen as the extension of the concept Li. The intuition here is that εi captures the idea of being sufficiently close to prototypes Pi. In other words, x ∈ Ω is sufficiently close to Pi to be appropriately labelled as Li providing that d(x, Pi) ≤ εi.\nGiven an element x ∈ Ω, we can ask how appropriate a given label is to describe it. This is quantified by an appropriateness measure, denoted µLi(x). We are intentionally using the same notation as for the membership function of a fuzzy set. This quantity is the probability that the distance from x to Pi, the prototype of Li, is less than the threshold εi, as given by:\nµLi(x) = P (εi : x ∈ N εiLi) = P (εi : d(x, Pi) ≤ εi) = ∫ ∞ d(x,Pi) δεi(εi)dεi\nWe also use the notation ∫∞ d δεi(εi)dεi = ∆i(d), according to which µLi(x) = ∆i(d(x, Pi)). The above formulation provides a link to the random set interpretation of fuzzy sets. Random sets are random variables taking sets as values. If we viewN εiLi as a random set from R+ into 2Ω, then µLi(x) is the single point coverage function of N εiLi , as defined in [18], and also commonly called a contour function [26].\nLabels can often be semantically related to each other. For example, the label ‘pet fish’ is semantically related to the labels ‘pet’ and ‘fish’, and the label ‘very tall’ related to the label ‘tall’. This prompts two questions: firstly, how the prototypes of each concept are related to each other, and secondly, how the thresholds of each concept are related. Two simple models for the relationships between the thresholds are given in [19]. The consonant model takes all thresholds as being dependent on one common underlying threshold. So, all thresholds have the same distance metric d and are related to a base threshold ε by the dependency that εi = fi(ε) for increasing functions fi. In contrast, the independence model takes all thresholds as being independent of each other. This might hold when labels are taken from different conceptual spaces.\nBetween these two extremes, we model dependencies between thresholds as a Bayesian network - i.e., a directed acyclic graph whose edges encode conditional dependence between variables. The key property of this type of network is that the joint distribution of all variables can be broken into factors that depend only on each individual variable and its parents. So, for example, the network in figure 1 can be factorised as δ(ε1, ε2, ε3, ε4, ε5) = δε1(ε1)δε2(ε2)δε3|ε1,ε2(ε3|ε1, ε2)δε4|ε2(ε4|ε2)δε5|ε3(ε5|ε3).\nThis enables calculation of the joint distribution and therefore marginal distributions in an efficient manner.\nOne intuitively easy example is where the dependency of one threshold ε2 on another ε1 is that ε2 ≤ ε1. This could be taken to model the dependency of the threshold of the concept ‘very tall’ on the threshold of ‘tall’. The label ‘very tall’ should be appropriate to describe fewer people than the label ‘tall’. Therefore, the threshold for describing someone as ‘very tall’ will be narrower than the threshold for describing someone as ‘tall’, i.e. εvery tall ≤ εtall. This simple model will form part of the approach to modelling linguistic hedges, as outlined in the sequel."}, {"heading": "3 Approaches to linguistic hedges", "text": "Linguistic hedges have been given varying treatments in the literature. In this section we summarise these different approaches and state the approach that we wish to take, discussing properties that hedge modifiers\nmay need. We give two specific approaches from the literature with which we will compare our results. In [31] the idea of linguistic hedges as operators modifying fuzzy sets was introduced, so that the membership function µhL(x) of a hedged concept, hL, is a function of the membership of the base concept L, i.e. µhL(x) = f(µL(x)). Furthermore, truth can be considered as a linguistic variable and hence a fuzzy set [32], so that the application of a hedge can be seen as modifying the truth value of a sentence using that concept [12, 15, 32]. This second view is useful in approximate reasoning, and allows for an algebraic approach to investigating the properties of linguistic hedges, as introduced in [32], and expanded upon in [5, 12, 15]. The approach we take, however, is to view a hedge as modifying the fuzzy set associated with a concept directly, as taken by [2, 4, 9, 24]. Rather than examining the algebraic properties of hedges or their role in reasoning, we look at how hedges are semantically grounded and argue that our approach provides a particularly clear semantics.\nWe will propose a set of operations that may be used for both expansion and refinement of single concepts. This is in contrast to the work presented in [27] in which information coarsening is effected by taking disjunctions of labels. The idea of a hedged concept has some similarities to that of the bipolar model of concepts described in [28], since if it is appropriate to describe someone as ‘very tall’, it must be appropriate to describe them as ‘tall’, and similarly describing someone as ‘quite tall’ implies that it is not entirely inappropriate to describe them as ‘tall’. However, we see the concepts derived by application of hedges as labels in their own right which can be used to describe data or objects.\nZadeh divides hedges into two types. A type 1 hedge can be seen as an operator acting on a single fuzzy set. Examples are ‘very’, ‘more or less’, ‘quite’, or ‘extremely’ [31]. Type 2 hedges are more complicated and include modifiers such as ‘technically’ or ‘practically’. In [31] concepts are considered as made up of various different components, with the membership function a weighted sum of the memberships of the individual components. Type 1 hedges operate on all components equally, whereas type 2 hedges differentiate between components. For example, the hedge ‘essentially’ might give more weight to the most important components in a concept. Type 2 hedges are further explored in [16, 29], where components of a concept are categorised as definitional, primary or secondary, and the hedges ‘technically’, ‘strictly speaking’ and ‘loosely speaking’ are analysed in terms of these categories. Although in the following we restrict ourselves to consideration of type 1 hedges only, the treatment of concepts as having different components is mirrored by the conceptual spaces view, where each component might be seen as a dimension in the conceptual space. Further development of the framework may therefore allow a treatment of type 2 hedges.\nA further distinction between types of hedge lies in the difference between powering or shifting modifiers. Powering modifiers are of the form µhL(x) = (µL(x))\nk, where hL refers to the hedged concept and k is some real value, and shifting modifiers are of the form µhL(x) = (µL(x − a)). Zadeh introduces both types of modifier in his discussion of type 1 hedges [31], however his powering modifiers are most frequently cited. These are the concentration operator CON(µtall(x)) = (µtall(x)) 2, and the dilation operator DIL(µtall(x)) =\n(µtall(x)) 1 2 , which are often taken to implement the hedges ‘very’ and ‘quite’, (alternatively ‘more or less’), respectively. 1\nThe operators CON and DIL leave the core, {x ∈ Ω : µL(x) = 1}, and support {x ∈ Ω : µL(x) 6= 0}, of the fuzzy sets unchanged, which is often argued to be undesirable [3, 2, 24, 21]. In particular, [3] argue that in a fuzzy database, if a concentrating hedge is being used to refine a query that is returning too many objects, the hedge needs to reduce the number of objects returned, and hence narrow down the core. Furthermore, [22] find that classifiers using the CON and DIL operators (classical hedges) do not perform as well as those with hedges that modify the core and support of the fuzzy sets. In contrast, Zadeh himself argues that the core should not be altered. The application of a modifier ‘very’ to a property given by a crisp set should leave that property unchanged: ‘very square’ is the same as ‘square’. A fuzzy set is made up of a non-fuzzy part, the core, and a fuzzy part, {x ∈ Ω : 0 < µL(x) < 1}. Since the core of a fuzzy set is a crisp set, it should be left unchanged. The use of classical hedges does improve performance over non-hedged fuzzy rules in expert systems [6, 7, 20], so the argument against classical hedges is a matter of degree.\nThe use of the CON and DIL operators to model the hedges ‘very’ and ‘quite’ is further criticised on the basis that the modifiers are arbitrary and semantically ungrounded. No justification is given for these modifiers other than that they have what seem to be intuitively the right properties [2, 8, 24]. Grounding hedges semantically is important for a theoretical account of what happens when we use terms like ‘very’ and also for retaining interpretability in fuzzy systems. [2, 8] both ground modifiers using a resemblance relation which takes into account how objects in the universe are similar to each other. [24] takes a horizon shifting approach.\nIn [24] the class of finite numbers is used as an example of the horizon shifting approach. Some numbers are certainly finite, however as numbers get larger, finiteness becomes impossible to verify. Mapping this idea onto the concept ‘small’, we can say that there is a class of numbers that are definitely small, say [0, c]. As numbers get larger than c we approach the horizon past which the concept ‘small’ no longer applies, expressed as 1− (x)(x− c). So:\nµsmall(x) = { 1 if x ∈ [0, c] 1− (x)(x− c) if x ≥ c\nNow, to implement the hedge ‘very’, the horizon c is shifted by a factor σ and the membership function altered thus:\nµvery small(x) = { 1 if x ∈ [0, σc] 1− (x, σ)(x− σc) if x ≥ σc\nIn [24], examples of different kinds of membership functions that might be used to implement this idea are given. A linear membership function gives (x) = 1a−c where a is the upper limit of the membership function. To implement the hedge, the function (x, σ) = 1σ(a−c) is introduced, giving\nµsmall(x) =  1 if x ∈ [0, c] 1− x−ca−c if x ∈ [c, a] 0 otherwise\nand\nµvery small(x) =  1 if x ∈ [0, σc] 1− x−σcσ(a−c) if x ∈ [σc, σa] 0 otherwise\n[2, 8] both ground their approaches in the idea of looking at the elements near a fuzzy set in order to contract or dilate the set. The two approaches are similar, so we restrict ourselves to that of [2]. This\n1Zadeh in fact proposes a rather more complicated hedge for ‘more or less’, which involves a combination of powering and shifting, however, the dilation operator is more frequently quoted in the literature.\napproach introduces a fuzzy resemblance relation on the universe of discourse, and either a T -norm in the case of dilation, or a fuzzy implicator for concentration. The modifier is then implemented as follows. Consider a fuzzy set F and a proximity relation EZ which is approximate equality, parametrised by a fuzzy set Z. As described in [2], E is modelled by (u, v)→ E(u, v) = Z(u− v), where Z is a fuzzy interval centred on 0 with finite support. In terms of a trapezoidal membership function, Z can be expressed as (−z − a,−z, z, z + a). Therefore, if |u − v| ≤ z, u and v are judged to be approximately equal, i.e. EZ(u, v) = 1. The set F is dilated by EZ(F )(s) = supr∈ΩT (F (r), E\nZ(s, r)), where T is any T -norm, min being the standard. To understand the effect that this has on a fuzzy set F , suppose that F has a trapezoidal membership function (A,B,C,D) where [B,C] is the core of F and [A,B], [C,D] the support, and that Z similarly is (−z − a,−z, z, z + a), with the T-norm min used. Then EZ(F ) = (A− z − a,B − z, C + z,D + z + a).\nConcentration is effected in a similar way: EZ(F )(s) = infr∈ΩI(F (r), EZ(s, r)), where I is a fuzzy implication. If F and Z are as above with the condition that C − B ≥ 2z, and I is the Gödel implication, then EZ(F ) = (A+ z + a,B + z, C − z,D − z − a).\nFor example, suppose we start with a set F described in trapezoidal notation as F = (A,B,C,D) = (2, 4, 6, 8), and an approximate equality function parametrised by Z = (−z−a,−z, z, z+a) = (−1,−0.5, 0.5, 1). The dilation of the set F using T-norm min is then:\nEZ(F ) = (A− z − a,B − z, C + z,D + z + a) = (1, 3.5, 6.5, 9) The concentration of the set F using the Gödel implication is:\nEZ(F ) = (A+ z + a,B + z, C − z,D − z − a) = (3, 4.5, 5.5, 7) These effects are illustrated in figure 2.\nThe intuitive idea behind this approach is that if an object x1 resembles another object x2 that is L, then x1 can be said to be ‘quite L’. Conversely, object x2 that is L can be said to be ‘very L’ only if all the objects x that resemble it can be said to be L. This formulation alters both the core and support of the fuzzy set L, which has been argued to be a desirable effect.\nFollowing [2, 8, 24], we will propose linguistic modifiers that are semantically grounded rather than attempting to show their utility in classifiers, reasoning or to examine the algebra of modifiers. Our approach to linguistic modifiers arises very naturally from the label semantics framework, and the primary result does not require any parameters additional to the original membership function of the concept. We also show similarities between our model and the two detailed above."}, {"heading": "4 Label semantics approach to linguistic hedges", "text": "We present three formulations of linguistic hedges with increasing levels of generality. The first assumes that prototypes are equal. Secondly, we show that an analogue holds where prototypes are not equal, and thirdly that these hold in the case where the second threshold is a function of the first. We go on to show similarities between our model and those of [2, 8, 24]. Furthermore, we show that hedges are compositional, and look at their behaviour in the limit of composition.\nAs described in section 2.3, LA denotes a finite set of labels {Li} that agents use to describe basic categories. Ω is the underlying domain of discourse, with prototypes Pi ∈ Ω and thresholds εi, drawn from a distribution δεi . As before, the appropriateness µLi(x) = ∆i(d(x, Pi)) = ∫∞ d(x,Pi) δεi(εi)dεi. We use the notation Li =< Pi, d, δεi >. A concept L1 can be narrowed or broadened to a second concept L2 using the linguistic hedges ‘very’ and ‘quite’ respectively, i.e. L2 is defined as ‘quite L1’. The directed acyclic graph illustrating this dependency is given in figure 3. In this case, the threshold ε2 associated with L2 is dependent on ε1 in that ε2 ≥ ε1. In the case of ‘very’, we have that ε2 ≤ ε1. Essentially, for ‘quite’, we are saying that however wide a margin of certainty we apply the label ‘tall’ with, the margin for ‘quite tall’ will be wider, and conversely for ‘very’."}, {"heading": "4.1 Hedges with unmodified prototypes", "text": "Definition 1 (Dilation and Concentration). A label L2 =< P2, d, δε2 > is a dilation of a label L1 =< P1, d, δε1 > when ε2 is dependent on ε1 such that ε2 ≥ ε1. L2 is a concentration of L1 when ε2 is dependent on ε1 such that ε2 ≤ ε1.\nTheorem 2 (L2 = quite L1). Suppose L2 =< P2, d, δε2 > is a dilation of L1 =< P1, d, δε1 >, so that ε2 ≥ ε1. Suppose also that P1 = P2 = P , and that the marginal (unconditional) distribution of ε2, before conditioning on the knowledge that ε2 ≥ ε1, is identical to δε1 , since L2 is a dilation of L1. Then ∀x ∈ Ω, µL2(x) = µL1(x)− µL1(x) ln(µL1(x)).\nProof.\nδε2|ε1(ε2|ε1) = { δε1 (ε2)∫∞ ε1 δε1 (ε2)dε2\nif ε2 ≥ ε1 0 otherwise =\n{ δε1 (ε2)\n∆1(ε1) if ε2 ≥ ε1 0 otherwise\nand hence,\nδ(ε1, ε2) = δε1(ε1)δε2|ε1(ε2|ε1) = { δε1 (ε1)δε1 (ε2) ∆1(ε1) if ε2 ≥ ε1\n0 otherwise\nThen since ε2 ≥ ε1 we have that\nµL2(x) = ∫ ∞ 0 ∫ ∞ max(ε1,d(x,P )) δ(ε1, ε2)dε2dε1 = ∫ ∞ 0 ∫ ∞ max(ε1,d(x,P )) δε1(ε1)δε1(ε2) ∆1(ε1) dε2dε1\n= ∫ d(x,P ) 0 δε1(ε1) ∆1(ε1) ∫ ∞ d(x,P ) δε1(ε2)dε2dε1 + ∫ ∞ d(x,P ) δε1(ε1) ∆1(ε1) ∫ ∞ ε1 δε1(ε2)dε2dε1\n= µL1(x) ∫ d(x,P ) 0 δε1(ε1) ∆(ε1) dε1 + ∫ ∞ d(x,P ) δε1(ε1)dε1 = µL1(x)− µL1(x) ln(µL1(x))\nThe following example gives an illustration of the effect of applying this hedge, in comparison with the standard dilation hedge (µL(x)) 1/2.\nExample 3. Suppose our conceptual space Ω = R with Euclidean distance and that a label L has prototype P = 5, and threshold ε ∼ Uniform[0, 3]. Then\nµL(x) = { 1− |x−5|3 if x ∈ [2, 8] 0 otherwise\nWe can then form a new label qL with prototype Pq = P = 5 and threshold εq ≥ ε. Then, according to theorem 2, µqL(x) = µL(x) − µL(x) lnµL(x). The effect of applying a dilation hedge to L can be seen in figure 4. The dilation hedge given above is contrasted with Zadeh’s dilation hedge (µL(x)) 1/2.\nTheorem 4 (L2 = very L1). Suppose L2 =< P2, d, δε2 > is a concentration of L1 =< P1, d, δε1 >, so that ε2 ≤ ε1. Suppose also that P1 = P2 = P , and that the marginal (unconditional) distribution of ε2, before conditioning on the knowledge that ε2 ≤ ε1, is identical to δε1 , since L2 is a concentration of L1. Then ∀x ∈ Ω, µL2 = µL1(x) + (1− µL1(x)) ln(1− µL1(x)).\nProof.\nδε2|ε1(ε2|ε1) = { δε1 (ε2)∫ ε1 0 δε1 (ε2)dε2\nif ε2 ≤ ε1 0 otherwise =\n{ δε1 (ε2)\n1−∆1(ε1) if ε2 ≤ ε1 0 otherwise\nand hence,\nδ(ε1, ε2) = δε1(ε1)δε2|ε1(ε2|ε1) = { δε1 (ε1)δε1 (ε2)\n1−∆1(ε1) if ε2 ≤ ε1 0 otherwise\nSo since ε2 ≤ ε1 we have that:\nµL2(x) = ∫ ∞ 0 ∫ ε1 min(ε1,d(x,P )) δ(ε1, ε2)dε2dε1 = ∫ ∞ 0 ∫ ε1 min(ε1,d(x,P )) δε1(ε1)δε1(ε2) 1−∆1(ε1) dε2dε1\n= ∫ ∞ d(x,P ) δε1(ε1) 1−∆1(ε1) ∫ ε1 d(x,P ) δε1(ε2)dε2dε1\n= ∫ ∞ d(x,P ) δε1(ε1) 1−∆1(ε1) (∫ ε1 0 δε1(ε2)dε2 − ∫ d(x,P ) 0 δε1(ε2)dε2 ) dε1\n= µL1(x)− (1− µL1(x)) ∫ ∞ d(x,P ) δε1(ε1) 1−∆1(ε1) dε1 = µL1(x) + (1− µL1(x)) ln(1− µL1(x))\nThe effect of these hedges are illustrated in the following example.\nExample 5. Suppose the label L is as described in example 3. We can form a new label vL with prototype Pv = P = 5 and threshold εv ≤ ε. Then, according to theorem 4, µvL(x) = µL(x) + (1−µL(x)) ln(1−µL(x)) The effect of applying this contraction hedge is seen in figure 5, and again, this concentration hedge is contrasted with Zadeh’s concentration hedge (µL(x)) 2.\nThese hedges can also be applied across multiple dimensions, demonstrated in the example below.\nExample 6. Suppose we have two labels ‘tall’ and ‘thin’. ‘Tall’ has prototype Ptall = 6.5ft and ‘thin’ has prototype Pthin = 24in. The appropriateness of each label is defined by:\nµtall(x1) =  1 ifx1 > 6.5\n1− (Ptall − x1) ifx1 ∈ [5.5, 6.5] 0 otherwise\nwhere the variable x1 measures height\nµthin(x2) =  1 ifx2 < 24\n1− (x2−Pthin)4 ifx2 ∈ [24, 28] 0 otherwise\nwhere x2 measures waist size. Suppose further that being tall and being thin are independent of each other. The appropriateness of the\nlabel ‘tall and thin’ could then be defined by:\nµtall and thin(x1, x2) = µtall(x1)µthin(x2)\nIf ‘tall’ and ‘thin’ are independent, we can treat their hedges separately, so the appropriateness of a label ‘very tall and quite thin’ is:\nµvery tall and quite thin(x1, x2) = µvery tall(x1)µquite thin(x2)\n= (µtall(x1) + (1− µtall(x1) ln(1− µtall(x1)))(µthin(x2)− µthin(x2) ln(µthin(x2)))\nThis is illustrated in figure 6"}, {"heading": "4.2 Hedges with differing prototypes", "text": "As they stand, the hedges proposed leave the core and support of the fuzzy sets unchanged, which is often argued to be undesirable [2, 3, 24, 21]. A slight modification yields models of hedges in which the core, or prototype, of the concept has been changed.\nTheorem 7 (Dilation). Suppose that L2 = quite L1, as in theorem 2, but that P2 6= P1. Then µL2(x) = ∆1(d(x, P2))−∆1(d(x, P2)) ln(∆1(d(x, P2))).\nProof. Substitute ∆1(d(x, P2)) for µL1(x) throughout proof of theorem 2\nTheorem 8 (Concentration). Suppose that L2 = very L1, as in theorem 4, but that P2 6= P1. Then µL2(x) = ∆1(d(x, P2)) + (1−∆1(d(x, P2))) ln(1−∆1(d(x, P2))).\nProof. As above.\nCorollary 9. If ε2 ≥ ε1 and P2 ⊇ P1 then µL2(x) ≥ µL1(x)−µL1(x) ln(µL1(x)), and if ε2 ≤ ε1 and P2 ⊆ P1, then µL2(x) ≤ µL1(x) + (1− µL1(x)) ln(1− µL1(x)).\nProof. µL2(x) = ∆1(d(x, P2))−∆1(d(x, P2)) ln(∆1(d(x, P2))), but since P2 ⊇ P1, d(x, P2) ≤ d(x, P1) ∀x ∈ Ω, and so ∆1(d(x, P2)) ≥ ∆1(d(x, P1)) = µL1(x) ∀x ∈ Ω. Hence, µL2(x) ≥ µL1(x)−µL1(x) ln(µL1(x)). A similar argument shows that µL2(x) ≤ µL1(x) + (1− µL1(x)) ln(1− µL1(x)).\nExample 10. Suppose our conceptual space Ω = R with Euclidean distance and that a label L has prototype P = [4.5, 5.5], and threshold ε ∼ Uniform[0, 3]. Then\nµL(x) =  1 if x ∈ [4.5, 5.5] 1− |x−5|3 if x ∈ [1.5, 4.5] or x ∈ [5.5, 8.5] 0 otherwise\nWe form the concept qL by setting the prototype to be Pq = [4, 6], and εq ≥ ε. The effect of applying our dilation hedge is illustrated in figure 7.\nConversely, suppose that a label L has prototype P = [4, 6] and threshold ε ∼ Uniform[0, 3]. Then\nµL(x) =  1 if x ∈ [4, 6] 1− |x−5|3 if x ∈ [1, 4] or x ∈ [6, 9] 0 otherwise\nWe now form the concept vL by contracting the prototype to Pv = [4.5, 5.5] and setting εv ≤ ε. The effect of applying the contraction hedge is illustrated in figure 8."}, {"heading": "4.3 Functions of thresholds", "text": "It may be the case that the threshold of a given concept is greater than or less than a function of the original threshold. This could hold when a hedged concept is a very expanded or restricted version of the original concept, such as when the hedge ‘loosely’ or ‘extremely’ is used. Our formulae can also take account of this.\nTheorem 11. Suppose L2 =< P2, d, δε2 > is a dilation of L1 =< P1, d, δε1 > with P2 6= P1 and ε2 ≥ f(ε1), where f : R→ R is strictly increasing or decreasing. Then\nµL2(x) = ∆1(f −1(d(x, P2)))−∆1(f−1(d(x, P2))) ln(∆1(f−1(d(x, P2))))\nProof. Rewrite ε2 ≥ f(ε1) as ε2 ≥ ε = f(ε1), where ε ∼ δ and is associated with a label L with prototype P . Then: µL2(x) = ∆(d(x, P2))−∆(d(x, P2)) ln(∆(d(x, P2))) as above\nSince f : R→ R is strictly monotone, f−1 exists, and ∆(d(x, P )) = P (d(x, P ) ≤ ε) = P (f−1(d(x, P )) ≤ ε1) = ∆1(f\n−1(d(x, P ))). So\nµL2(x) = ∆1(f −1(d(x, P2)))−∆1(f−1(d(x, P2))) ln(∆1(f−1(d(x, P2))))\nas required.\nTheorem 12. Suppose L2 =< P2, d, δε2 > is a concentration of L1 =< P1, d, δε1 > with P2 6= P1 and ε2 ≤ f(ε1), where f : R→ R is strictly increasing or decreasing. Then\nµL2(x) = ∆1(f −1(d(x, P2))) + (1−∆1(f−1(d(x, P2)))) ln(1−∆1(f−1(d(x, P2))))\nProof. The proof is entirely similar to that of theorem 11"}, {"heading": "4.4 Links to other models of hedges", "text": "It is possible to specify the dependence of the threshold of the hedged concept on the threshold of the unhedged concept purely deterministically, i.e. by ε2 = f(ε1), rather than ε2 ≤ f(ε1). In this case, we can show links to other models of hedges from the literature.\nA simple example of a deterministic dependency is given below.\nExample 13. Suppose Ω = R, d is Euclidean distance and that L1 has prototype P = 5 and ε ∼ Uniform[0, 3]. Then as before,\nµL(x) = { 1− |x−5|3 if x ∈ [2, 8] 0 otherwise\nTo implement a dilation hedge, we would form a new label qL with Pq = P = 5 and εq = kqε with kq > 1. For a contraction hedge, we would form the label vL by setting Pv = P = 5 and εv = kvε with kv < 1. Then,\nµhL(x) = { 1− |x−5|3k if x ∈ [5− 3k, 5 + 3k] 0 otherwise\nwhere h = q or v, k = kq or kv respectively. The effect of implementing these hedges is illustrated in figure 9.\nUsing this approach, we can also create an effect similar to that of changing the prototype. Suppose that a label L in a conceptual space Ω has a single point P as a prototype, but that the minimum value of the threshold ε is greater than 0, for example, ε ∼ Uniform[c, a]. Then\nµL(x) =  1 if d(x, P ) < c a a−c − |x−P | a−c if d(x, P ) ∈ [a, c]\n0 otherwise\nSuppose that a hedged concept hL is formed from L by the dependency εh = kε where k is a constant. Then\nµL(x) = ∆( |x− P | k ) =  1 if |x−P |k < c a (a−c) − |x−P | k(a−c) if |x−P | k ∈ [a, c]\n0 otherwise\n=  1 if |x− P | < kc ka−|x−P | k(a−c) if |x− P | ∈ [ka, kc]\n0 otherwise\nThis effect is illustrated in the example below.\nExample 14. Suppose that the conceptual space Ω = R and that a label L has prototype P = 5 and threshold ε ∼ Uniform[1, 2]. Then\nµL(x) =  1 if |x− 5| < 1 2− |x− 5| if |x− 5| ∈ [1, 2] 0 otherwise\nForming a new label qL by applying the hedge εq = 2ε gives appropriateness measure\nµqL(x) =  1 if |x− 5| < 2 4−|x−5|\n2 if |x− 5| ∈ [2, 4] 0 otherwise\nForming a new label vL by applying the hedge εv = 0.5ε gives appropriateness measure\nµvL(x) =  1 if |x− 5| < 0.5 1−|x−5|\n0.5 if |x− 5| ∈ [0.5, 1] 0 otherwise\nThese are illustrated in figure 10.\nNotice that if we set Ω = R+ and label L specified by P = 0, ε ∼ Uniform[c, a], this is identical to the linear membership model given in [24]. Specifically, we have\nµL(x) =  1 if x < c a−x a−c if x ∈ [c, a] 0 otherwise\nForming a hedged concept hL by setting PhL = P = 0 and εhL = kε gives\nµhL(x) =  1 if x < kc ka−x ka−kc if x ∈ [kc, ka] 0 otherwise\nComparing this with the model given in section 3, we see that this is precisely the model proposed by [24] in the linear case.\nSimilarity between the hedging effects illustrated in figure 9 and the effects implemented in the model proposed in [2], illustrated in figure 2, can clearly be seen. To derive the model given in [2], we describe the fuzzy sets associated with labels L and hL in trapezoidal notation. Notice that L = (P−a, P−c, P+c, P+a) and hL = (P − ka, P − kc, P + kc, P + ka). We can render this transformation in the terms employed by [2]. Consider labels L and hL as fuzzy sets characterised by the appropriateness measure µL(x) and µhL(x). Then, in the case of dilation, we have:\nqL = EZ(L)(s) = supr∈ΩT (µL(s), E Z(s, r))\nand for contraction,\nvL = EZ(L)(s) = infr∈ΩI(µL(s), E Z(s, r))\nWhen T is the T -norm min, I is the Gödel implication and Z = (−z−α,−z, z, z+α) (with the restriction that c < z to ensure a well-defined set), the approach in [2] gives qL = (P −a−z−α, P −c−z, P +c+z, P + a+z+α). If we set z = (k−1)c and α = (k−1)(a−c), this is equal to qL = (P −ka, P −kc, P +kc, P +ka).\nHowever, we also require that vL = (P − ka, P − kc, P + kc, P + ka). The approach in [2] gives vL = (P−a+z+α, P−c+z, P+c−z, P+a−z−α), and we therefore need to set z = (1−k)c and α = (1−k)(a−c)\nThis formulation is not as general as given in [2], however, note that it only uses one additional parameter and no additional operators, rather than the two parameters and either a T -norm or implication used by [2].\nTwo more key models from the literature are the powering and shifting modifiers proposed in [31]. Recall that powering modifiers are of the form µhL(x) = (µL(x))\nk and shifting modifiers are of the form µhL(x) = (µL(x − a)). Shifting modifiers are easy to implement within our model, simply by shifting the prototype by the quantity a.\nPowering modifiers can be expressed as a function of the threshold ε given a particular distribution of the threshold δ. Suppose Ω = R, ε ∼ U [0, c], giving\nµL(x) = { 1− d(x,P )b if x ∈ [P − b, P + b] 0 otherwise\nand suppose a new label hL is formed with prototype P and threshold εh = f(ε) such that µhL(x) = µL(x) k. Then µhL(x) = ∆(f −1(d(x, P ))) = (∆(d(x, P )))k, so\nf−1(d(x, P )) = ∆−1((∆(d(x, P )))k) = b− b( (b− d(x, P )) k bk ) = b− (b− d(x, P )) k bk−1\nand hence εhL = f(ε) = b− (bk−1(b− ε))1/k\nThis expression seems surprisingly complicated, and there may be better ways of deriving the powering hedges that are not as a function of the threshold ε.\nIn this section we have shown that our general model can capture some of the many approaches found in the literature as special cases. We now go on to look at the property of compositionality that is exhibited by a number of models."}, {"heading": "4.5 Compositionality", "text": "One of the features of hedges seen in [2, 8, 24, 31] is that they can be applied multiple times. Within the label semantics framework, this consists in expanding or reducing the threshold of a concept a number of times. The directed acyclic graph corresponding to this is shown in figure 11. We show below that expressions for ‘very’ and ‘quite’ as given in theorems 2 and 4 are compositional, and that the appropriateness of a concept after n applications of a hedge can be expressed purely in terms of the appropriateness after n− 1 applications. We also derive expressions for the composition of deterministic hedges as described in section 4.4.\nTheorem 15. Suppose that labels L1, L2, ..., Ln are defined by prototypes P1 = P2 = ... = Pn = P , thresholds ε1 ≥ ε2 ≥ ... ≥ εn and with a distance metric d common to all labels. Then µLn(x) = µLn−1(x) + (1 − µLn−1(x)) ln(1− µLn−1(x))\nProof. We proceed by induction on n. Theorem 2 proves this for n = 2. Assuming true for n = k, we have\nµLk+1(x) = ∫ ∞ 0 ∫ ∞ 0 ... ∫ ∞ max(d(x,P ),εk) δ(ε1, ε2, ..., εk+1)dεk+1...dε1\n= ∫ ∞ 0 δε1(ε1) ∆1(ε1) ∫ ∞ 0 δε1(ε2) ∆2(ε2) ... ∫ ∞ 0 δεk−1(εk) ∆k(εk) ∫ ∞ max(d(x,P ),εk) δεk(εk+1)dεk+1...dε1\n= ∫ ∞ 0 δε1(ε1) ∆1(ε1) ∫ ∞ 0 δε1(ε2) ∆2(ε2) ... ∫ ∞ max(d(x,P ),εk−1) δεk−1(εk) ∆k(εk) =∆k(εk)︷ ︸︸ ︷∫ ∞ εk δεk(εk+1)dεk+1 dεk...dε1\n+ ∫ d(x,P ) 0 δε1(ε1) ∆1(ε1) ∫ d(x,P ) ε1 δε1(ε2) ∆2(ε2) ... ∫ d(x,P ) εk−1 δεk−1(εk) ∆k(εk) =µLk (x)︷ ︸︸ ︷∫ ∞ d(x,P ) δεk(εk+1)dεk+1 dεk...dε1\n= =µLk (x) by ind. hyp.︷ ︸︸ ︷∫ ∞ 0 δε1(ε1) ∆1(ε1) ∫ ∞ 0 δε1(ε2) ∆2(ε2) ... ∫ ∞ max(d(x,P ),εk) δεk−1(εk)dεk...dε1\n+ µLk(x) ∫ d(x,P ) 0 δε1(ε1) ∆1(ε1) ∫ d(x,P ) ε1 δε1(ε2) ∆2(ε2) ... ∫ d(x,P ) εk−1 δεk−1(εk) ∆k(εk) dεk...dε1\n= µLk(x) + µLk(x) ∫ d(x,P ) 0 δεk−1(εk) ∆k(εk) ... ∫ ε3 0 δε1(ε2) ∆2(ε2) ∫ ε2 0 δε1(ε1) ∆1(ε1) dε1...dεk\n= µLk(x) + µLk(x) =A︷ ︸︸ ︷∫ d(x,P ) 0 δεk−1(εk) ∆k(εk) ... ∫ ε3 0 −δε1(ε2) ln(∆1(ε2)) ∆2(ε2) dε2...dεk\nBy the inductive hypothesis, ∀i = 0...k\nδεi(εi) = − d\ndεi ∆i(εi)\n= − d dεi (∆i−1(εi)−∆i−1(εi) ln(∆i−1(εi)))\n= −δεi−1(εi) ln(∆i−1(εi)) Recursively substituting in A, we obtain\nµLk+1(x) = µLk(x) + µLk(x) ∫ d(x,P ) 0 δεk−1(εk) ∆k(εk) ... ∫ ε3 0 δε2(ε2) ∆2(ε2) dε2...dεk\n= µLk(x) + µLk(x) ∫ d(x,P ) 0 δεk(εk) ∆k(εk) dεk = µLk(x)− µLk(x) ln(µLk(x))\nTheorem 16. Suppose labels L1, L2, ..., Ln are defined by prototypes P1 = P2 = ... = Pn = P , thresholds ε1 ≤ ε2 ≤ ... ≤ εn, and that distance metric d is common to all. Then µLn(x) = µLn−1(x)−µLn−1(x) ln(µLn−1(x)) Proof. Similar to proof of theorem 15.\nWe can also derive expressions for the composition of deterministic hedges.\nTheorem 17. Suppose labels L1, L2, ..., Ln are defined by prototypes P1 = P2 = ... = Pn = P , thresholds εn = f(εn−1), εn−1 = f(εn−2), ..., ε2 = f(ε1), where f is monotone increasing or decreasing, and that distance metric d is common to all. Then µLn(x) = ∆1(f\n−(n−1)(d(x, P )), where f−k signifies f−1 composed k times.\nProof. µL2(x) = ∆1(f −1(d(x, P )). Suppose that µLk(x) = ∆k(d(x, P )) = ∆1(f −(k−1)(d(x, P )). Since εk+1 = f(εk), we have µLk+1(x) = ∆k(f\n−1(d(x, P )) = ∆1(f−k(d(x, P ))). Therefore µLn(x) = ∆1(f −(n−1)(d(x, P )) by induction.\nSince labels can be composed in this way, we can model different degrees of emphasis corresponding to the composition of multiple hedges. So, for example, we could model ‘extremely L’ as ‘very, very L’. This is illustrated in example 18.\nExample 18. Suppose the label L is as described in example 3, i.e. L has prototype P = 5, and threshold ε ∼ Uniform[0, 3]. We can form a new label vL with prototype Pv = P = 5 and threshold εv ≤ ε, which has appropriateness µvL(x) = µL(x) + (1 − µL(x)) ln(1 − µL(x)) as shown in theorem 4. We may then form another new label vvL with prototype Pvv = Pv = 5 and threshold εvv ≤ εv with appropriateness µvvL(x) = µvL(x) + (1 − µvL(x)) ln(1 − µvL(x)) as described in theorem 15. The effect of applying this contraction hedge is seen in figure 12. We have contrasted the effect of the composed hedges with (µL(x)) 4.\nSince these hedges can be composed only an integral number of times, we cannot obtain the differences in grade that could be achieved with using various powers in a powering modifier, e.g. µL(x)\n1.73. However, in section 4.3 we discuss how to tune the intensity of hedges by using dependencies on functions of thresholds. We have further shown in section 4.4 how to derive powering and shifting modifiers within our framework. It would be interesting to explore how other examples of hedges can be expressed in this framework.\nWe have shown that when multiple hedges of the forms seen in theorems 2 and 4 are used, µLn(x) can be expressed purely in terms of the appropriateness of the label directly preceding it. We have not been able to find a closed form solution for this recurrence, however, we can investigate the fixed points of the recurrence and examine what happens to the values of µLn(x) as n→∞. We have also shown that deterministic hedges can be composed, and we go on to look at their behaviour in the limit of composition."}, {"heading": "4.6 Limits of Compositions.", "text": "The following results examine the behaviour of µLn(x) as n→∞\nTheorem 19. Suppose L1, ..., Ln are labels obtained by repeated application of the dilation operator. Then µLn has a limit M + and M+ = 1 ∀x ∈ Ω such that µL1(x) 6= 0, and M+ = 0 otherwise.\nProof. µLi+1(x) = µLi(x) − µLi(x) ln(µLi(x)), i = 1, .., n − 1. If µL1(x) = 1 then µLi(x) = 1 ∀i = 1, ..., n. Also, if µL1(x) = 0 then µLi(x) = 0 ∀i = 1, ..., n. Suppose µLi(x) ∈ (0, 1). Then µLi+1(x) > µLi(x), and so for µL1(x) ∈ (0, 1), µL1(x) < ... < µLn(x) is a strictly increasing sequence.\nIf a limit M+ exists, then we will have M+ = M+ −M+ ln(M+), so either M+ = 0 or ln(M+) = 0. We can’t have M+ = 0, since we assume that µL1(x) ∈ (0, 1) and the sequence is strictly increasing. Therefore, we must have ln(M+) = 0 and therefore M+ = 1. So\nµL∞(x) = { 1 µL1(x) ∈ (0, 1] 0 µL1(x) = 0\nTheorem 20. Suppose L1, ..., Ln are labels obtained by repeated application of the contraction operator. Then µLn has a limit M − and M− = 0 ∀x ∈ Ω such that µL1(x) 6= 1, and M− = 1 otherwise.\nProof. µLi+1(x) = µLi(x) + (1−µLi(x)) ln(1−µLi(x)), i = 1, ..., n−1. Again, if µL1(x) = 1 then µLi(x) = 1 ∀i = 1, ..., n. Also, if µL1(x) = 0 then µLi(x) = 0 ∀i = 1, ..., n, and for µL1(x) ∈ (0, 1), µL1(x) > ... > µLn(x) is a strictly decreasing sequence.\nIf a limit M− exists, then\nM− = M− + (1−M−) ln(1−M−) ln(1−M−) = M− ln(1−M−)\nSo either M− = 0 or ln(1 −M−) = 0. If ln(1 −M−) = 0 then M− = 1, which is impossible since µL1(x) ∈ (0, 1) and the sequence of µLi(x) is strictly decreasing. Therefore\nµL∞(x) = { 0 µL1(x) ∈ [0, 1) 1 µL1(x) = 1\nWe have shown here that in the limit, the result of applying dilation or contraction modifiers multiple times is to create a crisp set. In the case of dilation, the crisp set includes the whole support of the fuzzy set associated with the original label, whereas in the case of contraction, the concept reduces to include only its prototype.\nWhen deterministic hedges are used, i.e. ε2 = f(ε1), the behaviour of the limit depends on the behaviour of the function f and its properties in the limit as n→∞ of f−n.\nExample 21. Suppose f(ε) = 0.5ε. Applying this hedge multiple times will result in µLn(x) = ∆1(2 nd(x, P )). As n→∞, 2nd(x, P )→∞, except where d(x, P ) = 0. Therefore,\nµL∞(x) = { 0 d(x, P ) > 0 1 d(x, P ) = 0\nOn the other hand, if f(ε) = 2ε, µLn(x) = ∆1(2 −nd(x, P )). As n → ∞, 2−nd(x, P ) → 0, and hence\nµL∞(x) = 1 ∀x ∈ Ω.\nThe behaviour of the hedges given in example 21 is therefore different from those in theorems 19 and 20, since the concept either shrinks to a single point, in the case of contraction, or, in the case of dilation, expands to fill the entire space Ω."}, {"heading": "5 Discussion", "text": "We have presented formulae for linguistic hedges which are both functional and semantically grounded. The modifiers presented arise naturally from the label semantics framework, in which concepts are represented by a prototype and threshold. Our hedges have an intuitive meaning: if I think that the threshold for a concept ‘small’ is of a certain width, then the threshold for the concept ‘very small’ will be narrower. On the other hand, the threshold for the concept ‘quite small’ will be broader. The hedges proposed are examples of ‘type 1’ hedges, i.e. they operate equally across all dimensions of the fuzzy set associated with a concept. The first result presented is somewhat similar to a powering modifier since the core and support of the set remain the same. In [3, 22], it is argued that this property is undesirable for hedges used in fuzzy expert systems, since if a query is returning too large a set of answers, this type of contraction hedge does not reduce this overabundance. However, although the hedges we propose do not at their simplest address the overabundance issue, we argue that they address another problem associated with powering hedges, in that they have a clear semantic grounding that the powering modifiers lack.\n[2, 8] also propose modifiers that are semantically grounded, using the idea of resemblance to nearby objects. Their formulations have the properties that the core and support of the fuzzy set are both changed, thereby addressing the issue of overabundant answers [3, 22]. In our most specific case, since the prototype is not altered, the core and support of the fuzzy set representing the concept remain the same. However, our initial proposal can be generalised, as in section 4.2, to apply to the case where P1 6= P2. Specifying a semantically meaningful way of altering the boundaries of the prototype would answer the objection that the core and support of a set should change under a linguistic hedge.\nThe most general result (section 4.3) shows that the formula still applies when ε2 ≤ f(ε1), or ε2 ≥ f(ε1). Combined with a distribution δ such that the lower bound of the distribution is not zero, the core and support of the fuzzy set are modified. With the condition ε2 = f(ε1), we are able to recreate the result given in [24] for linear membership functions, and show how the model proposed by [2] has strong similarities to our own. In this case we have introduced additional parameters, so the simplicity of the original result is lost. However, the further parameters introduced are no more than those introduced by [24], and arguably fewer than those introduced by [2], who require that a resemblance relation be specified, using two additional parameters, and also, that a T -norm or fuzzy implication need to be specified. There are various choices of operator that could be used for either of these, and it is not obvious that any one is better than the others.\nWe have also shown that the basic case operators ‘very’ and ‘quite’ can be composed, which is not immediately obvious from the formulae (section 4.5). Further, we show that in the limit of composition the\nmembership of any object in the fuzzy part of L, i.e. {x : 0 < µL(x) < 1}, increases to 1 in the case of ‘quite’ or decreases to 0 in the case of ‘very’ (section 4.6). This is similar to the limit of applying the powering modifiers, but differs from what would happen with the modifiers proposed by [2]. In that case, the limit of ‘very’ would shrink to a single point and the limit of ‘quite’ would expand to encompass the whole universe of discourse. This can be modelled using the deterministic hedges described in section 4.4. Although behaviour differs slightly, in fact human discourse does not apply modifiers infinitely, so the difference in behaviour is arguably not important.\nOur formulation has the benefit that it can be applied in more situations than simply linguistic hedges. For example, the concept ‘apple green’ has a prototype different to that of just green, and the threshold for ‘apple green’ is likely to be smaller than the threshold for simply ‘green’. Our model can take account of this."}, {"heading": "6 Conclusions and further work", "text": "We have presented formulae for two simple linguistic hedges, ‘very’ and ‘quite’. These formulae are functional, hence easy to compute, but also semantically grounded, in that they arise naturally from the conceptual framework of label semantics combined with prototype theory and conceptual spaces theory, and in the most specific case require no additional parameters. We have also shown that two other formulations [2, 8, 24], can be derived from this framework with equal or fewer parameters. We have shown that the hedges can be composed and have described their behaviour in the limit of composition.\nFurther work could look at testing the utility of these hedges in particular classifiers to compare their performance with the classical hedges and with the hedges used by e.g. [3, 22], and also to examine a trade-off between accuracy and the number of parameters used. Alternatively, investigating semantically grounded ways of expanding or reducing prototypes could have a similar impact.\nThe model could also be extended to the more complicated type 2 hedges such as ‘essentially’, or ‘technically’, by treating dimensions of the conceptual space heterogeneously. This requires using some type of weighting or necessity measure on the dimensions, work which is currently ongoing."}, {"heading": "7 Acknowledgements", "text": "Martha Lewis gratefully acknowledges support from EPSRC Grant No. EP/E501214/1"}], "references": [{"title": "A fuzzy linguistic approach generalizing boolean information retrieval: A model and its evaluation", "author": ["G. Bordogna", "G. Pasi"], "venue": "JASIS, 44(2):70–82,", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1993}, {"title": "Adjusting the core and/or the support of a fuzzy set-a new approach to fuzzy modifiers", "author": ["P. Bosc", "D. Dubois", "A. HadjAli", "O. Pivert", "H. Prade"], "venue": "In Fuzzy Systems Conference,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2007}, {"title": "Empty versus overabundant answers to flexible relational queries", "author": ["P. Bosc", "A. Hadjali", "O. Pivert"], "venue": "Fuzzy Sets and Systems,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 2008}, {"title": "Interpretable decisions by means of similarities and modifiers", "author": ["B. Bouchon-Meunier"], "venue": "In Fuzzy Systems,", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 2009}, {"title": "Hedge algebras: an algebraic approach to structure of sets of linguistic truth values", "author": ["N. Cat Ho", "W. Wechler"], "venue": "Fuzzy Sets and Systems,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 1990}, {"title": "Development of an adaptive neuro-fuzzy classifier using linguistic hedges: Part 1", "author": ["B. Cetisli"], "venue": "Expert Systems with Applications,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2010}, {"title": "Nonlinear inertia weight variation for dynamic adaptation in particle swarm optimization", "author": ["A. Chatterjee", "P. Siarry"], "venue": "Computers & Operations Research,", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2006}, {"title": "A context based approach to linguistic hedges", "author": ["M. De Cock", "E.E. Kerre"], "venue": "International Journal of Applied Mathematics and Computer Science,", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 2002}, {"title": "Linguistic hedges and the generalized modus ponens", "author": ["L. Di Lascio", "A. Gisolfi", "U. Cortes Garcia"], "venue": "International Journal of Intelligent Systems,", "citeRegEx": "9", "shortCiteRegEx": "9", "year": 1999}, {"title": "The three semantics of fuzzy sets", "author": ["D. Dubois", "H. Prade"], "venue": "Fuzzy Sets and Systems,", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 1997}, {"title": "Gradualness, uncertainty and bipolarity: Making sense of fuzzy sets", "author": ["Didier Dubois", "Henri Prade"], "venue": "Fuzzy Sets and Systems,", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2012}, {"title": "A qualitative reasoning with nuanced information", "author": ["M. El-Sayed", "D. Pacholczyk"], "venue": "Logics in Artificial Intelligence,", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2002}, {"title": "Sense and reference", "author": ["G. Frege"], "venue": "The Philosophical Review,", "citeRegEx": "13", "shortCiteRegEx": "13", "year": 1948}, {"title": "Conceptual Spaces: The Geometry of Thought", "author": ["P. Gärdenfors"], "venue": null, "citeRegEx": "14", "shortCiteRegEx": "14", "year": 2004}, {"title": "An algebraic approach to linguistic hedges in Zadeh’s fuzzy logic", "author": ["N.C. Ho", "H.V. Nam"], "venue": "Fuzzy Sets and Systems,", "citeRegEx": "15", "shortCiteRegEx": "15", "year": 2002}, {"title": "Hedges: A study in meaning criteria and the logic of fuzzy concepts", "author": ["G. Lakoff"], "venue": "Journal of Philosophical Logic,", "citeRegEx": "16", "shortCiteRegEx": "16", "year": 1973}, {"title": "A framework for linguistic modelling", "author": ["J. Lawry"], "venue": "Artificial Intelligence,", "citeRegEx": "17", "shortCiteRegEx": "17", "year": 2004}, {"title": "Modelling and reasoning with vague concepts, volume", "author": ["J. Lawry"], "venue": null, "citeRegEx": "18", "shortCiteRegEx": "18", "year": 2006}, {"title": "Uncertainty modelling for vague concepts: A prototype theory approach", "author": ["J. Lawry", "Y. Tang"], "venue": "Artificial Intelligence,", "citeRegEx": "19", "shortCiteRegEx": "19", "year": 2009}, {"title": "Design of adaptive fuzzy logic controller based on linguistichedge concepts and genetic algorithms. Systems, Man, and Cybernetics, Part B: Cybernetics", "author": ["B.D. Liu", "C.Y. Chen", "J.Y. Tsao"], "venue": "IEEE Transactions on,", "citeRegEx": "20", "shortCiteRegEx": "20", "year": 2001}, {"title": "Linguistic hedges on trapezoidal fuzzy sets: A revisit", "author": ["J.G. Marin-Blazquez", "Q. Shen"], "venue": "In Fuzzy Systems,", "citeRegEx": "21", "shortCiteRegEx": "21", "year": 2001}, {"title": "Regaining comprehensibility of approximative fuzzy models via the use of linguistic hedges", "author": ["J.G. Marin-Blazquez", "Q. Shen"], "venue": "Studies in Fuzziness and Soft Computing,", "citeRegEx": "22", "shortCiteRegEx": "22", "year": 2003}, {"title": "Gomez-Skarmeta. From approximative to descriptive models", "author": ["J.G. Marin-Blazquez", "Q. Shen", "A.F"], "venue": "In Fuzzy Systems,", "citeRegEx": "23", "shortCiteRegEx": "23", "year": 2000}, {"title": "A horizon shifting model of linguistic hedges for approximate reasoning", "author": ["V. Novák"], "venue": "In Fuzzy Systems,", "citeRegEx": "24", "shortCiteRegEx": "24", "year": 1996}, {"title": "Cognitive representations of semantic categories", "author": ["E. Rosch"], "venue": "Journal of Experimental Psychology: General,", "citeRegEx": "25", "shortCiteRegEx": "25", "year": 1975}, {"title": "A mathematical theory of evidence, volume 1", "author": ["Glenn Shafer"], "venue": null, "citeRegEx": "26", "shortCiteRegEx": "26", "year": 1976}, {"title": "Linguistic modelling and information coarsening based on prototype theory and label semantics", "author": ["Yongchuan Tang", "Jonathan Lawry"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "27", "shortCiteRegEx": "27", "year": 2009}, {"title": "A bipolar model of vague concepts based on random set and prototype theory", "author": ["Yongchuan Tang", "Jonathan Lawry"], "venue": "International Journal of Approximate Reasoning,", "citeRegEx": "28", "shortCiteRegEx": "28", "year": 2012}, {"title": "A fuzzy logic approach to non-scalar hedges", "author": ["S. Waart van Gulik"], "venue": "Towards Mathematical Philosophy,", "citeRegEx": "29", "shortCiteRegEx": "29", "year": 2009}, {"title": "Fuzzy sets", "author": ["L.A. Zadeh"], "venue": "Information and Control,", "citeRegEx": "30", "shortCiteRegEx": "30", "year": 1965}, {"title": "A fuzzy-set-theoretic interpretation of linguistic hedges", "author": ["L.A. Zadeh"], "venue": "Journal of Cybernetics,", "citeRegEx": "31", "shortCiteRegEx": "31", "year": 1972}, {"title": "The concept of a linguistic variable and its application to approximate reasoning - I", "author": ["L.A. Zadeh"], "venue": "Information Sciences,", "citeRegEx": "32", "shortCiteRegEx": "32", "year": 1975}], "referenceMentions": [{"referenceID": 12, "context": "that the meaning of a sentence is a function of the meanings of the words in the sentence, as proposed by [13].", "startOffset": 106, "endOffset": 110}, {"referenceID": 29, "context": "Fuzzy set theory has long been considered a useful framework for the modelling of natural language expressions, as it provides a functional calculus for concept combination [30, 32].", "startOffset": 173, "endOffset": 181}, {"referenceID": 31, "context": "Fuzzy set theory has long been considered a useful framework for the modelling of natural language expressions, as it provides a functional calculus for concept combination [30, 32].", "startOffset": 173, "endOffset": 181}, {"referenceID": 30, "context": "Modelling a hedge as a transformation of a concept allows us to determine membership of an object in the hedged concept as a function of its membership in the base concept, rather than building the hedged concept from scratch [31].", "startOffset": 226, "endOffset": 230}, {"referenceID": 5, "context": "Linguistic hedges have been widely applied, including in fuzzy classifiers [6, 7, 20, 22] and database queries [1, 3].", "startOffset": 75, "endOffset": 89}, {"referenceID": 6, "context": "Linguistic hedges have been widely applied, including in fuzzy classifiers [6, 7, 20, 22] and database queries [1, 3].", "startOffset": 75, "endOffset": 89}, {"referenceID": 19, "context": "Linguistic hedges have been widely applied, including in fuzzy classifiers [6, 7, 20, 22] and database queries [1, 3].", "startOffset": 75, "endOffset": 89}, {"referenceID": 21, "context": "Linguistic hedges have been widely applied, including in fuzzy classifiers [6, 7, 20, 22] and database queries [1, 3].", "startOffset": 75, "endOffset": 89}, {"referenceID": 0, "context": "Linguistic hedges have been widely applied, including in fuzzy classifiers [6, 7, 20, 22] and database queries [1, 3].", "startOffset": 111, "endOffset": 117}, {"referenceID": 2, "context": "Linguistic hedges have been widely applied, including in fuzzy classifiers [6, 7, 20, 22] and database queries [1, 3].", "startOffset": 111, "endOffset": 117}, {"referenceID": 3, "context": "Using linguistic hedges in these applications allows increased accuracy in rules or queries whilst maintaining human interpretability of results [4, 23].", "startOffset": 145, "endOffset": 152}, {"referenceID": 22, "context": "Using linguistic hedges in these applications allows increased accuracy in rules or queries whilst maintaining human interpretability of results [4, 23].", "startOffset": 145, "endOffset": 152}, {"referenceID": 16, "context": "Our account of linguistic hedges uses the label semantics framework to model concepts [17].", "startOffset": 86, "endOffset": 90}, {"referenceID": 18, "context": "We refer to this uncertainty as semantic uncertainty [19] to emphasise that it concerns the definition of concepts and categories, in contrast to stochastic uncertainty which concerns the state of the world.", "startOffset": 53, "endOffset": 57}, {"referenceID": 18, "context": "In [19] the label semantics approach is combined with conceptual spaces [14] and prototype theory [25], to give a formalisation of concepts as based on a prototype and a threshold, located in a conceptual space.", "startOffset": 3, "endOffset": 7}, {"referenceID": 13, "context": "In [19] the label semantics approach is combined with conceptual spaces [14] and prototype theory [25], to give a formalisation of concepts as based on a prototype and a threshold, located in a conceptual space.", "startOffset": 72, "endOffset": 76}, {"referenceID": 24, "context": "In [19] the label semantics approach is combined with conceptual spaces [14] and prototype theory [25], to give a formalisation of concepts as based on a prototype and a threshold, located in a conceptual space.", "startOffset": 98, "endOffset": 102}, {"referenceID": 24, "context": "There is some evidence that humans use natural categories in this way, as shown in experiments reported in [25].", "startOffset": 107, "endOffset": 111}, {"referenceID": 29, "context": "Fuzzy set theory [30] was proposed as a calculus for combining and modifying concepts with graded membership, and extended these ideas in [32] to linguistic variables as variables taking words as values, rather than numbers.", "startOffset": 17, "endOffset": 21}, {"referenceID": 31, "context": "Fuzzy set theory [30] was proposed as a calculus for combining and modifying concepts with graded membership, and extended these ideas in [32] to linguistic variables as variables taking words as values, rather than numbers.", "startOffset": 138, "endOffset": 142}, {"referenceID": 0, "context": "Then each value L of the variable is associated with a fuzzy subset of Ω, and a function μL : Ω → [0, 1] associates with each x ∈ Ω the value of its membership in L.", "startOffset": 98, "endOffset": 104}, {"referenceID": 9, "context": "Prototype theory gives a semantic basis to fuzzy sets through the notion of similarity to a prototype, as described in [10].", "startOffset": 119, "endOffset": 123}, {"referenceID": 9, "context": "An alternative interpretation for fuzzy sets is random set theory, see [10] for an exposition.", "startOffset": 71, "endOffset": 75}, {"referenceID": 18, "context": "This second approach is the stance taken by [19], and which we now adopt in this paper.", "startOffset": 44, "endOffset": 48}, {"referenceID": 13, "context": "2 Conceptual Spaces Conceptual spaces are proposed by Gärdenfors in [14] as a framework for representing information at the conceptual level.", "startOffset": 68, "endOffset": 72}, {"referenceID": 16, "context": "3 Label Semantics The label semantics framework was proposed by [17] and related to prototype theory and conceptual spaces in [19].", "startOffset": 64, "endOffset": 68}, {"referenceID": 18, "context": "3 Label Semantics The label semantics framework was proposed by [17] and related to prototype theory and conceptual spaces in [19].", "startOffset": 126, "endOffset": 130}, {"referenceID": 10, "context": ", a set where all elements are jointly prototypes, as opposed to an epistemic set describing a precise but unknown prototype, as described in [11].", "startOffset": 142, "endOffset": 146}, {"referenceID": 17, "context": "If we viewN εi Li as a random set from R into 2, then μLi(x) is the single point coverage function of N εi Li , as defined in [18], and also commonly called a contour function [26].", "startOffset": 126, "endOffset": 130}, {"referenceID": 25, "context": "If we viewN εi Li as a random set from R into 2, then μLi(x) is the single point coverage function of N εi Li , as defined in [18], and also commonly called a contour function [26].", "startOffset": 176, "endOffset": 180}, {"referenceID": 18, "context": "Two simple models for the relationships between the thresholds are given in [19].", "startOffset": 76, "endOffset": 80}, {"referenceID": 30, "context": "In [31] the idea of linguistic hedges as operators modifying fuzzy sets was introduced, so that the membership function μhL(x) of a hedged concept, hL, is a function of the membership of the base concept L, i.", "startOffset": 3, "endOffset": 7}, {"referenceID": 31, "context": "Furthermore, truth can be considered as a linguistic variable and hence a fuzzy set [32], so that the application of a hedge can be seen as modifying the truth value of a sentence using that concept [12, 15, 32].", "startOffset": 84, "endOffset": 88}, {"referenceID": 11, "context": "Furthermore, truth can be considered as a linguistic variable and hence a fuzzy set [32], so that the application of a hedge can be seen as modifying the truth value of a sentence using that concept [12, 15, 32].", "startOffset": 199, "endOffset": 211}, {"referenceID": 14, "context": "Furthermore, truth can be considered as a linguistic variable and hence a fuzzy set [32], so that the application of a hedge can be seen as modifying the truth value of a sentence using that concept [12, 15, 32].", "startOffset": 199, "endOffset": 211}, {"referenceID": 31, "context": "Furthermore, truth can be considered as a linguistic variable and hence a fuzzy set [32], so that the application of a hedge can be seen as modifying the truth value of a sentence using that concept [12, 15, 32].", "startOffset": 199, "endOffset": 211}, {"referenceID": 31, "context": "This second view is useful in approximate reasoning, and allows for an algebraic approach to investigating the properties of linguistic hedges, as introduced in [32], and expanded upon in [5, 12, 15].", "startOffset": 161, "endOffset": 165}, {"referenceID": 4, "context": "This second view is useful in approximate reasoning, and allows for an algebraic approach to investigating the properties of linguistic hedges, as introduced in [32], and expanded upon in [5, 12, 15].", "startOffset": 188, "endOffset": 199}, {"referenceID": 11, "context": "This second view is useful in approximate reasoning, and allows for an algebraic approach to investigating the properties of linguistic hedges, as introduced in [32], and expanded upon in [5, 12, 15].", "startOffset": 188, "endOffset": 199}, {"referenceID": 14, "context": "This second view is useful in approximate reasoning, and allows for an algebraic approach to investigating the properties of linguistic hedges, as introduced in [32], and expanded upon in [5, 12, 15].", "startOffset": 188, "endOffset": 199}, {"referenceID": 1, "context": "The approach we take, however, is to view a hedge as modifying the fuzzy set associated with a concept directly, as taken by [2, 4, 9, 24].", "startOffset": 125, "endOffset": 138}, {"referenceID": 3, "context": "The approach we take, however, is to view a hedge as modifying the fuzzy set associated with a concept directly, as taken by [2, 4, 9, 24].", "startOffset": 125, "endOffset": 138}, {"referenceID": 8, "context": "The approach we take, however, is to view a hedge as modifying the fuzzy set associated with a concept directly, as taken by [2, 4, 9, 24].", "startOffset": 125, "endOffset": 138}, {"referenceID": 23, "context": "The approach we take, however, is to view a hedge as modifying the fuzzy set associated with a concept directly, as taken by [2, 4, 9, 24].", "startOffset": 125, "endOffset": 138}, {"referenceID": 26, "context": "This is in contrast to the work presented in [27] in which information coarsening is effected by taking disjunctions of labels.", "startOffset": 45, "endOffset": 49}, {"referenceID": 27, "context": "The idea of a hedged concept has some similarities to that of the bipolar model of concepts described in [28], since if it is appropriate to describe someone as ‘very tall’, it must be appropriate to describe them as ‘tall’, and similarly describing someone as ‘quite tall’ implies that it is not entirely inappropriate to describe them as ‘tall’.", "startOffset": 105, "endOffset": 109}, {"referenceID": 30, "context": "Examples are ‘very’, ‘more or less’, ‘quite’, or ‘extremely’ [31].", "startOffset": 61, "endOffset": 65}, {"referenceID": 30, "context": "In [31] concepts are considered as made up of various different components, with the membership function a weighted sum of the memberships of the individual components.", "startOffset": 3, "endOffset": 7}, {"referenceID": 15, "context": "Type 2 hedges are further explored in [16, 29], where components of a concept are categorised as definitional, primary or secondary, and the hedges ‘technically’, ‘strictly speaking’ and ‘loosely speaking’ are analysed in terms of these categories.", "startOffset": 38, "endOffset": 46}, {"referenceID": 28, "context": "Type 2 hedges are further explored in [16, 29], where components of a concept are categorised as definitional, primary or secondary, and the hedges ‘technically’, ‘strictly speaking’ and ‘loosely speaking’ are analysed in terms of these categories.", "startOffset": 38, "endOffset": 46}, {"referenceID": 30, "context": "Zadeh introduces both types of modifier in his discussion of type 1 hedges [31], however his powering modifiers are most frequently cited.", "startOffset": 75, "endOffset": 79}, {"referenceID": 2, "context": "1 The operators CON and DIL leave the core, {x ∈ Ω : μL(x) = 1}, and support {x ∈ Ω : μL(x) 6= 0}, of the fuzzy sets unchanged, which is often argued to be undesirable [3, 2, 24, 21].", "startOffset": 168, "endOffset": 182}, {"referenceID": 1, "context": "1 The operators CON and DIL leave the core, {x ∈ Ω : μL(x) = 1}, and support {x ∈ Ω : μL(x) 6= 0}, of the fuzzy sets unchanged, which is often argued to be undesirable [3, 2, 24, 21].", "startOffset": 168, "endOffset": 182}, {"referenceID": 23, "context": "1 The operators CON and DIL leave the core, {x ∈ Ω : μL(x) = 1}, and support {x ∈ Ω : μL(x) 6= 0}, of the fuzzy sets unchanged, which is often argued to be undesirable [3, 2, 24, 21].", "startOffset": 168, "endOffset": 182}, {"referenceID": 20, "context": "1 The operators CON and DIL leave the core, {x ∈ Ω : μL(x) = 1}, and support {x ∈ Ω : μL(x) 6= 0}, of the fuzzy sets unchanged, which is often argued to be undesirable [3, 2, 24, 21].", "startOffset": 168, "endOffset": 182}, {"referenceID": 2, "context": "In particular, [3] argue that in a fuzzy database, if a concentrating hedge is being used to refine a query that is returning too many objects, the hedge needs to reduce the number of objects returned, and hence narrow down the core.", "startOffset": 15, "endOffset": 18}, {"referenceID": 21, "context": "Furthermore, [22] find that classifiers using the CON and DIL operators (classical hedges) do not perform as well as those with hedges that modify the core and support of the fuzzy sets.", "startOffset": 13, "endOffset": 17}, {"referenceID": 5, "context": "The use of classical hedges does improve performance over non-hedged fuzzy rules in expert systems [6, 7, 20], so the argument against classical hedges is a matter of degree.", "startOffset": 99, "endOffset": 109}, {"referenceID": 6, "context": "The use of classical hedges does improve performance over non-hedged fuzzy rules in expert systems [6, 7, 20], so the argument against classical hedges is a matter of degree.", "startOffset": 99, "endOffset": 109}, {"referenceID": 19, "context": "The use of classical hedges does improve performance over non-hedged fuzzy rules in expert systems [6, 7, 20], so the argument against classical hedges is a matter of degree.", "startOffset": 99, "endOffset": 109}, {"referenceID": 1, "context": "No justification is given for these modifiers other than that they have what seem to be intuitively the right properties [2, 8, 24].", "startOffset": 121, "endOffset": 131}, {"referenceID": 7, "context": "No justification is given for these modifiers other than that they have what seem to be intuitively the right properties [2, 8, 24].", "startOffset": 121, "endOffset": 131}, {"referenceID": 23, "context": "No justification is given for these modifiers other than that they have what seem to be intuitively the right properties [2, 8, 24].", "startOffset": 121, "endOffset": 131}, {"referenceID": 1, "context": "[2, 8] both ground modifiers using a resemblance relation which takes into account how objects in the universe are similar to each other.", "startOffset": 0, "endOffset": 6}, {"referenceID": 7, "context": "[2, 8] both ground modifiers using a resemblance relation which takes into account how objects in the universe are similar to each other.", "startOffset": 0, "endOffset": 6}, {"referenceID": 23, "context": "[24] takes a horizon shifting approach.", "startOffset": 0, "endOffset": 4}, {"referenceID": 23, "context": "In [24] the class of finite numbers is used as an example of the horizon shifting approach.", "startOffset": 3, "endOffset": 7}, {"referenceID": 23, "context": "μvery small(x) = { 1 if x ∈ [0, σc] 1− (x, σ)(x− σc) if x ≥ σc In [24], examples of different kinds of membership functions that might be used to implement this idea are given.", "startOffset": 66, "endOffset": 70}, {"referenceID": 1, "context": "μvery small(x) =  1 if x ∈ [0, σc] 1− x−σc σ(a−c) if x ∈ [σc, σa] 0 otherwise [2, 8] both ground their approaches in the idea of looking at the elements near a fuzzy set in order to contract or dilate the set.", "startOffset": 82, "endOffset": 88}, {"referenceID": 7, "context": "μvery small(x) =  1 if x ∈ [0, σc] 1− x−σc σ(a−c) if x ∈ [σc, σa] 0 otherwise [2, 8] both ground their approaches in the idea of looking at the elements near a fuzzy set in order to contract or dilate the set.", "startOffset": 82, "endOffset": 88}, {"referenceID": 1, "context": "The two approaches are similar, so we restrict ourselves to that of [2].", "startOffset": 68, "endOffset": 71}, {"referenceID": 1, "context": "As described in [2], E is modelled by (u, v)→ E(u, v) = Z(u− v), where Z is a fuzzy interval centred on 0 with finite support.", "startOffset": 16, "endOffset": 19}, {"referenceID": 1, "context": "Figure 2: Illustration of the expansion and contraction modifiers proposed in [2].", "startOffset": 78, "endOffset": 81}, {"referenceID": 1, "context": "Dilating the set as described in [2] gives the set E(F ) = (1, 3.", "startOffset": 33, "endOffset": 36}, {"referenceID": 1, "context": "Following [2, 8, 24], we will propose linguistic modifiers that are semantically grounded rather than attempting to show their utility in classifiers, reasoning or to examine the algebra of modifiers.", "startOffset": 10, "endOffset": 20}, {"referenceID": 7, "context": "Following [2, 8, 24], we will propose linguistic modifiers that are semantically grounded rather than attempting to show their utility in classifiers, reasoning or to examine the algebra of modifiers.", "startOffset": 10, "endOffset": 20}, {"referenceID": 23, "context": "Following [2, 8, 24], we will propose linguistic modifiers that are semantically grounded rather than attempting to show their utility in classifiers, reasoning or to examine the algebra of modifiers.", "startOffset": 10, "endOffset": 20}, {"referenceID": 1, "context": "We go on to show similarities between our model and those of [2, 8, 24].", "startOffset": 61, "endOffset": 71}, {"referenceID": 7, "context": "We go on to show similarities between our model and those of [2, 8, 24].", "startOffset": 61, "endOffset": 71}, {"referenceID": 23, "context": "We go on to show similarities between our model and those of [2, 8, 24].", "startOffset": 61, "endOffset": 71}, {"referenceID": 2, "context": "Suppose our conceptual space Ω = R with Euclidean distance and that a label L has prototype P = 5, and threshold ε ∼ Uniform[0, 3].", "startOffset": 124, "endOffset": 130}, {"referenceID": 1, "context": "μL(x) = { 1− |x−5| 3 if x ∈ [2, 8] 0 otherwise We can then form a new label qL with prototype Pq = P = 5 and threshold εq ≥ ε.", "startOffset": 28, "endOffset": 34}, {"referenceID": 7, "context": "μL(x) = { 1− |x−5| 3 if x ∈ [2, 8] 0 otherwise We can then form a new label qL with prototype Pq = P = 5 and threshold εq ≥ ε.", "startOffset": 28, "endOffset": 34}, {"referenceID": 23, "context": "μthin(x2) =  1 ifx2 < 24 1− (x2−Pthin) 4 ifx2 ∈ [24, 28] 0 otherwise where x2 measures waist size.", "startOffset": 52, "endOffset": 60}, {"referenceID": 27, "context": "μthin(x2) =  1 ifx2 < 24 1− (x2−Pthin) 4 ifx2 ∈ [24, 28] 0 otherwise where x2 measures waist size.", "startOffset": 52, "endOffset": 60}, {"referenceID": 1, "context": "2 Hedges with differing prototypes As they stand, the hedges proposed leave the core and support of the fuzzy sets unchanged, which is often argued to be undesirable [2, 3, 24, 21].", "startOffset": 166, "endOffset": 180}, {"referenceID": 2, "context": "2 Hedges with differing prototypes As they stand, the hedges proposed leave the core and support of the fuzzy sets unchanged, which is often argued to be undesirable [2, 3, 24, 21].", "startOffset": 166, "endOffset": 180}, {"referenceID": 23, "context": "2 Hedges with differing prototypes As they stand, the hedges proposed leave the core and support of the fuzzy sets unchanged, which is often argued to be undesirable [2, 3, 24, 21].", "startOffset": 166, "endOffset": 180}, {"referenceID": 20, "context": "2 Hedges with differing prototypes As they stand, the hedges proposed leave the core and support of the fuzzy sets unchanged, which is often argued to be undesirable [2, 3, 24, 21].", "startOffset": 166, "endOffset": 180}, {"referenceID": 2, "context": "5], and threshold ε ∼ Uniform[0, 3].", "startOffset": 29, "endOffset": 35}, {"referenceID": 3, "context": "5] 0 otherwise We form the concept qL by setting the prototype to be Pq = [4, 6], and εq ≥ ε.", "startOffset": 74, "endOffset": 80}, {"referenceID": 5, "context": "5] 0 otherwise We form the concept qL by setting the prototype to be Pq = [4, 6], and εq ≥ ε.", "startOffset": 74, "endOffset": 80}, {"referenceID": 3, "context": "Conversely, suppose that a label L has prototype P = [4, 6] and threshold ε ∼ Uniform[0, 3].", "startOffset": 53, "endOffset": 59}, {"referenceID": 5, "context": "Conversely, suppose that a label L has prototype P = [4, 6] and threshold ε ∼ Uniform[0, 3].", "startOffset": 53, "endOffset": 59}, {"referenceID": 2, "context": "Conversely, suppose that a label L has prototype P = [4, 6] and threshold ε ∼ Uniform[0, 3].", "startOffset": 85, "endOffset": 91}, {"referenceID": 3, "context": "μL(x) =  1 if x ∈ [4, 6] 1− |x−5| 3 if x ∈ [1, 4] or x ∈ [6, 9] 0 otherwise We now form the concept vL by contracting the prototype to Pv = [4.", "startOffset": 22, "endOffset": 28}, {"referenceID": 5, "context": "μL(x) =  1 if x ∈ [4, 6] 1− |x−5| 3 if x ∈ [1, 4] or x ∈ [6, 9] 0 otherwise We now form the concept vL by contracting the prototype to Pv = [4.", "startOffset": 22, "endOffset": 28}, {"referenceID": 0, "context": "μL(x) =  1 if x ∈ [4, 6] 1− |x−5| 3 if x ∈ [1, 4] or x ∈ [6, 9] 0 otherwise We now form the concept vL by contracting the prototype to Pv = [4.", "startOffset": 47, "endOffset": 53}, {"referenceID": 3, "context": "μL(x) =  1 if x ∈ [4, 6] 1− |x−5| 3 if x ∈ [1, 4] or x ∈ [6, 9] 0 otherwise We now form the concept vL by contracting the prototype to Pv = [4.", "startOffset": 47, "endOffset": 53}, {"referenceID": 5, "context": "μL(x) =  1 if x ∈ [4, 6] 1− |x−5| 3 if x ∈ [1, 4] or x ∈ [6, 9] 0 otherwise We now form the concept vL by contracting the prototype to Pv = [4.", "startOffset": 61, "endOffset": 67}, {"referenceID": 8, "context": "μL(x) =  1 if x ∈ [4, 6] 1− |x−5| 3 if x ∈ [1, 4] or x ∈ [6, 9] 0 otherwise We now form the concept vL by contracting the prototype to Pv = [4.", "startOffset": 61, "endOffset": 67}, {"referenceID": 2, "context": "Suppose Ω = R, d is Euclidean distance and that L1 has prototype P = 5 and ε ∼ Uniform[0, 3].", "startOffset": 86, "endOffset": 92}, {"referenceID": 1, "context": "μL(x) = { 1− |x−5| 3 if x ∈ [2, 8] 0 otherwise", "startOffset": 28, "endOffset": 34}, {"referenceID": 7, "context": "μL(x) = { 1− |x−5| 3 if x ∈ [2, 8] 0 otherwise", "startOffset": 28, "endOffset": 34}, {"referenceID": 0, "context": "Suppose that the conceptual space Ω = R and that a label L has prototype P = 5 and threshold ε ∼ Uniform[1, 2].", "startOffset": 104, "endOffset": 110}, {"referenceID": 1, "context": "Suppose that the conceptual space Ω = R and that a label L has prototype P = 5 and threshold ε ∼ Uniform[1, 2].", "startOffset": 104, "endOffset": 110}, {"referenceID": 0, "context": "μL(x) =  1 if |x− 5| < 1 2− |x− 5| if |x− 5| ∈ [1, 2] 0 otherwise Forming a new label qL by applying the hedge εq = 2ε gives appropriateness measure", "startOffset": 51, "endOffset": 57}, {"referenceID": 1, "context": "μL(x) =  1 if |x− 5| < 1 2− |x− 5| if |x− 5| ∈ [1, 2] 0 otherwise Forming a new label qL by applying the hedge εq = 2ε gives appropriateness measure", "startOffset": 51, "endOffset": 57}, {"referenceID": 1, "context": "μqL(x) =  1 if |x− 5| < 2 4−|x−5| 2 if |x− 5| ∈ [2, 4] 0 otherwise Forming a new label vL by applying the hedge εv = 0.", "startOffset": 52, "endOffset": 58}, {"referenceID": 3, "context": "μqL(x) =  1 if |x− 5| < 2 4−|x−5| 2 if |x− 5| ∈ [2, 4] 0 otherwise Forming a new label vL by applying the hedge εv = 0.", "startOffset": 52, "endOffset": 58}, {"referenceID": 23, "context": "Notice that if we set Ω = R and label L specified by P = 0, ε ∼ Uniform[c, a], this is identical to the linear membership model given in [24].", "startOffset": 137, "endOffset": 141}, {"referenceID": 23, "context": "μhL(x) =  1 if x < kc ka−x ka−kc if x ∈ [kc, ka] 0 otherwise Comparing this with the model given in section 3, we see that this is precisely the model proposed by [24] in the linear case.", "startOffset": 167, "endOffset": 171}, {"referenceID": 1, "context": "Similarity between the hedging effects illustrated in figure 9 and the effects implemented in the model proposed in [2], illustrated in figure 2, can clearly be seen.", "startOffset": 116, "endOffset": 119}, {"referenceID": 1, "context": "To derive the model given in [2], we describe the fuzzy sets associated with labels L and hL in trapezoidal notation.", "startOffset": 29, "endOffset": 32}, {"referenceID": 1, "context": "We can render this transformation in the terms employed by [2].", "startOffset": 59, "endOffset": 62}, {"referenceID": 1, "context": "vL = EZ(L)(s) = infr∈ΩI(μL(s), E (s, r)) When T is the T -norm min, I is the Gödel implication and Z = (−z−α,−z, z, z+α) (with the restriction that c < z to ensure a well-defined set), the approach in [2] gives qL = (P −a−z−α, P −c−z, P +c+z, P + a+z+α).", "startOffset": 201, "endOffset": 204}, {"referenceID": 1, "context": "The approach in [2] gives vL = (P−a+z+α, P−c+z, P+c−z, P+a−z−α), and we therefore need to set z = (1−k)c and α = (1−k)(a−c) This formulation is not as general as given in [2], however, note that it only uses one additional parameter and no additional operators, rather than the two parameters and either a T -norm or implication used by [2].", "startOffset": 16, "endOffset": 19}, {"referenceID": 1, "context": "The approach in [2] gives vL = (P−a+z+α, P−c+z, P+c−z, P+a−z−α), and we therefore need to set z = (1−k)c and α = (1−k)(a−c) This formulation is not as general as given in [2], however, note that it only uses one additional parameter and no additional operators, rather than the two parameters and either a T -norm or implication used by [2].", "startOffset": 171, "endOffset": 174}, {"referenceID": 1, "context": "The approach in [2] gives vL = (P−a+z+α, P−c+z, P+c−z, P+a−z−α), and we therefore need to set z = (1−k)c and α = (1−k)(a−c) This formulation is not as general as given in [2], however, note that it only uses one additional parameter and no additional operators, rather than the two parameters and either a T -norm or implication used by [2].", "startOffset": 337, "endOffset": 340}, {"referenceID": 30, "context": "Two more key models from the literature are the powering and shifting modifiers proposed in [31].", "startOffset": 92, "endOffset": 96}, {"referenceID": 1, "context": "5 Compositionality One of the features of hedges seen in [2, 8, 24, 31] is that they can be applied multiple times.", "startOffset": 57, "endOffset": 71}, {"referenceID": 7, "context": "5 Compositionality One of the features of hedges seen in [2, 8, 24, 31] is that they can be applied multiple times.", "startOffset": 57, "endOffset": 71}, {"referenceID": 23, "context": "5 Compositionality One of the features of hedges seen in [2, 8, 24, 31] is that they can be applied multiple times.", "startOffset": 57, "endOffset": 71}, {"referenceID": 30, "context": "5 Compositionality One of the features of hedges seen in [2, 8, 24, 31] is that they can be applied multiple times.", "startOffset": 57, "endOffset": 71}, {"referenceID": 2, "context": "L has prototype P = 5, and threshold ε ∼ Uniform[0, 3].", "startOffset": 48, "endOffset": 54}, {"referenceID": 2, "context": "In [3, 22], it is argued that this property is undesirable for hedges used in fuzzy expert systems, since if a query is returning too large a set of answers, this type of contraction hedge does not reduce this overabundance.", "startOffset": 3, "endOffset": 10}, {"referenceID": 21, "context": "In [3, 22], it is argued that this property is undesirable for hedges used in fuzzy expert systems, since if a query is returning too large a set of answers, this type of contraction hedge does not reduce this overabundance.", "startOffset": 3, "endOffset": 10}, {"referenceID": 1, "context": "[2, 8] also propose modifiers that are semantically grounded, using the idea of resemblance to nearby objects.", "startOffset": 0, "endOffset": 6}, {"referenceID": 7, "context": "[2, 8] also propose modifiers that are semantically grounded, using the idea of resemblance to nearby objects.", "startOffset": 0, "endOffset": 6}, {"referenceID": 2, "context": "Their formulations have the properties that the core and support of the fuzzy set are both changed, thereby addressing the issue of overabundant answers [3, 22].", "startOffset": 153, "endOffset": 160}, {"referenceID": 21, "context": "Their formulations have the properties that the core and support of the fuzzy set are both changed, thereby addressing the issue of overabundant answers [3, 22].", "startOffset": 153, "endOffset": 160}, {"referenceID": 23, "context": "With the condition ε2 = f(ε1), we are able to recreate the result given in [24] for linear membership functions, and show how the model proposed by [2] has strong similarities to our own.", "startOffset": 75, "endOffset": 79}, {"referenceID": 1, "context": "With the condition ε2 = f(ε1), we are able to recreate the result given in [24] for linear membership functions, and show how the model proposed by [2] has strong similarities to our own.", "startOffset": 148, "endOffset": 151}, {"referenceID": 23, "context": "However, the further parameters introduced are no more than those introduced by [24], and arguably fewer than those introduced by [2], who require that a resemblance relation be specified, using two additional parameters, and also, that a T -norm or fuzzy implication need to be specified.", "startOffset": 80, "endOffset": 84}, {"referenceID": 1, "context": "However, the further parameters introduced are no more than those introduced by [24], and arguably fewer than those introduced by [2], who require that a resemblance relation be specified, using two additional parameters, and also, that a T -norm or fuzzy implication need to be specified.", "startOffset": 130, "endOffset": 133}, {"referenceID": 1, "context": "This is similar to the limit of applying the powering modifiers, but differs from what would happen with the modifiers proposed by [2].", "startOffset": 131, "endOffset": 134}, {"referenceID": 1, "context": "We have also shown that two other formulations [2, 8, 24], can be derived from this framework with equal or fewer parameters.", "startOffset": 47, "endOffset": 57}, {"referenceID": 7, "context": "We have also shown that two other formulations [2, 8, 24], can be derived from this framework with equal or fewer parameters.", "startOffset": 47, "endOffset": 57}, {"referenceID": 23, "context": "We have also shown that two other formulations [2, 8, 24], can be derived from this framework with equal or fewer parameters.", "startOffset": 47, "endOffset": 57}, {"referenceID": 2, "context": "[3, 22], and also to examine a trade-off between accuracy and the number of parameters used.", "startOffset": 0, "endOffset": 7}, {"referenceID": 21, "context": "[3, 22], and also to examine a trade-off between accuracy and the number of parameters used.", "startOffset": 0, "endOffset": 7}], "year": 2016, "abstractText": "We introduce a model for the linguistic hedges ‘very’ and ‘quite’ within the label semantics framework, and combined with the prototype and conceptual spaces theories of concepts. The proposed model emerges naturally from the representational framework we use and as such, has a clear semantic grounding. We give generalisations of these hedge models and show that they can be composed with themselves and with other functions, going on to examine their behaviour in the limit of composition.", "creator": "LaTeX with hyperref package"}}}