{"id": "1603.01855", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Mar-2016", "title": "Online Learning to Rank with Feedback at the Top", "abstract": "We rather an advertisers cognitive if uniform setting once both, , another round, referring oblivious brute staggering a list of $ m $ collecting, pertaining then it scripting, and the student-centered produces scores given equal the disclosing. The unyielding, revenue set relevance exponential in well jdbc deadline its ranker according to several motivation received. We regard the their entire soon feedback is largely to any this relevance normally of only been top $ k $ information in still ranked currently instead $ | \\ douanes 110 $. However, another improved though learner is convincingly marketing a although unrevealed need diversity vectors, for be considering mind to rank loss formula_11. We develop efficient iterations for that regarded losses today, pointwise, pairwise and listwise ages. We are unlikely likely no customers simplest may unlike sublinear apologies, with top - 2003 feedback, own those loss that another reproducible with equal to NDCG. We apply rest methodologies moving dealers rdf demonstrating provide online learning of of eighth formula_6 some unlike exception feedback.", "histories": [["v1", "Sun, 6 Mar 2016 18:43:54 GMT  (217kb,D)", "http://arxiv.org/abs/1603.01855v1", "Appearing in AISTATS 2016"]], "COMMENTS": "Appearing in AISTATS 2016", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["sougata chaudhuri", "ambuj tewari"], "accepted": false, "id": "1603.01855"}, "pdf": {"name": "1603.01855.pdf", "metadata": {"source": "CRF", "title": "Online Learning to Rank with Feedback at the Top", "authors": ["Sougata Chaudhuri", "Ambuj Tewari"], "emails": [], "sections": [{"heading": null, "text": "We consider an online learning to rank setting in which, at each round, an oblivious adversary generates a list of m documents, pertaining to a query, and the learner produces scores to rank the documents. The adversary then generates a relevance vector and the learner updates its ranker according to the feedback received. We consider the setting where the feedback is restricted to be the relevance levels of only the top k documents in the ranked list for k m. However, the performance of learner is judged based on the unrevealed full relevance vectors, using an appropriate learning to rank loss function. We develop efficient algorithms for well known losses in the pointwise, pairwise and listwise families. We also prove that no online algorithm can have sublinear regret, with top-1 feedback, for any loss that is calibrated with respect to NDCG. We apply our algorithms on benchmark datasets demonstrating efficient online learning of a ranking function from highly restricted feedback."}, {"heading": "1 Introduction", "text": "In learning to rank for information retrieval, the objective is to rank lists of documents, pertaining to different queries, so that the documents that are more relevant to a query are ranked above those that are less relevant. Most learning to rank methods are based on supervised batch learning, i.e., rankers are trained on batch data consisting of instances and labels [Liu, 2011]. The instances are lists of documents, pertaining to different queries, and labels are in the form of relevance vectors. The accuracy of a ranked list,\nAppearing in Proceedings of the 19th International Conference on Artificial Intelligence and Statistics (AISTATS) 2016, Cadiz, Spain. JMLR: W&CP volume 41. Copyright 2016 by the authors.\nin comparison to the actual relevance of the documents, is measured by various ranking measures, such as NDCG, AP and ERR.\nCollecting reliable training data can be expensive and time consuming. In certain applications, such as deploying a new web app or developing a custom search engine, collecting large amount of training data might not be possible at all [Sanderson, 2010]. Moreover, a ranker trained from batch data might not be able to satisfy changing user needs and preferences. Recent research has focused on online learning of ranking systems, where a ranker is updated on the fly. One direction of work deploys models which learn from implicit feedback inferred from user clicks on ranked lists [Hofmann et al., 2013, Yue and Joachims, 2009]. However, there are some potential drawbacks in learning from user clicks. It is possible that the displayed items might not be clickable, such as in certain mobile apps. Moreover, a clicked item might not actually be relevant to the user and there is also the problem of bias towards top ranked items in inferring feedback from user clicks [Joachims, 2002]. Another direction of work deploys models which learn optimal ranking of a fixed list of items, for diverse user preferences [Radlinski et al., 2008, Chaudhuri and Tewari, 2015]. Specifically, the latter work assumes that a user generates a full relevance vector for the entire ranked list of items but gives feedback only on the top ranked item. Motivation for this feedback model comes from considerations of user burden constraints (users will feel burdensome to provide careful feedback on all items) and privacy concerns (users will be unwilling to provide feedback on all items if they are about sensitive issues such as medical conditions). However, the requirement of having a fixed set of items to rank severely limits the practical applicability of this line of work.\nOur work extends the work of Chaudhuri and Tewari [2015], by combining query-level ranking, in an online manner, with explicit but restricted feedback. We formalize the problem as an online game played over T rounds, between a learner and an oblivious adversary. At each round, the adversary generates a document list of length m, pertaining to a query. The learner\nar X\niv :1\n60 3.\n01 85\n5v 1\n[ cs\n.L G\n] 6\nM ar\n2 01\n6\nsees the list and produces a real valued score vector to rank the documents. We assume that the ranking is generated by sorting the score vector in descending order of its entries. The adversary then generates a relevance vector but the learner gets to see the relevance of only the top-k items of the ranked list, where k m is a small constant, like 1 or 2. The learner’s loss in each round, based on the learner’s score vector and the full relevance vector, is measured by some continuous learning to rank loss function. We focus on continuous surrogates losses, e.g., the cross entropy surrogate in ListNet [Cao et al., 2007] and hinge surrogate in RankSVM [Joachims, 2002], instead of discontinuous ranking measures like NDCG, AP, or ERR because the latter lead to intractable optimization problems. We note that the top-k feedback model is distinct from the full and bandit feedback models since neither the full relevance vector nor the loss at end of each round is revealed to the learner. Technically, the problem is an instance of partial monitoring [Cesa-Bianchi et al., 2006, Bartok et al., 2014], extended to a setting with side information (documents list) and an infinite set of learner’s moves (all real valued score vectors). For such an extension of partial monitoring there exists no generic theoretical or algorithmic framework to the best of our knowledge.\nWe make two main contributions in this paper. First, we propose a general, efficient algorithm for online learning to rank with top-k feedback and show that it works in conjunction with a number of ranking surrogates. We characterize the minimum feedback required, i.e., the value of k, for the algorithm to work with a particular surrogate by formally relating the feedback mechanism with the structure of the surrogates. We then apply our general techniques to three convex ranking surrogates and one non-convex surrogate. The convex surrogates considered are from three major learning to ranking methods: squared loss from a pointwise method [Cossock and Zhang, 2008], hinge loss used in the pairwise RankSVM [Joachims, 2002] method, and (modified) cross-entropy surrogate used in the listwise ListNet [Cao et al., 2007] method. The non-convex surrogate considered is the SmoothDCG surrogate [Chapelle and Wu, 2010]. For the three convex surrogates, we establish an O(T 2/3) regret bound.\nThe convex surrogates we mentioned above are widely used but are known to fail to be calibrated with respect to NDCG [Ravikumar et al., 2011]. Our second contribution is to show that for the entire class of NDCG calibrated surrogates, no online algorithm can have sublinear (in T ) regret with top-1 feedback, i.e., the minimax regret of an online game for any NDCG calibrated surrogate is Ω(T ). The proof for this rather surprising result is non-trivial and relies on exploiting a\nconnection between the construction of optimal adversary strategies for hopeless finite action partial monitoring games [Piccolboni and Schindelhauer, 2001] and the structure of NDCG calibrated surrogates. We only focus on NDCG calibrated surrogates for the impossibility results since no (convex) surrogate can be calibrated for AP and ERR [Calauzenes et al., 2012]. This impossibility result is not only the first of its kind in online ranking with top-1 feedback but it also the first such result for a natural partial monitoring problem with side information when the learner’s action space is infinite. Note, however, that there does exist work on partial monitoring problems with continuous learner actions, but without side information [Kleinberg and Leighton, 2003, Cesa-Bianchi et al., 2006], and vice versa [Bartók and Szepesvári, 2012, Gentile and Orabona, 2014].\nWe apply our algorithms on benchmark ranking datasets, demonstrating the ability to efficiently learn a ranking function in an online fashion, from highly restricted feedback."}, {"heading": "2 Preliminaries", "text": "In learning to rank, an instance is a matrix X ∈ Rm×d, consisting of a list of m documents, each represented as a feature vector in Rd, with each list pertaining to a single query. The supervision is in form of a relevance vector R = {0, 1, . . . , n}m, representing relevance of each document to the query. If n = 1, the relevance vector is binary graded. For n > 1, relevance vector is multi-graded. Xi: denotes ith row of X and Ri denotes ith component of R. The subscript t is exclusively used to denote time t. Thus, Rt denotes relevance vector generated at time t and Rt,i denotes ith component of Rt. We assume feature vectors representing documents are bounded by RD in `2 norm.\nDocuments are ranked by a ranking function. The prevalent technique is to represent a ranking function as a scoring function and get ranking by sorting scores in descending order. A linear scoring function produces score vector as fw(X) = Xw = s\nw ∈ Rm, with w ∈ Rd. Here, swi represents score of ith document (sw points to score s being generated by using parameter w). We assume that ranking parameter space is bounded in `2 norm, i.e, ‖w‖2 ≤ U , ∀ w. πs = argsort(s) is the permutation induced by sorting score vector s in descending order. A permutation π gives a mapping from ranks to documents and π−1 gives a mapping from documents to ranks. Thus, π(i) = j means document j is placed at position i in π while π−1(i) = j means document i is placed at position j. Sm denote the set of m! different permutations of [m] where [m] = {1, 2 . . . ,m}.\nVarious ranking measures, like NDCG and AP, judge the quality of a ranking function, by comparing the ranked lists produced by the ranking function and the relevance vector, respectively. Formally, NDCG, cut off at k ≤ m for a query with m documents, with relevance vector R and score vector s induced by a ranking function, is defined as follows: NDCGk(s,R) =\n1 Zk(R) ∑k i=1G(Rπs(i))D(i). Shorthand representation of NDCGk(s,R) is NDCGk. Here, G(r) = 2 r − 1, D(i) = 1log2 (i+1) , Zk(R) = max\nπ∈Sm\n∑k i=1G(Rπ(i))D(i).\nπs = argsort(s) is the permutation induced by score vector s in descending order. Since optimization of the discontinuous ranking measures is an NP-hard problem, most ranking methods are based on minimizing surrogate losses, which can be optimized more efficiently. A surrogate φ takes in a score vector s and relevance vector R and produces a real number, i.e., φ : Rm×{0, 1, . . . , n}m 7→ R. φ(·, ·) is said to be convex if it is convex in its first argument, for any value of the second argument. The ranking surrogates are designed in such a way that the score vector which minimizes the surrogate, induces a ranking which minimizes the target ranking measures."}, {"heading": "3 Problem Setting and Learning to Rank Algorithm", "text": "Formal problem setting: We formalize the problem as a game being played between a learner and an oblivious adversary over T rounds. The learner’s action set is the uncountably infinite set of score vectors in Rm and the adversary’s action set is all possible relevance vectors, i.e., (n + 1)m possible vectors. At round t, the adversary generates a list of documents, represented by a matrix Xt ∈ Rm×d, pertaining to a query (the document list is considered as side information). The learner receives Xt and produces a score vector s̃t ∈ Rm. The adversary then generates a relevance vector Rt but only reveals the relevance of top k ranked documents to the learner, where the ranked list is produced by sorting s̃t. The learner uses the feedback to choose its action for the next round (updates an internal scoring function). The learner suffers a loss as measured in terms of a surrogate φ, i.e, φ(s̃t, Rt). Note that since the learner’s objective is to produce good ranking at every round, learner’s performance is measured w.r.t. to entire relevance vector Rt whereas it only gets to see just the top-k entries of Rt. As is standard in online learning setting, the learner’s performance is measured in\nterms of its expected regret: E [∑T t=1 φ(s̃t, Rt) ] −\nmin‖w‖2≤U ∑T t=1 φ(Xtw,Rt), where the expectation is taken w.r.t. to randomization of learner’s strategy and\nXtw = s w t is the score produced by the linear function parameterized by w.\nRelation between feedback and structure of surrogates: Alg. 1 is our general algorithm for learning a ranking function, online, from partial feedback. The key step in Alg. 1 is the construction of the unbiased estimator z̃t of the surrogate gradient ∇w=wtφ(Xtw,Rt). The information present for the construction process, at end of round t, is the random score vector s̃t (and associated permutation σ̃t) and relevance of top-k items of σ̃t, i.e., {Rt,σ̃t(1), . . . , Rt,σ̃t(k)}. Let Et [·] be the expectation operator w.r.t. to randomization at round t, conditioned on (w1, . . . , wt). Then z̃t being an unbiased estimator of gradient of surrogate, w.r.t wt, means the following: Et [z̃t] = ∇w=wtφ(Xtw,Rt). We note that conditioned on the past, the score vector swtt = Xtwt is deterministic. We start with a general result relating feedback to the construction of unbiased estimator of a vector valued function. Let P denote a probability distribution on Sm, i.e, ∑ σ∈Sm P(σ) = 1. For a distinct set of indices (j1, j2, . . . , jk) ⊆ [m], we denote p(ji, j2, . . . , jk) as the the sum of probability of permutations whose first k objects match objects (j1, . . . , jk), in order. Formally,\np(j1, . . . , jk) = ∑ π∈Sm P(π)1(π(1) = j1, . . . , π(k) = jk).\n(1)\nLemma 1. Let F : Rm 7→ Ra be a vector valued function, where m ≥ 1, a ≥ 1. For a fixed x ∈ Rm, let k entries of x be observed at random. That is, for a fixed probability distribution P and some random σ ∼ P(Sm), observed tuple is {σ, xσ(1), . . . , xσ(k)}. A necessary condition for existence of an unbiased estimator of F (x), that can be constructed from {σ, xσ(1), . . . , xσ(k)}, is that it should be possible to decompose F (x) over k (or less) coordinates of x at a time. That is, F (x) should have the structure:\nF (x) = ∑\n(i1,i2,...,i`)∈ mP`\nhi1,i2,...,i`(xi1 , xi2 , . . . , xi`)\n(2) where ` ≤ k, mP` is ` permutations of m and h : R` 7→ Ra (the subscripts in h is used to simply represent different functions). Moreover, when F (x) can be written in form of Eq 2 , with ` = k, an unbiased estimator of F (x), based on {σ, xσ(1), . . . , xσ(k)}, is,\ng(σ,xσ(1), . . . , xσ(k)) =∑ (j1,j2,...,jk)∈Sk\nhσ(j1),...,σ(jk)(xσ(j1), . . . , xσ(jk))∑ (j1,...,jk)∈Sk p(σ(j1), . . . , σ(jk))\n(3)\nAlgorithm 1 Ranking with Top-k Feedback (RTop-kF)\n1: Exploration parameter γ ∈ (0, 12 ), learning parameter η > 0, ranking parameter w1 = 0 ∈ R d 2: For t = 1 to T 3: Receive Xt (document list pertaining to query qt) 4: Construct score vector swtt = Xtwt and get permutation σt = argsort(s wt t ) 5: Qt(s) = (1− γ)δ(s− swtt ) + γUniform([0, 1]m) (δ is the Dirac Delta function). 6: Sample s̃t ∼ Qt and output the ranked list σ̃t = argsort(s̃t) (Effectively, it means σ̃t is drawn from Pt(σ) = (1− γ)1(σ = σt) + γm! ) 7: Receive relevance feedback on top-k items, i.e., (Rt,σ̃t(1), . . . , Rt,σ̃t(k)) 8: Suffer loss φ(s̃t, Rt) (Neither loss nor Rt revealed to learner) 9: Construct z̃t, an unbiased estimator of gradient ∇w=wtφ(Xtw,Rt), from top-k feedback. 10: Update w = wt − ηz̃t 11: wt+1 = min{1, U‖w‖2 }w (Projection into Euclidean ball of radius U). 12: End For\nwhere Sk is the set of k! permutations of [k] and p(σ(1), . . . , σ(k)) is as in Eq 1 .\nIllustrative Examples: We provide simple examples to concretely illustrate the abstract functions in Lemma 1. Let F (·) be the identity function, and x ∈ Rm. Thus, F (x) = x and the function decomposes over k = 1 coordinate of x as follows: F (x) =∑m i=1 xiei, where ei ∈ Rm is the standard basis vector along coordinate i. Hence, hi(xi) = xiei. Based on top-1 feedback, following is an unbiased estimator of F (x): g(σ, xσ(1)) = xσ(1)eσ(1)\np(σ(1)) , where p(σ(1)) =∑ π∈Sm P(π)1(π(1) = σ(1)). In another example, let F : R3 7→ R2 and x ∈ R3. Let F (x) = [x1 + x2;x2 + x3]>. Then the function decomposes over k = 1 coordinate of x as F (x) = x1e1 + x2(e1 + e2) + x3e2, where ei ∈ R2. Hence, h1(x1) = x1e1, h2(x2) = x2(e1 + e2) and h3(x3) = x3e2. An unbiased estimator based on top-1 feedback is: g(σ, xσ(1)) = hσ(1)(xσ(1))\np(σ(1)) ."}, {"heading": "4 Unbiased Estimators of Gradients of Surrogates", "text": "Alg. 1 can be implemented for any ranking surrogate as long as an unbiased estimator of the gradient can be constructed from the random feedback. We will use techniques from online convex optimization to obtain formal regret guarantees. We will thus construct the unbiased estimator of four major ranking surrogates. Three of them are popular convex surrogates, one each from the three major learning to rank methods, i.e., pointwise, pairwise and listwise methods. The fourth one is a popular non-convex surrogate.\nShorthand notations: We note that by chain rule, ∇w=wtφ(Xtw,Rt) = X>t ∇swtt φ(s wt t , Rt), where s wt t = Xtwt. SinceXt is deterministic in our setting, we focus\non unbiased estimators of ∇swtt φ(s wt t , Rt) and take a matrix-vector product with Xt. To reduce notational clutter in our derivations, we drop w from sw and the subscript t throughout. Thus, in our derivations, z̃ = z̃t, X = Xt, s = s wt t (and not s̃t), σ = σ̃t (and not σt), R = Rt, ei is standard basis vector in Rm along coordinate i and p(·) as in Eq. 1 with P = Pt where Pt is the distribution in round t in Alg. 1."}, {"heading": "4.1 Convex Surrogates", "text": "Pointwise Method: We will construct the unbiased estimator of the gradient of squared loss [Cossock and Zhang, 2006]: φsq(s,R) = ‖s − R‖22. The gradient ∇sφsq(s,R) is 2(s − R) ∈ Rm. As we have already demonstrated in the example following Lemma 1, we can construct unbiased estimator of R from top1 feedback ({σ,Rσ(1)}). Concretely, the unbiased estimator is:\nz̃ = X> ( 2 ( s− Rσ(1)eσ(1)\np(σ(1))\n)) .\nPairwise Method: We will construct the unbiased estimator of the gradient of hinge-like surrogate in RankSVM [Joachims, 2002]: φsvm(s,R) =∑ i 6=j=1 1(Ri > Rj) max(0, 1 + sj − si). The gra-\ndient is given by ∇sφsvm(s,R) = ∑m i 6=j=1 1(Ri > Rj)1(1 + sj > si)(ej − ei) ∈ Rm. Since s is a known quantity, from Lemma 1, we can construct F (R) as follows: F (R) = Fs(R) = ∑m i 6=j=1 hs,i,j(Ri, Rj), where hs,i,j(Ri, Rj) = 1(Ri > Rj)1(1 + sj > si)(ej − ei). Since Fs(R) is decomposable over 2 coordinates of R at a time, we can construct an unbiased estimator from top-2 feedback ({σ,Rσ(1), Rσ(2)}). The unbiased estimator is:\nz̃ = X> ( hs,σ(1),σ(2)(Rσ(1), Rσ(2)) + hs,σ(2),σ(1)(Rσ(2), Rσ(1))\np(σ(1), σ(2)) + p(σ(2), σ(1))\n) .\nWe note that the unbiased estimator was constructed from top-2 feedback. The following lemma, in conjunction with the necessary condition of Lemma 1 shows that it is the minimum information required to construct the unbiased estimator.\nLemma 2. The gradient of RankSVM surrogate, i.e., φsvm(s,R) cannot be decomposed over 1 coordinate of R at a time.\nListwise Method: Convex surrogates developed for listwise methods of learning to rank are defined over the entire score vector and relevance vector. Gradient of a surrogate cannot usually be decomposed over coordinates of the relevance vector. We will focus on the cross-entropy surrogate used in the highly cited ListNet [Cao et al., 2007] ranking algorithm and show how a very natural modification to the surrogate makes its gradient estimable in our partial feedback setting.\nThe authors of the ListNet method use a crossentropy surrogate on two probability distributions on permutations, induced by score and relevance vector respectively. More formally, the surrogate is defined as follows1. Define m maps from Rm to R as: Pj(v) = exp(vj)/ ∑m j=1 exp(vj) for j ∈ [m]. Then, for\nscore vector s and relevance vector R, φLN(s,R) = − ∑m i=1 Pi(R) logPi(s) and ∇sφLN(s,R) =∑m\ni=1\n( − exp(Ri)∑m\nj=1 exp(Rj) + exp(si)∑m j=1 exp(sj)\n) ei. We have\nthe following lemma about the gradient of φLN .\nLemma 3. The gradient of ListNet surrogate φLN (s,R) cannot be decomposed over k, for k = 1, 2, coordinates of R at a time.\nIn fact, an examination of the proof of the above lemma reveals that decomposability at any k < m does not hold for the gradient of LisNet surrogate, though we only prove it for k = 1, 2 (since feedback for top k items with k > 2 does not seem practical). Due to Lemma 1, this means that if we want to run Alg. 1 under top-k feedback, a modification of ListNet is needed. We now make such a modification.\nWe first note that the cross-entropy surrogate of ListNet can be easily obtained from a standard divergence, viz. Kullback-Liebler divergence. Let p, q ∈ Rm be 2 probability distributions ( ∑m i=1 pi = ∑m i=1 qi = 1).\nThen KL(p, q) = ∑m i=1 pi log(pi) − ∑m i=1 pi log(qi) −∑m\ni=1 pi + ∑m i=1 qi. Taking pi = Pi(R) and qi = Pi(s), ∀ i ∈ [m] (where Pi(v) is as defined in φLN) and noting that φLN(s,R) needs to be minimized w.r.t. s (thus we can ignore the ∑m i=1 pi log(pi) term in KL(p, q)), we get the cross entropy surrogate from KL.\n1The ListNet paper actually defines a family of losses based on probability models for top r documents, with r ≤ m. We use r = 1 in our definition since that is the version implemented in their experimental results.\nOur natural modification now easily follows by considering KL divergence for un-normalized vectors (it should be noted that KL divergence is an instance of a Bregman divergence). Define m maps from Rm to R as: P ′j(v) = exp(vj) for j ∈ [m]. Now define pi = P ′ i (R) and qi = P ′ i (s). Then, the modified surrogate is φKL(s,R) is:\nm∑ i=1 eRi log(eRi)− m∑ i=1 eRi log(esi)− m∑ i=1 eRi + m∑ i=1 esi ,\nand m∑ i=1 (exp(si)− exp(Ri)) ei is its gradient w.r.t. s. Note that φKL(s,R) is non-negative and convex in s. Equating gradient to 0 ∈ Rm, at the minimum point, si = Ri, ∀ i ∈ [m]. Thus, the sorted order of optimal score vector agrees with sorted order of relevance vector and it is a valid ranking surrogate.\nNow, from Lemma 1, we can construct F (R) as follows: F (R) = Fs(R) = ∑m i=1 hs,i(Ri), where hs,i(Ri) = (exp(si)− exp(Ri)) ei. Since Fs(R) is decomposable over 1 coordinate of R at a time, we can construct an unbiased estimator from top-1 feedback ({σ,Rσ(1)}). The unbiased estimator is:\nz̃ = X> (\n(exp(sσ(1))− exp(Rσ(1)))eσ(1) p(σ(1))\n)\nOther Listwise Methods: As we mentioned before, most listwise convex surrogates will not be suitable for Alg. 1 with top-k feedback. For example, the class of popular listwise surrogates that are developed from structured prediction perspective [Chapelle et al., 2007, Yue et al., 2007] cannot have unbiased estimator of gradients from top-k feedback since they are based on maps from full relevance vectors to full rankings and thus cannot be decomposed over k = 1 or 2 coordinates of R. It does not appear they have any natural modification to make them amenable to our approach."}, {"heading": "4.1.1 Non-convex Surrogate", "text": "We provide an example of a non-convex surrogate for which Alg. 1 is applicable (however it will not have any regret guarantees due to non-convexity). We choose the SmoothDCG surrogate given in [Chapelle and Wu, 2010], which has been shown to have very competitive empirical performance. SmoothDCG, like ListNet, defines a family of surrogates, based on the cut-off point of DCG (see original paper [Chapelle and Wu, 2010] for details). We consider SmoothDCG@1, which is the smooth version of DCG@1 (i.e., DCG which focuses just on the top-ranked document). The surrogate is defined as: φSD(s,R) =\n1∑m j=1 exp(sj/ ) ∑m i=1G(Ri) exp(si/ ),\nwhere is a (known) smoothing parameter and G(a) = 2a − 1. The gradient of the surrogate is: [∇sφSD(s,R)] = m∑ i=1 hs,i(Ri), hs,i(Ri) =\nG(Ri) ( m∑ j=1 [ 1 exp(si/ )∑ j exp(sj′/ ) 1(i=j) − 1 exp((si + sj)/ ) ( ∑ j′ exp(sj′/ )) 2 ]ej ) Using Lemma 1, we can write F (R) = Fs(R) =∑m i=1 hs,i(Ri) where hs,i(Ri) is defined above. Since Fs(R) is decomposable over 1 coordinate of R at a time, we can construct an unbiased estimator from top-1 feedback ({σ,Rσ(1)}), with unbiased estimator being: z̃ = X> ( G(Rσ(1)) p(σ(1)) (∗) )\n(∗) = m∑ j=1 [ 1 exp(sσ(1)/ )∑ j′ exp(sj′/ ) 1(σ(1)=j) − 1 exp((sσ(1) + sj)/ ) ( ∑ j′ exp(sj′/ )) 2 ]ej"}, {"heading": "4.2 Computational Complexity of", "text": "Algorithm 1\nThree of the four key steps governing the complexity of Alg. 1, i.e., construction of s̃t, σ̃t and sorting can all be done in O(m log(m)) time. Construction of estimator is even simpler. The only bottleneck could have been calculations of p(σ(1)) in squared loss, (modified) ListNet loss and SmoothDCG loss, and p(σ(1), σ(2)) in RankSVM loss, since they involve sum over permutations. However, they have a compact representation, i.e., p(σ(1)) = 1 − γ + γm and p(σ(1), σ(2)) = 1 − γ + 2γm(m−1) . The calculations follow easily due to the nature of Pt (step-6 in algorithm) which put equal weights on all permutations other than σt."}, {"heading": "4.3 Regret Bounds", "text": "The underlying deterministic part of our algorithm is online gradient descent (OGD) [Zinkevich, 2003]. The regret of OGD, run with unbiased estimator of gradient of a convex function, as given in Theorem 3.1 of [Flaxman et al., 2005], in our problem setting is:\nE [ T∑ t=1 φ(Xtwt, Rt) ] ≤ min w:‖w‖2≤U T∑ t=1 φ(Xtw,Rt)+\nU2\n2η + η 2 E [ T∑ t=1 ‖z̃t‖22 ] (4)\nwhere z̃t is unbiased estimator of ∇w=wtφ(Xtw,Rt), conditioned on past events, η is the learning rate and the expectation is taken over all randomness in the algorithm.\nHowever, from the perspective of the loss φ(s̃t, Rt) incurred by Alg. 1, at each round t, the RHS above is not a valid upper bound. The algorithms plays the score vector suggested by OGD (s̃t = Xtwt) with probability 1− γ (exploitation) and plays a randomly selected score vector (i.e., a draw from the uniform distribution on [0, 1]m), with probability γ (exploration). Thus, the expected number of rounds in which the algorithm does not follow the score suggested by OGD is γT , leading to an extra regret2 of order γT . Thus, we have\nE [ T∑ t=1 φ(s̃t, Rt) ] ≤ E [ T∑ t=1 φ(Xtwt, Rt) ] +O (γT )\n(5)\nWe first control Et‖z̃t‖22, for all convex surrogates considered in our problem (we remind that z̃t is the estimator of a gradient of a surrogate, calculated at time t. In Sec 4.1 , we omitted showing w in sw and index t). To get bound on Et‖z̃t‖22, we used the following norm relation that holds for any matrix X [Bhaskara and Vijayaraghavan, 2011]: ‖X‖p→q = sup v 6=0 ‖Xv‖q ‖v‖p , where q is the dual exponent of p (i.e., 1q + 1 p = 1), and the following lemma derived from it: Lemma 4. For any 1 ≤ p ≤ ∞, ‖X>‖1→p = ‖X‖q→∞ = maxmj=1 ‖Xj:‖p, where Xj: denotes jth row of X and m is the number of rows of matrix.\nLemma 5. For parameter γ in Alg. 1 , RD being the bound on `2 norm of the feature vectors (rows of document matrix X), m being the upper bound on number of documents per query, U being the radius of the Euclidean ball denoting the space of ranking parameters and Rmax being the maximum possible relevance value (in practice always ≤ 5), let Cφ ∈ {Csq, Csvm, CKL} be polynomial functions of RD,m,U,Rmax, where the degrees of the polynomials depend on the surrogate (φsq, φsvm, φKL), with no degree ever greater than four. Then we have,\nEt [ ‖z̃t‖22 ] ≤ C φ\nγ (6)\nPlugging Eq. 6 and Eq. 5 in Eq. 4, and optimizing over η and γ, (which gives η = O(T−2/3) and γ = O(T−1/3)), we get the final regret bound.\nTheorem 4.1. For any sequence of instances and labels (Xt, Rt){t∈[T ]}, applying Alg. 1 with top-1 feedback for φsq and φKL and top-2 feedback for φsvm, will produce the following bound on the regret for any of the\n2The instantaneous loss suffered at each of the exploration round can be maximum of O(1), as long as φ(s,R) is bounded, ∀ s and ∀ R. This is true because the score space is `2 norm bounded, maximum relevance grade is finite in practice and we consider Lipschitz, convex surrogates.\nthree surrogates:\nE [ T∑ t=1 φ(s̃t, Rt) ] − min w:‖w‖2≤U T∑ t=1 φ(Xtw,Rt) ≤ CφO ( T 2/3 ) (7)\nwhere Cφ is a surrogate dependent function, as described in Lemma 5 , and expectation is taken over underlying randomness of the algorithm, over T rounds.\nDiscussion: It is known that online bandit games are special instances of partial monitoring games. For bandit online convex optimization problems with Lipschitz, convex surrogates, the best regret rate known so far, that can be achieved by an efficient algorithm, is O(T 3/4) (however, see the work of Bubeck and Eldan [2015] for a non-constructive O(log4(T ) √ T ) bound). Surprisingly, Alg. 1, when applied in a partial monitoring setting to the Lipschitz, convex surrogates that we have listed, achieves a better regret rate than what is known in the bandit setting. Moreover, as we show subsequently, for an entire class of Lipschitz convex surrogates (subclass of NDCG calibrated surrogates), sub-linear (in T ) regret is not even achievable. Thus, our work indicates that even within the class of Lipschitz, convex surrogates, regret rate achievable is dependent on the structure of surrogates; something that does not arise in bandit convex optimization."}, {"heading": "5 Impossibility of Sublinear Regret for NDCG Calibrated Surrogates", "text": "Learning to rank methods optimize surrogates to learn a ranking function, even though performance is measured by target measures like NDCG. This is done because direct optimization of the measures lead to NPhard optimization problems. One of the most desirable properties of any surrogate is calibration, i.e., the surrogate should be calibrated w.r.t the target [Bartlett et al., 2006]. Intuitively, it means that a function with small expected surrogate loss on unseen data should have small expect target loss on unseen data. We focus on NDCG calibrated surrogates (both convex and non-convex) that have been characterized by Ravikumar et al. [2011]. We first state the necessary and sufficient condition for a surrogate to be calibrated w.r.t NDCG. For any score vector s and distribution η on relevance space Y, let φ̄(s, η) = ER∼ηφ(s,R). Moreover, we define G(R) = (G(R1), . . . , G(Rm)) >.\nTheorem 5.1. [Ravikumar et al., 2011, Thm. 6] A surrogate φ is NDCG calibrated iff for any distribution η on relevance space Y, there exists an invertible, order preserving map g : Rm 7→ Rm s.t. the unique minimizer s∗φ(η) can be written as\ns∗φ(η) = g ( ER∼η [ G(R)\nZm(R)\n]) . (8)\nInformally, Eq. 8 states that argsort(s∗φ(η)) ⊆ argsort(ER∼η [ G(R) Zm(R) ] ) Ravikumar et al. [2011] give concrete examples of NDCG calibrated surrogates, including how some of the popular surrogates can be converted into NDCG calibrated ones: e.g., the NDCG calibrated version of squared loss is ‖s− G(R)Zm(R)‖ 2 2.\nWe now state the impossibility result for the class of NDCG calibrated surrogates with top-1 feedback.\nTheorem 5.2. Fix the online learning to rank game with top-1 feedback and any NDCG calibrated surrogate. Then, for every learner’s algorithm, there exists an adversary strategy s.t. the learner’s expected regret is Ω(T ).\nNote that our result is for top-1 feedback. Minimax regret for the problem setting with top-k feedback, with k ≥ 2 remains an open question.\nProof. (Sketch) The proof builds on the proof of hopeless finite action partial monitoring games given by Piccolboni and Schindelhauer [2001]. An examination of their proof of Thm. 3 indicates that for hopeless games, there have to exist two probability distributions (over adversary’s actions), which are indistinguishable in terms of feedback but the optimal learner’s actions for the distributions are different. We first provide a mathematical explanation as to why such existence lead to hopeless games. Then, we provide a characterization of indistinguishable probability distributions in our problem setting, and then exploit the characterization of optimal actions for NDCG calibrated surrogates (Thm. 5.1) to explicitly construct two such probability distributions. This proves the result.\nWe note that the proof of Thm. 3 of Piccolboni and Schindelhauer [2001] cannot be directly extended to prove the impossibility result because it relies on constructing a connected graph on vertices defined by neighboring actions of learner. In our case, due to the continuous nature of learner’s actions, the graph will be an empty graph and proof will break down."}, {"heading": "6 Empirical Results", "text": "Objective: We conducted experiments on benchmark datasets to demonstrate the performance of ranking functions that are learnt from partial feedback. As stated before, though Alg. 1 is designed to minimize surrogate based regret, the users only care about the ranking presented to them, and indeed the algorithm interacts with users only through ranked lists. We tested the quality of the ranked lists, and hence the performance of the evolving ranking functions, against\nthe full relevance vectors via NDCG10. Ranking functions compared: We applied Alg. 1, with top-1 feedback, on Squared, KL and SmoothDCG surrogates, and with top-2 feedback, on the RankSVM surrogate. Since our work is based on a novel feedback model, the performance of Alg. 1 could not be directly compared with any published baseline. So, based on the objective of our work, we selected two different ranking methods for comparison. The first one is the online version ListNet ranking algorithm, with full relevance vector revealed at end of every round. ListNet is not only one of the most cited ranking algorithms (over 700 citations according to Google Scholar), but also one of the most validated algorithms [Tax et al., 2015]. We emphasize that some of the ranking algorithms, which have shown better empirical performance than ListNet, are usually based on non-convex surrogates with complex ranking functions. These algorithms cannot usually be converted into online algorithms which learn from streaming data. The second one is a fully random algorithm which outputs a uniformly at random ranking of documents at each round. Effectively, we are comparing Alg 1, which learns from highly restricted feedback, with an algorithm which learns from full feedback and another algorithm which receives no\nfeedback. Datasets: We compared the various ranking functions on two large scale commercial datasets. They were Yahoo’s Learning to Rank Challenge dataset [Chapelle and Chang, 2011] and a dataset published by Russian search engine Yandex [IM-2009]. The Yahoo dataset has 19944 unique queries with 5 distinct relevance levels, while Yandex has 9126 unique queries with 5 distinct relevance levels. Setting of experiments: We selected time horizon T = 250,000 iterations for our experiments (thus, each algorithm went over each dataset multiple times). All the online algorithms, other than the fully random one, involve learning rate η and exploration parameter γ (Full information ListNet does not involve γ and SmoothDCG has an additional smoothing parameter ). While obtaining our regret guarantees, we had established that η = O(T−2/3) and γ = O(T−1/3) and thus, in our experiments, for each instance of Alg. 1, we selected η = 1\nT 2/3 and γ = 1 T 1/3 . We fixed = 0.01.\nFor ListNet, we selected η = 1 T 1/2 , since regret guaratnee in OGD is established with η = O(T−1/2). We plotted average NDCG10 against time, where average NDCG10 at time t is the cumulative NDCG10 up to time t, divided by t. Observations: In both the datasets, ListNet, with full information, has highest average NDCG value throughout. However, Alg. 1, with the convex surrogates, produce competitive performance. In fact, in the Yahoo dataset, our algorithms, with RankSVM and KL, are very close to the performance of ListNet. RanSVM does better than the other surrogates, since the estimator of RankSVM gradient is constructed from top-2 feedback, leading to lower variance. KL, being listwise in nature, does better than squared loss. Crucially, our algorithms, based on all three convex surrogates, perform significantly better than the purely random algorithm, and are much closer to full feedback ListNet in performance, despite being much closer to the purely random algorithm in terms of feedback. Our algorithm, with SmoothDCG, on the other hand, produce poor performance. We believe the reason is the non-convexity of the surrogate, which leads to the optimization procedure possibly getting stuck at a local minima. In batch setting, such problem is avoided by an annealing technique that successively reduces . We are not aware of an analogue in an online setting. Possible algorithms optimizing non-convex surrogates in an online manner, which require gradient of the surrogate, may be adapted to this partial feedback setting."}, {"heading": "7 Supplementary", "text": "Proof of Lemma 1: We restate the lemma before giving the proof, for ease of reading:\nLemma 1: Let F : Rm 7→ Ra be a vector valued function, where m ≥ 1, a ≥ 1. For a fixed x ∈ Rm, let k entries of x be observed at random. That is, for a fixed probability distribution P and some random σ ∼ P(Sm), observed tuple is {σ, xσ(1), . . . , xσ(k)}. The necessary condition for existence of an unbiased estimator of F (x), that can be constructed from {σ, xσ(1), . . . , xσ(k)}, is that it should be possible to decompose F (x) over k (or less) coordinates of x at a time. That is, F (x) should have the following structure:\nF (x) = ∑\n(i1,i2,...,i`)∈ mP`\nhi1,i2,...,i`(xi1 , xi2 , . . . , xi`)\nwhere ` ≤ k, mP` is ` permutations of m and h : R` 7→ Ra. Moreover, when F (x) can be written in form of Eq 2 , with ` = k, an unbiased estimator of F (x), based on {σ, xσ(1), . . . , xσ(k)}, is,\ng(σ, xσ(1), . . . , xσ(k)) =\n∑ (j1,j2,...,jk)∈Sk\nhσ(j1),...,σ(jk)(xσ(j1), . . . , xσ(jk))∑ (j1,...,jk)∈Sk p(σ(j1), . . . , σ(jk))\nwhere Sk is the set of k! permutations of [k] and p(σ(1), . . . , σ(k)) is as in Eq 1 .\nProof. For a fixed x ∈ Rm and probability distribution P, let the random permutation be σ ∼ P(Sm) and the observed tuple be {σ, xσ(1), . . . , xσ(k)}. Let Ĝ = G(σ, xσ(1), . . . , xσ(k)) be an unbiased estimator of F (x) based on the random observed tuple. Taking expectation, we get:\nF (x) = Eσ∼P [ Ĝ ] = ∑ π∈Sm P(π)G(π, xπ(1), . . . , xπ(k))\n= ∑\n(i1,i2,...,ik)∈ mPk ∑ π∈Sm P(π)1(π(1) = i1, π(2) = i2, . . . , π(k) = ik)G(π, xi1 , xi2 , . . . , xik)\nWe note that P(π) ∈ [0, 1] is independent of x for all π ∈ Sm. Then we can use the following construction of function h(·):\nhi1,i2,...,ik(xi1 , . . . , xik) = ∑ π∈Sm P(π)1(π(1) = i1, π(2) = i2, . . . , π(k) = ik)G(π, xi1 , xi2 , . . . , xik)\nand thus,\nF (x) = ∑\n(i1,i2,...,ik)∈ mPk\nhi1,i2,...,ik(xi1 , xi2 , . . . , xi)\nHence, we conclude that for existence of an unbiased estimator based on the random observed tuple, it should be possible to decompose F (x) over k (or less) coordinates of x at a time. The “less than k” coordinates arguement follows simply by noting that if F (x) can be decomposed over ` coordinates at a time (` < k) and observation tuple is {σ, xσ(1), . . . , xσ(k))}, then any k− ` observations can be thrown away and the rest used for construction of the unbiased estimator.\nThe construction of the unbiased estimator proceeds as follows: Let F (x) = ∑m i=1 hi(xi) and feedback is for top-1 item (k = 1). The unbiased estimator according to Lemma. 1 is:\ng(σ, xσ(1)) = hσ(1)(xσ(1))\np(σ(1)) = hσ(1)(xσ(1))∑ π P(π)1(π(1) = σ(1))\nTaking expectation w.r.t. σ, we get:\nEσ[g(σ, xσ(1))] = m∑ i=1 hi(xi)( ∑ π P(π)1(π(1) = i))∑ π P(π)1(π(1) = i) = m∑ i=1 hi(xi) = F (x)\nNow, let F (x) = m∑\ni 6=j=1 hi,j(xi, xj) and the feedback is for top-2 item (k = 2). The unbiased estimator according\nto Lemma. 1 is:\ng(σ, xσ(1), xσ(2)) = hσ(1),σ(2)(xσ(1), xσ(2)) + hσ(2),σ(1)(xσ(2), xσ(1))\np(σ(1), σ(2)) + p(σ(2), σ(1))\nWe will use the fact that for any 2 permutations σ1, σ2, which places the same 2 objects in top-2 positions but in opposite order, estimators based on σ1 (i.e, g(σ1, xσ1(1), xσ1(2))) and σ2 (i.e, g(σ2, xσ2(1), xσ2(2))) have same numerator and denominator. For eg., let σ1(1) = i, σ1(2) = j. Numerator and denominator for g(σ1, xσ1(1), xσ1(2)) are hi,j(xi, xj) + hj,i(xj , xi) and p(i, j) + p(j, i) respectively. Now let σ2(1) = j, σ2(2) = i. Then numerator and denominator for g(σ2, xσ2(1), xσ2(2)) are hj,i(xj , xi) + hi,j(xi, xj) and p(j, i) + p(i, j) respectively.\nThen, taking expectation w.r.t. σ, we get:\nEσg(σ, xσ(1), xσ(2)) = m∑\ni 6=j=1\n(hi,j(xi, xj) + hj,i(xj , xi))p(i, j)\np(i, j) + p(j, i)\n= m∑ i>j=1 (hi,j(xi, xj) + hj,i(xj , xi))(p(i, j) + p(j, i)) p(i, j) + p(j, i)\n= m∑ i>j=1 (hi,j(xi, xj) + hj,i(xj , xi)) = m∑ i 6=j=1 hi,j(xi, xj) = F (x)\nThis chain of logic can be extended for any k ≥ 3. Explicitly, for general k ≤ m, let S(i1, i2, . . . , ik) denote all permutations of the set {i1, . . . , ik}. Then, taking expectation of the unbiased estimator will give:\nEσg(σ, xσ(1), . . . , xσ(k))\n= ∑\n(i1,i2,...,ik)∈ mPk\n( ∑ (j1,...,jk)∈S(i1,...,ik) hj1,...,jk(xj1 , . . . , xjk) ) p(i1, . . . , ik)∑\n(j1,...,jk)∈S(i1,...,ik) p(j1, . . . , jk)\n= m∑ i1>i2>...>ik=1\n( ∑ (j1,...,jk)∈S(i1,...,ik) hj1,...,jk(xj1 , . . . , xjk) )( ∑ (j1,...,jk)∈S(i1,...,ik) p(j1, . . . , jk) ) ∑\n(j1,...,jk)∈S(i1,...,ik) p(j1, . . . , jk)\n= m∑ i1>i2>...>ik=1  ∑ (j1,...,jk)∈S(i1,...,ik) hj1,...,jk(xj1 , . . . , xjk)  = ∑ (i1,i2,...,ik)∈ mPk hi1,i2,...,ik(xi1 , xi2 , . . . , xik) = F (x)\nNote: For k = m, i.e., when the full feedback is received, the unbiased estimator is:\ng(σ, xσ(1), . . . , xσ(m)) =\n∑ (j1,j2,...,jm)∈Sm\nhσ(j1),...,σ(jm)(xσ(j1), . . . , xσ(jm))∑ (j1,...,jm)∈Sm p(σ(j1), . . . , σ(jm))\n=\n∑ (i1,i2,...,im)∈ mPm hi1,...,im(xi1 , . . . , xim)\n1 = F (x)\nHence, with full information, the unbiased estimator of F (x) is actually F (x) itself, which is consistent with the theory of unbiased estimator.\nProof of Lemma 4:\nProof. The first equality is true because\n‖X>‖1→p = sup v 6=0 ‖X>v‖p ‖v‖1 = sup v 6=0 sup u6=0\n〈 X>v, u 〉 ‖v‖1‖u‖q\n= sup u 6=0 sup v 6=0 〈v,Xu〉 ‖v‖1‖u‖q = sup u6=0 ‖Xu‖∞ ‖u‖q = ‖X‖q→∞.\nThe second is true because\n‖X‖q→∞ = sup u6=0 ‖Xu‖∞ ‖u‖q = sup u6=0 m max j=1 | 〈Xj:, u〉 | ‖u‖q\n= m\nmax j=1 sup u6=0 | 〈Xj:, u〉 | ‖u‖q = m max j=1 ‖Xj:‖p.\nProof of Lemma 5 : We restate the lemma before giving the proof:\nLemma 5: For parameter γ in Algorithm 1 , RD being the bound on `2 norm of the feature vectors (rows of document matrix X), m being the upper bound on number of documents per query, U being the radius of the Euclidean ball denoting the space of ranking parameters and Rmax being the maximum possible relevance value (in practice always ≤ 5), let Cφ ∈ {Csq, Csvm, CKL} be polynomial functions of RD,m,U,Rmax, where the degrees of the polynomials depend on the surrogate (φsq, φsvm, φKL). Then we have,\nEt [ ‖z̃t‖2 ] ≤ C φ\nγ .\nProof. All our unbiased estimators are of the form X>f(s,R, σ). We will actually get a bound on f(s,R, σ) by using Lemma 4 and p→ q norm relation, to equate out X:\n‖z̃‖2 = ‖X>f(s,R, σ)‖2 ≤ ‖X>‖1→2‖f(s,R, σ)‖1 ≤ RD‖f(s,R, σ)‖1\nsince RD ≥ maxmj=1 ‖Xj:‖2.\nSquared Loss: The unbiased estimator of gradient of squared loss, as given in the main text, is:\nz̃ = X>(2(s− Rσ(1)eσ(1)\np(σ(1)) ))\nwhere p(σ(1)) = ∑ π∈Sm P(π)1(π(1) = σ(1)) (P = Pt is the distribution at round t as in Alg. 1 )\nNow we have:\n‖s− Rσ(1)eσ(1)\np(σ(1)) ‖1 ≤ mRDU + Rmax p(σ(1)) ≤ mRDURmax p(σ(1)\nThus, taking expectation w.r.t σ, we get:\nEσ‖z̃‖22 ≤ m2R4DU2R2maxEσ 1\np(σ(1))2 = m2R4DU 2R2max m∑ i=1 p(i) p2(i)\nNow, since p(i) ≥ γ m , ∀ i, we get: Eσ‖z̃‖22 ≤ Csq γ , where Csq = m4R4DU 2R2max.\nRankSVM Surrogate: The unbiased estimator of gradient of the RankSVM surrogate, as given in the main text, is: z̃ = X> ( hs,σ(1),σ(2)(Rσ(1), Rσ(2)) + hs,σ(2),σ(1)(Rσ(2), Rσ(1))\np(σ(1), σ(2)) + p(σ(2), σ(1))\n)\nwhere hs,i,j(Ri, Rj) = 1(Ri > Rj)1(1 + sj > si)(ej − ei) and p(σ(1), σ(2)) = ∑\nπ∈Sm P(π)1(π(1) = σ(1), π(2) =\nσ(2)) (P = Pt as in Alg. 1)).\nNow we have:\n‖ hs,σ(1),σ(2)(Rσ(1), Rσ(2)) + hs,σ(2),σ(1)(Rσ(2), Rσ(1))\np(σ(1), σ(2)) + p(σ(2), σ(1)) ‖1 ≤\n2\np(σ(1), σ(2)) + p(σ(2), σ(1))\nThus, taking expectation w.r.t σ, we get:\nEσ‖z̃‖22 ≤ 4R2DEσ 1\n(p(σ(1), σ(2)) + p(σ(2), σ(1)))2 ≤ 4R2D m∑ i>j p(i, j) + p(j, i) (p(i, j) + p(j, i))2\nNow, since p(i, j) ≥ γ m2 , ∀ i, j, we get: Eσ‖z̃‖22 ≤ Csvm γ , where Csvm = O(m4R2D).\nKL based Surrogate: The unbiased estimator of gradient of the KL based surrogate, as given in the main text, is: z̃ = X> (\n(exp(sσ(1))− exp(Rσ(1)))eσ(1) p(σ(1)) ) where p(σ(1)) = ∑ π∈Sm P(π)1(π(1) = σ(1)) (P = Pt as in Alg. 1) ).\nNow we have:\n‖ (exp(sσ(1))− exp(Rσ(1)))eσ(1)\np(σ(1)) ‖1 ≤\nexp(RDU)\np(σ(1))\nThus, taking expectation w.r.t σ, we get:\nEσ‖z̃‖22 ≤ R2D exp(2RDU)Eσ( 1\np(σ(1))2\nFollowing the same arguement as in squared loss, we get: Eσ‖z̃‖22 ≤ CKL\nγ , where CKL = m2R2D exp(2RXU).\nProof of Lemma 2 :\nProof. Let m = 3. The term associated with the 1st coordinate of R, i.e, R1, in the gradient of RankSVM is: 1(R1 > R2)1(1 + s2 > s1)(e2 − e1) + 1(R2 > R1)1(1 + s1 > s2)(e1 − e2) + 1(R1 > R3)1(1 + s3 > s1)(e3 − e1) + 1(R3 > R1)1(1 + s1 > s3)(e1 − e3). Now let s1 = 1, s2 = 0, s3 = 0. Then the term associated becomes: 1(R2 > R1)(e1 − e2) + 1(R3 > R1)(e1 − e3) = (1(R2 > R1) + 1(R3 > R1))e1 − 1(R2 > R1)e2 − 1(R3 > R1)e3. Now, if the gradient can be decomposed over R1, then the term associated with R1 should only be a function of R1. More specifically, (1(R2 > R1) + 1(R3 > R1)) (the non-zero coefficient of e1, in the term associated with R1) should be a function of only R1. Same for the non-zero coefficients of e2 and e3.\nNow assume that the (1(R2 > R1) +1(R3 > R1)) can be expressed as a function of R1 only. Then the difference between the coefficient’s values, for the following two cases: R1 = 0, R2 = 0, R3 = 0 and R1 = 1, R2 = 0, R3 = 0, would be same as the difference between the coefficient’s values, for the following two cases: R1 = 0, R2 = 1, R3 = 1 and R1 = 1, R2 = 1, R3 = 1 (Since the difference would be affected only by change in R1 value). It can be clearly seen that the change in value between the first two cases is: 0− 0 = 0, while the change in value bertween the second two cases is: 2− 0 = 2. Thus, we reach a contradiction.\nProof of Lemma 3 :\nProof. The term associated with the 1st coordinate of R, i.e, R1, in the gradient of ListNet is =∑m i=1 ( − exp(Ri)∑m j=1 exp(Rj) + exp(si)∑m j=1 exp(sj) ) ei\nNow, f(R) = ( − exp(Ri)∑m j=1 exp(Rj) + exp(si)∑m j=1 exp(sj) ) is the non-zero coefficient of e1. Now, if f(R) would have only been a function of R1, then ∂2f(R)\n∂Ri∂Rj , ∀ j 6= i would have been zero. It can be clearly seen this is not the case.\nNow, the term associated with R1 and R2, in the gradient of ListNet is same as before, i.e,∑m i=1 ( − exp(Ri)∑m j=1 exp(Rj) + exp(si)∑m j=1 exp(sj) ) ei for both\nNow, f(R) = ( − exp(Ri)∑m j=1 exp(Rj) + exp(si)∑m j=1 exp(sj) ) is the non-zero coefficient of e1. Now, if f(R) would have only been a function of R1 and R2, then ∂3f(R)\n∂Ri∂Rj∂R` , ∀` 6= i, ` 6= j would have been zero. It can be clearly seen this\nis not the case.\nThe same arguement can be extended for any k < m.\nProof of Theorem. 5.2:\nProof. We will first fix the setting of the online game. We consider m = 3 and fixed the document matrix X ∈ R3×3 to be the identity. At each round of the game, the adversary generates the fixed X and the learner chooses a score vector s ∈ R3. Making the matrix X identity makes the distinction between weight vectors w and scores s irrelevant since s = Xw = w. We note that allowing the adversary to vary X over the rounds only makes him more powerful, which can only increase the regret. We also restrict the adversary to choose binary relevance vectors. Once again, allowing adversary to choose multi-graded relevance vectors only makes it more powerful. Thus, in this setting, the adversary can now choose among 23 = 8 possible relevance vectors. The learner’s action set is infinite, i.e., the learner can choose any score vector s = Xw = Rm. The loss function φ(s,R) is any NDCG calibrated surrogate and feedback is the relevance of top-ranked item at each round, where ranking is induced by sorted order (descending) of score vector. We will use p to denote randomized adversary one-short strategies, i.e. distributions over the 8 possible relevance score vectors. Let s∗p = argmins ER∼pφ(s,R). We note that in the definition of NDCG calibrated surrogates, Ravikumar et al. [2011] assume that the optimal score vector for each distribution over relevance vectors is unique and we subscribe to that assumption. The assumption was taken to avoid some boundary conditions.\nIt remains to specify the choice of U , a bound on the Euclidean norm of the weight vectors (same as score vectors for us right now) that is used to define the best loss in hindsight. It never makes sense for the learner to play anything outside the set ∪ps∗p so that we can set U = max{‖s‖2 : s ∈ ∪ps∗p}.\nThe paragraph following Lemma 6 of Thm. 3 in Piccolboni and Schindelhauer [2001] gives the main intuition behind the argument the authors developed to prove hopelessness of finite action partial monitoring games. To make our proof self contained, we will explain the intuition in a rigorous way.\nKey insight: Two adversary strategies p, p̃ are said to be indistinguishable from the learner’s feedback perspective, if for every action of the learner, the probability distribution over the feedbacks received by learner is the same for p and p̃. Now assume that adversary always selects actions according to one of the two such indistinguishable strategies. Thus, the learner will always play one of s∗p and s ∗ p̃. Now, let s ∗ p 6= s∗p̃. Then, the learner incurs a constant (non-zero) regret on any round where adversary plays according to p and learner plays s∗p, or if the adversary plays according to p̃ and learner plays s ∗ p̃. We show that in such a setting, adversary can simply play according to (p+ p̃)/2 and the learner suffers an expected regret of Ω(T ).\nAssume that the adversary selects {R1, . . . , RT } from product distribution ⊗p. Let the number of times the learner plays s∗p and s ∗ p̃ be denoted by random variables N p 1 and N p 2 respectively, where N\np shows the exclusive dependence on p. It is always true that Np1 + N p 2 = T . Moreover, let the expected per round regret be p when learner plays s∗p̃ , where the expectation is taken over the randomization of adversary. Now, assume that adversary selects {R1, . . . , RT } from product distribution ⊗p̃. The corresponding notations become N p̃1 and N p̃ 2\nand p̃. Then,\nand E(R1,...,RT )∼⊗p̃E(s1,...,sT )[Regret((s1, . . . , sT ), (R1, . . . , RT ))] = p̃ · E[N p̃ 1 ] + 0 · E[N p̃ 2 ]\nSince p and p̃ are indistinguishable from perspective of learner, E[Np1 ] = E[N p̃ 1 ] = E[N1] and E[N p 2 ] = E[N p̃ 2 ] = E[N2]. That is, the random variable denoting number of times s∗p is played by learner does not depend on adversary distribution (same for s∗p̃.). Using this fact and averaging the two expectations, we get:\nE(R1,...,RT )∼⊗p+⊗p̃2 E(s1,...,sT )[Regret((s1, . . . , sT ), (R1, . . . , RT ))] = p̃ 2 ·E[N1]+ p 2 ·E[N2] ≥ min( p 2 , p̃ 2 )·E[N1+N2] = ·T\nSince supR1,...,RT E[Regret((s1, . . . , sT ), (R1, . . . , RT ))] ≥ E(R1,...,RT )∼⊗p+⊗p̃2 E(s1,...,sT )[Regret((s1, . . . , sT ), (R1, . . . , RT ))], we conclude that for every learner algorithm, adversary has a strategy, s.t. learner suffers an expected regret of Ω(T ).\nNow, the thing left to be shown is the existence of two indistinguishable distributions p and p̃, s.t. s∗p 6= s∗p̃.\nCharacterization of indistinguishable strategies in our problem setting: Two adversary’s strategies p and p̃ will be indistinguishable, in our problem setting, if for every score vector s, the relevances of the top-ranked item, according to s, are same for relevance vector drawn from p and p̃. Since relevance vectors are restricted to be binary, mathematically, it means that ∀s, PR∼p(Rπs(1) = 1) = PR∼p̃(Rπs(1) = 1) (actually, we also need ∀s, PR∼p(Rπs(1) = 0) = PR∼p̃(Rπs(1) = 0), but due to the binary nature, PR∼p(Rπs(1) = 1) = PR∼p̃(Rπs(1) = 1) =⇒ PR∼p(Rπs(1) = 0) = PR∼p̃(Rπs(1) = 0)). Since the equality has to hold ∀s, this implies ∀j ∈ [m], PR∼p(Rj = 1) = PR∼p̃(Rj = 1) (as every item will be ranked at top by some score vector). Hence, ∀j ∈ [m], ER∼p[Rj ] = ER∼p̃[Rj ] =⇒ ER∼p[R] = ER∼p̃[R]. It can be seen clearly that the chain of implications can be reversed. Hence, ∀s, PR∼p(Rπs(1) = 1) = PR∼p̃(Rπs(1) = 1) ⇐⇒ ER∼p[R] = ER∼p̃[R].\nExplicit adversary strategies: Following from the discussion so far and Theorem 5.1, if we can show existence of two strategies p and p̃ s.t. ER∼p[R] = ER∼p̃[R], but argsort ( ER∼p [ G(R) Zm(R) ]) 6= argsort ( ER∼p̃ [ G(R) Zm(R) ]) , we are done.\nThe 8 possible relevance vectors (adversary’s actions) are (R1, R2, R3, R4, R5, R6, R7, R8) = (000, 110, 101, 011, 100, 010, 001, 111). Let the two probability vectors be: p = (0.0, 0.1, 0.15, 0.05, 0.2, 0.3, 0.2, 0.0) and p̃ = (0.0, 0.3, 0.0, 0.0, 0.15, 0.15, 0.4, 0.0). The data is provided in table format in Table. 1.\nUnder the two distributions, it can be checked that ER∼p[R] = ER∼p̃[R] = (0.45, 0.45, 0.4)>. However, ER∼p [ G(R) Zm(R) ] = (0.3533, 0.3920, 0.3226)>, but ER∼p̃ [ G(R) Zm(R) ] = (0.3339, 0.3339, 0.4000)>. Hence,\nargsort ( ER∼p [ G(R) Zm(R) ]) = [2, 1, 3]> but argsort ( ER∼p̃ [ G(R) Zm(R) ]) ∈ {[3, 1, 2]>, [3, 2, 1]>}."}], "references": [{"title": "Partial monitoring with side information", "author": ["Gábor Bartók", "Csaba Szepesvári"], "venue": "In Algorithmic Learning Theory,", "citeRegEx": "Bartók and Szepesvári.,? \\Q2012\\E", "shortCiteRegEx": "Bartók and Szepesvári.", "year": 2012}, {"title": "Partial monitoring–classification, regret bounds, and algorithms", "author": ["Gabor Bartok"], "venue": "Mathematics of Operations Research,", "citeRegEx": "Bartok,? \\Q2014\\E", "shortCiteRegEx": "Bartok", "year": 2014}, {"title": "Approximating matrix p-norms", "author": ["Aditya Bhaskara", "Aravindan Vijayaraghavan"], "venue": "In Proceedings of the twenty-second annual ACM-SIAM symposium on Discrete Algorithms,", "citeRegEx": "Bhaskara and Vijayaraghavan.,? \\Q2011\\E", "shortCiteRegEx": "Bhaskara and Vijayaraghavan.", "year": 2011}, {"title": "Multi-scale exploration of convex functions and bandit convex optimization", "author": ["Sébastien Bubeck", "Ronen Eldan"], "venue": "arXiv preprint arXiv:1507.06580,", "citeRegEx": "Bubeck and Eldan.,? \\Q2015\\E", "shortCiteRegEx": "Bubeck and Eldan.", "year": 2015}, {"title": "On the (non-) existence of convex, calibrated surrogate losses for ranking", "author": ["Clément Calauzenes", "Nicolas Usunier", "Patrick Gallinari"], "venue": "In Advances in Neural Information Processing Systems,", "citeRegEx": "Calauzenes et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Calauzenes et al\\.", "year": 2012}, {"title": "Learning to rank: from pairwise approach to listwise approach", "author": ["Zhe Cao", "Tao Qin", "Tie-Yan Liu", "Ming-Feng Tsai", "Hang Li"], "venue": "In Proceedings of the 24th International conference on Machine learning,", "citeRegEx": "Cao et al\\.,? \\Q2007\\E", "shortCiteRegEx": "Cao et al\\.", "year": 2007}, {"title": "Regret minimization under partial monitoring", "author": ["Nicolo Cesa-Bianchi", "Gábor Lugosi", "Gilles Stoltz"], "venue": "Mathematics of Operations Research,", "citeRegEx": "Cesa.Bianchi et al\\.,? \\Q2006\\E", "shortCiteRegEx": "Cesa.Bianchi et al\\.", "year": 2006}, {"title": "Yahoo! learning to rank challenge overview", "author": ["Olivier Chapelle", "Yi Chang"], "venue": "Journal of Machine Learning Research-Proceedings Track,", "citeRegEx": "Chapelle and Chang.,? \\Q2011\\E", "shortCiteRegEx": "Chapelle and Chang.", "year": 2011}, {"title": "Gradient descent optimization of smoothed information retrieval metrics", "author": ["Olivier Chapelle", "Mingrui Wu"], "venue": "Information retrieval,", "citeRegEx": "Chapelle and Wu.,? \\Q2010\\E", "shortCiteRegEx": "Chapelle and Wu.", "year": 2010}, {"title": "Large margin optimization of ranking measures", "author": ["Olivier Chapelle", "Quoc Le", "Alex Smola"], "venue": "In NIPS Workshop: Machine Learning for Web Search,", "citeRegEx": "Chapelle et al\\.,? \\Q2007\\E", "shortCiteRegEx": "Chapelle et al\\.", "year": 2007}, {"title": "Online ranking with top-1 feedback", "author": ["Sougata Chaudhuri", "Ambuj Tewari"], "venue": "In Proceedings of the 18th International Conference on Artificial Intelligence and Statistics,", "citeRegEx": "Chaudhuri and Tewari.,? \\Q2015\\E", "shortCiteRegEx": "Chaudhuri and Tewari.", "year": 2015}, {"title": "Subset ranking using regression", "author": ["David Cossock", "Tong Zhang"], "venue": "In Conference on Learning theory,", "citeRegEx": "Cossock and Zhang.,? \\Q2006\\E", "shortCiteRegEx": "Cossock and Zhang.", "year": 2006}, {"title": "Statistical analysis of bayes optimal subset ranking", "author": ["David Cossock", "Tong Zhang"], "venue": "Information Theory, IEEE Transactions on,", "citeRegEx": "Cossock and Zhang.,? \\Q2008\\E", "shortCiteRegEx": "Cossock and Zhang.", "year": 2008}, {"title": "Online convex optimization in the bandit setting", "author": ["Abraham D Flaxman", "Adam Tauman Kalai", "H Brendan McMahan"], "venue": "In Proceedings of the sixteenth annual ACM-SIAM symposium on Discrete algorithms,", "citeRegEx": "Flaxman et al\\.,? \\Q2005\\E", "shortCiteRegEx": "Flaxman et al\\.", "year": 2005}, {"title": "On multilabel classification and ranking with bandit feedback", "author": ["Claudio Gentile", "Francesco Orabona"], "venue": "The Journal of Machine Learning Research,", "citeRegEx": "Gentile and Orabona.,? \\Q2014\\E", "shortCiteRegEx": "Gentile and Orabona.", "year": 2014}, {"title": "Balancing exploration and exploitation in listwise and pairwise online learning to rank", "author": ["Katja Hofmann", "Shimon Whiteson", "Maarten de Rijke"], "venue": "Information Retrieval,", "citeRegEx": "Hofmann et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Hofmann et al\\.", "year": 2013}, {"title": "Optimizing search engines using clickthrough data", "author": ["Thorsten Joachims"], "venue": "In Proceedings of the 8th ACM SIGKDD,", "citeRegEx": "Joachims.,? \\Q2002\\E", "shortCiteRegEx": "Joachims.", "year": 2002}, {"title": "The value of knowing a demand curve: Bounds on regret for online posted-price auctions", "author": ["Robert Kleinberg", "Tom Leighton"], "venue": "In Foundations of Computer Science,", "citeRegEx": "Kleinberg and Leighton.,? \\Q2003\\E", "shortCiteRegEx": "Kleinberg and Leighton.", "year": 2003}, {"title": "Learning to rank for information retrieval", "author": ["Tie-Yan Liu"], "venue": "Springer Science & Business Media,", "citeRegEx": "Liu.,? \\Q2011\\E", "shortCiteRegEx": "Liu.", "year": 2011}, {"title": "Discrete prediction games with arbitrary feedback and loss", "author": ["Antonio Piccolboni", "Christian Schindelhauer"], "venue": "In COLT,", "citeRegEx": "Piccolboni and Schindelhauer.,? \\Q2001\\E", "shortCiteRegEx": "Piccolboni and Schindelhauer.", "year": 2001}, {"title": "Learning diverse rankings with multiarmed bandits", "author": ["Filip Radlinski", "Robert Kleinberg", "Thorsten Joachims"], "venue": "In Proceedings of the 25th international conference on Machine learning,", "citeRegEx": "Radlinski et al\\.,? \\Q2008\\E", "shortCiteRegEx": "Radlinski et al\\.", "year": 2008}, {"title": "On NDCG consistency of listwise ranking methods", "author": ["Pradeep Ravikumar", "Ambuj Tewari", "Eunho Yang"], "venue": "In Proceedings of the 14th International Conference on Artificial Intelligence and Statistics,", "citeRegEx": "Ravikumar et al\\.,? \\Q2011\\E", "shortCiteRegEx": "Ravikumar et al\\.", "year": 2011}, {"title": "Test collection based evaluation of information retrieval systems, volume 13", "author": ["Mark Sanderson"], "venue": "Now Publishers Inc,", "citeRegEx": "Sanderson.,? \\Q2010\\E", "shortCiteRegEx": "Sanderson.", "year": 2010}, {"title": "A cross-benchmark comparison of 87 learning to rank methods", "author": ["Niek Tax", "Sander Bockting", "Djoerd Hiemstra"], "venue": "Information Processing and Management,", "citeRegEx": "Tax et al\\.,? \\Q2015\\E", "shortCiteRegEx": "Tax et al\\.", "year": 2015}, {"title": "Interactively optimizing information retrieval systems as a dueling bandits problem", "author": ["Yisong Yue", "Thorsten Joachims"], "venue": "In Proceedings of the 26th ICML.,", "citeRegEx": "Yue and Joachims.,? \\Q2009\\E", "shortCiteRegEx": "Yue and Joachims.", "year": 2009}, {"title": "A support vector method for optimizing average precision", "author": ["Yisong Yue", "Thomas Finley", "Filip Radlinski", "Thorsten Joachims"], "venue": "In Proceedings of ACM SIGIR,", "citeRegEx": "Yue et al\\.,? \\Q2007\\E", "shortCiteRegEx": "Yue et al\\.", "year": 2007}, {"title": "Online convex programming and generalized infinitesimal gradient ascent", "author": ["Martin Zinkevich"], "venue": "In Proceedings of the 20th International Conference on Machine Learning", "citeRegEx": "Zinkevich.,? \\Q2003\\E", "shortCiteRegEx": "Zinkevich.", "year": 2003}], "referenceMentions": [{"referenceID": 18, "context": ", rankers are trained on batch data consisting of instances and labels [Liu, 2011].", "startOffset": 71, "endOffset": 82}, {"referenceID": 22, "context": "In certain applications, such as deploying a new web app or developing a custom search engine, collecting large amount of training data might not be possible at all [Sanderson, 2010].", "startOffset": 165, "endOffset": 182}, {"referenceID": 16, "context": "Moreover, a clicked item might not actually be relevant to the user and there is also the problem of bias towards top ranked items in inferring feedback from user clicks [Joachims, 2002].", "startOffset": 170, "endOffset": 186}, {"referenceID": 10, "context": "Our work extends the work of Chaudhuri and Tewari [2015], by combining query-level ranking, in an online manner, with explicit but restricted feedback.", "startOffset": 29, "endOffset": 57}, {"referenceID": 5, "context": ", the cross entropy surrogate in ListNet [Cao et al., 2007] and hinge surrogate in RankSVM [Joachims, 2002], instead of discontinuous ranking measures like NDCG, AP, or ERR because the latter lead to intractable optimization problems.", "startOffset": 41, "endOffset": 59}, {"referenceID": 16, "context": ", 2007] and hinge surrogate in RankSVM [Joachims, 2002], instead of discontinuous ranking measures like NDCG, AP, or ERR because the latter lead to intractable optimization problems.", "startOffset": 39, "endOffset": 55}, {"referenceID": 12, "context": "The convex surrogates considered are from three major learning to ranking methods: squared loss from a pointwise method [Cossock and Zhang, 2008], hinge loss used in the pairwise RankSVM [Joachims, 2002] method, and (modified) cross-entropy surrogate used in the listwise ListNet [Cao et al.", "startOffset": 120, "endOffset": 145}, {"referenceID": 16, "context": "The convex surrogates considered are from three major learning to ranking methods: squared loss from a pointwise method [Cossock and Zhang, 2008], hinge loss used in the pairwise RankSVM [Joachims, 2002] method, and (modified) cross-entropy surrogate used in the listwise ListNet [Cao et al.", "startOffset": 187, "endOffset": 203}, {"referenceID": 5, "context": "The convex surrogates considered are from three major learning to ranking methods: squared loss from a pointwise method [Cossock and Zhang, 2008], hinge loss used in the pairwise RankSVM [Joachims, 2002] method, and (modified) cross-entropy surrogate used in the listwise ListNet [Cao et al., 2007] method.", "startOffset": 280, "endOffset": 298}, {"referenceID": 8, "context": "The non-convex surrogate considered is the SmoothDCG surrogate [Chapelle and Wu, 2010].", "startOffset": 63, "endOffset": 86}, {"referenceID": 21, "context": "The convex surrogates we mentioned above are widely used but are known to fail to be calibrated with respect to NDCG [Ravikumar et al., 2011].", "startOffset": 117, "endOffset": 141}, {"referenceID": 19, "context": "The proof for this rather surprising result is non-trivial and relies on exploiting a connection between the construction of optimal adversary strategies for hopeless finite action partial monitoring games [Piccolboni and Schindelhauer, 2001] and the structure of NDCG calibrated surrogates.", "startOffset": 206, "endOffset": 242}, {"referenceID": 4, "context": "We only focus on NDCG calibrated surrogates for the impossibility results since no (convex) surrogate can be calibrated for AP and ERR [Calauzenes et al., 2012].", "startOffset": 135, "endOffset": 160}, {"referenceID": 11, "context": "Pointwise Method: We will construct the unbiased estimator of the gradient of squared loss [Cossock and Zhang, 2006]: φsq(s,R) = ‖s − R‖2.", "startOffset": 91, "endOffset": 116}, {"referenceID": 16, "context": "Pairwise Method: We will construct the unbiased estimator of the gradient of hinge-like surrogate in RankSVM [Joachims, 2002]: φsvm(s,R) = ∑ i 6=j=1 1(Ri > Rj) max(0, 1 + sj − si).", "startOffset": 109, "endOffset": 125}, {"referenceID": 5, "context": "We will focus on the cross-entropy surrogate used in the highly cited ListNet [Cao et al., 2007] ranking algorithm and show how a very natural modification to the surrogate makes its gradient estimable in our partial feedback setting.", "startOffset": 78, "endOffset": 96}, {"referenceID": 8, "context": "We choose the SmoothDCG surrogate given in [Chapelle and Wu, 2010], which has been shown to have very competitive empirical performance.", "startOffset": 43, "endOffset": 66}, {"referenceID": 8, "context": "SmoothDCG, like ListNet, defines a family of surrogates, based on the cut-off point of DCG (see original paper [Chapelle and Wu, 2010] for details).", "startOffset": 111, "endOffset": 134}, {"referenceID": 26, "context": "The underlying deterministic part of our algorithm is online gradient descent (OGD) [Zinkevich, 2003].", "startOffset": 84, "endOffset": 101}, {"referenceID": 13, "context": "1 of [Flaxman et al., 2005], in our problem setting is:", "startOffset": 5, "endOffset": 27}, {"referenceID": 2, "context": "To get bound on Et‖z̃t‖2, we used the following norm relation that holds for any matrix X [Bhaskara and Vijayaraghavan, 2011]: ‖X‖p→q = sup v 6=0 ‖Xv‖q ‖v‖p , where q", "startOffset": 90, "endOffset": 125}, {"referenceID": 3, "context": "For bandit online convex optimization problems with Lipschitz, convex surrogates, the best regret rate known so far, that can be achieved by an efficient algorithm, is O(T ) (however, see the work of Bubeck and Eldan [2015] for a non-constructive O(log(T ) √ T ) bound).", "startOffset": 200, "endOffset": 224}, {"referenceID": 21, "context": "We focus on NDCG calibrated surrogates (both convex and non-convex) that have been characterized by Ravikumar et al. [2011]. We first state the necessary and sufficient condition for a surrogate to be calibrated w.", "startOffset": 100, "endOffset": 124}, {"referenceID": 21, "context": "We focus on NDCG calibrated surrogates (both convex and non-convex) that have been characterized by Ravikumar et al. [2011]. We first state the necessary and sufficient condition for a surrogate to be calibrated w.r.t NDCG. For any score vector s and distribution η on relevance space Y, let φ̄(s, η) = ER∼ηφ(s,R). Moreover, we define G(R) = (G(R1), . . . , G(Rm)) >. Theorem 5.1. [Ravikumar et al., 2011, Thm. 6] A surrogate φ is NDCG calibrated iff for any distribution η on relevance space Y, there exists an invertible, order preserving map g : R 7→ R s.t. the unique minimizer sφ(η) can be written as sφ(η) = g ( ER∼η [ G(R) Zm(R) ]) . (8) Informally, Eq. 8 states that argsort(sφ(η)) ⊆ argsort(ER∼η [ G(R) Zm(R) ] ) Ravikumar et al. [2011] give concrete examples of NDCG calibrated surrogates, including how some of the popular surrogates can be converted into NDCG calibrated ones: e.", "startOffset": 100, "endOffset": 746}, {"referenceID": 19, "context": "(Sketch) The proof builds on the proof of hopeless finite action partial monitoring games given by Piccolboni and Schindelhauer [2001]. An examination of their proof of Thm.", "startOffset": 99, "endOffset": 135}, {"referenceID": 19, "context": "3 of Piccolboni and Schindelhauer [2001] cannot be directly extended to prove the impossibility result because it relies on constructing a connected graph on vertices defined by neighboring actions of learner.", "startOffset": 5, "endOffset": 41}, {"referenceID": 23, "context": "ListNet is not only one of the most cited ranking algorithms (over 700 citations according to Google Scholar), but also one of the most validated algorithms [Tax et al., 2015].", "startOffset": 157, "endOffset": 175}, {"referenceID": 7, "context": "They were Yahoo’s Learning to Rank Challenge dataset [Chapelle and Chang, 2011] and a dataset published by Russian search engine Yandex [IM-2009].", "startOffset": 53, "endOffset": 79}], "year": 2016, "abstractText": "We consider an online learning to rank setting in which, at each round, an oblivious adversary generates a list of m documents, pertaining to a query, and the learner produces scores to rank the documents. The adversary then generates a relevance vector and the learner updates its ranker according to the feedback received. We consider the setting where the feedback is restricted to be the relevance levels of only the top k documents in the ranked list for k m. However, the performance of learner is judged based on the unrevealed full relevance vectors, using an appropriate learning to rank loss function. We develop efficient algorithms for well known losses in the pointwise, pairwise and listwise families. We also prove that no online algorithm can have sublinear regret, with top-1 feedback, for any loss that is calibrated with respect to NDCG. We apply our algorithms on benchmark datasets demonstrating efficient online learning of a ranking function from highly restricted feedback.", "creator": "LaTeX with hyperref package"}}}