{"id": "1611.02337", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "7-Nov-2016", "title": "Balotage in Argentina 2015, a sentiment analysis of tweets", "abstract": "Twitter created distribution contains but large amount brought information generated by but users. That web entire roles from answers it cautioned that may reflect realities in creation perceived. There where me entire strong when it both possible to identify view of comments geared means however is important by a lot of families direction. To determine nor two or still written words income the even address, measurement Natural Language Processing (NLP) could make. This paper proposes a observational full polls signs in Twitter but 's use over fundamentals review vector NLP company another social behaviors. The case study however nationally on 2015 Presidential followed Argentina, like a digital architecture Big Data recorded Vertica measured one followed way input by Pulse in used. Through held effectiveness making was affect directly can rise on voting intentions time regard give held president candidates, essential bring assumptions 1999 predicting that importance now traditional create accurate.", "histories": [["v1", "Mon, 7 Nov 2016 23:05:40 GMT  (1046kb)", "http://arxiv.org/abs/1611.02337v1", "in Spanish. Jornadas de Cloud Computing, La Plata - Argentina. 2016"]], "COMMENTS": "in Spanish. Jornadas de Cloud Computing, La Plata - Argentina. 2016", "reviews": [], "SUBJECTS": "cs.IR cs.CL cs.SI", "authors": ["daniel robins", "fernando emmanuel frati", "jonatan alvarez", "jose texier"], "accepted": false, "id": "1611.02337"}, "pdf": {"name": "1611.02337.pdf", "metadata": {"source": "CRF", "title": "Balotage in Argentina 2015, a sentiment analysis of tweets (Balotaje Argentina 2015 a partir de un análisis de sentimiento de tweets)", "authors": ["Daniel Robins", "Fernando Emmanuel Frati", "Jonatan Alvarez", "Jose Texier"], "emails": ["daniel.robins@kunan.com.ar,", "fefrati@undec.edu.ar,", "jonatan.alvarez@kunan.com.ar,", "jtexier@undec.edu.ar"], "sections": [{"heading": null, "text": "Resumen La red social Twitter contiene una gran cantidad de información generada por sus usuarios. Esa información está compuesta de opiniones y comentarios que pueden reflejar tendencias de comportamientos sociales. Se habla de tendencia cuando es posible identificar opiniones y comentarios orientadas hacia la misma dirección compartidas por una gran cantidad de personas. Para determinar si dos o más opiniones escritas comparten una misma dirección, se utilizan técnicas de Procesamiento de Lenguaje Natural (PLN). Este trabajo propone una metodología de predicción de comportamientos sociales reflejados en Twitter a partir del uso de funciones de análisis de sentimientos basadas en PLN. El caso de estudio seleccionado fue el Balotaje Presidencial de Argentina 2015, y se utilizó una arquitectura de software de Big Data compuesta por la base de Datos Vertica con el componente llamado Pulse. A través del análisis realizado fue posible detectar la tendencia en intención de voto con respecto a los candidatos presidenciales, consiguiendo mayor precisión en la predicción que la alcanzada con sistemas de encuestas tradicionales. Palabras clave: PLN, Process Language Natural, Sentiment Analysis, Survey, Big Data, Ballotage, 2015, Argentina, Vertica, Pulse\n1. Introducción La necesidad de administrar grandes volúmenes de información no estructurada (heterogénea) es un tema que en la actualidad está en crecimiento (Canuto 2016). Evidencia de ello es el auge de los dispositivos móviles, sensores, aplicaciones de Internet, como así también empresas u organismos estatales, todos producen información digital. Con base en lo anterior, se denomina Big Data (BD) a la tecnología que permite procesar grandes volúmenes de datos en poco tiempo (Rajaraman, 2011). Por ello, el procesamiento y posterior análisis de los datos y/o información debe ser realizado preferiblemente en tiempo real para poder mejorar la toma de decisiones con base en la información generada. La caracterización típica de un problema de Big Data es si cumple con un gran volumen, con variedad de fuentes (tanto estructuradas o no), requiere velocidad y frecuencia de las actualizaciones y con veracidad de la información (tascon2013 ). 1\nActualmente, Big Data se encuentra en un gran crecimiento debido a que las diversas áreas de las instituciones y/o empresas necesitan de los servicios que se pueden generar a partir de este tratamiento dinámico de la información, que por lo general se encuentra digital (Yang Yu 2015 / Sayan Unankard 2014 / Varsha Sahayak 2015). Por ello, el análisis de sentimientos (AS) a través de los datos de Twitter (tweets) bajo el enfoque de BD, cubre un nicho de investigación que está creciendo y que permite hacer propuestas metodológicas para problemas actuales y futuros. El AS ha sido estudiado desde principios de la década del 2000 con trabajos con enfoques basados en la polaridad ((Pang, Lee, y Vaithyanathan, 2002)Turney, 2002 / Cotelo 2013), ya que el AS es visto como sentencias o palabras que representan una opinión o perspectiva que puede ser evaluada como positiva, negativa, neutral o ilegible (Mike Thelwall 2011, 2012 / Agarwal 2011 / M. Ghiassi 2013). Igualmente, el hecho de poder encontrar las orientaciones semánticas sobre palabras o frases (tweets) en tiempo real a través de una red social de microblogging (Twitter), nos lleva a tomar consideraciones sobre la gramática y códigos propios de la red como los emoticonos (emoticons), etiquetas (hashtags), menciones (mentions), abreviaturas, jergas, entre otros (Agarwal 2011 / Varsha Sahayak 2015 / Johan Bollen 2011).\n1 Tascón, M. \"Introducción: Big Data. Pasado, presente y futuro - Dialnet.\" 2013. <https://dialnet.unirioja.es/servlet/articulo?codigo=4423775>\nLa base del análisis de sentimientos de mensajes no estructurados, generalmente está centrada en el análisis semántico y por ende, en las técnicas clásicas de procesamiento de lenguaje natural (PLN). Es importante destacar que los tweets (además de cualquier otra información disponible) se pueden analizar también de las siguientes maneras: extracción de información basada en ontologías, minería de datos, clasificadores, técnicas de aprendizaje automático, entre otras(Cotelo 2013) . Muchos trabajos continúan usando estas 2 técnicas, combinaciones de ellas y generando nuevas propuestas sobre este dominio (Liu, 2012). Esta época donde las relaciones sociales, culturales y económicas se encuentran fuertemente atravesadas por las Tecnologías de la Información y las Comunicaciones (TIC), ha dado lugar a las denominadas sociedades de la información y el conocimiento (Murua 2014. Meirinhos 2009 ). Una expresión importante de este 3 fenómeno son las redes sociales Twitter, Facebook, Instagram, Snapchat, Whatsapp, entre otras (Garcia 2006, Arguelles 2013 ). En este contexto, las redes sociales que originalmente fueron pensadas como 4 aplicaciones para distracción, comienzan a tener cada vez más presencia en otros ámbitos, ya que hoy es posible utilizar los datos que circulan a través de ellas para transformarlos en información de relevancia y utilidad sobre tendencias de consumo, pensamientos políticos, ideologías, preferencias y costumbres (Gil 2012, Lorca 2008, Miguel 2013 ). Muchos de estos datos se encuentran disponibles para ser analizados y 5 existen herramientas que pueden comprender el lenguaje natural, caracterizarlo y sistematizarlo (ronchetti 2016 ). 6\nEn la comunidad científica existen antecedentes relacionados con este trabajo, donde se ha implementado análisis de opinión de los datos a partir de las redes sociales. Estos casos han sido utilizados en predicciones políticas y toma de decisiones para candidaturas políticas como las elecciones de Andalucía 2012 (Deltell 2013), campañas electorales en Estados Unidos 2012 e Italia 2012 (Ceron 2015) y Australia 2013 (Unankard 2014). En estos casos, las técnicas empleadas en el desarrollo de encuestas desde la base del análisis de datos de las redes sociales, representan una importante reducción de costos, tiempos, confección del cuestionario, diseño de muestras, testing del proceso, capacitación de los encuestadores y mejora de la gestión de la información, comparado con el enfoque tradicional de encuestas (Agudelo, Thayer-Hart 2010). Por tanto, para el procesamiento de los datos de Twitter en este trabajo se usó la base de datos columnar Vertica que provee un componente de software para el análisis de sentimientos llamando Pulse, siendo una iniciativa diferente a las propuestas tradicionales. El desarrollo realizado propone una metodología de predicción sobre comportamientos sociales basada en análisis de sentimientos de tweets. El caso de estudio fue el Balotaje Presidencial de Argentina 2015 donde se utilizaron los datos que se generaron en Twitter, con el objetivo de predecir el resultado real de la elección. Este trabajo se organiza de la siguiente forma: en la sección 2 se describe de manera general el caso de\n2Pla http://journal.sepln.org/sepln/ojs/ojs/index.php/pln/article/view/5218/3022 3 Cacheiro, M., Murua I., Gallego, D., (2015)Caracterización de las cibercomunidades de aprendizaje Meirinhos, M., Osorio, A., (2009) Las comunidades virtuales de aprendizaje: el papel central de la colaboración 4 García, Las redes sociales como herramientas para el aprendizaje colaborativo: una experiencia con Facebook Arguelles, Las redes sociales y su aplicación en la educación. Revista Digital Universitaria 5 Gil, , Redes sociales educativas como introducción a los entornos sociales de aprendizaje Lorca, J., & Pujol, L. (2008). Redes Sociales: descripción del fenómeno, situación actual y perspectivas Miguel ,V. (2013). Redes Sociales y Construcción del Conocimiento 6 \"Handshape recognition for Argentinian Sign Language using ... - SeDiCI.\" 2016. 12 May. 2016 <http://sedici.unlp.edu.ar/handle/10915/52376>\nestudio seleccionado; la sección 3 presenta la configuración experimental empleada; la sección 4 muestra los resultados generales del trabajo. Finalmente, la sección 5 presenta las conclusiones del trabajo."}, {"heading": "2. Descripción del caso de estudio", "text": "La República Argentina, país de 40.117.096 habitantes, según el censo de 2010, se encuentra en el hemisferio sur del continente Americano y está dividida en 24 provincias. En el marco del Balotaje de las elecciones presidenciales 2015 se condujo un estudio de corte transversal que incluyó 12.463.657 de tweets con una localización en el mismo país (ubicación geográfica del usuario de Twitter). Una muestra de los tweets, el analisis de sentimiento de cada tweets y la localizacion, se encuentran en Zenodo (https://zenodo.org/record/51496 ). Con esta información se puede validar el trabajo realizado. Se utilizó análisis de sentimiento de textos, mediante el procesamiento de lenguaje natural desarrollando en un componente de software llamado Pulse, que incorpora Vertica (base de datos columnar y analítica). Para este fin se recolectaron los tweets en la base de datos referidos a las elecciones presidenciales desde el 5 al 25 de noviembre del 2015. Posteriormente, se calculó el análisis de sentimiento sólo de los tweets obtenidos hasta el 22 de noviembre de 2015 a las 17:59:59 de Argentina, fecha y hora de finalización del comicio electoral. Los atributos se categorizaron, dándoles a los tweets los siguientes valores: positivo (1) para comentarios a favor del candidato, negativo (-1) en comentarios en contra del candidato y neutro (0) con comentarios que no están a favor de ninguno de los candidatos. Los candidatos eran Mauricio Macri y Daniel Scioli. Finalmente se contrastó el cálculo de sentimiento positivo para cada uno de los candidatos con el resultado electoral oficial, para determinar relaciones, tanto a nivel nacional como por provincias, verificando los resultados por provincias al utilizar la ubicación geográfica del usuario de Twitter."}, {"heading": "3. Configuración Experimental", "text": ""}, {"heading": "3.1. Arquitectura", "text": "La Figura 1 describe la arquitectura de software empleada para la investigación, donde se utilizó la API de Twitter a través del Agente Apache Flume de Hadoop (AAF - Apache-flume-1.3.1). Este agente carga los tweets en la base de datos columnar Vertica (Vertica Analytic Database v7.1.2-0). Luego esta información es analizada con funciones analíticas de Vertica (Vertica-pulse-7.1.2-0) y la visualización de los resultados se realizan con la herramienta Tableau (Tableau 9.1). Finalmente, se utilizó el software Stata 14 MP para un análisis de correlación de los datos(STATA).\nFigura 1. Arquitectura de la solución"}, {"heading": "3.2. Estructuras de Datos", "text": "La estructura de datos definida se compone de siete tablas y tres vistas, resumidas en la Tabla 1. El detalle de las tres principales tablas se puede observar en la Figura 2.\nEstructura de datos\nTipo Descripción\ntweets tabla Contiene los datos obtenidos de la API de Twitter.\ntweet_sentiment tabla Contiene el cálculo de sentimiento para cada párrafo del tweet.\nlocalidades\ntabla Contiene la relación entre el campo “user.location” de la tabla tweets con respecto a la provincia y país indicada por el usuario de Twitter.\nwhite_list_es\ntabla Contiene los atributos sobre los cuales se analiza el sentimiento en los tweets mediante el lenguaje castellano.\nnormalization_es\ntabla Contiene sinónimos de los atributos definidos en la tabla “white_list_es”.\npos_word_es\ntabla Palabras que se las consideran positivas.\nneg_word_es\ntabla Palabras que se las consideran positivas.\nv_tweets_score vista Calcula el score de cada tweet, sumando el resultado de cada párrafo.\nv_tweets_candidato s\nvista Determina si el tweet nombra a uno de los dos candidatos.\nv_sentiment_analisi s vista Cuenta los tweets positivos, negativos o neutros por candidato, detallando el conteo por país y provincia.\nTabla 1. Estructura de datos empleada. De particular interés es el campo \"text\" de la tabla \"tweets\" ya que contiene los datos utilizados para calcular el sentimiento del tweet. Otro campo importante de esta tabla es \"user.location\" dado que se utilizará para relacionar el tweet con los resultados provinciales (ubicación geográfica). Debido a que un \"tweet\" puede estar formado por uno o más párrafos, la tabla \"tweet_sentiment\" contiene el cálculo de sentimiento asignado a cada párrafo del tweet en el campo \"sentiment_score\". Por ello, la vista \"v_tweets_score\" se utiliza para ponderar el sentimiento general del tweet a partir de la suma de sentimientos de sus párrafos: si la suma da por resultado un valor positivo, cero o negativo se le asignará el valor 1, 0 o -1 respectivamente al tweet en cuestión. La Figura 3 muestra el código de la consulta que genera la vista.\nFigura 2. Descripción de Tablas\nPara determinar a qué candidato corresponde el sentimiento de cada tweet se utiliza la vista \"v_tweets_candidatos\". A través de esta vista se asigna al tweet los valores \"Scioli\", \"Macri\" \"Scioli-Macri\" o \"Sin Candidato\" en función del nombramiento del candidato, de los candidatos o de ninguno en el tweet. En la Figura 4 se muestra el código de la vista.\nLas tablas \"white_list_es\", \"normalization_es\", \"pos_word_es\" y \"neg_word_es\" forman parte de la herramienta Pulse y serán descritas posteriormente en la sección \"Configuración de los diccionarios de Pulse\".\nLa figura 5 describe la vista con los resultados por provincia, esta vista se utilizó para visualizar los datos en la herramienta Tableau"}, {"heading": "3.3. Metodología", "text": "La metodología empleada consiste en tres procesos o tareas simultáneas que se repitieron hasta finalizar el balotaje: ● Obtención de la información ● Cálculo de sentimientos ● Visualización de resultado Una vez escrutado el comicio se realizó el análisis confirmatorio estadístico, mediante análisis de correlación de las variables de tweets por cada candidato y los votos de la elección. Obtención de la información Dado que la captura de la información se realizó utilizando el Agente Apache Flume (AAF), la primera actividad fue definir la configuración del mismo. Esto significó indicarle a AAF cuáles hashtags, palabras clave y cuentas de twitter a seguir, para obtener toda la información de la temática de interés. Para\ndeterminar esos valores se realizó un estudio previo sobre tweets referidos a las elecciones, considerando las tendencias, trending topics y las cuentas de Twitter de los principales candidatos, medios digitales y programas de televisión políticos. Sin embargo, esta información fue actualizada periódicamente a medida que se avanzó con el trabajo. La Figura 6 muestra parte de la configuración del AAF al finalizar los comicios. En particular, la configuración de las propiedades \"TwitterAgent.sources.Twitter.keywords\" y \"TwitterAgent.sources.Twitter.follow\" de la configuración de AAF.\nFigura 6. Configuración del Agente Apache Flume\nPor otro lado, entre los datos que entrega la API de Twitter, se obtiene el dato de localidad geográfica en el campo “user.location” de la tabla tweets. Es importante destacar que esta información puede ser manipulada por el usuario de Twitter y puede no corresponder a una localidad correcta de la República Argentina, por lo cual a los efectos de relacionar las localidades con las provincias argentinas se generó una tabla denominada “localidades”. Esta tabla se usó para relacionar “user.location” con la provincia y el país. A medida que se recibían los tweets se fueron agregando registros a la tabla localidades para vincular el tweet a la provincia. La Figura 6 muestra un ejemplo de la instrucción empleada para la normalización de los datos.\ninsert into elec.localidades (\"user.location\") select \"user.location\" from elec.tweets where \"user.location\" not in (select \"user.location\" from elec.localidades) group by \"user.location\" having \"user.location\" is not null; update elec.localidades set province='Capital Federal', country='Argentina' where lower(\"user.location\") like '%caba%' and province is null; commit;\nFigura 7. Ejemplo de instrucción para la normalización de los datos de ubicación del tweet. Cálculo de sentimientos El análisis de sentimiento se realizó utilizando la herramienta Pulse de la base de datos analítica Vertica.\nPara esto es necesario configurar la herramienta insertando valores en las tablas “white_list_es”, “normalization_es”, “pos_word_es” y “neg_word_es” descritas en la Tabla 1. Los valores de esta tabla serán utilizados luego por la función de cálculo de sentimiento para clasificar los tweets en positivo (1), negativo (-1) o neutro (0). La Figura 8 muestra la configuración de atributos para este trabajo.\ndbadmin=> select * from pulse.white_list_es; standard ---------- macri scioli (2 rows)\nFigura 8. Atributos utilizados por pulse para el cálculo de sentimiento. Dado que en el texto pueden aparecer palabras o frases que identifican a los atributos sin nombrarlos, la tabla “normalization_es” se puede cargar con palabras que sean sinónimos de los atributos. La Figura 9 muestra una consulta sobre esta tabla. Por ejemplo, para indicar que la ocurrencia de palabra “#Cambiemos” en un tweet es un sinónimo de “macri”, se debe insertar el registro correspondiente en esta tabla.\ndbadmin=> select * from pulse.normalization_es; standard_base | standard_synonym ---------------+--------------------- macri | #Cambiemos macri | #CambiemosConMacri ... scioli | #CaravanaNaranja scioli | #ElDebateEnTVP scioli | #FPV (52 rows)\nFigura 9. Ejemplo de sinónimos configurados en la tabla “normalization_es”. Para determinar si el sentimiento del texto analizado es positivo o negativo, se deben cargar las tablas “pos_words_es” y “neg_words_es” con las palabras que se consideren positivas o negativas respectivamente. Pulse considerará las palabras de estas tablas influyentes en un sentido u otro sobre los textos a analizar. La Figura 10 y la Figura 11 muestran ejemplos de consultas sobre esas tablas.\ndbadmin=> select * from pulse.pos_words_es; standard ------------------------------- 678ConLaGenteAdentro Cambiemos CambiemosConMacri CaravanaNaranja … yolovotoamm\n(38 rows)\nFigura 10. Consulta sobre la tabla “pos_word_es”.\ndbadmin=> select * from pulse.neg_words_es; standard --------------------------------- 2001 90 Anibal fernandez Aníbal CampañaDeMiedo ... aumentará los impuestos (134 rows)\nFigura 11. Consulta sobre la tabla “neg_word_es”. Finalmente, el cálculo de sentimiento se realiza mediante la función de Pulse \"SentimentAnalysis()\", y sus resultados se insertan en la tabla tweet_sentiment de acuerdo con la instrucción \"insert\" descrita en la Figura 12.\ninsert into elec.tweet_sentiment (select id, \"user.screen_name\", SentimentAnalysis(text using parameters filterlinks=true,filterusermentions=false, filterhashtags=false) over (partition by id, \"user.screen_name\", text) from elec.tweets where lang='es' and created_at between to_timestamp ('2015-11-20 00:00:00','YYYY-MM-DD HH:MI:SS') and to_timestamp ('2015-11-20 23:59:59','YYYY-MM-DD HH:MI:SS')); commit;\nFigura 12. Instrucción utilizada para realizar el cálculo de sentimiento sobre los tweets. Una vez calculado el sentimiento sobre los tweets, se verifica manualmente los resultados. En caso de encontrar errores o incoherencias se ajustan las tablas de Pulse descritas anteriormente, se trunca la tabla tweet_sentiment y se repite el cálculo. Para acelerar el proceso de ajuste de los diccionarios se generó una tabla temporal con todas las palabras utilizadas en los tweets ordenadas por cantidad de ocurrencias en forma descendente y luego se agregaron a los diccionarios las palabras de mayor frecuencia identificándose como positivas o negativas. En la Figura 13 se describe el proceso realizado. Al igual que con la configuración de AAF, este proceso se repitió hasta finalizados los comicios.\ndbadmin=> create table elec.words(words varchar(500), input varchar(500)); dbadmin=> insert into elec.words SELECT TxtIndex.StringTokenizerDelim(text,' ') over() dbadmin=> from elec.tweets;\ndbadmin=> commit; dbadmin=> select words, count(*) from elec.words group by words order by 2 desc; words | count -------------------------+--------- Macri | 1899614 Argentina | 1416388 Scioli | 915487 elecciones | 565196 #MacriPresidente | 484177 @mauriciomacri: | 388416 @mauriciomacri | 357536 Mauricio | 333562 #ArgentinaDebate | 326241 todos | 266850 #Argentina | 244612 macri | 244332 presidente | 242502 #Elecciones2015 | 240109 Venezuela | 229394 #ScioliPresidente | 227044 porque | 221806 #Cambiemos | 220883 argentina | 218805 MACRI | 212296 Macri, | 207646\nFigura 13. Proceso de ajuste de configuración. Visualización Para la visualización de los datos se utilizó la herramienta Tableau. Esta herramienta permite de manera sencilla conectarse con Vertica y construir gráficos, tablas y mapas, en este caso referidos a los resultados nacionales y por provincias. Para mostrar la información en Tableau se utilizó la vista \"v_sentiment_analisis\" descrita en la Tabla 1 y Listado 3, que unifica los cálculos de sentimiento por cada tweet y los asigna a un candidato y a una provincia. En la siguiente sección se muestran los resultados finales obtenidos. Análisis confirmatorio Posteriormente se realizó un análisis de correlación para verificar la asociación entre los tweets positivos de cada candidato y los votos obtenidos en el balotaje electoral presidencial 2015."}, {"heading": "4. Resultados", "text": "En esta sección se presentan los resultados finales de aplicar la metodología descrita. Para una mejor interpretación se presentan los resultados a nivel nacional y luego a nivel provincial."}, {"heading": "4.1 Resultados nacionales", "text": "La Figura 14 muestra la consulta utilizada al cierre de los comicios. Los resultados se calcularon sobre la base de “tweets positivos” sobre cada candidato. En total, se pudieron clasificar 579.495 tweets como positivos entre ambos candidatos, de los cuales el 51.55% fue a favor del candidato Macri y el 48.44% a favor del candidato Scioli.\ndbadmin=> dbadmin=> select add_vertica_options('OPT','ENABLE_WITH_CLAUSE_MATERIALIZATION'); add_vertica_options --------------------- Options Set (1 row) dbadmin=> with res as (select c.candidato, dbadmin(> case s.sentiment_score when 1 then 'Positivo' when -1 then 'Negativo' else 'Neutro' end sentimiento, dbadmin(> count(*) cantidad dbadmin(> from elec.tweets t inner join elec.v_tweets_candidatos c on (t.id=c.id) dbadmin(> inner join elec.localidades l on (l.\"user.location\"=t.\"user.location\") dbadmin(> inner join elec.v_tweets_score s on (t.id=s.id) dbadmin(> where c.candidato in ('Scioli','Macri') and s.sentiment_score=1 dbadmin(> group by c.candidato, s.sentiment_score) dbadmin-> dbadmin-> select candidato, sentimiento, cantidad , cantidad*100/(select sum(cantidad) from res) porcentaje dbadmin-> from res; candidato | sentimiento | cantidad | porcentaje -----------+-------------+----------+----------------------- Macri | Positivo | 298746 | 51.552817539409313281 Scioli | Positivo | 280749 | 48.447182460590686719 (2 rows)\nFigura 14. Consulta y resultados obtenidos al finalizar los comicios.\nDel total de 12.463.657 de tweets, se utilizaron para el cálculo de los porcentajes 579.495 ya que solo se tuvo en cuenta para este estudio los tweets catalogados como positivos donde el texto del tweet nombro solo a uno de los dos candidatos, descartando en este caso los cálculos de sentimiento negativos y neutros. Otra de las consideraciones para el cálculo del resultado fue que el cálculo de sentimiento se realizó solo hasta la hora del cierre del comicio, descartando los tweets posteriores. Por otro lado la Figura 15 muestran los resultados oficiales publicados por la comisión electoral el día 25 de noviembre de 2015, tres días después de las elecciones.\nFigura 15. Resultados publicados por la comisión electoral\nEs de interés destacar que el margen de error de los resultados calculados al cierre del balotaje en este trabajo con respecto a los resultados oficiales fue aproximadamente de 0.16 puntos porcentuales. Por último, la Figura 16 muestra las predicciones realizadas por los encuestadores de opinión tradicionales. En este caso, todos ellos tuvieron un margen de error a nivel nacional mayor que el de nuestro estudio.\nFigura 16. Encuestas de intención de voto. Fuente: http://balotaje2015.com/encuestas/"}, {"heading": "4.2 Tweets positivos por provincia por cada candidato", "text": "Un segundo análisis buscando relacionar los resultados de acuerdo con la ubicación del tweet sobre las provincias que componen el territorio argentino, determinó que en 16 provincias de 24, la predicción\nrealizada coincidió con los resultados oficiales, La Figura 17 muestra la descomposición por provincias realizada con la herramienta Tableau, mientras que la Figura 18 muestra los resultados oficiales publicados por la comisión electoral. Es importante aclarar que del total de 579.495 tweets positivos para un candidato u otro, solo se pudieron relacionar con las provincias un 55.02%, es decir, 318.857 tweets. Esto se debe a que en el proceso de normalización geográfica no se pudieron relacionar todos los datos de localización “tweets.user.location” con la provincia.\nFigura 17. Resultados de análisis de sentimiento discriminados por provincias\nFigura 18. Resultados oficiales discriminados por provincias\nEn el Cuadro 2 se muestran los resultados del análisis de sentimiento positivo por provincia, y la relación entre la cantidad de tweets analizados (tweets positivos), los votos escrutados (votos) y la población Argentina en el censo 2010 (población). Como se puede observar el 44,98% de los datos, “Sin Provincia”, no pudieron normalizarse. Si bien en 16 de las 24 provincias el resultado del análisis de tweets coincide con el resultado de la elección, los porcentajes de 10 de las provincias, Córdoba, Salta, Capital Federal, Tierra del Fuego, Mendoza, Tucumán, Entre Ríos, Misiones, La Rioja y Santiago del Estero, muestran diferencias de más de 5 puntos entre el resultado de análisis de sentimiento y la elección (“% tweets por prov” y “% votos por prov”). En la mayoría de las provincias se nota una proporcionalidad de la cantidad de tweets recolectados con respecto al porcentaje total de la población y de votantes, salvo en Capital Federal, donde el porcentaje del total de los votos es del 7,72% y el porcentaje de tweets respecto al total es de tan solo el 0,42%.\nCuadro 2 . Relación entre la población y los tweets analizados por provincia\n4.3 Análisis de Correlación entre las variables El análisis de correlación verificó una asociación significativa entre los tweets positivos de cada candidato y los votos obtenidos en el balotaje electoral (resultados oficiales). Para los candidatos Macri y Scioli los coeficiente de correlación entre los tweets positivos y sus votos en el escrutinio fueron de 0.95 (p = 0,0001) y 0,98 (p = 0,00001), respectivamente."}, {"heading": "5. Conclusiones", "text": "Mediante el estudio realizado se ha logrado predecir el resultado electoral oficial a nivel nacional con una\ndiferencia del 0,16%. Sin embargo, a nivel de agregación provincial, este porcentaje se incrementa, probablemente por la incapacidad de obtener el dato de localidad en forma confiable desde la API de Twitter, la cual impide establecer la relación entre la localización geográfica del usuario de twitter y la provincia. Así, las herramientas utilizadas en este trabajo (Big Data, el análisis de sentimiento, datos de redes sociales), se encuentran en evolución permanente, por lo que continuar esta línea de investigación sería de gran trascendencia e importancia para diferentes campos laborales y ciencias, que pueden verse favorecidos por su utilización. Son necesarias futuras investigaciones para optimizar, actualizar y sistematizar los mecanismos utilizados en la presente investigación.\n6. Referencias\n● SURVEY FUNDAMENTALS A GUIDE TO DESIGNING AND IMPLEMENTING SURVEY de la University of Wisconsin Survey Center, December 2010, Nancy Thayer-Hart, Office of Quality Improvement Jennifer Dykema, Kelly Elver, Nora Cate Schaeffer, John Stevenson https://oqi.wisc.edu/resourcelibrary/uploads/resources/Survey_Guide.pdf ● Agudelo, G., Ruiz Restrepo, J., & Aigneren, M. (2010). Metodología de las encuestas telefónicas http://hdl.handle.net/10495/2685 ● METODOLOGÍA DE LAS ENCUESTAS TELEFONICAS de Gabriel Agudelo; Jaime Ruiz Restrepo, Miguel Aigneren del Centro de Estudios de Opinión de la Universidad de Antioquia. ● Azza Abouzeid, Kamil Bajda-Pawlikowski, Daniel Abad, Avi Silberschatz, Alexander Rasin:. “HadoopDB: An Architectural Hybrid of MapReduce and DBMS Technologies for Analytical Workloads”, VLDB Endowment, 2009. ● Antonopoulos-Gillan “Cloud Computing Principles, Systems and Applications”. Springer 2010- 978-1-84996-241-4. ● W. Hall, D. De Roure, N. Shadbolt. The evolution of the Web and implications for eResearch. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences, Vol. 367, No. 1890, 2009. ● Rajaraman, A., Ullman, J.D., 2011. Mining of massive datasets. Cambridge. University Press.. 2011. ● Sorenson, J., Lee, L., Nolan, G.P., 2010. Computational solutions to large-scale data management and analysis. Nature Reviews. Genetics 11, 647–657. 2010. ● D. López. “Análisis de las posibilidades de uso de Big Data en las organizaciones”. Universidad de Cantabria, Santander, España, 2012. URL: http://repositorio.unican.es/xmlui/handle/10902/4528 ● A. Ramírez, H. Helio, C. Herrera, J. Francined. Un viaje a través de bases de datos espaciales. NoSQL: Redes de ingeniería, Univ. Distrital Francisco J de Caldas, Bogotá, Colombia, vol.4, no2, págs. 35-47, agosto-diciembre 2013 URL: http://revistas.udistrital.edu.co/ojs/index.php/REDES/article/download/5923/7426 ● H. Del Busto, G. Hansel, O. Enríquez. “Bases de datos NoSQL”. Revista Telemática, vol. 11, no 3, 2013 URL: http://revistatelematica.cujae.edu.cu/index.php/tele/article/view/74/74 ● C. Nance, T. Losser, R. Iype, G. Harmon. “NoSQL vs RDBMS - why there is room for both”, Proceedings of the Southern Association for Information Systems Conference, Savannah, GA, USA March 8th–9th, 2013 URL: http://sais.aisnet.org/2013/Nance.pdf ● B. Li, B. F. Liu, N. X. Liu, \"The Big Data how to Influence the Development of E-Government\", Advanced Materials Research, Vols. 989-994, pp. 4717-4722, 2014. http://www.scientific.net/AMR.989-994.4717 ● Validating viral marketing strategies in Twitter via agent-based social simulation. Emilio Serrano, Carlos A. Iglesias. http://www.sciencedirect.com/science/article/pii/S0957417415008234\n● CRITICAL QUESTIONS FOR BIG DATA. danah boyd , Kate Crawford. Information, Communication & Society. Vol. 15, Iss. 5, 2012. http://www.tandfonline.com/doi/abs/10.1080/1369118X.2012.678878 ● Big data: How do your data grow?. Clifford Lynch. http://www.nature.com/nature/journal/v455/n7209/full/455028a.html ● [1] D. López, “Análisis de las posibilidades de uso de Big Data en las organizaciones,” Universidad de Cantabria, Santander, España, 2012. ● [2] A. Rajaraman, J. D. Ullman, J. D. Ullman, and J. D. Ullman, Mining of massive datasets. Cambridge University Press Cambridge, 2012, vol. 1. ● [3] B. Dana and C. Kate, “‘Critical Questions for Big Data’,” Information, Communication and Society, vol. 15, p. 5, 2012. ● [4] C. Lynch, “Big data: How do your data grow?” Nature, vol. 455, no. 7209, pp. 28–29, Sep. 2008. ● [5] N. Antonopoulos and L. Gillam, Cloud Computing: Principles, Systems and Applications. Springer Science & Business Media, Jul. 2010. ● [6] W. Hall, D. D. Roure, and N. Shadbolt, “The evolution of the Web and implications for eResearch,” Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences, vol. 367, no. 1890, pp. 991–1001, Mar. 2009. [Online]. Available: http://rsta.royalsocietypublishing.org/content/367/1890/991 ● [7] E. Serrano and C. A. Iglesias, “Validating viral marketing strategies in Twitter via agent-based social simulation,” Expert Systems with Applications, vol. 50, pp. 140–150, May 2016. [Online]. Available: http://www.sciencedirect.com/science/article/pii/S0957417415008234 ● [8] B. Li, B. F. Liu, and N. X. Liu, “The Big Data how to Influence the Development of E-Government,” in Advanced Materials Research, vol. 989. Trans Tech Publ, 2014, pp. 4717–4722. [Online]. Available: http://www.scientific.net/AMR.989-994.4717 ● [9] H. Ramírez and J. F. Herrera, “Un viaje a través de bases de datos espaciales,” NoSQL: Redes de ingeniería, Univ. Distrital Francisco J de Caldas, Bogotá, Colombia, vol. 4, pp. 35–47, 2013. ● [10] H. G. del Busto and O. Y. Enríquez, “Bases de datos NoSQL,” Revista Telem@tica, vol. 11, no. 3, pp. 21–33, 2013. ● [11] C. Nance, T. Losser, R. Iype, and G. Harmon, “Nosql vs rdbms-why there is room for both,” in Proceedings of the Southern Association for Information Systems Conference, 2013, pp. 111–116. ● [12] E. E. Schadt, M. D. Linderman, J. Sorenson, L. Lee, and G. P. Nolan, “Computational solutions to largescale data management and analysis,” Nature Reviews Genetics.\nTIPS ● HPE Vertica my.vertica.com ● http://www.nosql.es/blog/nosql/mapreduce.html ● PostgreSQL – http://www.postgresql.org/ ● MongoDB – http://www.mongodb.org/ ● Cassandra – http://cassandra.apache.org/ ● Redis – http://redis.io/ ● Neo4J – http://neo4j.com/ ● Análislis IoT ● http://www.jcc.info.unlp.edu.ar/jcc2016/wordpress/index.php/envio-de-articulos/"}], "references": [], "referenceMentions": [], "year": 0, "abstractText": "Twitter social network contains a large amount of information generated by its users. That information is composed of opinions and comments that may reflect trends in social behavior. There is talk of trend when it is possible to identify opinions and comments geared towards the same shared by a lot of people direction. To determine if two or more written opinions share the same address, techniques Natural Language Processing (NLP) are used. This paper proposes a methodology for predicting reflected in Twitter from the use of sentiment analysis functions NLP based on social behaviors. The case study was selected the 2015 Presidential in Argentina, and a software architecture Big Data composed Vertica data base with the component called Pulse was used. Through the analysis it was possible to detect trends in voting intentions with regard to the presidential candidates, achieving greater accuracy in predicting that achieved with traditional systems surveys.", "creator": null}}}