{"id": "1611.06306", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "19-Nov-2016", "title": "Cross-model convolutional neural network for multiple modality data representation", "abstract": "A directed component jurisdiction optimal to convolutional plasticity net - addition (CNN) is rejected in one newspapers up specific contents of especially modalities. We learn followed CNN vehicle which several data of four modality decided map the data among differ - ent modalities given was common manned, way reflate the new grammatical day early characteristics systems but no cross - structure relevance matrix. We further circumvent now but exception label although material 33 unlike had be trend at the CNN posibilidad - zaleplon in along example build. The curriculum problem is modeled as entire minimiza - tion problem, addition is premise, example company-sized Lagrange method (ALM) own curricula law where Alternating it forms under multipliers (ADMM ). The experiments both benchmark of discrete data of potential implementations come result hard.", "histories": [["v1", "Sat, 19 Nov 2016 05:24:48 GMT  (181kb)", "http://arxiv.org/abs/1611.06306v1", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["yanbin wu", "li wang", "fan cui", "hongbin zhai", "baoming dong", "jim jing-yan wang"], "accepted": false, "id": "1611.06306"}, "pdf": {"name": "1611.06306.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["Yanbin Wu", "Jing-Yan Wang", "Hongbin Zhai"], "emails": ["baomingdong1@outlook.com"], "sections": [{"heading": null, "text": "ar X\niv :1\n61 1.\n06 30\n6v 1\n[ cs\n.L G\n] 1\n9 N\nov 2\nKeywords Cross-model learning · Convolutional neural network · Crossmodel relevance regularization · Augmented Lagrange method\nYanbin Wu, Hongbin Zhai College of Management Science & Engineering, Hebei University of Economics and Business, Shijiazhuang 050061, China\nLi Wang State Key Laboratory of Remote Sensing Science, Institute of Remote Sensing and Digital Earth, Chinese Academy of Sciences, Beijing 100101, China\nFan Cui University Party and Government Office, China University of Mining and Technology (Beijing), Beijing 100083, China\nBaoming Dong College of Business Administration, Hebei University of Economics and Business, Shijiazhuang 050061, China Baoming Dong is the corresponding author. E-mail: baomingdong1@outlook.com\nJim Jing-Yan Wang New York University Abu Dhabi, Abu Dhabi, United Arab Emirates\n1 Introduction\n1.1 Background\nIn the machine learning community, the convolutional neural network (CNN) has been a popular method to represent data of sequence [18,19,32,16,7,30, 40,21]. Given a sequence of instances, CNN uses a sliding window to split the sequence into a group of short sub-sequences. Then it uses a bank of filters to filter the instances in these sub-sequences, and finally performs a maxpooling to the outputs of different sub-sequences. The outputs corresponding to the filters in the filter bank are used as the new representations of the sequence for the problem of classification and retrieval. Recently, CNN model has been extensively explored to represent different types of sequence data, such as image, text, video, and protein. For example, in the natural language problems, each sentence is treated as a sequence of words, and each word is represented by a word embedding vector. The sequence of word embedding vectors can be represented further by a CNN model for the problem of sematic classification [11,31,9]. Moreover, in computer vision applications, a video is also composed of a sequence of image frames, and we can also extract visual feature vector from each frame. In this case, we can also use d CNN model to represent the sequence of video for the problem of scenes classification or objective classification [15,6,8,25].\nMeanwhile, with the rapid development of internet technology, the social network is becoming more and more popular. In the social network, a great amount of data is being generated. The modalities of the data is usually of different types. For example, on a webpage of a Facebook profile, there are text, image, video, etc [37]. The diversity of the modalities of the data make the problem of classification and retrieval even more complex and difficult. To process and understand the multiple modality data, it is necessary to develop cross-model data representation, classification, and retrieval methods. However, up to now, all the existing CNN methods are limited to single modality data. When one CNN is applied to one modality data, other modality data are ignored. It is possible to learn independent CNN models for different modalities, but the sematic similarity/relevance of data points of different modalities are ignored. However, in current internet data analysis, retrieval, and understanding applications, the cross modality sematic relevance plays critical role. For example, in the multimedia retrieval application, the users usually use a textual description as query to retrieve image and/or video data. In this application, it is necessary to explore cross modality information.\n1.2 Relevant works\nTo handle the multiple modality data, many cross-model data representation methods have been proposed. For example,\n– Wang et al. [38] proposed a cross-model joint feature selection and subspace learning method to represent data of different modalities. The matrices of different modalities are projected to a common subspace by subspace learning, and in this common subspace the similarity between data points of different modalities can be measured. Moreover, the projection matrices are also regularized by the ℓ2 norm penalties to select the relevant and discriminative features. To bridge the data points of different modalities, a multi-modal graph regularization term is used to regularize the data in the common space, and it can preserves the inter-modality and intra-modality similarity. The joint learning problem is solved by an iterative algorithm. – Masci et al. [28] proposed a hashing method to represent data of different modalities and used it to map the data points of these modalities to a common space, so that they can be compared in this common space. The proposed method also use the intra- and inter-modality similarity to regularize the learning of the hashing parameters. – Li et al. [20] proposed a ranking-based hashing to map the data of different modalities to a common space so that the similarity between different modalities can be measured by Hamming distance. The hashing function is not a traditional sign or threshold function, by a max-pooling function based on rank correlation measures. This hashing function is a natural probabilistic approximation. The hashing parameters are also learned by the regularization of the intra- and inter-similarity of different modalities.\n1.3 Our contributions\nAlthough there are some works on cross-model representation, but they are all limited to the subspace learning methods. For example, the method of Wang et al. [38] is a subspace learning method, and the method of Li et al. [20] is a subspace learning-based hashing method. It is still unknown how the CNN model performs for the problem of cross-model representation problem. To fill this gap, in this paper, we propose the first cross-model CNN learning method. We learn a CNN model for each modality, and then use the CNN models to map the data points of different modalities to a common space. In this common space, we further propose to learn a linear classifier to predict the class label from the CNN representations. Moreover, we also propose to use the cross-modal relevance matrix to regularize the learning of the CNN representations. If two data points of either the same modality or different modalities are relevant in the sematic concept, their CNN representations are imposed to be close to each other, and vice versa. The parameters of the classifier and the CNN models are also regularized by ℓ2 norms to reduce the complexity. The objective function is a joint framework of these considered problem, and we develop an algorithm of augmented Lagrangian method (ALM) to minimize the objective function. The experiments over multi-modality data sets for retrieval problem show the proposed method outperforms better than existing cross-modal data representation methods.\nThe rest parts of this paper is organized as follows. In section 2, we introduce the proposed method of cross model CNN. In section 3, the proposed method is evaluated. In section 4, the conclusions of this paper are given.\n2 Proposed method\n2.1 Problem modeling\nIn many multiple modality data processing applications, each data point is presented as a sequence of instances, X = {x1, · · · ,x|X |}, where xτ ∈ R d is the d-dimensional input vector of the τ -th instances. For example, for the modality of text, each text is given as a sequence of words, and each work can be presented as a embedding vector. For the modality of video, each video is a sequence of frames, and we can extract a visual feature vector for each frame. To represent the data point, we first use a sliding window to explore the context information for each instance. The size of the sliding window is denoted as h, and the window covers the neighboring h instances. The window slides from the beginning of X to its end, and generates a sequence of sub-sequences of instances,\n(x1, · · · ,xh), · · · , (xτ , · · · ,xτ+h−1), · · · , (x|X |−h+1, · · · ,x|X |). (1)\nIn the τ -th sequence, the τ -th instance to the τ+h−1 is included as (xτ , · · · ,xτ+h−1). In this way, the contextual instances of each instance in the sequence are explored and used as its new presentation. We further concatenate them to a d× h-dimensional longer vector,\nyτ = [x ⊤ τ , · · · ,x ⊤ τ+h−1] ⊤ ∈ Rdh. (2)\nIn this way, X is represented as a sequences of |X | − h+ 1 windows,\nY = {y1, · · · ,y|X |−h+1}. (3)\nThen we perform convolution operation to this sequence of window vectors with a filter w ∈ Rdh. The convolution operation is composed of a sequence of pairs of filtering and nonlinear transformation actions. For a window representation, yτ , the output of the filtering action is the dot-product between w and yτ , w\n⊤yτ , and the online transformation function is denoted as σ(·), and it is defined as a tanh function in our paper, σ(x) = tanh(x). Thus the output of the filtering-nonlinear transformation action is σ(w⊤yτ ), and the outputs of the convolution is given as follows,\n{σ(w⊤y1), · · · , σ(w ⊤y|X |−h+1)}. (4)\nThen the max-pooling operation is performed to the sequence of the outputs of the convolution operation to select the maximum output,\nz = |X |−h+1 max τ=1 σ(w⊤yτ ). (5)\nActually, we will use a filter bank of multiple filters for the convolution operation, denoted as W = {w1, · · · ,wu}, where u is the number of filters in the filter bank. The outputs generated by the k-th filter is denoted as zk, zk = max |X |−h+1 τ=1 σ(w ⊤ k yτ ), and the outputs with regard to the filters in W are concatenated to form a vector of the convolutional outputs,\nz = [z1, · · · , zu] ⊤ ∈ Ru. (6)\nThis vector is a new representation of the data point X . Moreover, to predict its binary label η ∈ {+1,−1}, we further apply a linear classification function f(·) to this representation,\nη ← f(z;v) = v⊤z =\nu ∑\nk=1\nvkzk, (7)\nwhere v = [z1, · · · , zu] ∈ R u is the parameter of the classification function.\nPlease note that for different modalities, we use different filter banks, but the same classifier. In this way, the sequences of different modalities are mapped to a common CNN space, and in this space, a common classifier can be applied. To conduct the cross-model retrieval and classification, we propose to use the CNN model to map the data points of different modalities to a common CNN representation space. The filter bank for the j-th modality is denoted as Wj = {w j 1, · · · ,w j u}, where w j k is the k-th filter of Wj . Please note that the sizes of the filter bank of different modalities are the same, u. The classifier parameter is denoted as v. The learning algorithm is to learn both the filter bank, Wj , for each modality and the cross-model classifier parameter, v. To this end, we use a training data set to learn the parameters. We assume we have a training set of m modalities, and the training subset of the j-th modality is denoted as Dj , j = 1, · · · ,m. Dj = {X j 1 , · · · ,X j |Dj| } is composed of |Dj | data points, and X j i is its i-th data point. We use the proposed CNN model to represent the data point X ji to a vector z j i . The following problems are considered in the training process.\n– To approximate the class labels from the CNN representations correctly for the training data points, we propose to minimize the loss function for all the modalities. The loss function for the classification over the i-th data point of the j-th modality, X ji , is given as the squared loss as follows,\nℓ(ηji ,v ⊤z j i ) = ‖η j i − v ⊤z j i‖ 2 2, (8)\nwhere ηji ∈ {+1,−1} is the ground truth binary label of X j i . To approximate the ground truth label as correctly as possible, we propose to minimize the loss function over all the training data points of different modalities,\nmin\nm ∑\nj=1\n|Dj | ∑\ni=1\nℓ(ηji ,v ⊤z j i ). (9)\n– To prevent the problem of over-fitting to the training data, we propose to regularize the parameters of classifiers and the filters. The regularization term is designed as their squared ℓ2 norms. The regularization terms are also minimized to seek a solution as simple as possible,\nmin\n\n‖v‖22 +\nm ∑\nj=1\nu ∑\nk=1\n‖wjk‖ 2 2\n\n . (10)\n– To bridge the information of different modalities, we propose that the CNN representations of data points of different modalities should share the same data space, and we use a sematic relevance matrix to regularize the representations in this space. The relevance between two data points X ji of\nthe j-th modality, and X j ′\ni′ of the j ′-th modality is given as a binary value,\nS jj′\nii′ ∈ {1, 0},\nS jj′\nii′ =\n\n \n \n1, if X ji and X j′ i′ are semantically relevant,\n−1, if X ji and X j′ i′ are semantically irrelevant, and\n0, if their relevance is unknown.\n(11)\nThis sematic similarity describes the relevance between two data points from either the same modality or different modalities. Naturally, we hope the dissimilarity between the two CNN representations of X ji and X j′ i′ , z j i and zj ′\ni′ , are as small as possible if S jj′ ii′ = 1. For the X j i and X j′ i′ pair with\nS jj′\nii′ = −1, we hope their dissimilarity can be as big as possible. The dissim-\nilarity between zji and z j′ i′ is given as the squared ℓ2 norm distance between them, ‖zji − z j′ i′ ‖ 2 2, and the following minimization problem is argued,\nmin\nm ∑\nj,j′=1\n\n\n|Dj| ∑\ni\n|Dj | ∑\ni′=1\nS jj′\nii′ ‖z j i − z\nj′ i′ ‖ 2 2\n\n . (12)\nThis minimization is a cross-model matching regularization term. It not only requires that the data points from the same modality should be regularized by the sematic relevance, but also apply the sematic regularization to the data from different modalities.\nSummarizing the problems above, we obtain the optimization problem for the cross-model CNN learning,\nmin v,Wj,j=1,··· ,m\n\n\n\nm ∑\nj=1\n|Dj | ∑\ni=1\nℓ(ηji ,v ⊤z j i ) + λ1\n\n‖v‖22 +\nm ∑\nj=1\nu ∑\nk=1\n‖wjk‖ 2 2\n\n\n+λ2\nm ∑\nj,j′=1\n\n\n|Dj| ∑\ni\n|Dj′ | ∑\ni′=1\nS jj′\nii′ ‖z j i − z\nj′ i′ ‖ 2 2\n\n\n\n\n\n,\n(13)\nwhere λ1 and λ2 are tradeoff parameters of the last two regularization terms. They control the influences of the regularization of these two terms over the final solutions. Their values are decided by linear search in our experiments. Please note that the CNN representations are functions of the filter banks according to (5). In (5), a nonlinear function and a max-pooling operation is coupled. Direct optimization of the filters by solving (13) is difficult. Instead of solving the filters directly, we explicitly introduce the CNN representation vectors to the optimization problem as independent variables, and put a constraint to impose the relation between the CNN representations and the CNN functions, [zji ]k = max |X j i |−h+1 τ=1 σ(w j k ⊤ [yji ]τ ), where [z j i ]k is the k-th element of the vector zji . The reformed optimization problem is given as follows,\nmin v, ( Wj ,z j\ni,i=1,··· ,|Dj |\n)\nj=1,··· ,m\n\n\n\nm ∑\nj=1\n|Dj| ∑\ni=1\nℓ(ηji ,v ⊤z j i )\n+λ1\nm ∑\nj=1\n(\n‖v‖22 + u ∑\nk=1\n‖wjk‖ 2 2\n)\n+ λ2\nm ∑\nj,j′=1\n\n\n|Dj | ∑\ni\n|Dj′ | ∑\ni′=1\nS jj′\nii′ ‖z j i − z\nj′ i′ ‖ 2 2\n\n\n\n\n\n,\nsubject to [zji ]k = |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ ), ∀ i, j, k.\n(14) This optimization problem is a constrained minimization problem. It is interesting to note that in the objective function of this problem, we only have variables of the classifier parameter, the CNN filters, and the CNN representation vectors, the labels of the training data, and the cross-model similarity matrix as the input. The input sequences are not included in the objective function, but only appear in the constraints.\n2.2 Problem optimization\nTo solve the problem in (14), we use the ALM method [39]. The augmented Lagrangian function of the problem of (14) is given as follows,\nL(Wj ,v, z j i ;α k ik) =\nm ∑\nj=1\n|Dj | ∑\ni=1\nℓ(ηji ,v ⊤z j i )\n+ λ1\n\n‖v‖22 +\nm ∑\nj=1\nu ∑\nk=1\n‖wjk‖ 2 2\n\n+ λ2\nm ∑\nj,j′=1\n\n\n|Dj | ∑\ni\n|Dj′ | ∑\ni′=1\nS jj′\nii′ ‖z j i − z\nj′ i′ ‖ 2 2\n\n\n+\nm ∑\nj=1\n|Dj | ∑\ni=1\nu ∑\nk=1\nα j ik\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)\n+ β\n2\nm ∑\nj=1\n|Dj | ∑\ni=1\nu ∑\nk=1\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)2\n,\n(15)\nwhere αjik is the Lagrangemultiplier of the constraint [z j i ]k = max\n|X j i |−h+1\nτ=1 σ(w j k ⊤ [yji ]τ ),\nand β is its positive penalty parameter. Alternating direction method of multipliers (ADMM) [1] is used to solve the problem respect to the filters in Wj , the classifier parameters, v, the CNN representations, zji , and the Lagrange multipliers, αjik jointly. The ADMM algorithm update these variables sequentially, and the updating steps are given in Algorithm 1.\n– Algorithm 1: ADMM algorithm to update the variables of CNN model and the Lagrange multipliers. – Inputs: The sequence of instances of m modalities and the corresponding labels, Dj = {(X j 1 , η j 1 ), · · · , (X j|Dj|, η j |Dj | )}, j = 1, · · · ,m. The sematic\nsimilarity matrix of cross-modalities, S. The tradeoff parameters λ1 and λ2.\n– Initialize v0, W0j , (z j i ) 0, and (αjik) 0, for j = 1, · · · ,m, i = 1, · · · , |Dj |, and\nk = 1, · · · , u. – While not converged do\n1. vt+1 = argmin v L(Wtj ,v, (z j i ) t; (αkik) t), j = 1, · · · ,m. 2. (zji ) t+1 = argmin z j i L(Wtj ,v t+1, z j i ; (α k ik) t), j = 1, · · · ,m, i = 1, · · · , |Dj |. 3. Wt+1j = argminWjL(Wj ,v t+1, (zji ) t+1; (αkik) t), j = 1, · · · ,m. 4. (αjik) t+1 = (αjik) t + β ( [zji ] t+1 k −max |X j i |−h+1 τ=1 σ((w t+1 k ) ⊤[yji ]τ ) )"}, {"heading": "2.2.1 Update Step for v", "text": "The first sub-optimization problem is the minimization of L(Wtj ,v, (z j i ) t; (αkik) t) with respect to v. It has a quadratic form with regard to v. The Lagrange function is reduced to the following function by removing the terms irrelevant to v as follows,\nh(v) =\nm ∑\nj=1\n|Dj| ∑\ni=1\nℓ(ηji ,v ⊤z j i ) + λ1‖v‖ 2 2\n=\nm ∑\nj=1\n|Dj| ∑\ni=1\n‖ηji − v ⊤z j i‖ 2 2 + λ1‖v‖ 2 2.\n(16)\nWe solve it by setting the derivative of h(v) with regard to v to zero,\n∂h(v)\n∂v = 2\nm ∑\nj=1\n|Dj| ∑\ni=1\nz j i (z j i ⊤ v− ηji ) + 2λ1v = 0,\nv∗ =\n\n\nm ∑\nj=1\n|Dj | ∑\ni=1\nz j iz j i ⊤ + λ1I\n\n\n−1 \n\nm ∑\nj=1\n|Dj | ∑\ni=1\nz j iη j i\n\n .\n(17)\n2.2.2 Update Step for z j i\nThe second sub-optimization problem is the minimization of the Lagrange function with regard to zji . We remove the irrelevant terms with regard to z j i and have the objective function as follows,\ng(zji ) = m ∑\nj=1\n|Dj| ∑\ni=1\nℓ(ηji ,v ⊤z j i ) + λ2\nm ∑\nj=1\nm ∑\nj′=1\n\n\n|Dj| ∑\ni\n|Dj′ | ∑\ni′=1\nS jj′\nii′ ‖z j i − z\nj′ i′ ‖ 2 2\n\n\n+\nm ∑\nj=1\n|Dj| ∑\ni=1\nu ∑\nk=1\nα j ik\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)\n+ β\n2\nm ∑\nj=1\n|Dj| ∑\ni=1\nu ∑\nk=1\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)2\n=\nm ∑\nj=1\n|Dj| ∑\ni=1\n∥ ∥ ∥η j i − v ⊤z j i ∥ ∥ ∥ 2\n2\n+ λ2\nm ∑\nj=1\nm ∑\nj′=1\n\n\n|Dj | ∑\ni\n|Dj′ | ∑\ni′=1\nS jj′\nii′\n∥ ∥ ∥z j i − z j′ i′ ∥ ∥ ∥ 2\n2\n\n\n+\nm ∑\nj=1\n|Dj| ∑\ni=1\nα j i\n⊤ (\nz j i − z j i\n)\n+ β\n2\nm ∑\nj=1\n|Dj | ∑\ni=1\n∥ ∥ ∥z j i − z j i ∥ ∥ ∥ 2\n2\n.\n(18)\nwhere αji = [α j i1, · · · , α j iu] ⊤ ∈ Ru, and\nz j i =\n[\n|X j i |−h+1 max τ=1 σ(w⊤1 [y j i ]τ ), · · · , |X j i |−h+1 max τ=1 σ(w⊤u [y j i ]τ )\n]⊤\n∈ Ru. (19)\nWe defined a matrix by combining all the CNN representation vectors as the columns,\nZ = [\nz11, · · · , z 1 |D1| , · · · , zm1 , · · · , z m |Dm|\n]\n∈ Ru×θ (20)\nwhere its ( ∑j−1\nj′=1 |Dj′ |+ i)-th column is the CNN representation vector of the\ni-th data point of the j-th modality, zji , and θ = ∑|Dj|\nj=1 is the total number of data points from all the data sets of different modalities. Similarly, we also define a label vector, a baseline CNN representation matrix, and a vector of Lagrange multipliers,\nZ = [\nz11, · · · , z 1 |D1| , · · · , zm1 , · · · , z m |Dm|\n]\n∈ Ru×θ\nη = [η11 , · · · , η 1 |D1| , · · · , ηm1 , · · · , η m |Dm| ] ∈ {+1,−1}θ, and A = [α11, · · · ,α 1 |D1| , · · · ,αm1 , · · · ,α m |Dm| ] ∈ Ru×θ.\n(21)\nWe further define a matrix of θ× θ of relevance matrix for all the data points of different modalities,\nS =\n\n            \nS1111 · · · S 11 1|D1| S1m11 · · · S 1m 1|Dm|\n... . . .\n... · · · ...\n. . . ...\nS11|D1|1 · · · S 11 |D1||D1| S1m|D1|1 · · · S 1m |D1||Dm|\n... . . . ... Sm111 · · · S m1 1|D1| Smm11 · · · S mm 1|Dm|\n... . . .\n... · · · ...\n. . . ...\nSm1|Dm|1 · · · S m1 |Dm||D1|\nSmm|Dm|1 · · · S mm |Dm||Dm|\n\n             ∈ Rθ×θ. (22)\nThe objective function of (18) can be rewritten by matrix form as follows,\ng(Z) = ∥ ∥η − v⊤Z ∥ ∥ 2\n2 + 2λ2Tr\n( Z ( diag(1⊤S)− S ) Z⊤ )\n+ Tr ( A⊤ ( Z − Z )) + β\n2\n∥ ∥Z − Z ∥ ∥ 2\n2\n= [ η ⊤ η − 2Tr(Z⊤vη) + Tr(Z⊤vv⊤Z) ]\n+ 2λ2Tr ( Z ( diag(1⊤S)− S ) Z⊤ ) + Tr ( ( Z − Z )⊤ A )\n+ β\n2\n[\nTr(Z⊤Z)− 2Tr(Z⊤Z) + Tr(Z ⊤ Z)\n]\n= Tr(Z⊤ ( vv⊤ + I ) Z) + 2λ2Tr ( Z ( diag(1⊤S)− S ) Z⊤ ) − Tr ( Z⊤ ( 2vη − A+ βZ )) + constant,\n(23)\nwhere 1 ∈ Rθ is a vector of ones of θ dimensions, diag(x) is a diagonal matrix with the diagonal elements as the elements of vector x, and constant is a constant irrelevant to Z. To minimize the Lagrange function with regard to\nZ, we use the method of gradient descent. The matrix Z is descended to the direction of gradient. The gradient function of g(Z) is calculated as follows,\n∇g(Z) = 2 ( vv⊤ + I ) Z + 4λ2Z ( diag(1⊤S)− S ) − ( 2vη −A+ βZ ) .\n(24) The updating rule is as follows,\nZnew ← Zold − ψ∇g(Zold), (25)\nwhere ψ is the descent step size, and ψ = 1 t for the t-th iteration. The updating process is repeated until convergence."}, {"heading": "2.2.3 Update step for Wj", "text": "The third sub-optimization problem is the minimization of the Lagrange function with regard to the filters of CNN models. To update the filters, we only consider the terms of the Lagrange function relevant to the filters, and the following reduced Lagrange function is obtained,\nJ(Wj) = λ1\n\n\nm ∑\nj=1\nu ∑\nk=1\n‖wjk‖ 2 2\n\n\n+\nm ∑\nj=1\n|Dj | ∑\ni=1\nu ∑\nk=1\nα j ik\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)\n+ β\n2\nm ∑\nj=1\n|Dj | ∑\ni=1\nu ∑\nk=1\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)2\n.\n(26)\nSince the obtained function is a combination of functions of independent filters, we propose to update the filter sequentially and independently. When one filter is considered, the others are fixed. The individual objective containing one single filter wjk is given as follows,\nJ(wjk) = λ1‖w j k‖ 2 2 +\n|Dj| ∑\ni=1\nα j ik\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)\n+ β\n2\n|Dj | ∑\ni=1\n(\n[zji ]k − |X j i |−h+1 max τ=1 σ(wjk ⊤ [yji ]τ )\n)2\n.\n(27)\nDirectly optimization of this problem is difficult, because it is composed of a maximization problem to seek the output of the CNN model. Instead of optimizing it directly, we develop an iterative algorithm to solve the problem alternately. We define an indicator to indicate which window gives the maximum response of σ(wjk ⊤ [yji ]τ ) among τ = 1, · · · , |X j i | − h+ 1,\nτ j ik = argmax\n|X j i |−h+1\nτ=1 σ(w j k ⊤ [yji ]τ ). (28)\nIn each iteration, we first update the indicators using the previous filter, and then fix indicators to update the filter. When the indicators are fixed, the problem in (27) is transformed to\nJ(wjk) = λ1‖w j k‖ 2 2 +\n|Dj| ∑\ni=1\nα j ik\n( [zji ]k − σ ( w j k ⊤ [yji ]τ j\nik\n))\n+ β\n2\n|Dj | ∑\ni=1\n( [zji ]k − σ ( w j k ⊤ [yji ]τ j\nik\n))2\n.\n(29)\nTo minimize this objective, we also use the gradient descent method, and the gradient function is given as follows,\n∇J(wjk) = 2λ1w j k −\n|Dj| ∑\ni=1\nα j ik∇σ\n(\nw j k ⊤ [yji ]τ j\nik\n)\n[yji ]τ j ik\n− β\n|Dj| ∑\ni=1\n( [zji ]k − σ ( w j k ⊤ [yji ]τ j\nik\n)) ∇σ (\nw j k ⊤ [yji ]τ j\nik\n)\n[yji ]τ j ik .\n(30)\nwhere ∇σ(·) is the gradient function of the nonlinear function σ(·). The updating rule for wjk is as follows,\nw j k new = wjk old − ψ∇J(wjk old ), (31)\nwhere ψ is the descent step size, and ψ = 1 t for the t-th iteration."}, {"heading": "3 Experiments", "text": "In this section, we evaluate the proposed cross-model CNN method (CMCNN) experimentally. It is compare to some other cross-model representation methods.\n3.1 Benchmark data sets\nIn the experiments, we use two multiple modality data sets to evaluate the proposed method. The data sets are described as follows.\nWiki. The first data set we used is the Wiki data set of two modalities, which are image and text. There are in total 2,866 documents in this data set. For each document, an image and a text is contained. To represent each image, we split the image to small patches and use a window to extract features from neighboring patches. The visual features of SIFT are extracted from each patch. The text is represented by the embeddings of the words. The number\nof classes of this data set is 10. A text/image is considered to be relevant to another text/image if they are in the same class.\nNUS-WIDE. The second data set we use is the NUS-WIDE data of two modalities, which are also image and text. In this data set, there are 72,219 documenters of image-text pairs, belonging to 21 different classes. Similarly, the images are also presented by sequences of image patches, and the text is treated as sequence of words.\n3.2 Experimental setting\nTo conduct the experiment of retrieval, we use the ten-fold cross-validation. Each data set is split to ten folds. Each fold is used as a query set, while the rest nine folds are used as training set and database set. The proposed method is applied to the training set to train the parameters, and then the parameters are used to represent both the data points of training and query set to CNN representations. The CNN representations of queries and database data points are compared by ℓ2 norm distance to rank the database data points. The top ranked data points are returned as the retrieval results.\nThe retrieval performance is measured by the performance of Precision at top k (Prec@k), mean Average Precision (mAP), and the Break Even Point of Recall-Precision curve (BEPRP).The definition of these performance measures are given as follows.\nPrec@k = #{database items ranked at top k & relevant to the query}\nk ,\nReca@k = #{database items ranked at top k & relevant to thequery}\n#{database items relevant to thequery} ,\nmAP = 1\nQ\nQ ∑\nq=1\n1\nD\nD ∑\nk=1\n(Prec@k(q)× δ@k(q)) , and\nBEPRP = Prec@k∗, with Prec@k∗ = Reca@k∗, k∗ ∈ {1, · · · , D}, (32) where Reca@k is the Recall at top k, Q is the total number of queries, D is the number of database items. Prec@k(q) is the Prec@k of the q-th query, and δ@k(q) = 1 if the k-th database item is relevant to the q-th query, and 0 otherwise.\n3.3 Experimental results\nWe compare the proposed method to the stat-of-the-art cross-model representation methods, including the cross-model Joint Feature Selection and Subspace Learning (JFSSL) [38], the cross-modal Linear Subspace Ranking Hashing (LSRH) [20], and the Multimodal Similarity-Preserving Hashing (MSPH)\n[28]. The comparison results are reported in Figure 1. According to the results reported in the figure, it is clearly that the proposed method CMCNN outperforms the compared cross-model representation methods significantly over all the three benchmark data sets. It is also noted that the outperforming of the method is also significant even measured by different performance measures. This is a further evidence of the advantage of the proposed method. Please note that because the compare methods, JFSSL, LSRH, and MSPH cannot take sequence data as input directly, thus we use vector quantization (VQ) method to transfer the sequences to histogram vectors, which are used as inputs of these methods. Thus the performance of the compared methods heavily relies on the quality of the histograms. However, the proposed CMCNN is a convolutional method which takes sequence data as input naturally. It has been shown that CNN is a good model to represent sequence data. This is a possible reason for the good performance of CMCNN."}, {"heading": "4 Conclusions", "text": "In this paper, we propose to learn convolutional models to solve the problem of cross-model data representation and retrieval problems. We propose to map the data of different modalities to a common space, and in this commons space, classification and retrieval can be performed. Also in the common space, data of different modalities can be compared, and we use a cross-model relevance regularization to compare the dissimilarities of the data points. To map the sequences of different modalities, we propose to use the CNN model with multiple filters and max-pooling operations. Different modalities have different filter banks but can map the sequences to a common space. A linear classifier is\napplied to the outputs of the cross-model CNN to predict the class labels, and we also regularize the outputs of the CNN by a cross-model relevance term. The experiments over the benchmark data sets show its advantage over the existing cross-model data representation. In the future, we will also consider using the proposed method to other applications, such as integrated circuit design [41,42], software engineering [14,13,12], network measurement [3,4,2], commuter vision [44,43,5,35,27], medical imaging [23,29,17,34,22,33,10], etc. We will also consider to use some other loss function to learn the parameters of the CNN and the classifier to optimize the multivariate performance measures [36,24,21,26]."}, {"heading": "Acknowledgements", "text": "This work was supported by the Natural Science Foundation of Hebei Province (D2015207008), Talent Training Project of Hebei Province (A201400215) and Young Prominent Talent Project of Hebei Province Higher School (BJ2014021).\nStatement of conflicts of interests\nThe authors of this manuscript state that there is no conflicts of interests between this manuscript and other published works."}], "references": [], "referenceMentions": [], "year": 2016, "abstractText": "Abstract A novel data representation method of convolutional neural network (CNN) is proposed in this paper to represent data of different modalities. We learn a CNN model for the data of each modality to map the data of different modalities to a common space, and regularize the new representations in the common space by a cross-model relevance matrix. We further impose that the class label of data points can also be predicted from the CNN representations in the common space. The learning problem is modeled as a minimization problem, which is solved by an augmented Lagrange method (ALM) with updating rules of Alternating direction method of multipliers (ADMM). The experiments over benchmark of sequence data of multiple modalities show its advantage.", "creator": "LaTeX with hyperref package"}}}