{"id": "1103.0605", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "3-Mar-2011", "title": "Loopy Belief Propagation, Bethe Free Energy and Graph Zeta Function", "abstract": "gurney We propose khalilzad a reconsidering new entremed approach cartledge to guillem the theoretical analysis 31,000-square of auxois Loopy .160 Belief buenaventura Propagation (steegmans LBP) fiddly and the 11-on-11 Bethe free energy (borgman BFE) umayyads by mittelstaedt establishing moodley a suphamongkhon formula l'héritier to mandai connect acanthamoeba LBP and BFE with haidong a zemurray graph higinbotham zeta stroot function. The proposed approach is upgradeable applicable utm to m-45 a wide class zelophehad of models mudavadi including multinomial grapefruit and Gaussian xtra types. The 11.25 connection pin-point derives a number of new nsis theoretical proscriptions results lousewies on hinckley LBP nozzle and sdx BFE. lefferts This paper focuses 50.34 two 155 of such topics. One is the p-61 analysis of sanai the region mahv where the Hessian mm2 of waived/injured the bogs Bethe free energy is chrysostomos positive definite, which derives nord-trøndelag the longbenton non - floccari convexity falstaffian of eight-minute BFE yigong for graphs klasnic with multiple cycles, gardist and murinus a condition of violette convexity on a restricted goodworks set. scott This brundage analysis also gives piloti a new strehler condition 101st for the tary uniqueness of the LBP fixed point. gpac The petersdorf other result is harmonicas to clarify radack the relation between schrenk the holaus local stability of tindill a anti-shipping fixed point montenero of 2009-2011 LBP and steed local siderman minima of drinkable the BFE, which kaho implies, kake for example, that a simpering locally betul stable fixed 124.26 point ndegeocello of the Gaussian coombe LBP holdman is djing a local flic minimum of market-place the sleaford Gaussian quipped Bethe free romgaz energy.", "histories": [["v1", "Thu, 3 Mar 2011 04:40:19 GMT  (476kb)", "http://arxiv.org/abs/1103.0605v1", null]], "reviews": [], "SUBJECTS": "cs.AI cs.DM", "authors": ["yusuke watanabe", "kenji fukumizu"], "accepted": false, "id": "1103.0605"}, "pdf": {"name": "1103.0605.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["Yusuke Watanabe", "Kenji Fukumizu"], "emails": ["watay@ism.ac.jp", "fukumizu@ism.ac.jp"], "sections": [{"heading": null, "text": "ar X\niv :1\n10 3.\n06 05\nv1 [\ncs .A\nI] 3\nKeywords: loopy belief propagation, graphical models, Bethe free energy, graph zeta function, Ihara-Bass formula"}, {"heading": "1. Introduction", "text": "Probability density functions that have “local” factorization structures, called graphical models, constitute fundamentals in many fields. In the fields of statistics, artificial intelligence and machine learning, for example, graphical modeling has been a powerful tool for representing our prior knowledge and modeling hidden structures of problems (Whittaker, 2009; Pearl, 1988; Jordan, 1998). Other examples are found in statistical physics, coding theory, and combinatorial optimizations (Pelizzola, 2005; McEliece et al., 1998; Mezard et al., 2002). Typically, such probability distributions are derived from random variables that only have local interactions/constraints. This factorization structure is clearly visualized by a graph, called factor graph.\nSince the inference problems on graphical models, such as computation of marginal/conditional density functions and partition functions, are in general intractable for large graphs, Loopy Belief Propagation (LBP) has been proposed as an efficient approximation method applicable to any graph-structured density functions. Originally, Belief Propagation (BP) algorithm was proposed by Pearl (1988) to compute exactly the marginals for tree-structured graphical\nc©2011 Yusuke Watanabe and Kenji Fukumizu.\nmodels. This algorithm passes “messages” between vertices of the graph until all information of the graphical model is distributed throughout the graph. Some researchers have found that LBP, an extended use of BP for graphs with cycles, shows good approximation with high potential applicability (Murphy et al., 1999; McEliece et al., 1998). After the proposal, many extensions and variants have been studied (Yedidia et al., 2001; Sudderth et al., 2002; Wainwright et al., 2005) and have been applied successfully to many problems, including coding theory, image processing, sensor network localization and compressive sensing (Ihler et al., 2005; Baron et al., 2010).\nOn the theoretical side, a significant number of studies have been carried out by many authors in this decade. One theoretical challenge of LBP is that the algorithm may have many fixed points; the uniqueness is generally guaranteed only for trees and one-cycle graphs (Weiss, 2000). The LBP fixed points are the solutions of a nonlinear equation associated with the graph, and the structure of the equation is more complicated as the number of cycle is larger. Regarding this problem, a notable result is the variational interpretation of LBP; it shows that the LBP fixed points are the local minima of the Bethe free energy (Yedidia et al., 2001, 2005). This suggests that the behavior of LBP is more complex with non-convexity of the Bethe free energy. Another difficulty of LBP is that the algorithm does not necessarily converge and sometimes shows oscillatory behaviors. Concerning the multinomial model (also known as discrete variable model), Mooij and Kappen (2007) and Ihler et al. (2006) give sufficient conditions for the convergence in terms of the spectral radius of a certain matrix related to the graph. Tatikonda and Jordan (2002) also derive a sufficient condition for convergence, interpreting the convergence as the uniqueness of the Gibbs measure on the universal covering tree.\nThe purpose of this paper is to provide a novel discrete geometric approach to analysis of the LBP algorithm. The starting point of our study is a question: “How are the behaviors of the LBP algorithm affected by the geometry of the graph?” If the graph is a tree (L)BP works nicely; it terminates in a finite step at the unique fixed point and gives the exact marginals. If the graph has only one cycle it also works appropriately; the algorithm converges to the unique fixed point and finds the MPM (Maximum Posterior Marginal) assignment in binary variable cases (Weiss, 2000). Additionally, the Bethe free energy function is convex in these cases (Pakzad and Anantharam, 2002). Existence of multiple cycles, however, breaks down these nice properties. There have not been many researches that elucidate the effects of cycles on LBP in detail beyond “tree or non-tree” classification. While a notable exception is the walk-sum analysis by Johnson et al. (2006) and Malioutov et al. (2006), it is limited to the Gaussian case.\nThis paper proposes a method based on a new connection between LBP, Bethe free energy, and a graph zeta function. Graph zeta functions, originally introduced by Ihara (1966), are popular graph characteristics defined by the products over the prime cycles. We capture the effects of cycles on LBP and Bethe free energy by establishing a novel formula, called Bethe-zeta formula, which connects the Hessian of the Bethe free energy with the graph zeta function. To derive the formula, we extend the definition of existing graph zeta functions and related Ihara-Bass formula (Stark and Terras, 1996; Bass, 1992).\nOur discovery of the connection, including the Bethe-zeta formula, derives new ways of analyzing LBP and the Bethe free energy function taking the graph geometry into account. It is applicable to a wide class of graphical models defined by “marginally closed”\nexponential families, which include multinomial and Gaussian models. This paper discusses two examples of such analysis: one is the positive definiteness of Hessian for the Bethe free energy, and the other is local stability of the LBP dynamics.\nFirst, based on the connection, we derive conditions that the Hessian of Bethe free energy function is positive definite. As already discussed, analysis of the Bethe free energy is important for theoretical understanding of the complex behavior of LBP. As the fundamentals, we consider the local properties of the Bethe free energy by elucidating the positive definiteness of its Hessian, while there are many studies on modifications and convexifications of the Bethe free energy function (Wiegerinck and Heskes, 2003; Wainwright et al., 2003b; Weiss et al., 2007). The direct consequence of our analysis is a sufficient condition of the uniqueness of the LBP fixed point, which is derived by giving a condition of global convexity. In discussing the positive definiteness, we consider two defining domains of the Bethe free energy: one is given by the locally consistent pseudomarginals, and the other is a more restricted set conditioned by the compatibility functions of given graphical model. The beliefs given by LBP always lie in the latter domain. We show that, when considered in the former domain, the necessary and sufficient condition for the Hessian to be positive definite is that the underlying factor graph has no more than one cycle. We also give a sufficient condition of the convexity of Bethe free energy on the latter domain, which implies the uniqueness of the LBP fixed point. By numerical examples, we demonstrate that our new uniqueness condition covers a wider region than the one given by Mooij and Kappen (2007) for the examples.\nIn the second application, we clarify a relation between the local structure of the Bethe free energy function and the local stability of a LBP fixed point. Such a relation is not necessarily obvious, since LBP is not derived as the gradient descent of the Bethe free energy. In this line of studies, for multinomial models Heskes (2002) shows that a locally stable fixed point of LBP is a local minimum of the Bethe free energy. We give conditions of the local stability of LBP and the positive definiteness of the Bethe free energy in terms of the eigenvalues of a matrix that appears in the graph zeta function. As a consequence, the result by Heskes is extended to a wider class including Gaussian distributions.\nThis paper is organized as follows. In section 2, we introduce graphical models, LBP and the Bethe free energy as preliminaries. We formulate the setting in terms of exponential families. Section 3 includes the definition of a new class of graph zeta function, the extension of Ihara-Bass formula, and related results. Using these results, Section 4 shows the fundamental results of this paper, Bethe-zeta formula and positive definiteness condition, in Theorems 11 and 14. Section 5 derives a positive-definite region of the Bethe free energy function, and discusses convexity. In section 6, we elucidate the relations between the stability of LBP and the local structure of the Bethe free energy at LBP fixed points. Section 7 includes discussion and concluding remarks. Proofs omitted from the main body of the paper are given in the appendices."}, {"heading": "2. Preliminaries", "text": "In this section we summarize a background of graphical models and LBP. In Subsection 2.1 we introduce graphical models in terms of hypergraphs. Subsection 2.2 introduces LBP\nalgorithm. The Bethe free energy, which provides alternative language for formulating LBP algorithm, is discussed in Subsection 2.3."}, {"heading": "2.1 Graphical models", "text": "We begin with basic definitions of hypergraphs because the associated structures with graphical models are, precisely speaking, hypergraphs.\nAn ordinary graph G = (V,E) consists of the vertex set V joined by edges of E. Generalizing the notion of graphs, hypergraphs are defined as follows. A hypergraph H = (V, F ) consists of a set of vertices V and a set of hyperedges F . A hyperedge is a non-empty subset of V . For any vertex i ∈ V , the neighbors of i is defined by Ni := {α ∈ F |i ∈ α}. Similarly, for any hyperedge α ∈ F , the neighbors of α is defined by Nα := {i ∈ V |i ∈ α} = α. The degrees of i and α are given by di := |Ni| and dα := |Nα| = |α|, respectively. If all the degrees of hyperedges are two, then the hypergraph is naturally identified with an ordinary graph.\nIn order to describe the message passing algorithm in Subsection 2.2.2, it is convenient to identify a relation i ∈ α with a directed edge α → i. For example, let H = ({1, 2, 3, 4}, {α1 , α2, α3}), where α1 = {1, 2}, α2 = {1, 2, 3, 4} and α3 = {4}; this hypergraph is shown as a directed graph in Fig. 1. Explicitly writing the set of directed edges ~E, a hypergraph H is also denoted by H = (V ∪ F, ~E). Note that, forgetting the edge directions, H is also represented as a bipartite graph (Fig. 2).\nWe define basic notions of hypergraphs via its corresponding bipartite graphs. A hypergraph H is connected (resp. tree) if the corresponding bipartite graph is connected (resp. tree). In the same way, the number of connected components (resp. nullity) of H is defined and denoted by k(H) (resp. n(H)). Therefore, n(H) := |V |+ |F | − | ~E| and a hypergraph H is a tree if and only if n(H) = 0 and k(H) = 1.\nOur primary interest is probability density functions that have factorization structures represented by hypergraphs. In such situations, a hypergraph is often referred to as a factor graph and a hyperedge as a factor.\nDefinition 1 Let H = (V, F ) be a hypergraph. For each i ∈ V , let xi be a variable that takes values in a set Xi. A probability density function p on x = (xi)i∈V is said to be graphically factorized with respect to H if it has the following factorized form\np(x) = 1\nZ\n∏\nα∈F\nΨα(xα), (1)\nwhere xα = (xi)i∈α, Z is the normalization constant and Ψα are positive valued functions called compatibility functions. A set of compatibility functions, giving a graphically factorized density function, is called a graphical model. The associated hypergraph H is called the factor graph of the graphical model.\nFactor graphs are introduced by Kschischang et al. (2001). Any probability density function on X = ∏i∈V Xi is trivially graphically factorized with respect to the “one-factor hypergraph”, where the unique factor includes all vertices. It is more informative if the factorization involves factors of small size. Our implicit assumption throughout this paper is that for all factors α, Xα = ∏\niXi are small enough, in the sense of cardinality or dimension, to be handled efficiently by computers."}, {"heading": "2.2 Loopy Belief Propagation algorithm", "text": "Given a graphical model, our task is to solve inference problem such as computation of marginal/conditional density functions and the partition function. Belief Propagation (BP) efficiently computes the exact marginals of a joint distribution that is factorized according to a tree-structured factor graph; Loopy Belief Propagation (LBP) is a heuristic application of the algorithm for factor graphs with cycles, showing successful performance in various problems.\nFirst, in Subsection 2.2.1, we introduce a collection of exponential families called inference family to formulate the LBP algorithm. In order to perform inferences using LBP, we have to fix an inference family that “includes” the given graphical model. Our formulation is a variant of the approach by Wainwright et al. (2003a), where over-complete sufficient statistics are exploited. The detail of the LBP algorithm is described in Subsections 2.2.2."}, {"heading": "2.2.1 Exponential families and Inference family", "text": "To clarify notations, here we summarize basic facts on exponential families. Let (X ,B, ν) be a measure space. For given n real valued functions (sufficient statistics) φ(x) = (φ1(x), . . . , φn(x)), an exponential family is given by\np(x; θ) = exp\n(\nN ∑\ni=1\nθiφi(x)− ψ(θ) ) , ψ(θ) := log ∫ exp ( N ∑\ni=1\nθiφi(x)\n)\ndν(x).\nThe natural parameter, θ, ranges over the set Θ := int{θ ∈ RN ;ψ(θ) < ∞}, where int denotes the interior of the set. The function ψ(θ) is called the log partition function. We always assume that the Hessian of this function (i.e. the covariance matrix) is invertible. The derivative of the log partition function gives a bijective map\nΛ : Θ ∋ θ 7−→ ∂ψ ∂θ (θ) = Epθ [φ] ∈ Y := Λ(Θ)\nand this alternative parameter η = ∂ψ∂θ (θ) is called expectation parameter. The inverse of this map is given by the derivative of the Legendre transform ϕ(η) = supθ∈Θ( ∑\ni θiηi−ψ(θ)) = EpΛ−1(η) [log pΛ−1(η)].\nExample 1 [Multinomial distributions] Let X = {0, . . . , N − 1} be a finite set with the uniform base measure. One way of taking sufficient statistics is\nφk(x) =\n{\n1 if x = k 0 otherwise (2)\nfor k = 0, . . . , N − 2. Then the given exponential family is called multinomial distributions and coincide with the all probability density functions on X that has positive probabilities for all elements of X . The region of natural parameters is Θ = RN−1 and the of expectation parameters is the interior of the probability simplex. That is, Y = {(y1, . . . , yN ); ∑N k=1 yk = 1, yk > 0}.\nExample 2 [Gaussian distributions] Let X = Rn with the Lebesgue measure and The exponential family given by the sufficient statistics φ(x) = (xi, xjxk)1≤i≤n,1≤j≤k≤n, is called Gaussian distributions, consists of probability density functions of the form\np(x; θ) = exp (\n∑\ni≤j\nθijxixj + ∑\ni\nθixi − ψ(θ) ) .\nExample 3 [Fixed-mean Gaussian distributions] For a given mean vector µ = (µi), the fixed-mean Gaussian distributions is the exponential family obtained by the sufficient statistics φ(x) = {(xi − µi)(xj − µj)}1≤i≤j≤n.\nHere and below, we construct a set of exponential families. In order to perform inferences using LBP for a given graphical model, we have to fix a “family” that includes the given probability density function.\nLet H = (V, F ) be a hypergraph. First, for each vertex i, we consider an exponential family Ei with a sufficient statistic φi and a base measure νi on Xi. A natural parameter, expectation parameter, the log partition function and its Legendre transform are denoted by θi, ηi, ψi and ϕi respectively. Secondly, for each factor α = {i1, . . . , idα}, we give an exponential family Eα on Xα = ∏ i∈α Xi with the base measure να = ∏\ni∈α νi and a sufficient statistic φα of the form\nφα(xα) = (φ〈α〉(xα), φi1(xi1), . . . , φidα (xidα )). (3)\nAn important point is that φα includes the sufficient statistics for i ∈ α as its components in addition to φ〈α〉 indexed by α ∈ F . The natural parameter, expectation parameter, log partition function and its Legendre transform are denoted by\nθα = (θ〈α〉, θα:i1 , . . . , θα:idα ) ∈ Θα, ηα = (η〈α〉, ηα:i1 , . . . , ηα:idα ) ∈ Yα, ψα and ϕα. (4)\nThe following assumption is indispensable to our analysis:\nAssumption 1 For all i ∈ V and α ∈ F , we assume that the Hessian of the log partition functions , ψi and ψα, (i.e. the covariance matrix) are invertible in the parameter spaces.\nIn order to use these exponential families Eα and Ei for LBP, we need another assumption: the family is “closed” under marginalization operation. This type of condition on exponential families is also considered in other litterateurs (Mardia et al., 2009).\nAssumption 2 (Marginally closed assumption) For all pair of i ∈ α, ∫\np(xα)dναri(xαri) ∈ Ei for all p ∈ Eα. (5)\nDefinition 2 If a collection of the exponential families I := {Eα, Ei} given by sufficient statistics (φ〈α〉(xα), φi(xi))α∈F,i∈V as above satisfies Assumptions 1 and 2, it is called an inference family associated with a hypergraph H. An inference family is called pairwise if the associated hypergraph is a graph.\nAn inference family has a parameter set Θ = ∏ αΘα × ∏\niΘi, which is bijectively mapped to the dual parameter set Y = ∏\nα Yα × ∏\ni Yi by the maps of respective components. An inference family naturally defines an exponential family on X = ∏i Xi of the sufficient statistic (φ〈α〉(xα), φi(xi))α∈F,i∈V . We denote it by E(I).\nExample 4 [Binary pairwise inference family] Consider the case that a graph G = (V,E) is the factor graph. For each i ∈ V , we define an exponential family Ei on Xi = {0, 1} defined by φi(xi) = xi. For each {i, j} ∈ E, we also define multinomial exponential family E{i,j} on {0, 1}2 by φ{i,j}(xi, xj) = (xi, xj , xixj), where φ〈i,j〉(xi) = xixj. Then these exponential family gives an inference family since Assumption 2 is trivially satisfied.\nExample 5 [Multinomial inference family] Let Ei be an exponential family of multinomial distributions. Choosing functions φ〈α〉(xα), we can make the Eα being multinomial distributions on Xα; more precisely, we choose φ〈α〉(xα) so that the components of φα(xα), which are regarded as ∏\ni |Xi| dimensional vectors, are linearly independent. Then we obtain an inference family called a multinomial inference family.\nExample 6 [Gaussian inference family] We consider the case1 that Xi = R . For Gaussian case, given a factor graph H = (V, F ), the sufficient statistics are given by\nφi(xi) = (xi, x 2 i ), φ〈α〉(xα) = (xixj)i,j∈α,i 6=j.\nThen the inference family is called Gaussian inference family. Assumption 2 is satisfied because a marginal of a Gaussian density function is a Gaussian density function. Fixedmean inference family is analogously defined by φi(xi) = (xi − µi)2 and φ〈α〉(xα) = ((xi − µi)(xj−µj))i,j∈α,i 6=j. Usually, for Gaussian cases, the factor graph H is a graph rather than hypergraphs; thus, we only consider Gaussian inference families on graphs. 2"}, {"heading": "2.2.2 LBP algorithm", "text": "The LBP algorithm calculates the approximate marginals of a given graphical model Ψ = {Ψα} using the inference family inference family I. We always assume that the inference family includes the given probability density function:\nAssumption 3 For every factor α ∈ F , there exists θ̄α s.t.\nΨα(xα) = exp ( 〈θ̄α, φα(xα)〉 ) . (6)\n1. Extensions to high dimensional case, i.e. Xi = R ri , is straight forward. 2. Extensions to the cases of hypergraphs are also straightforward.\nThis is equivalent to the assumption\np(x) = 1\nZ\n∏\nα\nΨα(xα) ∈ E(I) (7)\nup to trivial re-scaling of Ψα, which does not affect LBP algorithm. The procedures of the LBP algorithm is as follows (Kschischang et al., 2001). For each pair of a vertex i ∈ V and a factor α ∈ F satisfying i ∈ α, an initialized message is given in the form of m0α→i(xi) = exp(〈µ0α→i, φi(xi)〉), (8) where the choice of µ0α→i is arbitrary. The set {m0α→i} or {µ0α→i} is called an initialization of the LBP algorithm. At each time t, the messages are updated by the following rule:\nmt+1α→i(xi) = ω\n∫\nΨα(xα) ∏\nj∈α,j 6=i\n∏\nβ∋j,β 6=α\nmtβ→j(xj) dναri(xαri) (t ≥ 0), (9)\nwhere ω is a certain scaling constant.3 See Fig 3 for the illustration of this message update scheme. From Assumptions 2 and 3, the messages keep the form of Eq. (8).\nSince this update rule simultaneously generates all messages of time t + 1 by those of time t, it is called a parallel update. Another possibility of the update is a sequential update, where, at each time step, one message is chosen according to some prescribed or random order of directed edges. In this paper, we mainly discuss the parallel update.\nWe repeat the update Eq. (9) until the messages converge to a fixed point, though this procedure is not guaranteed to converge. Indeed, it sometimes exhibits oscillatory behaviors. The set of LBP fixed points does not depend on the choices of the update rule, but converging behavior, or dynamics, does depend on the choices.\nIf the algorithm converges, we obtain the fixed point messages {m∗α→i} and beliefs that are defined by\nbi(xi) := ω ∏\nα∋i\nm∗α→i(xi) (10)\nbα(xα) := ωΨα(xα) ∏\nj∈α\n∏\nβ∋j,β 6=α\nm∗β→j(xj), (11)\n3. Here and below, we do not care about the integrability problem. For multinomial and Gaussian cases, there are no problems.\nwhere ω denotes (not necessarily the same) normalization constants that require ∫\nbi(xi)dνi = 1 and\n∫\nbα(xα)dνα = 1. (12)\nNote that beliefs automatically satisfy the conditions bα(xα) > 0 and ∫\nbα(xα)dναri(xαri) = bi(xi). (13)\nThe beliefs are used for approximation of the true marginal density functions. If H is a tree, the LBP algorithm stops at most | ~E| updates and the computed beliefs are equal to the exact marginals of the given density function."}, {"heading": "2.3 Bethe free energy and characterization of LBP fixed points", "text": "The Bethe approximation was initiated by Bethe (1935) and was found to be essentially equivalent to LBP by Yedidia et al. (2001). The modern formulation for presenting the approximation is a variational problem of the Bethe free energy (An, 1988). In this subsection, we summarize these facts in our settings.\nFirst, we should introduce the Gibbs free energy function because the Bethe free energy function is a computationally tractable approximation of the Gibbs free energy function. For given graphical model Ψ = {Ψα}, the Gibbs free energy FGibbs is a convex function over the set of probability distributions p̂ on x = (xi)i∈V defined by\nFGibbs(p̂) =\n∫\np̂(x) log\n(\np̂(x) ∏\nαΨα(xα)\n)\ndν(x), (14)\nwhere ν = ∏ i∈V νi is the base measure on X = ∏ i∈V Xi. Using Kullback-Leibler divergence D(q||p) = ∫\np̂ log(q/p), Eq. (14) comes to FGibbs(p̂) = D(p̂||p)− logZ. Therefore, the exact density function Eq. (1) is characterized by a variational problem\np(x) = argmin p̂ FGibbs(p̂), (15)\nwhere the minimum is taken over all probability distributions on x. As suggested from the name of “free energy”, the minimum value of this function is equal to − logZ.\nIn many cases including discrete variables, computing values of the Gibbs free energy function is intractable in general because the integral in Eq. (14) is indeed a sum over |X | = ∏i |Xi| states. We introduce functions called Bethe free energy that does not include such an exponential number of state sum.\nDefinition 3 The Bethe free energy (BFE) function is a function of expectation parameters. For a given inference family I, define L(I) := {η = {ηα, ηi} ∈ Y |ηα:i = ηi ∀(i ∈ α)} 4. On this set, the Bethe free energy function is defined by\nF (η) := − ∑\nα∈F\n〈θ̄α, ηα〉+ ∑\nα∈F\nϕα(ηα) + ∑\ni∈V\n(1− di)ϕi(ηi), (16)\nwhere θ̄α is the natural parameter of Ψα in Eq. (6).\n4. We often write L(I) as L when I is obvious from the context. Since Y = ∏ α Yα × ∏\ni Yi is convex, L is a convex set. If the inference family is multinomial, the closure of this set is called local polytope (Wainwright and Jordan, 2008, 2003).\nAn expectation parameter specifies a probability density function in the exponential family. Thus, η ∈ Y specifies {bα(xα), bi(xi)}α∈F,i∈V , where bα(xα) ∈ Eα and bi(xi) ∈ Ei. The constraint ηα:i = ηi means that\n∫\nφi(xi)bα(xα)dνα =\n∫\nφi(xi)bi(xi)νi.\nUnder Assumption 3, this condition is equivalent to ∫\nbα(xα)dναri = bi(xi) because a probability density function in Ei is specified by the expectation of φi(xi). An element of L is called a set of pseudomarginals. Therefore, we have the following identification\nL = { {bα(xα), bi(xi)}α∈F,i∈V | bα(xα) ∈ Eα, bi(xi) ∈ Ei and ∫ bα(xα)dναri = bi(xi) } .\nThe second condition is called local consistency. Under this identification, the Bethe free energy function is\nF ({bα(xα), bi(xi)}) = − ∑\nα∈F\n∫\nbα(xα) log Ψα(xα)dνα + ∑\nα∈F\n∫\nbα(xα) log bα(xα)dνα\n+ ∑\ni∈V\n(1− di) ∫ bi(xi) log bi(xi)dνi.\nIf H is a tree, the variational problem of the Bethe free energy over L is equivalent to that of the Gibbs free energy in the following sense. See Wainwright and Jordan (2008) for more details. First, it can be shown that, for any {bα(xα), bi(xi)} ∈ L,\nΠ({bα(xα), bi(xi)}) := ∏\nα\nbα(xα) ∏\ni\nbi(xi) 1−di (17)\nis a probability density function because it is summed up to one. For these type of density functions, we can see that the Gibbs free energy function is equal to the Bethe free energy function: F = FGibbs ◦ Π. Secondly, it is also known that the true density function p for a tree has the factorization of the form Eq. (17). Therefore, the variational problem Eq. (15) reduces to that of the Bethe free energy function over L.\nFor general factor graphs, the Bethe variational problem approximates the Gibbs variational problem and a minimizer of the Bethe problem can be used to approximate the marginal density function. As shown by Pakzad and Anantharam (2002), the Bethe free energy function is convex if the factor graph has at most one cycle. Therefore, the minimization of the Bethe free energy is easy for these cases. In general, however, the convexity of F is broken as the nullity of the underlying factor graph becomes large, yielding multiple minima. Though the functions ϕα and ϕi are convex, the negative coefficients (1−di) makes the function F complex. The positive-definiteness of the Hessian of the Bethe free energy will be analyzed in Section 4 and 5.\nThe Bethe free energy function gives an alternative description of the LBP fixed points. The following fact is shown by Yedidia et al. (2001); LBP finds a stationary point of the Bethe free energy function, which is a necessary condition of the minimality. We give the proof in our term in Appendix A.2.\nTheorem 4 Let I be an inference family and Ψ = {Ψα} be a graphical model. The following sets are naturally identified each other.\n1. The set of fixed points of loopy belief propagation.\n2. The set of stationary points of F over L(I)."}, {"heading": "3. Graph zeta function", "text": "The aim of this section is to introduce the graph zeta function and develop some results, which are used in the later sections.\nIhara’s graph zeta function was originally introduced by Y. Ihara (1966) for a certain algebraic object, and was abstracted and extended to be defined on arbitrary finite graphs by J. P. Serre (1980), Sunada (1986) and Bass (1992). The edge zeta function is a multivariable generalization of Ihara’s graph zeta function, allowing arbitrary scalar weight for each directed edge (Stark and Terras, 1996). Extending those graph zeta functions, we introduce a graph zeta function defined on hypergraphs with matrix weights.\nThe central result of this section is the Ihara-Bass type determinant formula in Subsection 3.2. This formula plays an important role in deriving the positive definiteness condition in Subsection 3.4. These results are utilized to establish the relations between this zeta function and the LBP algorithm in the next section."}, {"heading": "3.1 Definition of the graph zeta function", "text": "In the first part of this subsection, we further introduce basic definitions and notations of hypergraphs required for the definition of our graph zeta function.\nLet H = (V, F ) be a hypergraph. As noted before, it can be regarded as a directed graph H = (V ∪ F, ~E). For each edge e = (α → i) ∈ ~E, s(e) = α ∈ F is the starting hyperedge of e and t(e) = i ∈ V is the terminus vertex of e. If two edges e, e′ ∈ ~E satisfy conditions t(e) ∈ s(e′) and t(e) 6= t(e′), this pair is denoted by e ⇀ e′. (See Figure 4.) A sequence of directed edges (e1, . . . , ek) is said to be a closed geodesic if el ⇀ el+1 for l ∈ Z/kZ. For a closed geodesic c, we may form the m-multiple cm by repeating c m-times. If c is not a multiple of strictly shorter closed geodesic, c is said to be prime. For example, a closed geodesic c = (e1, e2, e3, e1, e2, e3) is not prime because c = (e1, e2, e3)\n2. A closed geodesic c = (e1, e2, e3, e4, e1, e2, e3) is prime because it is not c 6= c′m for any c′ and m(≥ 2). Two closed geodesics are said to be equivalent if one is obtained by cyclic permutation of the other. For example, closed geodesics (e1, e2, e3), (e2, e3, e1) and (e3, e1, e2) are equivalent. An equivalence class of a prime closed geodesic is called a prime cycle. The set of prime cycles of H is denoted by PH .\nIfH is a graph (i.e. dα = 2 for all α ∈ F ), these definitions reduce to standard definitions (Kotani and Sunada, 2000). (We will explicitly give them in Subsection 3.3.) In this case, a factor α = {i, j} is identified with an undirected edge ij and (α → i) is identified with a directed edge (i → j).\nUsually, in graph theory, Ihara’s graph zeta function is a uni-variate function and associated with a graph. Our graph zeta function is much more involved: it is defined on a hypergraph having weights of matrices. To define matrix weights, we have to prescribe its sizes; we associate a positive integer re with each edge e ∈ ~E.\nHere are additional notations used in the following definition. The set of functions 5 on ~E that take values on Cre for each e ∈ ~E is denoted by X( ~E). The set of n1 × n2 complex matrices is denoted by M(n1, n2).\nDefinition 5 Assume that for each e′ ⇀ e, a matrix weight ue′⇀e ∈ M(re, re′) is associated. For this matrix weights u = {ue′⇀e}, the graph zeta function of H is defined by\nζH(u) := ∏\np∈PH\n1\ndet ( I − π(p) ) ,\nwhere π(p) := uek⇀e1 . . . ue2⇀e3ue1⇀e2 for p = (e1, . . . , ek).\nSince det(In −AB) = det(Im −BA) for n×m and m× n matrices A and B, det(I − π(p)) is well defined for an equivalence class p. The definition is an analogue of the Euler product formula of the Riemann zeta function which is represented by the product over all the prime numbers.\nIf H is a graph and re = 1 for all e ∈ ~E, this zeta function reduces to the edge zeta function by Stark and Terras (1996). If in addition all these scalar weights are set to be equal, i.e. ue′⇀e = u, the zeta function reduces to the Ihara zeta function. These reductions will be discussed in Subsection 3.3. Moreover, for general hypergraphs, we obtain the onevariable hypergraph zeta function by setting all matrix weights to be the same scalar u (Storm, 2006).\nExample 7 ζH(u) = 1 if H is a tree. For 1-cycle graph CN of length N , the prime cycles are (e1, e2, . . . , eN ) and (ēN , ēN−1, . . . , ē1). (See Figure 5.) The zeta function is\nζCN (u) = det(Ire1 − ueN⇀e1 . . . ue2⇀e3ue1⇀e2 ) −1 det(IrēN − uē1⇀ēN . . . uēN−1⇀ēN−2uēN⇀ēN−1) −1.\nExcept for the above two types of hypergraphs, the number of prime cycles is infinite. Therefore, rigorously speaking, we have to care about the convergence of the product and restrict the definition for sufficiently small matrix weights u. However, as we will see below, the zeta function has a determinant formula and is well defined on the whole space of matrix weights. The proof is given in Appendix A.2.\n5. In mathematical usage, this is not a “function” because it takes a value on a different set for each argument e ∈ ~E. However, we do not stick this point.\nTheorem 6 (The first determinant formula of zeta function) We define a linear operator M(u) : X( ~E) → X( ~E) by\nM(u)f(e) = ∑\ne′:e′⇀e\nue′⇀ef(e ′) f ∈ X( ~E).\nThen, the following formula holds\nζG(u) −1 = det(I −M(u)).\nThis type of determinant formula is well known in the context of graph zeta functions; in fact this theorem is a straightforward generalization of Theorem 3 of Stark and Terras (1996). In the next section we derive a new determinant formula of the zeta function by manipulating the matrix M(u) in the above determinant.\nNote that the matrix representation of the operator M(u) is\nM(u)e,e′ = { ue′⇀e if e ′ ⇀ e\n0 otherwise.\nThe simplification of this matrix obtained by setting re = 1 and u = 1 is called directed edge matrix and denoted by M (Stark and Terras, 1996). Kotani and Sunada (2000) call this matrix a Perron-Frobenius operator. A noteworthy difference, in our and their definitions, is that directions of edges are opposite, because we choose the directions to be consistent with illustrations of the LBP algorithm."}, {"heading": "3.2 Determinant formula of Ihara-Bass type", "text": "In the previous subsection, we have shown that the zeta function is expressed as a determinant of size ∑\ne∈ ~E re. In this subsection, we show another determinant expression with additional assumptions on the matrix weights. The formula is called Ihara-Bass type determinant formula and plays a key role in proofs of Theorem 10 and Theorem 11.\nIn the rest of this subsection, we fix a set of positive integers {ri}i∈V associated with vertices. Let {uαi→j}α∈F,i,j∈α be a set of matrices uαi→j ∈ M(rj , ri,). Our additional assumption on the set of matrix weights, which is the argument of the zeta function, is that\nre := rt(e) and ue′⇀e := u s(e) t(e′)→t(e).\nThen the graph zeta function can be seen as a function of u = {uαi→j}. With slight abuse of notation, it is also denoted by ζH(u). Later in Section 4, ri corresponds to the dimension of the sufficient statistic φi, and u α i→j to a matrix Varbj [φj ] −1Covbα [φj, φi].\nTo state the Ihara-Bass type determinant formula, we introduce a linear operator ι(u) : X( ~E) → X( ~E) defined by\n(ι(u)f)(e) := ∑\ne′: s(e ′)=s(e)\nt(e′) 6=t(e)\nu s(e) t(e′)→t(e)f(e ′) f ∈ X( ~E).\nThe matrix representation of ι(u) is a block diagonal matrix because it acts on each factor separately. Therefore I + ι(u) is also a block diagonal matrix. Each block is indexed by α ∈ F and denoted by Uα. Thus, for α = {i1, . . . , idα},\nUα =\n\n    \nIri1 u α i2→i1 · · · uαidα→i1 uαi1→i2 Iri2 · · · uαidα→i2\n... ...\n. . . ...\nuαid1→idα uαid2→idα · · · Iri dα\n\n     . (18)\nWe also define wαi→j by the elements of Wα = U −1 α :\nWα =\n\n    \nwαi1→i1 w α i2→i1 · · · wαidα→i1 wαi1→i2 w α i2→i2\n· · · wαidα→i2 ... ... . . .\n... wαid1→idα wαid2→idα · · · wαidα→idα\n\n     . (19)\nSimilar to the definition of X( ~E) in Subsection 3.1, we define X(V ) as the set of functions on V that takes value on Cri for each i ∈ V .\nTheorem 7 (Determinant formula of Ihara-Bass type) Let D be W are linear transforms on X(V ) defined by\n(Dg)(i) := dig(i), (Wg)(i) := ∑\ne,e′∈~E t(e)=i,s(e)=s(e′)\nw s(e) t(e′)→ig(t(e ′)). (20)\nThen, we have the following formula\nζG(u) −1 = det\n( IrV −D +W )\n∏\nα∈F\ndetUα,\nwhere rV := ∑ i∈V ri\nThe proof is given in Appendix A.2"}, {"heading": "3.3 Ihara-Bass type determinant formula on ordinary graphs", "text": "In this subsection, we explicitly write definitions and the above formula for better understanding. A hypergraph H = (V, F ), which has only hyperedges of degrees two, is naturally identified with an (undirected) graph GH = (V,E). In the next section, we see that this case corresponds to the pairwise inference family.\nFirst, we define the zeta function ZG of a graph G = (V,E). For each undirected edge, we make a pair of oppositely directed edges, which form a set of directed edges ~E. Thus | ~E| = 2|E|. For each directed edge e ∈ ~E, o(e) ∈ V is the origin of e and t(e) ∈ V is the terminus of e. For e ∈ ~E, the inverse edge is denoted by ē, and the corresponding undirected edge by [e] = [ē] ∈ E.\nA closed geodesic in G is a sequence (e1, . . . , ek) of directed edges such that t(ei) = o(ei+1), ei 6= ēi+1 for i ∈ Z/kZ. Prime cycles are defined in the same manner to that of hypergraphs. The set of prime cycles is denoted by PG.\nDefinition 8 Let G = (V,E) a graph. For given positive integers {ri}i∈V and matrix weights u = {ue}e∈ ~E with ue ∈ M(rt(e), ro(e)),\nZG(u) := ∏\np∈PG\ndet(1− π(p))−1, π(p) := ue1 · · · uek for p = (e1, . . . , ek).\nSince PGH is naturally identified with PH , ZGH = ζH holds. This zeta function is the matrix weight extension of the edge zeta function analyzed by Stark and Terras (1996).\nSince the degree of every hyperedge is equal to two for a graph, the matrix Wα defined in Eq. (19) has explicit expressions. Using this fact, we obtain the following simplification of Theorem 7.\nCorollary 9 For a graph G = (V,E),\nZG(u) −1 = det(I + D̂(u)− Â(u))\n∏\n[e]∈E\ndet(I − ueuē), (21)\nwhere D̂ and Â are defined by\n(D̂(u)g)(i) := ( ∑\ne:t(e)=i\n(Iri − ueuē)−1ueuē ) g(i), (22)\n(Â(u)g)(i) := ∑\ne:t(e)=i\n(Iri − ueuē)−1ueg(o(e)). (23)\nProof For e = (i → j), the U[e] block is given by\nU[e] =\n[\nIri ue uē Irj\n]\nTherefore detU[e] = det(Iri − ueuē) and the inverse W[e] is\nW[e] =\n[\n(Iri − ueuē)−1 0 0 (Irj − uēue)−1\n] [\nIri −ue −uē Irj\n]\n.\nPlugging these equations into Theorem 7, we obtain the assertion.\nMizuno and Sato (2004); Horton et al. (2008) have derived a weighted graph version of Ihara-Bass type determinant formula under assumption that the scalar weights {ue} satisfy conditions ueuē = u\n2. In this case, the factors (1−ueuē)−1 in Eqs. (22,23) do not depend on e and Eq. (21) is further simplified. Corollary 9 gives the extension of the result to graphs with arbitrary weights. A direct proof of Corollary 9, without discussing hypergraphs, is found in the supplementary material of Watanabe and Fukumizu (2009).\nIf all the weights are set to u, the result reduces to the following formula known as Ihara-Bass formula:\nZG(u) −1 = (1− u2)|E|−|V | det(I − uA+ u2(D − I)),\nwhere D is the degree matrix defined by Di,j = diδi,j, and A is the adjacency matrix by\nAi,j = { 1 if {i, j} ∈ E 0 otherwise.\nMany authors have discussed the proof of the Ihara-Bass formula. The first proof was given by Bass (1992). See Kotani and Sunada (2000); Stark and Terras (1996) for others. A combinatorial proof is given by Foata and Zeilberger (1999)."}, {"heading": "3.4 Positive definiteness condition", "text": "The Ihara-Bass type determinant formula relates the matrices M(u) and (IrV − D +W). In the later sections, we see that M(u) corresponds to the derivative of the LBP update and (IrV −D +W) is closely related to the Hessian of the Bethe free energy function.\nThe following theorem is fundamental to prove Theorem 14.\nTheorem 10 Assume that u = {uαi→j}α∈F,i,j∈α satisfies uαi→j = uαj→i and ‖uαi→j‖ < 1, where ‖ · ‖ is an arbitrary operator norm. If Spec(M(u)) ⊂ C r R≥1, where Spec(·) denotes the set of eigenvalues, then (IrV −D +W) is a positive definite matrix. Proof From the assumption of symmetry, Wα in Eq. (19) is a symmetric matrix. Therefore, W, defined in Eq. (20), is also symmetric. To prove the positive definiteness, we define uαi→j(t) := tu α i→j (t ∈ [0, 1]), which implies M(u(t)) = tM(u). From the assumption, Uα(t) is invertible and thus Wα(t) is well defined for all t. If t = 0, Wα(0) = D and I − D + W(0) = I is obviously positive definite. Since the eigenvalues of a symmetric matrix are real and continuous with respect to its entries, it is enough to prove that det(I − D + W(t)) 6= 0 on the interval [0, 1]. Under the condition on the eigenvalues of M(u), det(I −M(u(t))) 6= 0 holds for t ∈ [0, 1]. Therefore, Theorem 7 implies the claim."}, {"heading": "4. Main theoretical results", "text": "In this section, we establish the connection between the graph zeta function and the Bethe free energy function. These results form a basis of the analyses in later sections.\nIn Subsection 4.1, we prove a formula using the Ihara-Bass type determinant formula proved in the previous section. The formula shows a concrete relation between the Bethe free energy function and the graph zeta function. In Subsection 4.2, we give a condition that the Hessian of the Bethe free energy function is positive-definite."}, {"heading": "4.1 Bethe-zeta formula", "text": "In this subsection, we show that the determinant of the Hessian of the Bethe free energy function is essentially equal to the reciprocal of the graph zeta function6.\nIn order to make the assertion clear, we first recall the definitions and notations. Let H = (V, F ) be a hypergraph and let I = {Eα, Ei} be an inference family on H. Exponential families Ei and Eα are given by sufficient statistics φi and φα as discussed in Subsection 2.2.1. Furthermore, as discussed in Subsection 2.3, a point η = {η〈α〉, ηi} ∈ L is identified with a set of pseudomarginals {bα(xα), bi(xi)}α∈F,i∈V .\nTheorem 11 At any point of η = {η〈α〉, ηi} ∈ L the following equality holds.\nζH(u) −1= det(I −M(u)) = det(∇2F )\n∏\nα∈F\ndet(Varbα [φα]) ∏\ni∈V\ndet(Varbi [φi]) 1−di ,\nwhere uαi→j := Varbj [φj ] −1Covbα [φj , φi] (24)\nis an rj×ri matrix, and ∇2F is the Hessian matrix with respect to the coordinate {η〈α〉, ηi}.\nNote that he Hessian ∇2F does not depend on the given compatibility functions Ψα because those only affect linear terms in F , and thus the formula is a property of inference family I. Note also that the determinants of variances in the formula are always positive, because we assume all the local exponential families Eα and Ei have positive definite covariance matrices.\nThe proof is based on the Ihara-Bass type determinant formula; we check that the Hessian ∇2F is related to the matrix (I −D+W) if weights has the form of Eq. (24). The key condition satisfied on the set L is Varbα [φi] = Varbi [φi]. Proof From the definition of the Bethe free energy function Eq. (16), the (V,V)- block of ∇2F is given by\n∂2F\n∂ηi∂ηi =\n∑\nα∋i\n∂2ϕα ∂ηi∂ηi + (1− di) ∂2ϕi ∂ηi∂ηi , ∂2F ∂ηi∂ηj = ∑\nα⊃{i,j}\n∂2ϕα ∂ηi∂ηj (i 6= j).\nThe (V,F)-block and (F,F)-block are given by\n∂2F\n∂ηi∂η〈α〉 = ∂2ϕα ∂ηi∂η〈α〉 , ∂2F ∂η〈α〉∂η〈β〉 = ∂2ϕα ∂η〈α〉∂η〈β〉 δα,β .\nUsing the diagonal blocks of (F,F)-block, we erase (V,F)-block and (F,V)-block of the Hessian by Gaussian elimination. In other words, we choose a square matrix X such that\n6. An intuitive understanding of this result, based on the Legendre duality of two types of the Bethe free energy functions is discussed by Watanabe (2010)\ndetX = 1 and\nXT (∇2F )X = [ Y 0\n0 ( ∂2F ∂η〈α〉∂η〈β〉 )\n]\n,\nin which\nYi,i = ∑\nα∋i\n{\n∂2ϕα ∂ηi∂ηi − ∂ 2ϕα ∂ηi∂η〈α〉\n(\n∂2ϕα ∂η〈α〉∂η〈α〉 )−1 ∂2ϕα ∂η〈α〉∂ηi\n}\n+ (1− di) ∂2ϕi ∂ηi∂ηi , (25)\nYi,j = ∑\nα⊃{i,j}\n{\n∂2ϕα ∂ηi∂ηj − ∂ 2ϕα ∂ηi∂η〈α〉\n(\n∂2ϕα ∂η〈α〉∂η〈α〉 )−1 ∂2ϕα ∂η〈α〉∂ηj\n}\n. (26)\nOn the other hand, since uαi→j := Varbj [φj ] −1 Covbα [φj , φi], the matrix Uα defined in Eq. (18) is\nUα = diag(Var[φi] −1|i ∈ α) Varbα [(φi)i∈α]. (27)\nSince the matrix Varbα [(φi)i∈α] is a submatrix of Varbα [φα], its inverse can be expressed by submatrices of Varbα [φα] −1 = ∂ 2ϕα ∂ηα∂ηα using the Schur complement formula, which shows that the elements of Wα = U −1 α is given by\nwαj→i =\n{\n∂2ϕα ∂ηi∂ηj − ∂ 2ϕα ∂ηi∂η〈α〉\n(\n∂2ϕα ∂η〈α〉∂η〈α〉 )−1 ∂2ϕα ∂η〈α〉∂ηj\n}\nVar[φj ]. (28)\nIt follows from Eq. (25),(26) and (28) that\nY diag (Var[φi]|i ∈ V ) = I −D +W,\nwhere D and W are defined in Eq. (20). Accordingly, we obtain\nζH(u) −1 = det(I −D +W)\n∏\nα∈F\ndetUα\n= detY ∏\ni∈V\ndet(Var[φi]) ∏\nα∈F\ndet (Varbα [(φi)i∈α]) ∏\nj∈α det (Var[φj ])\n= det ( ∇2F )\n∏\ni∈V\ndet(Var[φi]) 1−di\n∏\nα∈F\ndet (Varbα [(φi)i∈α])\ndet ( ∂2ϕα ∂η〈α〉∂η〈α〉 )\n= det ( ∇2F )\n∏\nα∈F\ndet(Varbα [φα]) ∏\ni∈V\ndet(Varbi [φi]) 1−di ,\nwhere det (Varbα [(φi)i∈α]) det ( ∂2ϕα ∂η〈α〉∂η〈α〉 )−1 = det (Var[φα]) is used.\nIn the rest of this subsection, we rewrite the Bethe-zeta formula in some specific cases. Especially, we give explicit expressions of the determinants of the variance matrices.\nCase 1: Multinomial inference family\nFirst, we consider the multinomial case. If we take the sufficient statistics of multinomial exponential family as in Example 1, the determinant of the variance is\ndet (Varp[φ]) = N ∏\nk=1\np(k).\nTherefore, the theorem reduces to the following form 7.\nCorollary 12 (Bethe-zeta formula for multinomial inference family) For any {bα(xα), bi(xi)} ∈ L the following equality holds.\nζG(u) −1= det(∇2F )\n∏\nα∈F\n∏\nxα\nbα(xα) ∏\ni∈V\n∏\nxi\nbi(xi) 1−di ,\nwhere uαi→j := Varbj [φj ] −1 Covbα [φj , φi] is an (Nj − 1)× (Ni − 1) matrix.\nFor binary and pairwise case, this formula is first shown by Watanabe and Fukumizu (2009).\nCase 2: Fixed-mean Gaussian inference family\nLet G = (V,E) be a graph. We consider the fixed-mean Gaussian inference family on G. For a given vector µ = (µi)i∈V , the inference family is constructed from sufficient statistics φi(xi) = (xi−µi)2 and φ〈i,j〉(xi, xj) = (xi−µi)(xj −µj). Their expectation parameters are denoted by ηii and ηij , respectively. The variances and covariances are\nVar[φi] = 2η 2 ii, Var[φ{i,j}] =\n\n\n2η2ii 2η 2 ij 2ηiiηij 2η2ij 2η 2\njj 2ηjjηij 2ηiiηij 2ηjjηij η 2 ij + ηiiηjj\n\n ,\nwhere φ{i,j}(xi, xj) = ( (xi − µi)2, (xj − µj)2, (xi − µi)(xj − µj) )\n. Therefore, det(Var[φ{i,j}]) = 4(ηiiηjj − η2ij)3.\nCorollary 13 [Bethe-zeta formula for fixed-mean Gaussian inference family ] For any {ηii, ηij} ∈ L the following equality holds.\nZG(u) −1= det(∇2F )\n∏\ni∈V\nη 2(1−di) ii\n∏\nij∈E\n(ηiiηjj − η2ij)3 2|V |,\nwhere ui→j := η 2 ijη −2 jj is a scalar value.\nOne interesting point of this case is that the edge weights ui→j are always positive.\n7. Here, we ignore minor constant factors which come from the choices of sufficient statistics"}, {"heading": "4.2 Positive definiteness condition", "text": "In this section, we derive a condition that guarantees the positive-definiteness of the Hessian of the Bethe free energy function. It is based on Theorem 10, which gives a condition that the matrix (I −D +W) is positive definite in terms of the matrix M(u). As we have seen in the proof of the previous theorem, ∇2F and (I−D+W) are essentially the same. Thus, we obtain the following theorem.\nTheorem 14 Let u be given by η ∈ L using Eq. (24). Then,\nSpec(M(u)) ⊂ Cr R≥1 =⇒ ∇2F (η) is a positive definite matrix.\nBefore the proof of the theorem, we remark the following fact. It implies that we can change the matrix weight to the correlation coefficient matrices.\nLemma 15 Let η be a point in L, uαi→j be given by Eq. (24), and\ncαi→j := Corbα [φj , φi] = Varbα [φj ] −1/2Covbα [φj , φi]Varbα [φi] −1/2\nbe the correlation coefficient matrix, where bα corresponds to η. Then\nSpec(M(u)) = Spec(M(c)). (29)\nProof Define Z by (Z)e,e′ := δe,e′Var[φt(e)]1/2. Then\n(ZM(u)Z−1)e,e′ = Var[φt(e)]1/2M(u)e,e′Var[φt(e′)]−1/2 = M(c)e,e′ .\nProof [Theorem 14] By definition, cαi→j = c α j→i holds. We choose the operator norm induced by the inner product of the vector spaces. In other words, ‖X‖ is equal to the maximum singular value of X. In this case, it is well known that the norm of a correlation coefficient matrix is smaller than 1. From Theorem 10, the matrix (I − D + W) for the weights c = {cαi→j} is positive definite.\nNext, we compute the matrix (I − D + W) for the weight c. Similar to Eq. (28), we obtain\nwαj→i = Var[φi] 1/2\n{\n∂2ϕα ∂ηi∂ηj − ∂ 2ϕα ∂ηi∂η〈α〉\n(\n∂2ϕα ∂η〈α〉∂η〈α〉 )−1 ∂2ϕα ∂η〈α〉∂ηj\n}\nVar[φj ] 1/2.\nTherefore, using the same notations as in the proof of Theorem 11, we have\ndiag (Var[φi]|i ∈ V )1/2 Y diag (Var[φi]|i ∈ V )1/2 = (I −D +W).\nThis equation implies that Y and ∇2F (η) are positive definite.\nTo check the condition of Theorem 14, we need to analyze the extent of the eigenvalues. An easy way for narrowing down the possible region is to bound the spectral radius. For a given square matrix X, the spectral radius of X is the maximum of the modulus of the eigenvalues; it is denoted by ρ(X). The following proposition provides a useful bound. The proof is given in Appendix A.2.\nProposition 16 Let u = {uαi→j} be arbitrary matrix weights and let ‖u‖ = {‖uαi→j‖} be the scalar weights obtained by an arbitrary operator norm. Then,\nρ(M(u)) ≤ ρ( M(‖u‖) ) ≤ max ‖uαi→j‖ ρ(M)"}, {"heading": "5. Analysis of positive definiteness and convexity of BFE", "text": "The Bethe free energy function is not necessarily convex though it is an approximation of the Gibbs free energy function, which is convex. Non-convexity of the Bethe free energy can lead to multiple fixed points. Pakzad and Anantharam (2002) and Heskes (2004) have derived sufficient conditions of the convexity and shown that the Bethe free energy is convex for trees and graphs with one cycle. In this section, not only such a global structure, we shall focus on the local structure of the Bethe free energy function, i.e. the Hessian. Our approach derives the region where the positive definiteness is broken. All the results are based on the techniques developed in the previous section.\nIn Subsection 5.1, as an application of the positive definite condition, we analyze the region where the Hessian of Bethe free energy function is positive definite. The Hessian does not depend on the given compatibility function, Ψ, because it appears in the linear part of the Bethe free energy function. In Subsection 5.2, we deal with the compatibility functions by restricting the Bethe free energy function on a subset S(Ψ) of L. This set consists of the pseudomarginals that has natural parameters {θ̄〈α〉} and thus includes all the fixed point beliefs. We will see that the problem of the uniqueness of the LBP fixed points is reduced to the following problem: is the subset S(Ψ) included in the positive definite region of the original Bethe free energy function?"}, {"heading": "5.1 Region of positive definite and convexity condition", "text": "In this subsection, we simplify Theorem 14 and explicitly see that if the correlation coefficient matrices of the pseudomarginals are sufficiently small, then the Hessian is positive definite. This “smallness” criteria depends on graph geometry.\nIn the following, we choose the operator norm that is equal to the maximum singular value. It is well known that the norm of a correlation coefficient matrix is smaller than 1 under the assumption that the variance-covariance matrix is non-degenerate.\nCorollary 17 (Positive definite region) Let κ be the Perron-Frobenius eigenvalue of M, and define\nLκ−1(I) := { {bα(xα), bi(xi)} ∈ L(I) | ∀α ∈ F, ∀i, j ∈ α, ‖Corbα [φi, φj ]‖ < κ−1 } .\nThen, the Hessian ∇2F is positive definite on Lκ−1(I).\nProof From Proposition 16 and max ‖cαi→j‖ κ < 1, Spec(M(c)) ⊂ {λ ∈ C| |λ| < 1}. Therefore, from Theorem 14, the Hessian is positive definite at the point.\nA bound of the Perron-Frobenius eigenvalue of M is given in Subsection A.1. Roughly speaking, as the degrees of factors and vertices increase, κ also increases and thus Lκ−1\nshrinks. The Perron-Frobenius eigenvalue is equal to 0 (resp. 1) if the hypergraph is a tree (resp. has a unique cycle). This result suggests that LBP works better for graphs of low degree.\nThe convexity of F depends solely on the given inference family and the underlying hypergraph, because the Hessian∇2F does not depend on the given compatibility functions, Ψ = {Ψα}. For multinomial case, Pakzad and Anantharam (2002) have shown that the Bethe free energy function is convex if the hypergraph has at most one cycle. The following theorem extends the result. To show the direction of (i) we have only to analyze the Bethe free energy function on trees and one-cycle hypergraphs. To show (ii), however, we need to capture the effect of cycles on arbitrary hypergraphs.\nTheorem 18 Let H be a connected hypergraph. (i) If n(H) = 0 or 1, then F is convex on L. (ii) Assuming the inference family is either a multinomial, Gaussian or fixed-mean Gaussian, then the converse of (i) holds.\nProof (i) As we have mentioned above, the Perron-Frobenius eigenvalue α of M is equal to 1 if n(H) = 0 and 0 if n(H) = 1. Using Corollary 17, we obtain Lα−1 = L. Therefore, the Bethe free energy function is convex over the domain L. (ii) Here we show the proof only in the case of fixed-mean Gaussian. (Other cases are proved by a similar way in Appendix A.2.) Let G = (V,E) be a graph. For t ∈ [0, 1), define ηii(t) := 1 and ηij(t) := t. Accordingly, u ij i→j = t\n2 and η(t) ∈ L. As t ր 1, η(t) approaches to a boundary point of L. From Theorem 27 in Appendix A.1,\ndet(∇2F (t))(1 − t2)2|E|+|V |−1 = 2−|V |ZG(t2)−1(1− t2)−|E|+|V |−1\n−→ −2|E|−2|V |+1(|E| − |V |)κ(G) (t → 1).\nIf n(G) = |E| − |V | + 1 > 1, the limit value is negative. Therefore, in a neighborhood of the limit point, ∇2F is not positive definite."}, {"heading": "5.2 Convexity of restricted Bethe free energy function", "text": "Our analysis so far has not involved the given compatibility function, because it disappears in the second derivatives. Not only graph structure, however, but also the compatibility functions affect the properties of LBP and the Bethe free energy.\nIn this section, we show a method for dealing with the compatibility functions. We see that the understanding of the positive definite region helps us to deduce a uniqueness condition of LBP."}, {"heading": "5.2.1 Restricted Bethe free energy function", "text": "First, we make simple observations. Since beliefs are given by Eq. (10,11), they must satisfy the following condition: for each factor α, there exists {θ′αi }i∈α such that\nbα(xα) ∝ exp(〈θ̄α, φα〉+ ∑\ni∈α\n〈θ′αi , φi(xi)〉),\nwhere θ̄α is the natural parameter of Ψα. (See Eq. (6).) In other words, we can say that all the beliefs are always in the following subset of L:\nS(Ψ) := { {ηα, ηi} ∈ L | ∀α ∈ F, Λ−1α (ηα)〈α〉 = θ̄〈α〉 } .\nWe can take a coordinate {ηi}i∈V of S(Ψ) because ηα is determined by {ηi}i∈α. We obtain a function by restricting F on the set and taking ηα as arguments. The function is called restricted Bethe free energy function and denoted by F̂ . The following proposition says that the stationary points of F̂ also correspond to the LBP fixed points. (This fact can be also stated as “the fixed points of LBP are the stationary points of the Bethe free energy function.”)\nProposition 19\n∂F̂ ({ηi}) ∂ηj = 0 ∀j ∈ V ⇐⇒ {ηi} ∈ S(Ψ) is an LBP fixed point.\nProof Using the chain rule of derivatives, we have\n∂F̂ ∂ηj = ∂F ∂ηj + ∑\nα∋i\n∂F\n∂η〈α〉\n∂η〈α〉\n∂ηj .\nFrom the definition of F and S(Ψ), we have ∂F∂η〈α〉 = 0 on the set S(Ψ). Therefore, all the derivatives of F are equal to zero if and only if those of F̂ are zero."}, {"heading": "5.2.2 Convexity condition and uniqueness", "text": "In the following, we analyze the (strict) convexity of the restricted Bethe free energy function. Our focus is multinomial models. As a result, we provide a new condition that guarantee the uniqueness. From Proposition 19, the LBP fixed point is unique if F̂ is strictly convex.\nFrom the viewpoint of approximate inference, the uniqueness of LBP fixed point is a preferable property. Since LBP algorithm is interpreted as the variational problem of the Bethe free energy function, an LBP fixed point that correspond to the global minimum is believed to be the best one. If we find the unique fixed point of the LBP algorithm, it is guaranteed to be the global minimum of F .\nTo understand the convexity of F̂ , we analyze the Hessian. It turns out that the positive definiteness of the Hessian of this function is equivalent to the Hessian of F . Note that the Hessian of F̂ is of size “V ” while that of F is of size “V + F”.\nProposition 20 At any points in the set S(Ψ),\n∇2F̂ is positive definite ⇐⇒ ∇2F is positive definite.\nProof By taking the derivative of the equation ∂F∂η〈α〉 = 0 on the set S(Ψ), we obtain\n∂2F\n∂ηi∂η〈α〉 +\n∑\nβ\n∂η〈β〉\n∂ηi\n∂2F\n∂η〈β〉∂η〈α〉 = 0.\nThis equation can be written as ( ∂η〈β〉 ∂ηi ) = −X−1F,FXF,V using a notation\n∇2F = [\nXV,V XV,F XF,V XF,F\n]\n.\nA straightforward computation of the derivatives of F̂ gives ∇2F̂ = XV,V −XV,FX−1F,FXF,V , where we used the above equation. Since the block XF,F is always positive definite, the statement is obvious.\nIf we can verify that the set S(Ψ) is in the region where ∇2F is positive definite, we can show that F̂ is convex. Using Theorem 14, we obtain the following.\nTheorem 21 Define\nWαi,j(Ψ) := sup { ‖Corbα [φi, φj ]‖ | bα(xα) ∝ Ψα(xα) ∏\ni∈α\nfi(xi), fi are positive functions of xi\n}\n."}, {"heading": "If ρ(M(W )) < 1 then F̂ is strictly convex. Therefore, LBP has the unique fixed point.", "text": "Proof Let η be any point in S(Ψ). By definition, ‖Corbα [φi, φj ]‖ is smaller than Wαi,j. From Theorem 14 and Proposition 16, ∇2F̂ is positive definite at the point.\nIn principle, we can compute the weights, W , given the compatibility functions. However, it requires optimizations with respect to f ; we can use standard numerical maximization techniques (Venkataraman, 2009). We leave developing efficient methods for computing the values for future works. For binary pairwise case, we have a useful formulaW {i,j} i,j (Ψi,j) = tanh(|Jij |), where Ψi,j(xi, xj) ∝ eJijxixj+hixi+hjxj (Watanabe and Fukumizu, 2009). Theorem 21 holds for an arbitrary LBP. However, for Gaussian cases we obtain W\n{i,j} i,j =\n1, yielding no meaningful implications. Therefore, in the rest of this section, we focus on multinomial cases."}, {"heading": "5.2.3 Comparison to Mooij’s condition", "text": "For multinomial models, there are several works that give sufficient conditions for the uniqueness property. Heskes (2004) analyzed the uniqueness problem by considering an equivalent min-max problem. Other authors analyzed the convergence property rather than the uniqueness. LBP algorithm is said to be convergent if the messages converge to the unique fixed point irrespective of the initial messages. By definition, this property is stronger than the uniqueness. Tatikonda and Jordan (2002) utilized the theory of Gibbs measure, and showed that the uniqueness of the Gibbs measure implies the convergence of LBP algorithm. Therefore, known sufficient conditions of the uniqueness of\nthe Gibbs measure are that of the convergence of LBP algorithm. Ihler et al. (2006) and Mooij and Kappen (2007) derived sufficient conditions for the convergence by investigating conditions that make the LBP update a contraction; for pairwise case, their conditions are essentially the same.\nWe compare our condition with Mooij’s condition. One reason is that this condition is directly applicable to factor graph models, while Ihler’s and Tatikonda’s conditions are for written for pairwise models. Another reason is that numerical experiments by Mooij and Kappen (2007) suggests that Mooij’s condition is far superior to the condition of Heskes. (See numerical experiments in (Mooij and Kappen, 2007).)\nThe Mooij’s condition is stated as follows.\nTheorem 22 (Mooij and Kappen (2007)) Define\nNij(Ψα) := sup xi 6=x′i sup xj 6=x′j sup xαij 6=x ′ αij\ntanh (1\n4 log\nΨα(xi, xj , xαij ) Ψα(x′i, x ′ j , x ′ αij )\nΨ(x′i, xj , xαij ) Ψ(xi, x′j , x ′ αij ) ) , αij = α\\{i, j}."}, {"heading": "If ρ(M(N )) < 1, then LBP is convergent. Therefore, LBP has a unique fixed point.", "text": "Interestingly, this condition looks similar to our Theorem 21; both of them are stated in terms of the spectral radius of the directed edge matrix, M, with weights. Comparison of these condition is reduced to that of Wij(Ψα) and Nij(Ψα). (Recall that for positive matrices X and Y , ρ(X) ≤ ρ(Y ) if Xij ≤ Yij. ) For binary pairwise case, the conditions coincide; it is not hard to check that Wij = Nij = tanh(|Jij |).\nBy numerical computation, we conjecture that Wij(Ψα) ≤ Nij(Ψα) always holds. In Figure 7, we show a plot for the case of Ψ(x1, x2, x3) = exp(Kx1x2x3 + 0.3 ∑\nxixj), where xi ∈ {±1}. We observe that W and N coincides for large |K|, but W is strictly smaller than N for small |K|.\nNext, we compare conditions of Theorem 21, 22 and the actual LBP convergence region. We run the LBP algorithm on the 3 × 3 square grid of cyclic boundary condition, where the factors correspond to the vertices of the grid and variables are on the edges. Thus, the degree of factors is four and that of vertices is two. The variables are binary (xi ∈ {±1}) and compatibility functions are given in the form of Ψ(x1, x2, x3, x4) = exp(K ∑\ni<j<k xixjxk + J ∑\ni<j xixj); we changed the parameters K and J . All the messages are initialized to constant functions and updated in parallel by Eq. (9). The result is plotted in Figure 7. We judge LBP is convergent if message change is smaller than 10−3 after 30 iterations. We observe that there is a triangle region where uniqueness is guaranteed but LBP does not converge."}, {"heading": "6. Analysis of stability of LBP", "text": "In this section, we analyze relations between the local stability of LBP and the local structure of the Bethe free energy around an LBP fixed point. Since LBP is not the gradient descent of the Bethe free energy function, such a relation is not necessarily obvious. From the view point of the variational formulation, we hope to find the minima. In the celebrated paper by Yedidia et al. (2001), they empirically found that locally stable LBP fixed points\nare local minima of the Bethe free energy function; Heskes (2002) have shown the fact for multinomial case.\nIn the following, we extend the result to two directions. First, we derive the conditions of the local stability and local minimality in terms of the eigenvalues of the matrixM(u), which immediately implies the above fact. Secondly, the result is extended to LBPs formulated by inference family including both multinomial and Gaussian cases. This is possible, since our analysis is based on the techniques developed in Section 4."}, {"heading": "6.1 LBP as a dynamical system", "text": "First, we regard the LBP update as a dynamical system. At each time t, the state of the algorithm is specified by the set of messages {mtα→i}, which is identified with its natural parameters µt = {µtα→i} ∈ R\n~E. In terms of the parameters, the update rule Eq. (9) is written as follows.\nµt+1α→i = Λ −1 i\n(\nΛα(θ̄α, θ̄ α i1 +\n∑\nβ∈Ni1rα\nµtβ→i1 , . . . , θ̄ α ik +\n∑\nβ∈Nikrα\nµtβ→ik)i\n)\n− ∑\nγ∈Nirα\nµtγ→i,\nwhere α = {i1, . . . , idα}, dα = k and Λα(· · · )i is the i-th component (i ∈ α). To obtain this equation, after multiply Eq. (9) by\n∏\nγ∈Nirα\nmtγ→i(xi),\nnormalize it to be a probability density function, and then take the expectation of φi.\nFormally, this update rule can be viewed as a transform T on the set of natural parameters of messages M :\nT : M −→ M, µt = T (µt−1).\nLBP algorithm can be formulated as repeated applications of this map. In this formulation, the fixed points of LBP are {µ∗ ∈ M |µ∗ = T (µ∗)}.\nHere we compute the differentiation of the update map T around an LBP fixed point. This expression derived by Ikeda et al. (2004) for the cases of turbo and LDPC codes.\nTheorem 23 (Differentiation of the LBP update) At an LBP fixed point, the differentiation (linearization) of the LBP update is\n∂T (µ)α→i ∂µβ→j =\n{\nVarbi [φi] −1Covbα [φi, φj ] if j ∈ Nα r i and β ∈ Nj r α, 0 otherwise."}, {"heading": "In other words, at an LBP fixed point η ∈ L, the differentiation of T is", "text": "T ′ = M(u),\nwhere u = {uαi→j} is given by Eq. (24).\nProof First, consider the case that j ∈ Nα r i and β ∈ Nj rα. The derivative is equal to\n∂Λ−1i ∂ηi ∂(Λα)i ∂θα:j = Varbi [φi] −1Covbα [φi, φj ].\nAnother case is i = j and α, β ∈ Ni (α 6= β). Then, the derivative is\n∂Λ−1i ∂ηi ∂(Λα)i ∂θα:i − I = 0\nbecause Varbi [φi] = Varbα [φi] from Eq. (13). In other cases, the derivative is trivially zero.\nThe relation j ∈ Nα r i and β ∈ Nj r α will be written as (β → j) ⇀ (α → i) in Subsection 3.1. It is noteworthy that the elements of the linearization matrix is explicitly expressed by the fixed point beliefs."}, {"heading": "6.2 Spectral conditions", "text": "Let T be the LBP update map. A fixed point µ∗ is called locally stable8 if LBP starting with a point sufficiently close to µ∗ converges to µ∗. To suppress oscillatory behaviors of LBP, damping of update Tǫ := (1 − ǫ)T + ǫI is sometimes useful, where 0 ≤ ǫ < 1 is a damping strength and I is the identity matrix.\nAs we will summarize in the following theorem, the local stability is determined by the linearization T ′ at the fixed point. Since T ′ is nothing but M(u) at an LBP fixed point, Theorem 14 implies relations between the local stability and the Hessian of the Bethe free energy function.\nTheorem 24 Let µ∗ be an LBP fixed point and assume that T ′(µ∗) has no eigenvalues of unit modulus for simplicity. Then the following statements hold.\n8. This property is often referred to as asymptotically stable Guckenheimer and Holmes (1990).\n1. Spec(T ′(µ∗)) ⊂ {λ ∈ C||λ| < 1} ⇐⇒ LBP is locally stable at µ∗.\n2. Spec(T ′(µ∗)) ⊂ {λ ∈ C|Reλ < 1} ⇐⇒ LBP is locally stable at µ∗ with some damping.\n3. Spec(T ′(µ∗)) ⊂ CrR≥1 ⇒ µ∗ is a local minimum of the Bethe free energy function.\nProof 1. : This is a standard result. (See Guckenheimer and Holmes (1990) for example.) 2. : There is an ǫ ∈ [0, 1) that satisfy Spec(T ′ǫ(µ∗)) ⊂ {λ ∈ C||λ| < 1} if and only if Spec(T ′(µ∗)) ⊂ {λ ∈ C|Reλ < 1}. 3. : This assertion is a direct consequence of Theorem 14 and 23.\nThis theorem immediately implies that a locally stable LBP fixed point is a local minimum of the Bethe free energy. The theorem applies to both the multinomial and Gaussian cases.\nIt is interesting to ask under which condition a local minimum of the Bethe free energy function is a locally stable fixed point of (damped) LBP. An implicit reason for the empirical success of the LBP algorithm is that LBP finds a “good” local minimum rather than a local minimum nearby the initial point. The theorem gives a new insight to the question, i.e., the difference between the stable local minima and the unstable local minima in terms of the spectrum of T ′(µ∗)."}, {"heading": "6.3 Special cases: gaps between stability and local minimality", "text": "Here we focus on two special cases: binary pairwise attractive models and pairwise fixedmean Gaussian models. Note that a binary pairwise graphical model Ψ = {Ψij,Ψi} is called attractive if Jij ≥ 0, where Ψi(xi) = exp(hixi) and Ψij(xi, xj) = exp(Jijxixj) (xi, xj ∈ {±1}). In these cases, the stable fixed points of LBP and the local minima of Bethe free energy function are less different.\nConsider the following situation: we have continuously parametrized compatibility functions {Ψij(t),Ψi(t)}t≥0, which are constants at t = 0 (e.g. t is a inverse temperature: Ψij(t) = exp(tJijxixj) and Ψi(t) = exp(thixi)). Starting from t = 0, we run LBP algorithm for t, find a stable fixed point and use it as initial messages of LBP for t + δt, where δt is a sufficiently small positive number. Then we obtain a trajectory of a stable fixed point beliefs: we call it a belief trajectory. It first continuously follow the local minima and then it may jump to another stable fixed point belief at t = t0. The following theorem implies that the stable fixed point becomes unstable by continuous changes of the compatibility functions exactly when the corresponding local minimum becomes a saddle.\nTheorem 25 Suppose that we have a continuously parametrized compatibility functions of attractive binary pairwise model or fixed-mean Gaussian model as above. If the LBP fixed point becomes unstable across t = t0 for the first time following the belief trajectory, then the corresponding local minimum of the Bethe free energy becomes a saddle point across t = t0.\nProof First consider the case of attractive binary pairwise models. From Eq. (11), we see that bij(xi, xj) ∝ exp(Jijxixj + θixi + θjxj) for some θi and θj. From Jij ≥ 0, we have Covbij [xi, xj ] ≥ 0, and thus ui→j ≥ 0. When the LBP fixed point becomes unstable,\nthe Perron-Frobenius eigenvalue of M(u) goes over 1, which means det(I −M(u)) crosses 0. From Theorem 11, we see that det(∇2F ) becomes positive to negative at t = t0. The Gaussian case can be proved analogously. Recall that the weight ui→j are always positive scalars as shown in Corollary 13.\nTheorem 25 extends Theorem 2 of Mooij and Kappen (2005), which discusses only the case of binary pairwise models with vanishing local fields hi = 0 and the trivial fixed point (i.e. Ebi [xi] = 0)."}, {"heading": "7. Summary and discussions", "text": "We have established a connection between graph zeta function, Bethe free energy and loopy belief propagation. We have shown that this connection provides powerful tools for the analysis of Bethe free energy and LBP; key theorems are given in Section 4. In Section 5, based on the theorems, we analyzed the (non) convexity of the Bethe free energy function. Roughly speaking, the positive definite region of Bethe free energy functions shrinks as the Perron-Frobenius eigenvalue of the directed edge matrix becomes large, or equivalently, as the pole of the Ihara zeta function closest to the origin approaches to zero. We have shown that such knowledge can be used to derive the uniqueness property of LBP. In Section 6, we have shown that the local stability of LBP implies local minimality of Bethe free energy as long as LBP is well defined within a class of exponential families. A key observation is that the matrix M(u) is equal to the linearization of the LBP update at LBP fixed points.\nThe Bethe-zeta formula shows that the Bethe free energy function contains information on the graph geometry, especially on the prime cycles. The formula helps extract graph information from the Bethe free energy function. For example we observed that the number of the spanning trees are derived from a limit of the Bethe free energy function. In a sense, the connection between those three objects seems to be natural as all of them becomes “trivial” if the associated graph structure is a tree. If the associated hypergraph is a tree, zeta function is equal to 1, Bethe free energy function is equal to the Gibbs free energy function and LBP reduces to the original BP, which computes exact marginals in finite steps."}, {"heading": "7.1 Path forward", "text": "In this subsection, we list a few directions of future researches going beyond the results of this paper.\nIn a sequel paper (Watanabe and Fukumizu, 2011), we further exploit the connection between LBP, Bethe free energy and graph zeta function to analyze the LBP fixed point equation, focusing on binary pairwise models. We characterize the class of signed graph on which uniqueness of the LBP fixed point is guaranteed. Note that the signs on the edges represents those of the interactions (i.e. sgn Jij). The condition is contrast to the those of the past researches and the result in Section 5, where the strength of interactions (i.e. |Jij |) are bounded.\nIn Subsection 5.2, we have derived a condition for the convexity for the restricted Bethe free energy function. Unfortunately, the expression of the weight W involves sup operator\nand does not easy to compute directly. We need further consideration to find a way of compute it more easily. The proof of the conjecture W ≤ N is also an interesting problem.\nThe connection between graph zeta, Bethe free energy and LBP can be extended to a more general class of free energies including fractional and tree-reweighted types (Wiegerinck and Heskes, 2003; Wainwright et al., 2003b). These free energies are obtained by modifying the coefficients in the definition of the Bethe free energy function. The corresponding graph zeta function then becomes the Bartholdi type, which allows cycles with backtracking (Bartholdi, 1999; Iwao, 2006). The relation may be useful to analyze such class of free energies."}, {"heading": "Acknowledgments", "text": "This work was supported in part by Grant-in-Aid for JSPS Fellows 20-993 and Grant-in-Aid for Scientific Research (C) 22300098."}, {"heading": "Appendix A.", "text": "A.1 Miscellaneous properties of one-variable hypergraph zeta function\nThis subsection provides miscellaneous facts related to the one-variable hypergraph zeta functions. In the analyses of this paper, we sometimes reduce the multivariate zeta to the one-variable zeta. Therefore, it is important to understand the one-variable hypergraph zeta ζH(u) and the directed edge matrix M.\nRecall that ρ(X) denotes the spectral radius of X. We have the following bounds on the spectral radius of M.\nProposition 26 For e ∈ ~E, let ke := |{e′ ∈ ~E; e′ ⇀ e}|, km = min ke and kM = max ke. Then\nkm ≤ ρ(M) ≤ kM .\nTherefore, if H is a graph,\nmin i∈V di − 1 ≤ ρ(M) ≤ max i∈V di − 1. (30)\nProof Since ke = ∑ e′ Me,e′ , the bound is trivial from the easy bound on the spectral radius of non-negative matrices. See Theorem 8.1.22 of Horn and Johnson (1990).\nSince the directed matrix M is non-negative, the spectral radius is equal to the PerronFrobenius eigenvalue. The pole of ζH closest to the origin is u = ρ(M)−1 ≥ k−1M . For the case of Ihara’s zeta function, a bound on the modulus of imaginary poles as well as Eq. (30) are given by Kotani and Sunada (2000).\nFor arbitrary hypergraph, ζH(u) has a pole at u = 1 because det(I − M) = 0. The following theorem gives the multiplicity of the pole. The original version of this theorem is proved by Hashimoto (1989, 1990).\nTheorem 27 (Hypergraph Hashimoto’s theorem (Hashimoto, 1989; Storm, 2006)) Let χ(H) := |V |+ |F | − | ~E| be the Euler number of H.\nlim u→0\nζH(u) −1(1− u)−χ(H)+1 = χ(H)κ(BH ),\nwhere κ(BH) is the number of spanning trees of the bipartite graph BH . (BH is the bipartite graph representation of the hypergraph H.)\nProof For a graph G = (V,E), Hashimoto (1989, 1990) proved that\nlim u→1\nZG(u) −1(1− u)−|E|+|V |−1 = −2|E|−|V |+1(|E| − |V |)κ(G),\nwhere κ(G) is the number of spanning tree of G. A simple proof is given by Northshield (1998). Since there is a one-to-one correspondence between PH and PBH , we have ζH(u) = ZBH ( √ u). Then the assertion is proved from the above formula.\nA.2 Detailed Proofs\nProof of Theorem 4 The conditions for stationary points of the Bethe free energy function are θ̄〈α〉 = θ〈α〉 and ∑\nα∋i(−θ̄α:i + θα:i) + (1− di)θi = 0. (1. ⇒ 2.) The correspondence from the fixed point message to the stationary point is given by Eqs. (10,11). From this construction, we see that\n∏\nα∈F\nΨα(xα) ∝ ∏\nα\nbα(xα) ∏\ni\nbi(xi) 1−di .\nThis implies the above stationary point conditions. (2. ⇒ 1.) The converse correspondence is given by mα→i(xi) = exp(〈θi + θ̄α:i − θα:i, φi〉), where {θα, θi} are the natural parameters of the stationary point pseudomarginals {bα(xα), bi(xi)}. From this construction and the stationary point conditions, we have\n∏\nβ∈Ni\nmβ→i(xi) = exp(〈θi, φi(xi)〉) ∝ bi(xi),\nΨα(xα) ∏\ni∈α\n∏\nβ∈Nirα\nmβ→i(xi) = exp(〈θ〈α〉, φ〈α〉(xα)〉+ ∑\ni∈Nα\n〈θα:i, φi〉) ∝ bα(xα).\nTherefore, the local consistency condition Eq. (13) implies that\n∏\nβ∈Ni\nmβ→i(xi) ∝ ∫ Ψα ∏\nj∈α\n∏\nβ∈Njrα\nmβ→j(xj)dναri.\nThis is equivalent to the LBP fixed point equation.\nProof of Theorem 6 The following proof proceeds in an analogous manner with Theorem 3 in Stark and Terras (1996). First define a differential operator\nH := ∑\ne′⇀e\n∑\nae,ae′\n(ue′⇀e)ae,ae′ ∂\n∂(ue′⇀e)ae,ae′\nwhere (ue′⇀e)ae,ae′ denotes the (ae, ae′) element of the matrix ue′⇀e. If we apply this operator to a k product of u terms, it is multiplied by k. Since log ζH(0) = 0 and log det(I− M(0))−1 = 0, it is enough to prove that H log ζH(u) = H log det(I − M(u))−1. Using equations log detX = tr logX and − log(1− x) = ∑\nk≥1 1 kx k, we have\nH log ζH(u) = H ∑\np∈PH\n− log det(I − π(p))\n= H ∑\np∈PH\n∑\nk≥1\n1 k tr(π(p)k) (31)\n= ∑\np∈PH\n∑\nk≥1\n|p|tr(π(p)k) (32)\n= ∑\nC:closed geodesic\ntr(π(C)) = ∑\nk≥1\ntr(M(u)k).\nFrom Eq. (31) to Eq. (32), notice that H acts as a multiplication of k|p| for each summand. This is because the summand is a sum of degree k|p| terms counting each (ue′⇀e)ae,ae′ degree one.\nOn the other hand, one easily observes that\nH log det(I −M(u))−1 = H ∑\nk≥1\n1 k tr(M(u)k)\n= ∑\nk≥1\ntr(M(u)k).\nThus, the proof is completed.\nProof of Theorem 7 The proof is based on the decomposition in the following lemma and determinant manipulations. We define a linear operator by\nT : X(V ) → X( ~E), (T g)(e) := g(t(e))\nThe vector spaces X( ~E) and X(V ) have inner products naturally. We can think of the adjoint of T which is given by\nT ∗ : X( ~E) → X(V ), (T ∗f)(i) := ∑\ne:t(e)=i\nf(e).\nThese linear operators have the following relation. Lemma M(u) = ι(u)T T ∗ − ι(u) Proof [Proof of Lemma] Let f ∈ X(V ). (\nι(u)T T ∗ − ι(u) ) f(e) = ∑\ne′: s(e′)=s(e)\nt(e′) 6=t(e)\nu s(e) t(e′)→t(e)\n∑\ne′′:t(e′′)=t(e′)\nf(e′′)− ∑\ne′′: s(e′′)=s(e)\nt(e′′) 6=t(e)\nu s(e) t(e′′)→t(e)f(e ′′)\n= ∑\ne′: s(e′)=s(e)\nt(e′) 6=t(e)\nu s(e) t(e′)→t(e)\n∑\ne′′: t(e′′)=t(e′)\ne′′ 6=e′\nf(e′′)\n= (M(u)f)(e).\nUsing this lemma, we have\nζG(u) −1 = det(I −M(u))\n= det(I − ι(u)T T ∗ + ι(u)) = det(I − ι(u)T T ∗(I + ι(u))−1) det((I + ι(u))) = det(IrV − T ∗(I + ι(u))−1ι(u)T ) ∏\nα∈F\ndet(Uα)\nIt is easy to see that IrV −T ∗(I + ι(u))−1ι(u)T = IrV −T ∗T + T ∗(I + ι(u))−1T . We also see that\n(T ∗T g)(i) = ∑\ne:t(e)=i\ng(t(e)) = dig(i)\nand (T ∗(I + ι(u))−1T g)(i) = ∑\ne:t(e)=i\n((I + ι(u))−1T g)(e) = (Wg)(i).\nProof of Proposition 16 The right inequality is obvious. We prove the left inequality. Let C = ρ(M(‖u‖)). It is enough to prove that det(I − zM(u)) has no root in {λ ∈ C| |λ| < C−1}. Accordingly, we show that ζH(zu) has no pole in the set. Let p be a prime cycle and let λ1, . . . , λr be the eigenvalues of π(p;u). Then we obtain max |λl| ≤ π(p; ‖u‖). Therefore, if |z| < π(p; ‖u‖)−1, we have\n∣ ∣ ∣ det(I − z|p|π(p;u)) ∣ ∣ ∣ =\n∣ ∣ ∣ ∣ ∣ ∏\nl\n(1− z|p|λl) ∣ ∣ ∣ ∣\n∣\n≥ ( 1− |z||p|π(p; ‖u‖) )r .\nIt is not difficult to see that, for arbitrary prime cycle p, an inequality C−1 ≤ π(p; ‖u‖)−1 holds. Therefore, if |z| < C−1,\n|ζH(zu)| =\n∣ ∣ ∣ ∣ ∣ ∣ ∏\np∈P\ndet(I − z|p|π(p;u))−1 ∣ ∣ ∣ ∣\n∣ ∣\n≤ ∏\np∈P\n( 1− |z||p|π(p; ‖u‖) )−r = ζH(|z|‖u‖)r < ∞.\nProof of Theorem 18 (ii) : Multinomial case First, we consider binary case, i.e. φi(xi) = xi ∈ {±1}. For t ∈ [0, 1], let us define ηij(t) = Ebα [xixj] = t and ηi(t) = 0. Accordingly, uαi→j = t and η(t) ∈ L. As t ր 1, η(t) approaches to a boundary point of L. Using Theorem 27, analogous to the fixed-mean Gaussian case, we see that det(∇2F (t)) becomes negative as t → 1 if n(H) > 1. Therefore, F is not convex on L.\nFor general multinomial inference families, the non convexity of F is deduced from the binary case. There is a face of (the closure of) L that is identified with the set of pseudomarginals of the binary inference family on the same hypergraph. Since 0 log 0 = 0, we see that the restriction of F on the face is the Bethe free energy function of the binary inference family. Since this restriction is not convex, F is not convex."}], "references": [{"title": "A note on the cluster variation method", "author": ["G. An"], "venue": "Journal of Statistical Physics,", "citeRegEx": "An.,? \\Q1988\\E", "shortCiteRegEx": "An.", "year": 1988}, {"title": "Bayesian compressive sensing via belief propagation", "author": ["D. Baron", "S. Sarvotham", "R.G. Baraniuk"], "venue": "Signal Processing, IEEE Transactions on,", "citeRegEx": "Baron et al\\.,? \\Q2010\\E", "shortCiteRegEx": "Baron et al\\.", "year": 2010}, {"title": "Zeta functions of finite graphs and representations of p-adic groups", "author": ["K. Hashimoto"], "venue": null, "citeRegEx": "Hashimoto.,? \\Q1990\\E", "shortCiteRegEx": "Hashimoto.", "year": 1990}, {"title": "Learning in graphical models", "author": ["M.I. Jordan"], "venue": "Kluwer Academic Publishers,", "citeRegEx": "Jordan.,? \\Q1998\\E", "shortCiteRegEx": "Jordan.", "year": 1998}, {"title": "Zeta functions of finite graphs", "author": ["M. Kotani", "T. Sunada"], "venue": "Journal of Mathematical Sciences. The University of Tokyo,", "citeRegEx": "Kotani and Sunada.,? \\Q2000\\E", "shortCiteRegEx": "Kotani and Sunada.", "year": 2000}, {"title": "Factor graphs and the sum-product algorithm", "author": ["F.R. Kschischang", "B.J. Frey", "H.A. Loeliger"], "venue": "IEEE Transactions on information theory,", "citeRegEx": "Kschischang et al\\.,? \\Q2001\\E", "shortCiteRegEx": "Kschischang et al\\.", "year": 2001}, {"title": "Walk-sums and belief propagation in Gaussian graphical models", "author": ["D.M. Malioutov", "J.K. Johnson", "A.S. Willsky"], "venue": "The Journal of Machine Learning Research,", "citeRegEx": "Malioutov et al\\.,? \\Q2006\\E", "shortCiteRegEx": "Malioutov et al\\.", "year": 2006}, {"title": "Maximum likelihood estimation using composite likelihoods for closed exponential families", "author": ["K.V. Mardia", "J.T. Kent", "G. Hughes", "C.C. Taylor"], "venue": null, "citeRegEx": "Mardia et al\\.,? \\Q2009\\E", "shortCiteRegEx": "Mardia et al\\.", "year": 2009}, {"title": "Turbo decoding as an instance of Pearl’s ”belief propagation", "author": ["R.J. McEliece", "D.J.C. MacKay", "J.F. Cheng"], "venue": "algorithm. IEEE J. Sel. Areas Commun.,", "citeRegEx": "McEliece et al\\.,? \\Q1998\\E", "shortCiteRegEx": "McEliece et al\\.", "year": 1998}, {"title": "Analytic and algorithmic solution of random satisfiability problems", "author": ["M. Mezard", "G. Parisi", "R. Zecchina"], "venue": null, "citeRegEx": "Mezard et al\\.,? \\Q2002\\E", "shortCiteRegEx": "Mezard et al\\.", "year": 2002}, {"title": "Weighted zeta functions of graphs", "author": ["H. Mizuno", "I. Sato"], "venue": "Journal of Combinatorial Theory, Series B,", "citeRegEx": "Mizuno and Sato.,? \\Q2004\\E", "shortCiteRegEx": "Mizuno and Sato.", "year": 2004}, {"title": "On the properties of the Bethe approximation and loopy belief propagation on binary networks", "author": ["J.M. Mooij", "H.J. Kappen"], "venue": "Journal of Statistical Mechanics: Theory and Experiment,", "citeRegEx": "Mooij and Kappen.,? \\Q2005\\E", "shortCiteRegEx": "Mooij and Kappen.", "year": 2005}, {"title": "Sufficient conditions for convergence of the sum-product algorithm", "author": ["J.M. Mooij", "H.J. Kappen"], "venue": "IEEE Transactions on Information Theory,", "citeRegEx": "Mooij and Kappen.,? \\Q2007\\E", "shortCiteRegEx": "Mooij and Kappen.", "year": 2007}, {"title": "Loopy belief propagation for approximate inference: An empirical study", "author": ["K. Murphy", "Y. Weiss", "M.I. Jordan"], "venue": "Proc. of Uncertainty in AI,", "citeRegEx": "Murphy et al\\.,? \\Q1999\\E", "shortCiteRegEx": "Murphy et al\\.", "year": 1999}, {"title": "A note on the zeta function of a graph", "author": ["S. Northshield"], "venue": "Journal of Combinatorial Theory, Series B,", "citeRegEx": "Northshield.,? \\Q1998\\E", "shortCiteRegEx": "Northshield.", "year": 1998}, {"title": "Belief propagation and statistical physics", "author": ["P. Pakzad", "V. Anantharam"], "venue": "Conference on Information Sciences and Systems,", "citeRegEx": "Pakzad and Anantharam.,? \\Q2002\\E", "shortCiteRegEx": "Pakzad and Anantharam.", "year": 2002}, {"title": "Probabilistic Reasoning in Intelligent Systems: Networks of Plausible Inference", "author": ["J. Pearl"], "venue": null, "citeRegEx": "Pearl.,? \\Q1988\\E", "shortCiteRegEx": "Pearl.", "year": 1988}, {"title": "Cluster variation method in statistical physics and probabilistic graphical models", "author": ["A. Pelizzola"], "venue": "Journal of Physics A: Mathematical General,", "citeRegEx": "Pelizzola.,? \\Q2005\\E", "shortCiteRegEx": "Pelizzola.", "year": 2005}, {"title": "Zeta functions of finite graphs and coverings", "author": ["H.M. Stark", "A.A. Terras"], "venue": "Advances in Mathematics,", "citeRegEx": "Stark and Terras.,? \\Q1996\\E", "shortCiteRegEx": "Stark and Terras.", "year": 1996}, {"title": "The zeta function of a hypergraph", "author": ["C.K. Storm"], "venue": "The Electronic Journal of Combinatorics,", "citeRegEx": "Storm.,? \\Q2006\\E", "shortCiteRegEx": "Storm.", "year": 2006}, {"title": "Nonparametric belief propagation and facial appearance estimation", "author": ["E.B. Sudderth", "A.T. Ihler", "W.T. Freeman", "A.S. Willsky"], "venue": "In IEEE International Conference on Computer Vision and Pattern Recognition,", "citeRegEx": "Sudderth et al\\.,? \\Q2002\\E", "shortCiteRegEx": "Sudderth et al\\.", "year": 2002}, {"title": "L-functions in geometry and some applications", "author": ["T. Sunada"], "venue": "Lecture Notes in Math,", "citeRegEx": "Sunada.,? \\Q1986\\E", "shortCiteRegEx": "Sunada.", "year": 1986}, {"title": "Loopy belief propagation and Gibbs measures", "author": ["S. Tatikonda", "M.I. Jordan"], "venue": "Uncertainty in AI,", "citeRegEx": "Tatikonda and Jordan.,? \\Q2002\\E", "shortCiteRegEx": "Tatikonda and Jordan.", "year": 2002}, {"title": "Applied optimization with MATLAB programming", "author": ["P. Venkataraman"], "venue": null, "citeRegEx": "Venkataraman.,? \\Q2009\\E", "shortCiteRegEx": "Venkataraman.", "year": 2009}, {"title": "Tree-based reparameterization framework for analysis of sum-product and related algorithms", "author": ["M.J. Wainwright", "T.S. Jaakkola", "A.S. Willsky"], "venue": "IEEE Transactions on Information Theory,", "citeRegEx": "Wainwright et al\\.,? \\Q2003\\E", "shortCiteRegEx": "Wainwright et al\\.", "year": 2003}, {"title": "Tree-reweighted belief propagation algorithms and approximate ML estimation by pseudomoment matching", "author": ["M.J. Wainwright", "T.S. Jaakkola", "A.S. Willsky"], "venue": "In Workshop on Artificial Intelligence and Statistics,", "citeRegEx": "Wainwright et al\\.,? \\Q2003\\E", "shortCiteRegEx": "Wainwright et al\\.", "year": 2003}, {"title": "MAP estimation via agreement on trees: message-passing and linear programming", "author": ["M.J. Wainwright", "T.S. Jaakkola", "A.S. Willsky"], "venue": "IEEE Transactions on Information Theory,", "citeRegEx": "Wainwright et al\\.,? \\Q2005\\E", "shortCiteRegEx": "Wainwright et al\\.", "year": 2005}, {"title": "Variational inference in graphical models: The view from the marginal polytope", "author": ["M.J. Wainwright", "M.I. Jordan"], "venue": "In proceedings of the annual Allerton Conference on Communication, Control, and Computing,", "citeRegEx": "Wainwright and Jordan.,? \\Q2003\\E", "shortCiteRegEx": "Wainwright and Jordan.", "year": 2003}, {"title": "Graphical models, exponential families, and variational inference", "author": ["M.J. Wainwright", "M.I. Jordan"], "venue": "Foundations and Trends in Machine Learning,", "citeRegEx": "Wainwright and Jordan.,? \\Q2008\\E", "shortCiteRegEx": "Wainwright and Jordan.", "year": 2008}, {"title": "On the uniquness of the solution of belief propagation equation", "author": ["W. Watanabe", "K. Fukumizu"], "venue": "in preparation,", "citeRegEx": "Watanabe and Fukumizu.,? \\Q2011\\E", "shortCiteRegEx": "Watanabe and Fukumizu.", "year": 2011}, {"title": "Discrete geometric analysis of message passing algorithm on graphs", "author": ["Y Watanabe"], "venue": "Ph.D thesis,", "citeRegEx": "Watanabe.,? \\Q2010\\E", "shortCiteRegEx": "Watanabe.", "year": 2010}, {"title": "Graph zeta function in the Bethe free energy and loopy belief propagation", "author": ["Y. Watanabe", "K. Fukumizu"], "venue": "Advances in Neural Information Processing Systems,", "citeRegEx": "Watanabe and Fukumizu.,? \\Q2009\\E", "shortCiteRegEx": "Watanabe and Fukumizu.", "year": 2009}, {"title": "Correctness of local probability propagation in graphical models with loops", "author": ["Y. Weiss"], "venue": "Neural Computation,", "citeRegEx": "Weiss.,? \\Q2000\\E", "shortCiteRegEx": "Weiss.", "year": 2000}, {"title": "MAP estimation, linear programming and belief propagation with convex free energies", "author": ["Y. Weiss", "C. Yanover", "T. Meltzer"], "venue": "Uncertainty in Artificial Intelligence,", "citeRegEx": "Weiss et al\\.,? \\Q2007\\E", "shortCiteRegEx": "Weiss et al\\.", "year": 2007}, {"title": "Graphical models in applied multivariate statistics", "author": ["J. Whittaker"], "venue": "Wiley Publishing,", "citeRegEx": "Whittaker.,? \\Q2009\\E", "shortCiteRegEx": "Whittaker.", "year": 2009}, {"title": "Fractional belief propagation", "author": ["W. Wiegerinck", "T. Heskes"], "venue": "Advances in Neural Information Processing Systems,", "citeRegEx": "Wiegerinck and Heskes.,? \\Q2003\\E", "shortCiteRegEx": "Wiegerinck and Heskes.", "year": 2003}, {"title": "Generalized belief propagation", "author": ["J.S. Yedidia", "W.T. Freeman", "Y. Weiss"], "venue": "Advances in Neural Information Processing Systems,", "citeRegEx": "Yedidia et al\\.,? \\Q2001\\E", "shortCiteRegEx": "Yedidia et al\\.", "year": 2001}, {"title": "Constructing free-energy approximations and generalized belief propagation algorithms", "author": ["J.S. Yedidia", "W.T. Freeman", "Y. Weiss"], "venue": "IEEE Transactions on Information Theory,", "citeRegEx": "Yedidia et al\\.,? \\Q2005\\E", "shortCiteRegEx": "Yedidia et al\\.", "year": 2005}], "referenceMentions": [{"referenceID": 34, "context": "In the fields of statistics, artificial intelligence and machine learning, for example, graphical modeling has been a powerful tool for representing our prior knowledge and modeling hidden structures of problems (Whittaker, 2009; Pearl, 1988; Jordan, 1998).", "startOffset": 212, "endOffset": 256}, {"referenceID": 16, "context": "In the fields of statistics, artificial intelligence and machine learning, for example, graphical modeling has been a powerful tool for representing our prior knowledge and modeling hidden structures of problems (Whittaker, 2009; Pearl, 1988; Jordan, 1998).", "startOffset": 212, "endOffset": 256}, {"referenceID": 3, "context": "In the fields of statistics, artificial intelligence and machine learning, for example, graphical modeling has been a powerful tool for representing our prior knowledge and modeling hidden structures of problems (Whittaker, 2009; Pearl, 1988; Jordan, 1998).", "startOffset": 212, "endOffset": 256}, {"referenceID": 17, "context": "Other examples are found in statistical physics, coding theory, and combinatorial optimizations (Pelizzola, 2005; McEliece et al., 1998; Mezard et al., 2002).", "startOffset": 96, "endOffset": 157}, {"referenceID": 8, "context": "Other examples are found in statistical physics, coding theory, and combinatorial optimizations (Pelizzola, 2005; McEliece et al., 1998; Mezard et al., 2002).", "startOffset": 96, "endOffset": 157}, {"referenceID": 9, "context": "Other examples are found in statistical physics, coding theory, and combinatorial optimizations (Pelizzola, 2005; McEliece et al., 1998; Mezard et al., 2002).", "startOffset": 96, "endOffset": 157}, {"referenceID": 3, "context": "In the fields of statistics, artificial intelligence and machine learning, for example, graphical modeling has been a powerful tool for representing our prior knowledge and modeling hidden structures of problems (Whittaker, 2009; Pearl, 1988; Jordan, 1998). Other examples are found in statistical physics, coding theory, and combinatorial optimizations (Pelizzola, 2005; McEliece et al., 1998; Mezard et al., 2002). Typically, such probability distributions are derived from random variables that only have local interactions/constraints. This factorization structure is clearly visualized by a graph, called factor graph. Since the inference problems on graphical models, such as computation of marginal/conditional density functions and partition functions, are in general intractable for large graphs, Loopy Belief Propagation (LBP) has been proposed as an efficient approximation method applicable to any graph-structured density functions. Originally, Belief Propagation (BP) algorithm was proposed by Pearl (1988) to compute exactly the marginals for tree-structured graphical", "startOffset": 243, "endOffset": 1021}, {"referenceID": 13, "context": "Some researchers have found that LBP, an extended use of BP for graphs with cycles, shows good approximation with high potential applicability (Murphy et al., 1999; McEliece et al., 1998).", "startOffset": 143, "endOffset": 187}, {"referenceID": 8, "context": "Some researchers have found that LBP, an extended use of BP for graphs with cycles, shows good approximation with high potential applicability (Murphy et al., 1999; McEliece et al., 1998).", "startOffset": 143, "endOffset": 187}, {"referenceID": 36, "context": "After the proposal, many extensions and variants have been studied (Yedidia et al., 2001; Sudderth et al., 2002; Wainwright et al., 2005) and have been applied successfully to many problems, including coding theory, image processing, sensor network localization and compressive sensing (Ihler et al.", "startOffset": 67, "endOffset": 137}, {"referenceID": 20, "context": "After the proposal, many extensions and variants have been studied (Yedidia et al., 2001; Sudderth et al., 2002; Wainwright et al., 2005) and have been applied successfully to many problems, including coding theory, image processing, sensor network localization and compressive sensing (Ihler et al.", "startOffset": 67, "endOffset": 137}, {"referenceID": 26, "context": "After the proposal, many extensions and variants have been studied (Yedidia et al., 2001; Sudderth et al., 2002; Wainwright et al., 2005) and have been applied successfully to many problems, including coding theory, image processing, sensor network localization and compressive sensing (Ihler et al.", "startOffset": 67, "endOffset": 137}, {"referenceID": 1, "context": ", 2005) and have been applied successfully to many problems, including coding theory, image processing, sensor network localization and compressive sensing (Ihler et al., 2005; Baron et al., 2010).", "startOffset": 156, "endOffset": 196}, {"referenceID": 32, "context": "One theoretical challenge of LBP is that the algorithm may have many fixed points; the uniqueness is generally guaranteed only for trees and one-cycle graphs (Weiss, 2000).", "startOffset": 158, "endOffset": 171}, {"referenceID": 32, "context": "If the graph has only one cycle it also works appropriately; the algorithm converges to the unique fixed point and finds the MPM (Maximum Posterior Marginal) assignment in binary variable cases (Weiss, 2000).", "startOffset": 194, "endOffset": 207}, {"referenceID": 15, "context": "Additionally, the Bethe free energy function is convex in these cases (Pakzad and Anantharam, 2002).", "startOffset": 70, "endOffset": 99}, {"referenceID": 18, "context": "To derive the formula, we extend the definition of existing graph zeta functions and related Ihara-Bass formula (Stark and Terras, 1996; Bass, 1992).", "startOffset": 112, "endOffset": 148}, {"referenceID": 0, "context": "Another difficulty of LBP is that the algorithm does not necessarily converge and sometimes shows oscillatory behaviors. Concerning the multinomial model (also known as discrete variable model), Mooij and Kappen (2007) and Ihler et al.", "startOffset": 0, "endOffset": 219}, {"referenceID": 0, "context": "Another difficulty of LBP is that the algorithm does not necessarily converge and sometimes shows oscillatory behaviors. Concerning the multinomial model (also known as discrete variable model), Mooij and Kappen (2007) and Ihler et al. (2006) give sufficient conditions for the convergence in terms of the spectral radius of a certain matrix related to the graph.", "startOffset": 0, "endOffset": 243}, {"referenceID": 0, "context": "Another difficulty of LBP is that the algorithm does not necessarily converge and sometimes shows oscillatory behaviors. Concerning the multinomial model (also known as discrete variable model), Mooij and Kappen (2007) and Ihler et al. (2006) give sufficient conditions for the convergence in terms of the spectral radius of a certain matrix related to the graph. Tatikonda and Jordan (2002) also derive a sufficient condition for convergence, interpreting the convergence as the uniqueness of the Gibbs measure on the universal covering tree.", "startOffset": 0, "endOffset": 392}, {"referenceID": 0, "context": "Another difficulty of LBP is that the algorithm does not necessarily converge and sometimes shows oscillatory behaviors. Concerning the multinomial model (also known as discrete variable model), Mooij and Kappen (2007) and Ihler et al. (2006) give sufficient conditions for the convergence in terms of the spectral radius of a certain matrix related to the graph. Tatikonda and Jordan (2002) also derive a sufficient condition for convergence, interpreting the convergence as the uniqueness of the Gibbs measure on the universal covering tree. The purpose of this paper is to provide a novel discrete geometric approach to analysis of the LBP algorithm. The starting point of our study is a question: “How are the behaviors of the LBP algorithm affected by the geometry of the graph?” If the graph is a tree (L)BP works nicely; it terminates in a finite step at the unique fixed point and gives the exact marginals. If the graph has only one cycle it also works appropriately; the algorithm converges to the unique fixed point and finds the MPM (Maximum Posterior Marginal) assignment in binary variable cases (Weiss, 2000). Additionally, the Bethe free energy function is convex in these cases (Pakzad and Anantharam, 2002). Existence of multiple cycles, however, breaks down these nice properties. There have not been many researches that elucidate the effects of cycles on LBP in detail beyond “tree or non-tree” classification. While a notable exception is the walk-sum analysis by Johnson et al. (2006) and Malioutov et al.", "startOffset": 0, "endOffset": 1508}, {"referenceID": 0, "context": "Another difficulty of LBP is that the algorithm does not necessarily converge and sometimes shows oscillatory behaviors. Concerning the multinomial model (also known as discrete variable model), Mooij and Kappen (2007) and Ihler et al. (2006) give sufficient conditions for the convergence in terms of the spectral radius of a certain matrix related to the graph. Tatikonda and Jordan (2002) also derive a sufficient condition for convergence, interpreting the convergence as the uniqueness of the Gibbs measure on the universal covering tree. The purpose of this paper is to provide a novel discrete geometric approach to analysis of the LBP algorithm. The starting point of our study is a question: “How are the behaviors of the LBP algorithm affected by the geometry of the graph?” If the graph is a tree (L)BP works nicely; it terminates in a finite step at the unique fixed point and gives the exact marginals. If the graph has only one cycle it also works appropriately; the algorithm converges to the unique fixed point and finds the MPM (Maximum Posterior Marginal) assignment in binary variable cases (Weiss, 2000). Additionally, the Bethe free energy function is convex in these cases (Pakzad and Anantharam, 2002). Existence of multiple cycles, however, breaks down these nice properties. There have not been many researches that elucidate the effects of cycles on LBP in detail beyond “tree or non-tree” classification. While a notable exception is the walk-sum analysis by Johnson et al. (2006) and Malioutov et al. (2006), it is limited to the Gaussian case.", "startOffset": 0, "endOffset": 1536}, {"referenceID": 0, "context": "Another difficulty of LBP is that the algorithm does not necessarily converge and sometimes shows oscillatory behaviors. Concerning the multinomial model (also known as discrete variable model), Mooij and Kappen (2007) and Ihler et al. (2006) give sufficient conditions for the convergence in terms of the spectral radius of a certain matrix related to the graph. Tatikonda and Jordan (2002) also derive a sufficient condition for convergence, interpreting the convergence as the uniqueness of the Gibbs measure on the universal covering tree. The purpose of this paper is to provide a novel discrete geometric approach to analysis of the LBP algorithm. The starting point of our study is a question: “How are the behaviors of the LBP algorithm affected by the geometry of the graph?” If the graph is a tree (L)BP works nicely; it terminates in a finite step at the unique fixed point and gives the exact marginals. If the graph has only one cycle it also works appropriately; the algorithm converges to the unique fixed point and finds the MPM (Maximum Posterior Marginal) assignment in binary variable cases (Weiss, 2000). Additionally, the Bethe free energy function is convex in these cases (Pakzad and Anantharam, 2002). Existence of multiple cycles, however, breaks down these nice properties. There have not been many researches that elucidate the effects of cycles on LBP in detail beyond “tree or non-tree” classification. While a notable exception is the walk-sum analysis by Johnson et al. (2006) and Malioutov et al. (2006), it is limited to the Gaussian case. This paper proposes a method based on a new connection between LBP, Bethe free energy, and a graph zeta function. Graph zeta functions, originally introduced by Ihara (1966), are popular graph characteristics defined by the products over the prime cycles.", "startOffset": 0, "endOffset": 1747}, {"referenceID": 35, "context": "As the fundamentals, we consider the local properties of the Bethe free energy by elucidating the positive definiteness of its Hessian, while there are many studies on modifications and convexifications of the Bethe free energy function (Wiegerinck and Heskes, 2003; Wainwright et al., 2003b; Weiss et al., 2007).", "startOffset": 237, "endOffset": 312}, {"referenceID": 33, "context": "As the fundamentals, we consider the local properties of the Bethe free energy by elucidating the positive definiteness of its Hessian, while there are many studies on modifications and convexifications of the Bethe free energy function (Wiegerinck and Heskes, 2003; Wainwright et al., 2003b; Weiss et al., 2007).", "startOffset": 237, "endOffset": 312}, {"referenceID": 11, "context": "By numerical examples, we demonstrate that our new uniqueness condition covers a wider region than the one given by Mooij and Kappen (2007) for the examples.", "startOffset": 116, "endOffset": 140}, {"referenceID": 11, "context": "By numerical examples, we demonstrate that our new uniqueness condition covers a wider region than the one given by Mooij and Kappen (2007) for the examples. In the second application, we clarify a relation between the local structure of the Bethe free energy function and the local stability of a LBP fixed point. Such a relation is not necessarily obvious, since LBP is not derived as the gradient descent of the Bethe free energy. In this line of studies, for multinomial models Heskes (2002) shows that a locally stable fixed point of LBP is a local minimum of the Bethe free energy.", "startOffset": 116, "endOffset": 496}, {"referenceID": 4, "context": "Factor graphs are introduced by Kschischang et al. (2001). Any probability density function on X = ∏i∈V Xi is trivially graphically factorized with respect to the “one-factor hypergraph”, where the unique factor includes all vertices.", "startOffset": 32, "endOffset": 58}, {"referenceID": 0, "context": "Any probability density function on X = ∏i∈V Xi is trivially graphically factorized with respect to the “one-factor hypergraph”, where the unique factor includes all vertices. It is more informative if the factorization involves factors of small size. Our implicit assumption throughout this paper is that for all factors α, Xα = ∏ iXi are small enough, in the sense of cardinality or dimension, to be handled efficiently by computers. 2.2 Loopy Belief Propagation algorithm Given a graphical model, our task is to solve inference problem such as computation of marginal/conditional density functions and the partition function. Belief Propagation (BP) efficiently computes the exact marginals of a joint distribution that is factorized according to a tree-structured factor graph; Loopy Belief Propagation (LBP) is a heuristic application of the algorithm for factor graphs with cycles, showing successful performance in various problems. First, in Subsection 2.2.1, we introduce a collection of exponential families called inference family to formulate the LBP algorithm. In order to perform inferences using LBP, we have to fix an inference family that “includes” the given graphical model. Our formulation is a variant of the approach by Wainwright et al. (2003a), where over-complete sufficient statistics are exploited.", "startOffset": 0, "endOffset": 1268}, {"referenceID": 7, "context": "This type of condition on exponential families is also considered in other litterateurs (Mardia et al., 2009).", "startOffset": 88, "endOffset": 109}, {"referenceID": 5, "context": "The procedures of the LBP algorithm is as follows (Kschischang et al., 2001).", "startOffset": 50, "endOffset": 76}, {"referenceID": 0, "context": "The modern formulation for presenting the approximation is a variational problem of the Bethe free energy (An, 1988).", "startOffset": 106, "endOffset": 116}, {"referenceID": 35, "context": "3 Bethe free energy and characterization of LBP fixed points The Bethe approximation was initiated by Bethe (1935) and was found to be essentially equivalent to LBP by Yedidia et al. (2001). The modern formulation for presenting the approximation is a variational problem of the Bethe free energy (An, 1988).", "startOffset": 168, "endOffset": 190}, {"referenceID": 3, "context": "See Wainwright and Jordan (2008) for more details.", "startOffset": 19, "endOffset": 33}, {"referenceID": 0, "context": "As shown by Pakzad and Anantharam (2002), the Bethe free energy function is convex if the factor graph has at most one cycle.", "startOffset": 23, "endOffset": 41}, {"referenceID": 0, "context": "As shown by Pakzad and Anantharam (2002), the Bethe free energy function is convex if the factor graph has at most one cycle. Therefore, the minimization of the Bethe free energy is easy for these cases. In general, however, the convexity of F is broken as the nullity of the underlying factor graph becomes large, yielding multiple minima. Though the functions φα and φi are convex, the negative coefficients (1−di) makes the function F complex. The positive-definiteness of the Hessian of the Bethe free energy will be analyzed in Section 4 and 5. The Bethe free energy function gives an alternative description of the LBP fixed points. The following fact is shown by Yedidia et al. (2001); LBP finds a stationary point of the Bethe free energy function, which is a necessary condition of the minimality.", "startOffset": 23, "endOffset": 692}, {"referenceID": 18, "context": "The edge zeta function is a multivariable generalization of Ihara’s graph zeta function, allowing arbitrary scalar weight for each directed edge (Stark and Terras, 1996).", "startOffset": 145, "endOffset": 169}, {"referenceID": 4, "context": "dα = 2 for all α ∈ F ), these definitions reduce to standard definitions (Kotani and Sunada, 2000).", "startOffset": 73, "endOffset": 98}, {"referenceID": 18, "context": "Serre (1980), Sunada (1986) and Bass (1992).", "startOffset": 14, "endOffset": 28}, {"referenceID": 18, "context": "Serre (1980), Sunada (1986) and Bass (1992). The edge zeta function is a multivariable generalization of Ihara’s graph zeta function, allowing arbitrary scalar weight for each directed edge (Stark and Terras, 1996).", "startOffset": 14, "endOffset": 44}, {"referenceID": 19, "context": "Moreover, for general hypergraphs, we obtain the onevariable hypergraph zeta function by setting all matrix weights to be the same scalar u (Storm, 2006).", "startOffset": 140, "endOffset": 153}, {"referenceID": 18, "context": "If H is a graph and re = 1 for all e ∈ ~ E, this zeta function reduces to the edge zeta function by Stark and Terras (1996). If in addition all these scalar weights are set to be equal, i.", "startOffset": 100, "endOffset": 124}, {"referenceID": 18, "context": "This type of determinant formula is well known in the context of graph zeta functions; in fact this theorem is a straightforward generalization of Theorem 3 of Stark and Terras (1996). In the next section we derive a new determinant formula of the zeta function by manipulating the matrix M(u) in the above determinant.", "startOffset": 160, "endOffset": 184}, {"referenceID": 18, "context": "The simplification of this matrix obtained by setting re = 1 and u = 1 is called directed edge matrix and denoted by M (Stark and Terras, 1996).", "startOffset": 119, "endOffset": 143}, {"referenceID": 4, "context": "Kotani and Sunada (2000) call this matrix a Perron-Frobenius operator.", "startOffset": 0, "endOffset": 25}, {"referenceID": 18, "context": "This zeta function is the matrix weight extension of the edge zeta function analyzed by Stark and Terras (1996). Since the degree of every hyperedge is equal to two for a graph, the matrix Wα defined in Eq.", "startOffset": 88, "endOffset": 112}, {"referenceID": 4, "context": "See Kotani and Sunada (2000); Stark and Terras (1996) for others.", "startOffset": 4, "endOffset": 29}, {"referenceID": 4, "context": "See Kotani and Sunada (2000); Stark and Terras (1996) for others.", "startOffset": 4, "endOffset": 54}, {"referenceID": 4, "context": "See Kotani and Sunada (2000); Stark and Terras (1996) for others. A combinatorial proof is given by Foata and Zeilberger (1999). 3.", "startOffset": 4, "endOffset": 128}, {"referenceID": 0, "context": "An intuitive understanding of this result, based on the Legendre duality of two types of the Bethe free energy functions is discussed by Watanabe (2010)", "startOffset": 0, "endOffset": 153}, {"referenceID": 29, "context": "For binary and pairwise case, this formula is first shown by Watanabe and Fukumizu (2009). Case 2: Fixed-mean Gaussian inference family Let G = (V,E) be a graph.", "startOffset": 61, "endOffset": 90}, {"referenceID": 0, "context": "Analysis of positive definiteness and convexity of BFE The Bethe free energy function is not necessarily convex though it is an approximation of the Gibbs free energy function, which is convex. Non-convexity of the Bethe free energy can lead to multiple fixed points. Pakzad and Anantharam (2002) and Heskes (2004) have derived sufficient conditions of the convexity and shown that the Bethe free energy is convex for trees and graphs with one cycle.", "startOffset": 0, "endOffset": 297}, {"referenceID": 0, "context": "Analysis of positive definiteness and convexity of BFE The Bethe free energy function is not necessarily convex though it is an approximation of the Gibbs free energy function, which is convex. Non-convexity of the Bethe free energy can lead to multiple fixed points. Pakzad and Anantharam (2002) and Heskes (2004) have derived sufficient conditions of the convexity and shown that the Bethe free energy is convex for trees and graphs with one cycle.", "startOffset": 0, "endOffset": 315}, {"referenceID": 0, "context": "For multinomial case, Pakzad and Anantharam (2002) have shown that the Bethe free energy function is convex if the hypergraph has at most one cycle.", "startOffset": 33, "endOffset": 51}, {"referenceID": 23, "context": "However, it requires optimizations with respect to f ; we can use standard numerical maximization techniques (Venkataraman, 2009).", "startOffset": 109, "endOffset": 129}, {"referenceID": 31, "context": "For binary pairwise case, we have a useful formulaW {i,j} i,j (Ψi,j) = tanh(|Jij |), where Ψi,j(xi, xj) ∝ eJijxixj+hixi+hjxj (Watanabe and Fukumizu, 2009).", "startOffset": 125, "endOffset": 154}, {"referenceID": 21, "context": "However, it requires optimizations with respect to f ; we can use standard numerical maximization techniques (Venkataraman, 2009). We leave developing efficient methods for computing the values for future works. For binary pairwise case, we have a useful formulaW {i,j} i,j (Ψi,j) = tanh(|Jij |), where Ψi,j(xi, xj) ∝ eJijxixj+hixi+hjxj (Watanabe and Fukumizu, 2009). Theorem 21 holds for an arbitrary LBP. However, for Gaussian cases we obtain W {i,j} i,j = 1, yielding no meaningful implications. Therefore, in the rest of this section, we focus on multinomial cases. 5.2.3 Comparison to Mooij’s condition For multinomial models, there are several works that give sufficient conditions for the uniqueness property. Heskes (2004) analyzed the uniqueness problem by considering an equivalent min-max problem.", "startOffset": 110, "endOffset": 731}, {"referenceID": 3, "context": "Tatikonda and Jordan (2002) utilized the theory of Gibbs measure, and showed that the uniqueness of the Gibbs measure implies the convergence of LBP algorithm.", "startOffset": 14, "endOffset": 28}, {"referenceID": 12, "context": "(See numerical experiments in (Mooij and Kappen, 2007).", "startOffset": 30, "endOffset": 54}, {"referenceID": 10, "context": "(2006) and Mooij and Kappen (2007) derived sufficient conditions for the convergence by investigating conditions that make the LBP update a contraction; for pairwise case, their conditions are essentially the same.", "startOffset": 11, "endOffset": 35}, {"referenceID": 0, "context": "Another reason is that numerical experiments by Mooij and Kappen (2007) suggests that Mooij’s condition is far superior to the condition of Heskes.", "startOffset": 0, "endOffset": 72}, {"referenceID": 0, "context": "Another reason is that numerical experiments by Mooij and Kappen (2007) suggests that Mooij’s condition is far superior to the condition of Heskes. (See numerical experiments in (Mooij and Kappen, 2007).) The Mooij’s condition is stated as follows. Theorem 22 (Mooij and Kappen (2007)) Define", "startOffset": 0, "endOffset": 285}, {"referenceID": 0, "context": "Analysis of stability of LBP In this section, we analyze relations between the local stability of LBP and the local structure of the Bethe free energy around an LBP fixed point. Since LBP is not the gradient descent of the Bethe free energy function, such a relation is not necessarily obvious. From the view point of the variational formulation, we hope to find the minima. In the celebrated paper by Yedidia et al. (2001), they empirically found that locally stable LBP fixed points 25", "startOffset": 0, "endOffset": 424}, {"referenceID": 0, "context": "Another case is i = j and α, β ∈ Ni (α 6= β). Then, the derivative is ∂Λ i ∂ηi ∂(Λα)i ∂θα:i − I = 0 because Varbi [φi] = Varbα [φi] from Eq. (13). In other cases, the derivative is trivially zero. The relation j ∈ Nα r i and β ∈ Nj r α will be written as (β → j) ⇀ (α → i) in Subsection 3.1. It is noteworthy that the elements of the linearization matrix is explicitly expressed by the fixed point beliefs. 6.2 Spectral conditions Let T be the LBP update map. A fixed point μ∗ is called locally stable8 if LBP starting with a point sufficiently close to μ∗ converges to μ∗. To suppress oscillatory behaviors of LBP, damping of update Tǫ := (1 − ǫ)T + ǫI is sometimes useful, where 0 ≤ ǫ < 1 is a damping strength and I is the identity matrix. As we will summarize in the following theorem, the local stability is determined by the linearization T ′ at the fixed point. Since T ′ is nothing but M(u) at an LBP fixed point, Theorem 14 implies relations between the local stability and the Hessian of the Bethe free energy function. Theorem 24 Let μ∗ be an LBP fixed point and assume that T ′(μ∗) has no eigenvalues of unit modulus for simplicity. Then the following statements hold. 8. This property is often referred to as asymptotically stable Guckenheimer and Holmes (1990).", "startOffset": 0, "endOffset": 1275}, {"referenceID": 29, "context": "In a sequel paper (Watanabe and Fukumizu, 2011), we further exploit the connection between LBP, Bethe free energy and graph zeta function to analyze the LBP fixed point equation, focusing on binary pairwise models.", "startOffset": 18, "endOffset": 47}, {"referenceID": 11, "context": "Theorem 25 extends Theorem 2 of Mooij and Kappen (2005), which discusses only the case of binary pairwise models with vanishing local fields hi = 0 and the trivial fixed point (i.", "startOffset": 32, "endOffset": 56}, {"referenceID": 35, "context": "The connection between graph zeta, Bethe free energy and LBP can be extended to a more general class of free energies including fractional and tree-reweighted types (Wiegerinck and Heskes, 2003; Wainwright et al., 2003b).", "startOffset": 165, "endOffset": 220}, {"referenceID": 19, "context": "Theorem 27 (Hypergraph Hashimoto’s theorem (Hashimoto, 1989; Storm, 2006)) Let χ(H) := |V |+ |F | − | ~ E| be the Euler number of H.", "startOffset": 43, "endOffset": 73}, {"referenceID": 3, "context": "(30) are given by Kotani and Sunada (2000). For arbitrary hypergraph, ζH(u) has a pole at u = 1 because det(I − M) = 0.", "startOffset": 18, "endOffset": 43}, {"referenceID": 2, "context": "The original version of this theorem is proved by Hashimoto (1989, 1990). Theorem 27 (Hypergraph Hashimoto’s theorem (Hashimoto, 1989; Storm, 2006)) Let χ(H) := |V |+ |F | − | ~ E| be the Euler number of H. lim u→0 ζH(u) (1− u) = χ(H)κ(BH ), where κ(BH) is the number of spanning trees of the bipartite graph BH . (BH is the bipartite graph representation of the hypergraph H.) Proof For a graph G = (V,E), Hashimoto (1989, 1990) proved that lim u→1 ZG(u) (1− u) |−1 = −2 (|E| − |V |)κ(G), where κ(G) is the number of spanning tree of G. A simple proof is given by Northshield (1998). Since there is a one-to-one correspondence between PH and PBH , we have ζH(u) = ZBH ( √ u).", "startOffset": 50, "endOffset": 584}, {"referenceID": 18, "context": "Proof of Theorem 6 The following proof proceeds in an analogous manner with Theorem 3 in Stark and Terras (1996). First define a differential operator H := ∑", "startOffset": 89, "endOffset": 113}], "year": 2011, "abstractText": "We propose a new approach to the theoretical analysis of Loopy Belief Propagation (LBP) and the Bethe free energy (BFE) by establishing a formula to connect LBP and BFE with a graph zeta function. The proposed approach is applicable to a wide class of models including multinomial and Gaussian types. The connection derives a number of new theoretical results on LBP and BFE. This paper focuses two of such topics. One is the analysis of the region where the Hessian of the Bethe free energy is positive definite, which derives the non-convexity of BFE for graphs with multiple cycles, and a condition of convexity on a restricted set. This analysis also gives a new condition for the uniqueness of the LBP fixed point. The other result is to clarify the relation between the local stability of a fixed point of LBP and local minima of the BFE, which implies, for example, that a locally stable fixed point of the Gaussian LBP is a local minimum of the Gaussian Bethe free energy.", "creator": "LaTeX with hyperref package"}}}