{"id": "1203.3508", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "15-Mar-2012", "title": "Merging Knowledge Bases in Possibilistic Logic by Lexicographic Aggregation", "abstract": "Belief ewha merging magpies is vitosha an important guest-conducted but tiemann difficult problem in røros Artificial Intelligence, especially when sources deadens of ajamie information are pervaded with zoetebier uncertainty. Many mouth merging operators kutkai have doofus been proposed banning to adhami deal prata with 31.60 this summerhaven problem in constitutio possibilistic logic, a brokerages weighted logic mayflies which plushnick is durrow powerful gračanica for footgear handling inconsistency goateed and weehawken deal - ing with uncertainty. semra They br02 often hamer result in erbschloe a possibilistic knowledge base which reattaches is a set of cruciani weighted 2128 formulas. Although sahih possibilistic plaaf logic bigman is inconsistency derr tolerant, hanania it ipra suers from .369 the fattest well - beijo known \" drowning naleo effect \". larrieux Therefore, we alegrete may still unredacted want tahiti to velibor obtain a consistent possi - pavarotti bilistic acquitting knowledge inauspiciously base as idah the result of mzm merg - ing. otman In posso such motif a case, antipasti we argue daniilidou that juliao it gtu is not always 3,474 necessary knoppix to keep eppenstein weighted arbitron informa - kolmogorov tion after cibecue merging. arthritic In this heavyweights paper, saint-julien we define travelcard a cahier merging operator landhi that alcids maps archivist a 71-yard set kanana of schacht pos - halderman sibilistic csrd knowledge bases and hornets a tocchet formula rep - conveyer resenting the verron integrity constraints sudairi to yanez a penult clas - entscheidungsproblem sical kulathuvayal knowledge ba4 base by naunton using lexicographic mabi ordering. bisys We 8million show snowdrift that it çorum satisfies 56.1 nine hamisi pos - borriello tulates that mantiqueira generalize basic postulates for propositional follieri merging given in [11 ]. rampages These postulates capture the caryatids principle pianet of minimal typhimurium change noémie in marrone some jso sense. fazlullah We then calke provide an redd algorithm werkbund for generating the petrucci resulting knowl - screwup edge base of our phocis merging superbugs operator. ishibashi Finally, we anaesthesiology discuss the compatibility of our coomassie merging operator with 23-30 propositional merging and es - tablish kierans the advantage 54-38 of subh our moorings merging pre-test opera - tor 11-26 over hagi existing 566,000 semantic unbiased merging operators in the tawhidi propositional eini case.", "histories": [["v1", "Thu, 15 Mar 2012 11:17:56 GMT  (353kb)", "http://arxiv.org/abs/1203.3508v1", "Appears in Proceedings of the Twenty-Sixth Conference on Uncertainty in Artificial Intelligence (UAI2010)"]], "COMMENTS": "Appears in Proceedings of the Twenty-Sixth Conference on Uncertainty in Artificial Intelligence (UAI2010)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["guilin qi", "jianfeng du", "weiru liu", "david a bell"], "accepted": false, "id": "1203.3508"}, "pdf": {"name": "1203.3508.pdf", "metadata": {"source": "CRF", "title": "Merging Knowledge Bases in Possibilistic Logic by Lexicographic Aggregation", "authors": ["Guilin Qi", "Jianfeng Du"], "emails": [], "sections": [{"heading": null, "text": "Belief merging is an important but difficult problem in Artificial Intelligence, especially when sources of information are pervaded with uncertainty. Many merging operators have been proposed to deal with this problem in possibilistic logic, a weighted logic which is powerful for handling inconsistency and dealing with uncertainty. They often result in a possibilistic knowledge base which is a set of weighted formulas. Although possibilistic logic is inconsistency tolerant, it suffers from the well-known “drowning effect”. Therefore, we may still want to obtain a consistent possibilistic knowledge base as the result of merging. In such a case, we argue that it is not always necessary to keep weighted information after merging. In this paper, we define a merging operator that maps a set of possibilistic knowledge bases and a formula representing the integrity constraints to a classical knowledge base by using lexicographic ordering. We show that it satisfies nine postulates that generalize basic postulates for propositional merging given in [11]. These postulates capture the principle of minimal change in some sense. We then provide an algorithm for generating the resulting knowledge base of our merging operator. Finally, we discuss the compatibility of our merging operator with propositional merging and establish the advantage of our merging operator over existing semantic merging operators in the propositional case."}, {"heading": "1 Introduction", "text": "Logic-based belief merging is an important topic in Artificial Intelligence and has application in many com-\nputer science fields, such as multi-agent systems and requirements engineering. In a logical framework, each information source is often considered as a knowledge base, which is a set of logical formulas. Even though each knowledge base is consistent, putting them together may give rise to logical contradiction. Since an inconsistent knowledge base is useless due to the fact “ex falso quodlibet” (a false statement implies an arbitrary statement), we need to resolve inconsistency when we merge knowledge bases. Furthermore, in practice, information is often pervaded with uncertainty. This is because the truth of some propositions may remain unknown in the presence of incomplete or partial information.\nPossibilistic logic [6] provides a flexible framework to handle inconsistency and deal with uncertainty. At the syntactic level, it is a weighted logic which attaches to each formula with a weight belonging to a totally ordered scale, such as [0, 1], where the weight is interpreted as the certainty level of the formula. A possibilistic knowledge base is a set of weighted formulas. At the semantic level, it is based on the notion of a possibility distribution, which is a mapping from the set of interpretations Ω to interval [0,1]. For each possibilistic knowledge base, there is a unique possibility distribution associated with it.\nMany merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12]. In [4, 2], given several possibilistic knowledge bases, a semantic combination rule (or merging operator) is applied to aggregate the possibility distributions associated with them into a new possibility distribution. Then the syntactical counterpart of the semantic merging of the possibility distributions is a possibilistic knowledge base whose associated possibility distribution is the new possibility distribution [2]. Several approaches (such as those in [17]) have been proposed to improve the semantic combination rules. The approach proposed in [1] is based on argumentation. The model-based approach given in [14] is based on a model-based merging opera-\ntor in propositional logic. There are other approaches for merging possibilistic knowledge bases that are either based on some context information [12] or based on a negotiation framework [16].\nAlmost all merging approaches in possibilistic logic result in a possibilistic knowledge base. Although possibilistic inference is inconsistency-tolerant, it suffers from the notorious “drowning effect”, and so we may still want to obtain a consistent merged possibilistic knowledge base (see [17, 12, 16]). In such a case, it is not always necessary to keep weighted information in the resulting knowledge base after merging. For example, suppose we are interested in knowing if a formula can be inferred from the consistent merged knowledge base and do not really need to consider what degree it can be inferred, the weighted information is not useful any more. This is because a formula can be inferred from a consistent possibilistic knowledge base through possibilistic inference if and only if it can be inferred from the classical knowledge base associated with the possibilistic knowledge base, where a classical knowledge base is one with non-weighted information. There are some disadvantages for over-emphasizing the pursuit of keeping weighted information in the result of merging. First, it is difficult to define a possibilistic merging operator which is compatible with propositional merge. When applied to merge propositional knowledge bases directly1(we attach weight 1 to every formula in the knowledge bases), a possibilistic merging operator usually does not satisfy all the basic postulates for propositional merging given in [3] or in [11] (see [13] for a discussion). Furthermore, regarding possibilistic merging preserving weighted information, as far as we known, there does not exist a set of postulates in possibilistic logic that generalize postulates in [10] or [11] such that an existing semantic merging operator2 satisfies all of them. The absence of such a set of postulates makes it hard to evaluate the rationality of a semantic merging operator in possibilistic logic.\nIn this paper, we propose a merging operator in possibilistic logic that maps a set of possibilistic knowledge bases and a formula representing the integrity constraints to a classical knowledge base. The models of the result of our merging operator are models of the formula representing the integrity constraints that are maximal w.r.t. the lexicographic ordering. Therefore, the result of merging of our operator is syntactically a propositional knowledge base. Although lexicographic\n1It has been shown that some well-known distancebased merging operators can be encoded by possibilistic merging in [2]. This is not a direct application of possibilistic merging to propositional knowledge bases.\n2By a semantic merging operator we mean a merging operator that is semantically defined by possibility distributions.\nordering has been used to define some important merging operators in propositional logic, its application to possibilistic merging is still unexplored. We generalize the set of basic postulates for propositional merging given in [11] and show that our merging operator satisfies all of them. These postulates capture the principle of minimal change in some sense. We then provide an algorithm for generating the resulting knowledge base of our merging operator. Finally, we discuss the compatibility of our merging operator with propositional merging. We show that our merging operator can be reduced to a propositional merging operator that satisfies all the basic postulates given in [11]. According to the relationship between possibilistic logic and ordinal conditional functions, it is not difficult to see that our merging operator can be also used to merging uncertain information in ordinal conditional functions.\nThe rest of this paper proceeds as follows. We give some preliminaries on possibilistic logic in next section. We then define our merging operator in possibilistic logic and discussion its logical properties. In the next section, the syntactic counterpart of our model-based merging operator is given. After that, we discuss related work. Finally we conclude the paper and present some future work."}, {"heading": "2 Preliminaries on Possibilistic Logic", "text": "We consider a propositional language LPS over a finite set PS of propositional symbols. The classical consequence relation is denoted as `. An interpretation is a total function from PS to {true, false}. Ω is the set of all possible interpretations. An interpretation ω is a model of a formula φ iff ω(φ) = true. For each formula φ, we use Mod(φ) to denote its set of models. A (classical) knowledge base B is a finite set of propositional formulas which can be identified with the conjunction of its elements. K is consistent iff Mod(K) 6= ∅. Two knowledge bases K1 and K2 are equivalent, denoted K1≡K2, iff Mod(K1) = Mod(K2). A knowledge profile E is a multi-set of knowledge bases, i.e. it may contain a knowledge base twice. The union of multisets will be denoted by t.\nThe semantics of possibilistic logic [6] is based on the notion of a possibility distribution π which is a mapping from the set of interpretations Ω to interval [0,1]. The possibility degree π(ω) represents the degree of compatibility (resp. satisfaction) of the interpretation ω with the available beliefs about the real world. From a possibility distribution π, two measures can be determined: the possibility degree of formula φ, Ππ(φ) = max{π(ω) | ω ∈ Ω, ω |= φ} and the necessity degree of formula φ, Nπ(φ) = 1−Ππ(¬φ).\nAt the syntactic level, a formula, called a possibilis-\ntic formula, is represented by a pair (φ, a), where φ is a propositional formula and a is an element of the semi-open real interval (0, 1] or of a finite total ordered scale, which means that the necessity degree of φ is at least equal to a, i.e. N(φ) ≥ a. Then uncertain or prioritized pieces of information can be represented by a possibilistic knowledge base which is a finite set of possibilistic formulas of the form B = {(φi, ai) : i = 1, ..., n}. The classical base associated with B is denoted as B∗, namely B∗ = {φi | (φi, ai) ∈ B}. A possibilistic knowledge base B is consistent if and only if its classical base B∗ is consistent. A possibilistic knowledge profile E is a multi-set of possibilistic knowledge bases.\nGiven a possibilistic knowledge base B, a unique possibility distribution, denoted by πB , can be obtained by the principle of minimum specificity [6]. For all ω ∈ Ω,\nπB(ω) = { 1 if ∀(φi, ai) ∈ B,ω |= φi, 1−max{ai | ω 6|= φi, (φi, ai) ∈ B} otherwise.\n(1)\nDefinition 1 Let B be a possibilistic knowledge base, and a ∈ [0, 1]. The a-cut (resp. strict a-cut) of B is B≥a = {φi∈B∗ | (φi, bi)∈B and bi≥a} (resp. B>a = {φi∈B∗ | (φi, bi)∈B and bi>a}).\nDefinition 2 Let B be a possibilistic knowledge base. The inconsistency degree of B is:\nInc(B) = max{ai | B≥ai is inconsistent},\nwith Inc(B) = 0 if B is consistent. The inconsistency degree of B is the largest weight ai such that the ai-cut of B is inconsistent.\nDefinition 3 Let B be a possibilistic base. A formula φ is said to be a consequence of B to a degree a, denoted by B `π (φ, a), iff (i)B≥a is consistent; (ii) B≥a ` φ; (iii)∀b>a, B≥b 6` φ.\nTwo possibilistic knowledge bases B and B′ are said to be equivalent, denoted by B ≡s B′, iff ∀ a ∈ (0, 1], B≥a≡B′≥a. Two possibilistic knowledge profiles E1 and E2 are said to be equivalent (E1≡sE2) iff there is a bijection between them such that each possibilistic knowledge base of E1 is equivalent to its image in E2."}, {"heading": "3 A Merging Operator in Possibilistic Logic by Lexicographic Aggregation", "text": "Lexicographic ordering has been used to define merging operators in propositional logic [11, 7] and stratified knowledge bases [15]. It has been shown that these merging operators are rational in the sense that\nthey satisfy the set of basic postulates and some other additional postulates for propositional merging given in [11] or the generalized set of basic postulates. However, its application to define a merging operator in possibilistic logic is unexplored. In this section, we define our merging operator in possibilistic logic by the lexicographic ordering and show that it satisfies some interesting logical postulates."}, {"heading": "3.1 Definition", "text": "We recall the notion of lexicographical ordering on vectors of numbers (see [8] for more details).\nDefinition 4 Given two vectors of numbers ~a = (a1, ..., an) and ~b = (b1, ..., bn). Let σ and σ\n′ be two permutations on {1, ..., n} such that aσ(i)≥aσ(i+1) and bσ′(i)≥bσ′(i+1) for all i. The lexicographical ordering ≤lex between ~a and ~b is defined as:\n~a≤lex~b if and only if aσ(i) = bσ′(i) for all i or there exists i ≥ 1 such that aσ(i)<bσ′(i) and aσ(j) = bσ′(j) for all 1 ≤ j < i.\nThe lexicographical ordering compares two sequences of numbers in a descending order (we use two permutations to assure that the sequences of numbers to be compared are in descending order). As usual, ~a <lex ~b denotes ~a ≤lex ~b and ~b 6≤lex ~a, and ~a ≡lex ~b denotes ~a ≤lex ~b and ~b ≤lex ~a.\nWe define our merging operators using the lexicographical ordering.\nDefinition 5 Let E = {B1, ..., Bn} be a possibilistic knowledge profile, and µ be a formula representing the integrity constraint. Suppose πi is the possibility distribution associated with Bi, for each i = 1, ..., n. For each interpretation ω, we can associate with it a vector of numbers ~lE(ω) = (π1(ω), ..., πn(ω)). The resulting knowledge base of lexicographical ordering based merging operator, denoted by ∆Lexµ (E), is defined in a model-theoretic way as follows:\nω∈Mod(∆Lexµ (E)) if and only if ω∈Mod(µ) and ∀ω′∈Mod(µ), ~lE(ω)≥lex~lE(ω′).\nIn Definition 5, each interpretation is associated with a vector consisting of its possibility degrees relative to all possibilistic knowledge bases. Then any two interpretations can be compared w.r.t the lexicographical ordering defined by Definition 4. The models of the resulting knowledge base of operator ∆Lex are the models of µ that are maximal w.r.t the lexicographical ordering. The result of our merging operator is a propositional knowledge base, instead of a possibilistic knowledge base. The advantages of our merging operator over existing merging operators in possibilistic logic\nω value B1 B2 B3 B4 ~lE(ω) ω1 0111 0.4 1.0 1.0 0.1 (0.4,1.0,1.0,0.1) ω2 0110 0.4 1.0 1.0 0.1 (0.4,1.0,1.0,0.1) ω3 0011 0.1 0.4 0.4 0.1 (0.1,0.1,0.4,0.1) ω4 0010 0.1 0.4 0.4 0.1 (0.1,0.1,0.4,0.1) ω5 1111 1.0 0.4 1.0 0.4 (1.0,0.4,1.0,0.4) ω6 1110 1.0 0.4 1.0 0.4 (1.0,0.4,1.0,0.4)\nTable 1: ∆Lex operator\nare that our merging operator fulfils the principle of minimal change and is compatible with propositional merging, as we will show later. As we have argued in the Introduction, suppose we want to resolve inconsistency after merging, it is not always necessary to keep weighted information in the resulting knowledge base of merging. However, it is not desirable to use our merging operator for iterated merging. This is because our merging operator drops the weighted information after merging, which is critical for possibilistic merging. In order to iterate the merging process, after merging a set of possibilistic knowledge bases, we may have to keep the original knowledge bases in case further information is received.\nExample 1 Let E = {B1, B2, B3, B4} be a possibilistic profile consisting of four possibilistic knowledge bases, where\n- B1 = {(p1∨p2, 0.9), (p3, 0.9), (p1, 0.6), (p2, 0.6)};\n- B2 = {(p3∨p4, 0.9), (¬p1, 0.6), (p2, 0.6)};\n- B3 = {(p3, 0.9), (p2, 0.6)};\n- B4 = {(p1, 0.9), (p2, 0.8), (¬p3, 0.6)}.\nIn addition, we have an integrity constraint µ = (¬p1∨ p2) ∧ p3. The computations of possibility degrees of models of µ are given in Table 1.\nIn Table 1, the column corresponding to Bi gives the possibility degree of ω w.r.t. πi. The column corresponding to ~lE(ω) gives the lists of possibility degrees of interpretations. By Definition 5, it is easy to see that ω5 and ω6 are two interpretations with highest priority w.r.t. the lexicographic ordering in Table 1. So Mod(∆Lexµ (E)) = {1111, 1110}. Therefore, we have ∆Lexµ (E) ≡ p1 ∧ p2 ∧ p3."}, {"heading": "3.2 Logical properties", "text": "The following postulates generalize postulates (IC0)(IC3) and (IC5)-(IC8) for propositional merging given in [11] in a straightforward way. Let E , E1, E2 be possibilistic knowledge profiles, and µ, µ1, µ2 be formulas from LPS . Let ∆ be a merging operator that maps a set of possibilistic knowledge bases to a propositional knowledge base.\n(P1) ∆µ(E) ` µ.\n(P2) If µ is consistent, then ∆µ(E) is consistent. (P3) Let ∧ E = ∧Bi∈E ∧φij∈Bi φij . If ∧ E is consistent\nwith µ, then ∆µ(E)≡ ∧ E∧µ.\n(P4) If E1≡sE2 and µ1≡µ2, then ∆µ1(E1)≡ ∆µ2(E2).\n(P5) ∆µ(E1) ∧∆µ(E2) ` ∆µ(E1tE2)\n(P6) If ∆µ(E1) ∧ ∆µ(E2) is consistent, then ∆µ(E1tE2) ` ∆µ(E1) ∧∆µ(E2)\n(P7) ∆µ1(E) ∧ µ2 ` ∆µ1∧µ2(E)\n(P8) If ∆µ1(E) ∧ µ2 is consistent, then ∆µ1∧µ2(E) ` ∆µ1(E) ∧ µ2 (P1) requires the result of merging satisfying the integrity constraints. (P2) states that the result of merging should be consistent if the integrity constraints are consistent. (P3) says that if there is not contradiction between the integrity constraints and the knowledge bases, then we keep all the information. (P4) is the condition for syntax-irrelevance. (P5) and (P6) together state that if there exist two subgroups which agree on at least one alternative, then the result of the global merging will be exactly those alternatives the two groups agree on. (P7) and (P8) together say that the notion of closeness is well-behaved, i.e., that an alternative that is preferred among the possible alternatives µ1, will remain preferred if one restricts the possible choices µ1∧µ2. Thus (P7) and (P8) are important to ensure minimal change.\nNext we consider the generalization of (IC4) in [11] given as follows: If φ ` µ and φ′ ` µ, then ∆({φ} t {φ′}) ∧ φ 6` ⊥ implies that ∆({φ} t {φ′}) ∧ φ′ 6` ⊥, where φ, φ′ and µ are propositional formulas. This is not trivial because the condition part of the postulate needs to be modified to take into account the priority information. Our new postulate is inspired from a postulate given in [5]. We first introduce the notion of a priority degree of a subbase which was originally defined in [5].\nDefinition 6 Let B′ be a possibilistic knowledge base. We define its priority degree w.r.t. another possibilistic knowledge base B, denoted by DegB(B ′), by\nDegB(B ′) = min{a | (φ, a)∈B′∩B},\nand DegB(B ′) = 1 if B∩B′ is empty.\nDegB(B ′) is the priority level of the least certain formulas in B′ which also appear in B.\nGiven two possibilistic knowledge bases B1 and B2 and a formula µ, we say that a subset C of B1 ∪ B2 is a conflict set w.r.t. µ if it satisfies (1) C∗ ∪ {µ} is inconsistent and (2) for any subset C ′ ⊂ C, C ′ ∪ {µ}\nis consistent. Two possibilistic knowledge bases B1 and B2 are said to be equally prioritized w.r.t µ if for each conflict set C of B1 ∪ B2 w.r.t. µ, we have DegB1(C) = DegB2(C).\nWe propose (P9) to generalize (IC4).\n(P9) Let B1 and B2 be two consistent possibilistic knowledge bases. If B1 `π (µ, a) and B2 `π (µ, a), and B1 and B2 are equally prioritized w.r.t. µ, then ∆µ({B1, B2})∧ ∧ φ∈B∗1 φ is consistent if and only if\n∆µ({B1, B2})∧ ∧ ψ∈B∗2 ψ is consistent.\nIt says that given two consistent possibilistic knowledge bases B1 and B2, if both B1 and B2 are consistent with µ, and they are equally prioritized with respect to µ, then the result of merging is consistent with B1 if and only if it is consistent with B2.\nGiven a possibilistic profile E = {B1, ..., Bn} and a formula µ, let Incµ(E) = Inc(B1 ∪ ...∪Bn ∪ {(µ, 1)}), which we call the inconsistency degree of E w.r.t. µ, we give another postulate for possibilistic merging:\n(P10) For any possibilistic profile E = {B1, ..., Bn} and any formula µ, we have ∆µ(E) ` (φ, a) for any (φ, a) ∈ B1 ∪ ... ∪Bn where a > Incµ(E).\n(P10) says that the result of a merging operator should keep those possibilistic formulas whose weights are greater than the inconsistent degree of E w.r.t. µ.\nWe show that our merging operator satisfies all the generalized postulates.\nProposition 1 Merging operator ∆Lex satisfies (P1)(P10)."}, {"heading": "3.3 Computational complexity", "text": "Let ∆ be a merging operator. The following decision problem is denoted as MERGE(∆):\n• Input : a triple 〈E , µ, ψ〉 where E = {B1, ..., Bn} is possibilistic profile, µ is a formula, and ψ is a formula.\n• Question : Does ∆µ(E) |= ψ hold?\nWe can establish the following complexity result.\nProposition 2 MERGE(∆Lex) is ∆p2-complete."}, {"heading": "4 Syntactical Counterpart of Our Merging Operator", "text": "We propose Algorithm 1 to compute the resulting knowledge base of our merging operator. We use Φ to denote the set of pairs consisting of a formula φS and a\nAlgorithm 1: Algorithm for syntactical computation\nData: a possibilistic knowledge profile E = {B1, ..., Bn}; a formula µ\nResult: a new knowledge base B begin1 Let Φ := {(µ, E)}; Inc := 0;2 while ∃(φS , ES) ∈ Φ, ES 6= ∅ do3 maxc := −∞;4 foreach (φS , ES) ∈ Φ do5 foreach Bj ∈ ES do6 Compute Inc(φS , Bj);7\nIncS := minBj∈ES Inc(φS , Bj);8\nInc := min(φS ,ES)∈ΦIncS ;9 Φ := Φ \\ {(φS , ES) ∈ Φ | IncS 6= Inc}; Φ′ := ∅;10 foreach (φS , ES) ∈ Φ do11 I := {j | Inc(φS , Bj) = Inc,Bj ∈ ES};12 MCS(I) := {J ⊆ I | ∧ j∈J(Bj)>Inc ∧ φS 6` ⊥13\nand ∀k ∈ I \\ J , ∧ j∈J∪{k}(Bj)>Inc ∧ φS ` ⊥};\nmaxcS := maxJ′∈MCS(I)|J ′|;14 CardM(I) := {J ∈ MCS(I) | |J | = maxcS};15 foreach J ∈ CardM(I) do16\nφJ := ∧ j∈J(Bj)>Inc ∧ φS ;17 EJ := ES \\ {Bj ∈ ES | j ∈ J}; if maxcS > maxc then18 Φ′ := {(φJ , EJ) | J ∈ CardM(I)}19 maxc := maxcS20\nelse if maxcS = maxc then21 Φ′ = Φ′ ∪ {(φJ , EJ) | J ∈ CardM(I)};22\nΦ := Φ′;23\nB = ∨(φS ,ES)∈ΦφS ;24 return B25 end26\nknowledge profile ES , where φS is obtained by merging some selected knowledge bases from E and ES contains knowledge bases which are left to be merged under the integrity constraints φS . Given a possibilistic knowledge base B and a formula φ, we use Inc(φ,B) to denote the inconsistency degree Inc(B′) of the new knowledge base B′ = B ∪ {(φ, 1)} and call it the inconsistency degree of φ w.r.t. B. Initially, Φ contains a single element (µ, E). In the “while” step, we check whether there is a pair (φS , ES) in Φ such that ES is nonempty. If not, then the algorithm stops and the result of merging is returned (see Proposition 4), which is the disjunction of φS for all (φS , ES) where ES is nonempty. Otherwise, for each element (φS , ES) in Φ, we compute the inconsistency degree IncS of φS w.r.t. ES as the minimum of Inc(φS , Bj) for all Bj ∈ ES and let Inc be the minimal inconsistency degree among all IncS , which we call the global inconsistency degree of Φ (lines 5-9). This global inconsistency degree corresponds to the possibility degree of a model of the result of merging w.r.t. one of the possibilistic knowledge bases. Formally, we have the following proposition.\nProposition 3 Let E = {B1, ..., Bn} be a possibilistic knowledge profile, and µ be a formula representing the integrity constraint. For any model ω of ∆Lexµ (E), let ~lE(ω) = (π1(ω), ..., πn(ω)). Suppose a1 > a2 > ... > am are all the distinct possibility degrees appearing in ~lE(ω). If Inc is obtained during the k-th iteration in the while loop, then Inc = 1− ak.\nWe then delete those pairs (φS′ , ES′) such that IncS′ is not equal to the global inconsistency degree from Φ (line 10). For each such pair (φS′ , ES′), the possibility degrees of the models of φS′ must be less than ak given in Proposition 3 if Inc is obtained during the k-th iteration in the while loop. That is, none of the models of φS′ can be maximal w.r.t the lexicographical ordering, thus we do not need to handle (φS′ , ES′). According to Proposition 3, Inc = 1−ak for some ak in ~lE(ω) where ω is a model of ∆ Lex µ (E). For each (φS , ES) left in Φ, we need to obtain the maximum maxcS of the cardinalities of subsets T of ES such that the set of Inc-cut sets of possibilistic knowledge bases in T is consistent with φS (line 14). We use maxc to obtain the maximum of all maxcS associated with (φS , ES) in Φ. For those pairs (φS , ES) in Φ such that maxcS 6= maxc, all models ω of φS cannot be maximal w.r.t. the lexicographical ordering because the number of possibilistic knowledge bases Bj in ES such that πBj (ω) = 1 − Inc must be less than maxc (remember that 1 − Inc = ak if Inc is obtained during the k-th iteration in the while loop by Proposition 3). Thus these pairs are dropped (lines 18-22). For pairs (φS , ES) in Φ such that maxcS = maxc, for each cardinally maximal subset T of ES such that the set of Inc-cut sets of possibilistic knowledge bases in T is consistent with φS , we obtain a formula φJ which is the conjunction of φS and the Inc-cut sets of possibilistic knowledge bases in the subset are consistent with φS . A set EJ , which is the complement of this cardinally maximal subset by ES , is then attached to the new formula φJ for further merging (lines 16-17). Φ is reset to contain all those pairs of (φJ , EJ) (line 23) and we go back to the “while” step again.\nExample 2 (Continue Example 1) Initially, we have Φ = {(µ = (¬p1∨p2)∧ p3, E = {B1, B2, B3, B4})}. We have Inc(µ,B1) = 0, Inc(µ,B2) = 0, Inc(µ,B3) = 0 and Inc(µ,B4) = 0.6. So Inc = 0. There is only one element in Φ, so Φ is not changed. Since Inc(µ,B1) = Inc(µ,B2) = Inc(µ,B3) = 0, we have I = {1, 2, 3}. It is not difficult to get that MCS(I) = CardM(I) = {{1, 3}, {2, 3}} and maxc∅ = 2. So φ{1,3} = p1∧p2∧p3 and E{1,3} = {B2, B4}, and φ{2,3} = ¬p1 ∧ p2 ∧ p3 and E{2,3} = {B1, B4}. Since maxc∅ > maxc = −∞, we have Φ′ = {(φ{1,3}, E{1,3}), (φ{2,3}, E{2,3})} and Φ = Φ′.\nWe go to the second iteration of the while loop. Note maxc is reset to −∞. We have Inc(φ{1,3}, B2) = 0.6, Inc(φ{1,3}, B4) = 0.6, Inc(φ{2,3}, B1) = 0.6 and Inc(φ{2,3}, B4) = 0.9. Thus Inc{1,3} = Inc{2,3} = 0.6. So Inc = 0.6 and Φ is not changed. We handle (φ{1,3}, E{1,3}) first. We have I = {2, 4}. It is not difficult to check that MCS(I) = CardM(I) = {I} and maxc{1,3} = 2. We have φ{2,4} = p1 ∧ p2 ∧ p3 and E{2,4} = ∅. Since maxc{1,3} = 2 > maxc, we have Φ′ = {(φ{2,4}, E{2,4})} and maxc = 2. We then handle (φ{1,3}, E{1,3}). We have I = {1}. So MCS(I) = CardM(I) = {I} and maxc{1,3} = 1. Since max{1,3} < maxc, we do not need to consider dealing with (φ{1,3}, E{1,3}). Thus, we have Φ = {(φ{2,4}, E{2,4})}. Since E{2,4} = ∅, the algorithm terminates and returns B = p1 ∧ p2 ∧ p3, this coincides with the result in Example 1.\nWe show that Algorithm 1 results in the syntactical counterpart of our merging operator.\nProposition 4 Let E = {B1, ...., Bn} be a possibilistic profile and µ a formula representing the integrity constraint. Suppose B is the knowledge base obtained by Algorithm 1, then B ≡ ∆Lexµ (E)."}, {"heading": "5 Compatibility with Propositional Merging", "text": "In this section, we consider the compatibility of our merging operator with propositional merging by evaluating it with basic postulates (IC0)-(IC8) given in [11]. It is well-known that classical logic is a special case of possibilistic logic in which all the formulas have the same level of priority. That is, given a knowledge base K = {φ1, ..., φn}, we can relate it to a possibilistic knowledge base BK = {(φ1, 1), ..., (φn, 1)}. Thus, our merging operator can be applied to merge propositional knowledge bases. We show that our merging operator is reduced to the ∆dH ,GMin operator defined in [7], which is defined as follows. The drastic distance dH between two interpretations is defined as dH(ω1, ω2) = 0 when ω1 = ω2 and 1 otherwise.\nDefinition 7 [7] Let E = {K1, ...,Kn} be a propositional knowledge profile and mu a formula. For any interpretation ω, suppose ddH ,Gmin(ω,E) is defined as the list of numbers (d1, ..., dn) obtained by sorting in increasing order the set {d(ω,Ki) | Ki ∈ E}. The models of ∆dH ,GMinµ (E) are the models of µ that are minimal w.r.t. the lexicographic order induced by the natural order.\nProposition 5 Let E = {K1, ...,Kn} be a propositional knowledge profile and µ a formula. Then ∆Lexµ (E) = ∆ dH ,GMin µ (E).\nOur merging operator is also related to the ∆C4 operator defined in [9], which selects the set of subsets of E that are consistent with µ and are maximal with respect to cardinality. Let E be a propositional knowledge profile and µ be a formula. Let CardM(E,µ) = {F⊆E | ∧ Ki∈F Ki∧µ 6` ⊥, ∀F\n′ ⊆ E : |F ′| > |F | ⇒ ∧ Ki∈F ′ Ki ∧ µ ` ⊥}.\nProposition 6 Let E be a propositional knowledge profile and µ be a formula. Then ∆Lexµ (E) =∨ F∈CardM(E,µ)( ∧ Ki∈F Ki ∧ µ).\nProposition 6 shows that when each knowledge base is viewed as a formula, the ∆Lex operator is equivalent to the ∆C4 operator.\nSince the ∆dH ,GMin operator satisfies all the basic postulates for propositional merging, our merging operator ∆Lex also satisfies these postulates in the propositional case, i.e., when knowledge bases to be merged are propositional knowledge bases.\nProposition 7 ∆Lex satisfies (IC0)-(IC8) given in [11] in the propositional case.\nProposition 7 shows the advantage of our semantic merging operator over others as it has been shown in [17, 13] that existing semantic possibilistic merging operators do not satisfy all (IC0)-(IC8) in the propositional case. Another interesting result is that it is possible to encode the ∆C4 operator by using our merging operator ∆Lex in case a knowledge base is considered as a set of formulas.\nProposition 8 Let E = {K1, ...,Kn} be a profile and µ be a formula. Suppose we split each knowledge base Ki = {φ1, ..., φni} into a set of bases K ′1 = {φ1},...,K ′ni = {φni}. If there are two duplicated knowledge bases after splitting, we only keep one of them. Let the resultant profile be E′ = {K ′1, ...,K ′l}, then we have ∆Lexµ (E ′) = ∆C4µ (E)."}, {"heading": "6 Related Work", "text": "We compare our merging operator with existing ones given in the literature. Like our merging operator, the merging operators given in [4, 2] are semantically defined by aggregation of possibility distributions. The difference is that we apply the lexicographic aggregation function whilst the merging operators given in [4, 2] apply other aggregation operators, such as a conjunctive operator or a disjunctive operator. It has been shown in [17, 13] that merging operators given in [4, 2, 17] do not satisfy basic postulates for propositional merging given in [10] in the propositional case. The merging operators proposed in [5] are defined by\naggregating weights of formulas inferred by possibilistic knowledge bases to be merged. The authors generalized postulates for propositional merging given in [10] by considering the logical closure of possibilistic inference and have shown that a merging operator satisfying all of the generalized postulates must be a strictly monotonic operator. Such a merging operator is similar to the conjunctive operator given in [2] and it thus suffers from the similar problems, that is, it suffers from the “drowning effect” and is not compatible with propositional merging. In contrast, our merging operator does not have such problems. One may argue that the disadvantage of our merging operator is that the weighted information is lost in the resulting knowledge base after merging. However, as we have discussed in the Introduction, this is not an issue if we want to know if a formula can be inferred from the merged knowledge base. Let us consider an example. Let µ = p1 ∨ p2, E = {B1, B2}, where B1 = {(¬p2, 0.8), (p4, 0.6)} and B2 = {(p2, 0.9), (p1, 0.8), (p3, 0.6)}. By applying the product merging operator given in [2], we obtain the result of merging as B ≡s {(µ, 1)} ∪ B1 ∪ B2 ∪ {(p1 ∨ p2, 0.99), (p1 ∨ p3, 0.96), (¬p2 ∨ p3, 0.88), (p2 ∨ p4, 0.96), (p3 ∨ p4, 0.76)}. The inconsistency degree of B is 0.8. Therefore, p1 and p3 cannot be inferred from B by using the possibilistic inference due to the drowning effect. However, applying our merging operator, we get ∆Lexµ (E) = µ ∧ B∗2 . It is easy to check that ∆Lexµ (E) ` B∗>0.8, and p1 and p3 can be inferred from ∆Lexµ (E). This example shows that there are cases where the formulas inferred from the result of our merging operator by applying classical inference can be more than those inferred from the result of the product merging operator by applying possibilistic inference.\nThe adaptive merging operator given in [12] has no semantic definition and has not been evaluated by logical properties. The merging approaches given in [3] are dependent on the syntactic form of formulas in a possibilistic knowledge base. The merging operator given in [14] is defined by a classical merging operator, thus it is compatible with propositional merging. However, it is only evaluated by four postulates that generalize some basic postulates given in [11] and its rationality w.r.t. postulates is still not fully recognized. The merging operator proposed in [15] is also based on lexicographic ordering. However, it is applied to merging prioritized knowledge bases that do not share a common scale, thus is different from ours."}, {"heading": "7 Conclusion and Discussion", "text": "In this paper, we have considered the problem of merging knowledge bases in possibilistic logic. We first pre-\nsented a novel merging operator in possibilistic logic based on the lexicographic ordering. The key difference between our merging operator and existing ones is that we do not require that the weighted information be kept in the merged knowledge base. We proposed some new logical postulates for possibilistic merging and showed that our merging operator satisfies all of them. We then provided an algorithm for computing the syntactical counterpart of our merging operator. Finally, we analyzed the compatibility of our merging operator with propositional merging. We showed that our merging operator can be reduced to the operator ∆dH ,GMin defined in [7] operator in the propositional case and it satisfies postulates (IC0-IC8) given in [11]. We also showed that it is possible to encode the ∆C4 operator by using our merging operator ∆Lex in case a knowledge base is considered as a set of formulas.\nWe have generalized some logical postulates for propositional merging operators, as a future work, we will try to provide a representation theorem for the generalized postulates. We will also investigate other merging operators in possibilistic logic that map a possibilistic profile to a propositional knowledge base."}, {"heading": "Acknowledgments", "text": "Guilin Qi is partially supported by Excellent Youth Scholars Program of Southeast University under grant 4009001011 and National Science Foundation of China under grant 60903010. We would like to thanks three anonymous reviewers for their helpful comments."}], "references": [{"title": "An argumentation framework for merging conflicting knowledge bases: The prioritized case", "author": ["Leila Amgoud", "Souhila Kaci"], "venue": "In Proc. of EC-", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 2005}, {"title": "Possibilistic merging and distance-based fusion of propositional information", "author": ["Salem Benferhat", "Didier Dubois", "Souhila Kaci", "Henri Prade"], "venue": "Ann. Math. Artif. Intell.,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2002}, {"title": "Some syntactic approaches to the handling of inconsistent knowledge bases: A comparative study part 2: The prioritized case", "author": ["Salem Benferhat", "Didier Dubois", "Henri Prade"], "venue": "In Logic at work : essays dedicated to the memory of Helena Rasiowa,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 1998}, {"title": "A practical approach to fusing prioritized knowledge bases", "author": ["Salem Benferhat", "Didier Dubois", "Henri Prade", "Mary-Anne Williams"], "venue": "In Proc. of EPIA’99,", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 1999}, {"title": "Fusion of possibilistic knowledge bases from a postulate point of view", "author": ["Salem Benferhat", "Souhila Kaci"], "venue": "Int. J. Approx. Reasoning,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 2003}, {"title": "Possibilistic logic. In Handbook of logic in Aritificial Intelligence and Logic Programming, Volume 3, pages 439–513", "author": ["Didier Dubois", "Jérôme Lang", "Henri Prade"], "venue": null, "citeRegEx": "6", "shortCiteRegEx": "6", "year": 1994}, {"title": "Quota and gmin merging operators", "author": ["Patricia Everaere", "Sébastien Konieczny", "Pierre Marquis"], "venue": "In Proc. of IJCAI’05,", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2005}, {"title": "Lexicographic orders, utilities and decision rules: A survey", "author": ["Peter C. Fishburn"], "venue": "Management Science,", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 1974}, {"title": "On the difference between merging knowledge bases and combining them", "author": ["Sébastien Konieczny"], "venue": "In Proc. of KR’00,", "citeRegEx": "9", "shortCiteRegEx": "9", "year": 2000}, {"title": "On the logic of merging", "author": ["Sébastien Konieczny", "Ramón Pino Pérez"], "venue": "In Proc. of KR’98,", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 1998}, {"title": "Merging information under constraints: A logical framework", "author": ["Sébastien Konieczny", "Ramón Pino Pérez"], "venue": "J. Log. Comput.,", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2002}, {"title": "Adaptive merging of prioritized knowledge bases", "author": ["Weiru Liu", "Guilin Qi", "David A. Bell"], "venue": "Fundamenta Informaticae,", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2006}, {"title": "Fusion of Uncertain Information In the Framework of Possibilistic Logic", "author": ["Guilin Qi"], "venue": "PhD Thesis, Queen’s University Belfast,", "citeRegEx": "13", "shortCiteRegEx": "13", "year": 2006}, {"title": "A model-based approach for merging prioritized knowledge bases in possibilistic logic", "author": ["Guilin Qi"], "venue": "In Proc. of AAAI’07,", "citeRegEx": "14", "shortCiteRegEx": "14", "year": 2007}, {"title": "Merging stratified knowledge bases under constraints", "author": ["Guilin Qi", "Weiru Liu", "David A. Bell"], "venue": "In Proc. of AAAI’06,", "citeRegEx": "15", "shortCiteRegEx": "15", "year": 2006}, {"title": "Combining multiple prioritized knowledge bases by negotiation", "author": ["Guilin Qi", "Weiru Liu", "David A. Bell"], "venue": "Fuzzy Sets and Systems,", "citeRegEx": "16", "shortCiteRegEx": "16", "year": 2007}, {"title": "A split-combination method for merging inconsistent possibilistic knowledge bases", "author": ["Guilin Qi", "Weiru Liu", "David H. Glass"], "venue": "In Proc. of KR’04,", "citeRegEx": "17", "shortCiteRegEx": "17", "year": 2004}], "referenceMentions": [{"referenceID": 10, "context": "We show that it satisfies nine postulates that generalize basic postulates for propositional merging given in [11].", "startOffset": 110, "endOffset": 114}, {"referenceID": 5, "context": "Possibilistic logic [6] provides a flexible framework to handle inconsistency and deal with uncertainty.", "startOffset": 20, "endOffset": 23}, {"referenceID": 0, "context": "totally ordered scale, such as [0, 1], where the weight is interpreted as the certainty level of the formula.", "startOffset": 31, "endOffset": 37}, {"referenceID": 0, "context": "At the semantic level, it is based on the notion of a possibility distribution, which is a mapping from the set of interpretations Ω to interval [0,1].", "startOffset": 145, "endOffset": 150}, {"referenceID": 2, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 3, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 1, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 4, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 16, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 13, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 15, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 11, "context": "Many merging approaches have been proposed in possibilistic logic [3, 4, 2, 5, 17, 14, 16, 12].", "startOffset": 66, "endOffset": 94}, {"referenceID": 3, "context": "In [4, 2], given several possibilistic knowledge bases, a semantic combination rule (or merging operator) is applied to aggregate the possibility distributions associated with them into a new possibility distribution.", "startOffset": 3, "endOffset": 9}, {"referenceID": 1, "context": "In [4, 2], given several possibilistic knowledge bases, a semantic combination rule (or merging operator) is applied to aggregate the possibility distributions associated with them into a new possibility distribution.", "startOffset": 3, "endOffset": 9}, {"referenceID": 1, "context": "Then the syntactical counterpart of the semantic merging of the possibility distributions is a possibilistic knowledge base whose associated possibility distribution is the new possibility distribution [2].", "startOffset": 202, "endOffset": 205}, {"referenceID": 16, "context": "Several approaches (such as those in [17]) have been proposed to improve the semantic combination rules.", "startOffset": 37, "endOffset": 41}, {"referenceID": 0, "context": "The approach proposed in [1] is based on argumentation.", "startOffset": 25, "endOffset": 28}, {"referenceID": 13, "context": "The model-based approach given in [14] is based on a model-based merging opera-", "startOffset": 34, "endOffset": 38}, {"referenceID": 11, "context": "There are other approaches for merging possibilistic knowledge bases that are either based on some context information [12] or based on a negotiation framework [16].", "startOffset": 119, "endOffset": 123}, {"referenceID": 15, "context": "There are other approaches for merging possibilistic knowledge bases that are either based on some context information [12] or based on a negotiation framework [16].", "startOffset": 160, "endOffset": 164}, {"referenceID": 16, "context": "still want to obtain a consistent merged possibilistic knowledge base (see [17, 12, 16]).", "startOffset": 75, "endOffset": 87}, {"referenceID": 11, "context": "still want to obtain a consistent merged possibilistic knowledge base (see [17, 12, 16]).", "startOffset": 75, "endOffset": 87}, {"referenceID": 15, "context": "still want to obtain a consistent merged possibilistic knowledge base (see [17, 12, 16]).", "startOffset": 75, "endOffset": 87}, {"referenceID": 2, "context": "When applied to merge propositional knowledge bases directly(we attach weight 1 to every formula in the knowledge bases), a possibilistic merging operator usually does not satisfy all the basic postulates for propositional merging given in [3] or in [11]", "startOffset": 240, "endOffset": 243}, {"referenceID": 10, "context": "When applied to merge propositional knowledge bases directly(we attach weight 1 to every formula in the knowledge bases), a possibilistic merging operator usually does not satisfy all the basic postulates for propositional merging given in [3] or in [11]", "startOffset": 250, "endOffset": 254}, {"referenceID": 12, "context": "(see [13] for a discussion).", "startOffset": 5, "endOffset": 9}, {"referenceID": 9, "context": "Furthermore, regarding possibilistic merging preserving weighted information, as far as we known, there does not exist a set of postulates in possibilistic logic that generalize postulates in [10] or [11] such that an existing semantic merging operator satisfies all of them.", "startOffset": 192, "endOffset": 196}, {"referenceID": 10, "context": "Furthermore, regarding possibilistic merging preserving weighted information, as far as we known, there does not exist a set of postulates in possibilistic logic that generalize postulates in [10] or [11] such that an existing semantic merging operator satisfies all of them.", "startOffset": 200, "endOffset": 204}, {"referenceID": 1, "context": "It has been shown that some well-known distancebased merging operators can be encoded by possibilistic merging in [2].", "startOffset": 114, "endOffset": 117}, {"referenceID": 10, "context": "We generalize the set of basic postulates for propositional merging given in [11] and show that our merging operator satis-", "startOffset": 77, "endOffset": 81}, {"referenceID": 10, "context": "reduced to a propositional merging operator that satisfies all the basic postulates given in [11].", "startOffset": 93, "endOffset": 97}, {"referenceID": 5, "context": "The semantics of possibilistic logic [6] is based on the notion of a possibility distribution π which is a mapping from the set of interpretations Ω to interval [0,1].", "startOffset": 37, "endOffset": 40}, {"referenceID": 0, "context": "The semantics of possibilistic logic [6] is based on the notion of a possibility distribution π which is a mapping from the set of interpretations Ω to interval [0,1].", "startOffset": 161, "endOffset": 166}, {"referenceID": 5, "context": "Given a possibilistic knowledge base B, a unique possibility distribution, denoted by πB , can be obtained by the principle of minimum specificity [6].", "startOffset": 147, "endOffset": 150}, {"referenceID": 0, "context": "Definition 1 Let B be a possibilistic knowledge base, and a ∈ [0, 1].", "startOffset": 62, "endOffset": 68}, {"referenceID": 10, "context": "Lexicographic ordering has been used to define merging operators in propositional logic [11, 7] and stratified knowledge bases [15].", "startOffset": 88, "endOffset": 95}, {"referenceID": 6, "context": "Lexicographic ordering has been used to define merging operators in propositional logic [11, 7] and stratified knowledge bases [15].", "startOffset": 88, "endOffset": 95}, {"referenceID": 14, "context": "Lexicographic ordering has been used to define merging operators in propositional logic [11, 7] and stratified knowledge bases [15].", "startOffset": 127, "endOffset": 131}, {"referenceID": 10, "context": "It has been shown that these merging operators are rational in the sense that they satisfy the set of basic postulates and some other additional postulates for propositional merging given in [11] or the generalized set of basic postulates.", "startOffset": 191, "endOffset": 195}, {"referenceID": 7, "context": "We recall the notion of lexicographical ordering on vectors of numbers (see [8] for more details).", "startOffset": 76, "endOffset": 79}, {"referenceID": 10, "context": "The following postulates generalize postulates (IC0)(IC3) and (IC5)-(IC8) for propositional merging given in [11] in a straightforward way.", "startOffset": 109, "endOffset": 113}, {"referenceID": 10, "context": "Next we consider the generalization of (IC4) in [11] given as follows: If φ ` μ and φ′ ` μ, then ∆({φ} t {φ′}) ∧ φ 6` ⊥ implies that ∆({φ} t {φ′}) ∧ φ′ 6` ⊥, where φ, φ′ and μ are propositional formulas.", "startOffset": 48, "endOffset": 52}, {"referenceID": 4, "context": "Our new postulate is inspired from a postulate given in [5].", "startOffset": 56, "endOffset": 59}, {"referenceID": 4, "context": "We first introduce the notion of a priority degree of a subbase which was originally defined in [5].", "startOffset": 96, "endOffset": 99}, {"referenceID": 10, "context": "In this section, we consider the compatibility of our merging operator with propositional merging by evaluating it with basic postulates (IC0)-(IC8) given in [11].", "startOffset": 158, "endOffset": 162}, {"referenceID": 6, "context": "We show that our merging operator is reduced to the ∆H ,GMin operator defined in [7], which is defined as follows.", "startOffset": 81, "endOffset": 84}, {"referenceID": 6, "context": "Definition 7 [7] Let E = {K1, .", "startOffset": 13, "endOffset": 16}, {"referenceID": 8, "context": "Our merging operator is also related to the ∆ operator defined in [9], which selects the set of subsets of E that are consistent with μ and are maximal with respect to cardinality.", "startOffset": 66, "endOffset": 69}, {"referenceID": 10, "context": "Proposition 7 ∆ satisfies (IC0)-(IC8) given in [11] in the propositional case.", "startOffset": 47, "endOffset": 51}, {"referenceID": 16, "context": "Proposition 7 shows the advantage of our semantic merging operator over others as it has been shown in [17, 13] that existing semantic possibilistic merging operators do not satisfy all (IC0)-(IC8) in the propositional case.", "startOffset": 103, "endOffset": 111}, {"referenceID": 12, "context": "Proposition 7 shows the advantage of our semantic merging operator over others as it has been shown in [17, 13] that existing semantic possibilistic merging operators do not satisfy all (IC0)-(IC8) in the propositional case.", "startOffset": 103, "endOffset": 111}, {"referenceID": 3, "context": "Like our merging operator, the merging operators given in [4, 2] are semantically defined by aggregation of possibility distributions.", "startOffset": 58, "endOffset": 64}, {"referenceID": 1, "context": "Like our merging operator, the merging operators given in [4, 2] are semantically defined by aggregation of possibility distributions.", "startOffset": 58, "endOffset": 64}, {"referenceID": 3, "context": "The difference is that we apply the lexicographic aggregation function whilst the merging operators given in [4, 2] apply other aggregation operators, such as a conjunctive operator or a disjunctive operator.", "startOffset": 109, "endOffset": 115}, {"referenceID": 1, "context": "The difference is that we apply the lexicographic aggregation function whilst the merging operators given in [4, 2] apply other aggregation operators, such as a conjunctive operator or a disjunctive operator.", "startOffset": 109, "endOffset": 115}, {"referenceID": 16, "context": "It has been shown in [17, 13] that merging operators given in [4, 2, 17] do not satisfy basic postulates for propositional merging given in [10] in the propositional case.", "startOffset": 21, "endOffset": 29}, {"referenceID": 12, "context": "It has been shown in [17, 13] that merging operators given in [4, 2, 17] do not satisfy basic postulates for propositional merging given in [10] in the propositional case.", "startOffset": 21, "endOffset": 29}, {"referenceID": 3, "context": "It has been shown in [17, 13] that merging operators given in [4, 2, 17] do not satisfy basic postulates for propositional merging given in [10] in the propositional case.", "startOffset": 62, "endOffset": 72}, {"referenceID": 1, "context": "It has been shown in [17, 13] that merging operators given in [4, 2, 17] do not satisfy basic postulates for propositional merging given in [10] in the propositional case.", "startOffset": 62, "endOffset": 72}, {"referenceID": 16, "context": "It has been shown in [17, 13] that merging operators given in [4, 2, 17] do not satisfy basic postulates for propositional merging given in [10] in the propositional case.", "startOffset": 62, "endOffset": 72}, {"referenceID": 9, "context": "It has been shown in [17, 13] that merging operators given in [4, 2, 17] do not satisfy basic postulates for propositional merging given in [10] in the propositional case.", "startOffset": 140, "endOffset": 144}, {"referenceID": 4, "context": "The merging operators proposed in [5] are defined by aggregating weights of formulas inferred by possibilistic knowledge bases to be merged.", "startOffset": 34, "endOffset": 37}, {"referenceID": 9, "context": "The authors generalized postulates for propositional merging given in [10] by considering the logical closure of possibilistic inference and have shown that a merging operator satisfying all of the generalized postulates must be a strictly monotonic operator.", "startOffset": 70, "endOffset": 74}, {"referenceID": 1, "context": "Such a merging operator is similar to the conjunctive operator given in [2] and it thus suffers from the similar problems, that is, it suffers", "startOffset": 72, "endOffset": 75}, {"referenceID": 1, "context": "By applying the product merging operator given in [2], we obtain the", "startOffset": 50, "endOffset": 53}, {"referenceID": 11, "context": "The adaptive merging operator given in [12] has no semantic definition and has not been evaluated by logical properties.", "startOffset": 39, "endOffset": 43}, {"referenceID": 2, "context": "The merging approaches given in [3] are dependent on the syntactic form of formulas in a possibilistic knowledge base.", "startOffset": 32, "endOffset": 35}, {"referenceID": 13, "context": "The merging operator given in [14] is defined by a classical merging operator, thus it is compatible with propositional merging.", "startOffset": 30, "endOffset": 34}, {"referenceID": 10, "context": "However, it is only evaluated by four postulates that generalize some basic postulates given in [11] and its rationality w.", "startOffset": 96, "endOffset": 100}, {"referenceID": 14, "context": "The merging operator proposed in [15] is also based on lexicographic ordering.", "startOffset": 33, "endOffset": 37}, {"referenceID": 6, "context": "our merging operator can be reduced to the operator ∆H ,GMin defined in [7] operator in the propositional case and it satisfies postulates (IC0-IC8) given in [11].", "startOffset": 72, "endOffset": 75}, {"referenceID": 10, "context": "our merging operator can be reduced to the operator ∆H ,GMin defined in [7] operator in the propositional case and it satisfies postulates (IC0-IC8) given in [11].", "startOffset": 158, "endOffset": 162}], "year": 2010, "abstractText": "Belief merging is an important but difficult problem in Artificial Intelligence, especially when sources of information are pervaded with uncertainty. Many merging operators have been proposed to deal with this problem in possibilistic logic, a weighted logic which is powerful for handling inconsistency and dealing with uncertainty. They often result in a possibilistic knowledge base which is a set of weighted formulas. Although possibilistic logic is inconsistency tolerant, it suffers from the well-known “drowning effect”. Therefore, we may still want to obtain a consistent possibilistic knowledge base as the result of merging. In such a case, we argue that it is not always necessary to keep weighted information after merging. In this paper, we define a merging operator that maps a set of possibilistic knowledge bases and a formula representing the integrity constraints to a classical knowledge base by using lexicographic ordering. We show that it satisfies nine postulates that generalize basic postulates for propositional merging given in [11]. These postulates capture the principle of minimal change in some sense. We then provide an algorithm for generating the resulting knowledge base of our merging operator. Finally, we discuss the compatibility of our merging operator with propositional merging and establish the advantage of our merging operator over existing semantic merging operators in the propositional case.", "creator": "TeX"}}}