{"id": "1204.5981", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "26-Apr-2012", "title": "Containment, Equivalence and Coreness from CSP to QCSP and beyond", "abstract": "h1-b The 5:37 constraint satisfaction clothing problem (saccharum CSP) and ship-borne its sidetracking quantified extensions, whether enguerrand without (QCSP) leka or with potentiated disjunction (sterkfontein QCSP_or ), straightener correspond islas naturally boroland to the boatbuilders model checking neubauer problem vrain for three geekiness increasingly stronger fragments ocs of coolbaugh positive first - same-sex order ecotourism logic. kolnik Their philanthropical complexity correo is often studied what-if when slouchy parameterised by azzarello a fixed minimally model, canan the so - called long-term template.", "histories": [["v1", "Thu, 26 Apr 2012 16:46:25 GMT  (37kb,D)", "http://arxiv.org/abs/1204.5981v1", null]], "reviews": [], "SUBJECTS": "cs.LO cs.AI", "authors": ["florent madelaine", "barnaby martin"], "accepted": false, "id": "1204.5981"}, "pdf": {"name": "1204.5981.pdf", "metadata": {"source": "CRF", "title": "Containment, Equivalence and Coreness from CSP to QCSP and beyond", "authors": ["Barnaby Martin"], "emails": ["barnabymartin@gmail.com", "florent.madelaine@googlemail.com"], "sections": [{"heading": "1 Introduction", "text": "We consider the following increasingly stronger fragments of first-order logic:\n1. primitive positive first-order ({∃,∧}-FO)\n2. positive Horn ({∃,∀,∧}-FO)\n3. positive equality-free first-order ({∃,∀,∧,∨}-FO); and,\n4. positive first-order logic ({∃,∀,∧,∨,=}-FO) ∗Supported by EPSRC grant EP/G020604/1.\nar X\niv :1\n20 4.\n59 81\nv1 [\ncs .L\nO ]\nThe model checking problem for a logic L takes as input a sentence of L and a structure B and asks whether B models L. The structure B is often assumed to be a fixed parameter and called the template; and, unless otherwise stated, we will assume implicitly that we work in this so-called non-uniform setting.\nFor the above first three fragments, the model checking problem is better known as the constraint satisfaction problem CSP(B), the quantified constraint satisfaction problem QCSP(B) and its extension with disjunction which we shall denote by QCSP∨(B). Much of the theoretical research into CSPs is in respect of a large complexity classification project – it is conjectured that CSP(B) is always either in P or NP-complete [9]. This dichotomy conjecture remains unsettled, although dichotomy is now known on substantial classes (e.g. structures of size ≤ 3 [16, 3] and smooth digraphs [11, 1]). Various methods, combinatorial (graph-theoretic), logical and universal-algebraic have been brought to bear on this classification project, with many remarkable consequences. A conjectured delineation for the dichotomy was given in the algebraic language in [4].\nComplexity classifications for QCSPs appear to be harder than for CSPs. Just as CSP(B) is always in NP, so QCSP(B) is always in Pspace. No overarching polychotomy has been conjectured for the complexities of QCSP(B), as B ranges over finite structures, but the only known complexities are P, NP-complete and Pspace-complete (see [2, 15] for some trichotomies). It seems plausible that these complexities are the only ones that can be so obtained.\nDistinct templates may give rise to the same model-checking-problem or preserve acceptance,\n(L -equivalence) for any sentence ϕ of L , A models ϕ ⇔ B models ϕ\n(L -containment) for any sentence ϕ of L , A models ϕ ⇒ B models ϕ.\nWe will see that containment and therefore equivalence is decidable, and often quite effectively so, for the four logics we have introduced.\nFor example, when L is {∃,∧}-FO, any two bipartite undirected graphs that have at least one edge are equivalent. Moreover, there is a canonical minimal representative for each equivalence class, the so-called core. For example, the core of the class of bipartite undirected graphs that have at least one edge is the graph K2 that consists of a single edge. The core enjoys many benign properties and has greatly facilitated the classification project for CSPs (which corresponds to the model-checking for {∃,∧}-FO): it is unique up to isomorphism and sits as an induced substructure in all templates in its equivalence class. A core may be defined as a structure all of whose endomorphisms are automorphisms. To review, therefore, it is well-known that two templates A and B are equivalent iff there are homomorphisms from A to B and from B to A, and in this case there is an (up to isomorphism) unique core C equivalent to both A and B such that C ⊆ A and C ⊆ B.\nThe situation for {∃, ∀,∧}-FO and QCSP is somewhat murkier. It is known that non-trivial A and B are equivalent iff there exist integers r and r′ and surjective homomorphisms from Ar to B and from Br′ to A (and one may give a bound on these exponents) [6]. However, the status and properties of “core-ness” for QCSP were hitherto unstudied.\nWe might call a structure B a Q-core if there is no equivalent A of strictly smaller cardinality. We will discover that this Q-core is a more cumbersome beast than its cousin the core; it need not be unique nor sit as an induced substructure of the templates in its class. However, in many cases we shall see that its behaviour is reasonable and that – like the core – it can be very useful in delineating complexity classifications.\nThe erratic behaviour of Q-cores sits in contrast not just to that of cores, but also that of the UX-cores of [13], which are the canonical representatives of the equivalence classes associated with {∃,∀,∧,∨}-FO, and were instrumental in deriving a full complexity classification – a tetrachotomy – for QCSP∨ in [13]. Like cores, they are unique and sit as induced substructures in all templates in their class. Thus, primitive positive logic and positive equality-free logic behave genially in comparison to their wilder cousin positive Horn. In fact this manifests on the algebraic side also – polymorphisms and surjective hyper-endomorphisms are stable under composition, while surjective polymorphisms are not.\nContinuing to add to our logics, in restoring equality, we might arrive at positive logic. Two finite structures agree on all sentences of positive logic iff they are isomorphic – so here every finite structure satisfies the ideal of “core”. When computing a/the smallest substructure with the same behaviour with respect to the four decreasingly weaker logics – positive logic, positive equality-free, positive Horn, and primitive positive – we will obtain possibly decreasingly smaller structures. In the case of positive equality-free and primitive positive logic, as pointed out, these are unique up to isomorphism; and for the U -X-core and the core, these will be induced substructures. A Q-core will necessarily contain the core and be included in the U-X-core. This phenomenon is illustrated on Table 1 and will serve as our running example.\nThe paper is organised as follows. In Section 2, we recall folklore results on CSP. In Section 3, we recall results on coreness and spell out containment for {∃,∀,∧,∨}-FO that were only implicit in [13]. In Section 4, we move on to QCSP and recall results on the decidability of containment from [6] together with new lower bounds before initiating a study of the notion of core for QCSP."}, {"heading": "2 The case of CSP", "text": "Unless otherwise stated, we consider structures over a fixed relational signature σ. We denote by A the domain of a structure A and for every relation symbol R in σ of arity r, we write RA for the interpretation of R in A, which is a r-ary relation that is RA ⊆ Ar. We write |A| to denote the cardinality of the set A. A homomorphism (resp., strong homomorphism) from a structure A to a structure B is a function h : A → B such that (h(a1), . . . , h(ar)) ∈ RB, if (resp., iff) (a1, . . . , ar) ∈ RA.\nWe will occasionally consider signatures with constant symbols. We write cA for the interpretation of a constant symbol c and homomorphisms are required to preserve constants as well, that is h(cA) = cB.\nContainment for {∃,∧}-FO is a special case of conjunctive query containment from databases [5]. We state and prove these results for pedagogical reasons, before moving to the case of {∃, ∀,∧,∨}-FO. Let us fix some notation first. Given a sentence ϕ in {∃,∧}-FO, we denote by Dϕ its canonical database, that is the structure with domain the variables of ϕ and whose tuples are precisely those that are atoms of ϕ. In the other direction, given a finite structure A, we write ϕA for the so-called canonical conjunctive query of A, the quantifier-free formula that is the conjunction of the positive facts of A, where the variables v1, . . . , v|A| correspond to the elements a1, . . . , a|A| of A.1 It is well known that there is a homomorphism from Dϕ to a structure A if, and only if, A |= ϕ. Moreover, a winning strategy for ∃ in the (Hintikka) (A, ϕ)-game is precisely a homomorphism from Dϕ to A. Note also that A is isomorphic to the canonical database of ∃v1∃v2 . . . v|A|ϕA. Theorem 1 (Containment). Let A and B be two structures. The following are equivalent.\n(i) for every sentence ϕ in {∃,∧}-FO, if A |= ϕ then B |= ϕ.\n(ii) The exists a homomorphism from A to B.\n(iii) B |= ∃v1∃v2 . . . v|A|ϕA. where ϕA denotes the canonical conjunctive query of A. Proof. A homomorphism corresponds precisely to a winning strategy in the (A, ϕ)-game and (ii) and (iii) are equivalent. Clearly, (i) implies (iii) since A |= ∃v1∃v2 . . . v|A|ϕA.\nWe now prove that (ii) implies (i). Let h be a homomorphism from A to B. If A |= ϕ, then there is a homomorphism g from Dϕ to A. By composition, g ◦ h is a homomorphism from Dϕ to B. In other words, g ◦ h is a winning strategy witnessing that B |= ϕ.\nIt is well known that the core is unique up to isomorphism and that it is an induced substructure [12]. It is usually defined via homomorphic equivalence, but because of the equivalence between (i) and (ii) in the above theorem, we may define the core as follows.\nDefinition 1. The core B of a structure A is a minimal substructure of A such that for every sentence ϕ in {∃,∧}-FO, A |= ϕ if and only if B |= ϕ. Corollary 1 (equivalence). Let A and B be two structures. The following are equivalent.\n(i) for every sentence ϕ in {∃,∧}-FO, A |= ϕ if and only if B |= ϕ.\n(ii) There are homomorphisms from A to B and from B to A.\n(iii) The core of A and the core of B are isomorphic. As a preprocessing step, one could replace the template A of a CSP by its core B (see Algorithm\n6.1 in [7]). However, the complexity of this preprocessing step would be of the same order of magnitude as solving a constraint satisfaction problem.2 This drawback, together with the uniform nature of the instance in constraints solvers, means that this preprocessing is not exploited in practice to the best of our knowledge.\nThe notion of a core can be extended and adapted suitably to solve important questions related to data exchange and query rewriting in databases [8]. It is also very useful as a simplifying assumption when classifying the complexity: with the algebraic approach, it allows to study only idempotent algebras [4].\n1Most authors consider the canonical query to be the sentence which is the existential quantification of ϕA. 2Checking that a graph is a core is coNP-complete [10]. Checking that a graph is the core of another given graph\nis DP-complete [8]."}, {"heading": "3 The case of QCSP with disjunction", "text": "For {∃,∀,∧,∨}-FO, it is no longer the homomorphism that is the correct concept to transfer winning strategies.\nDefinition 2. A surjective hypermorphism f from a structure A to a structure B is a function from the domain A of A to the power set of the domain B of B that satisfies the following properties.\n• (total) for any a in A, f(a) 6= ∅.\n• (surjective) for any b in B, there exists a in A such that f(a) 3 b.\n• (preserving) if R(a1, . . . , ai) holds in A then R(b1, . . . , bi) holds in B , for all b1 ∈ f(a1), . . . , bi ∈ f(ai).\nA strategy for ∃ in the (Hintikka) (A, ϕ)-game, where ϕ ∈ {∃,∀,∧,∨}-FO, is a set of mappings {σx : ‘∃x’ ∈ ϕ} with one mapping σx for each existentially quantified variable x of ϕ. The mapping σx ranges over the domain A of A; and, its domain is the set of functions from Yx to A, where Yx denotes the universally quantified variables of ϕ preceding x.\nWe say that {σx : ‘∃x’ ∈ ϕ} is winning if for any assignment π of the universally quantified variables of ϕ to A, when each existentially quantified variable x is set according to σx applied to π|Yx , then the quantifier-free part ψ of ϕ is satisfied under this overall assignment h. When ψ is disjunction-free, this amounts to h being a homomorphism from Dψ to A.\nLemma 1 (strategy transfer). Let A and B be two structures such that there is a surjective hypermorphism from A to B. Then, for every sentence ϕ in {∃,∀,∧,∨}-FO, if A |= ϕ then B |= ϕ.\nProof. Let f be a surjective hypermorphism from A to B and ϕ be a sentence of {∃,∀,∧,∨}-FO such that A |= ϕ. For any element b of B, let f−1(b) := {a ∈ A s. t. b ∈ f(a)}. We fix an arbitrary linear order over A and write min f−1(b) to denote the smallest antecedent of b in A under f .\nLet {σx : ‘∃x’ ∈ ϕ} be a winning strategy in the (A, ϕ)-game. We construct a strategy {σ′x : ‘∃x’ ∈ ϕ} in the (B, ϕ)-game as follows. Let πB : Yx → B be an assignment to the universal variables Yx preceding an existential variable x in ϕ, we select for σ ′ x(π) an arbitrary element of f(σ(πA)) where πA : Yx → A is an assignment such that for any universal variable y preceding x, we have πA(y) := min f\n−1(πB(y)). This strategy is well defined since f is surjective (which means that πA is well defined) and total (which means that f(σ(πA)) 6= ∅). Note moreover that using min in the definition of πA means that a branch in the tree of the game on B will correspond to a branch in the tree of the game on A. It remains to prove that {σ′x : ‘∃x’ ∈ ϕ} is winning. We will see that it follows from the fact that f is preserving.\nAssume first that ϕ is a sentence of {∃,∀,∧}-FO. Let Dψ be the canonical database of the quantifier-free part ψ of ϕ. The winning condition of the (B, ϕ)-game can be recast as a homomorphism from Dψ. Composing with f the homomorphism from Dψ to A (induced by the sequence of compatible assignments πA to the universal variables and the strategy {σx : ‘∃x’ ∈ ϕ}), we get a surjective hypermorphism from Dψ to B. The map from the domain of Dψ to B induced by the sequence of assignments πB and the strategy {σ′x : ‘∃x’ ∈ ϕ} is a range restriction of this surjective hypermorphism and is therefore a homomorphism (we identify surjective hypermorphism to singletons with homomorphisms).\nWhen ϕ is not a sentence of {∃,∀,∧}-FO, we write its quantifier-free part in disjunctive normal form as a disjunction of conjunctions-of-atoms ψi. The winning condition can now be recast as a homomorphism from some Dψi . The above argument applies and the result follows.\nExample 1. Consider the structures A4 and A3 from Table 1. The map f given by f(1) := {1}, f(2) := {2}, f(3) := {3}, f(4) := {1} is a surjective hypermorphism from A4 to A3. The map g given by g(1) := {1, 4}, g(2) := {2}, g(3) := {3} is a surjective hypermorphism from A3 to A4. The two templates are equivalent w.r.t. {∃,∀,∧,∨}-FO.\nWe extend the notion of canonical conjunctive query of a structureA. Given a tuple of (not necessarily distinct) elements r := (r1, . . . , rl) ∈ Al, define the quantifier-free formula ϕA(r)(v1, . . . , vl) to be the conjunction of the positive facts of r, where the variables v1, . . . , vl correspond to the elements r1, . . . , rl. That is, R(vλ1 , . . . , vλi) appears as an atom in ϕA(r) iff R(rλ1 , . . . , rλi) holds in A. When r enumerates the elements of the structure A, this definition coincides with the usual definition of canonical conjunctive query. Note also that there is a strong homomorphism from the canonical database DϕA(r) to A given by the map ri 7→ vi.\nDefinition 3 (Canonical {∃,∀,∧,∨}-FO sentence). Let A be a structure and m > 0. Let r be an enumeration of the elements of A.\nθA,m := ∃v1, . . . , v|A|ϕA(r)(v1, . . . , v|A|) ∧ ∀w1, . . . , wm ∨\nt∈Am ϕA(r,t)(v,w).\nObserve that A |= θA,m. Indeed, we may take as witness for the variables v the corresponding enumeration a of the elements of A; and, for any assignment t ∈ Am to the universal variables w, it is clear that A |= ϕA(r,t)(a, t) holds.\nLemma 2 (strategy transfer). Let A and B be two structures. If B |= θA,|B| then there is a surjective hypermorphism from A to B.\nProof. Let b′ := b′1, . . . , b ′ |A| be witnesses for v1, . . . , v|A|. Assume that an enumeration b := b1, b2, . . . , b|B| of the elements of B is chosen for the universal variables w1, . . . w|B|. Let t ∈ Am be the witness s.t. B |= ϕA(r)(b′) ∧ ϕA(r,t)(b′,b).\nLet f be the map from the domain of A to the power set of that of B which is the union of the following two partial hyperoperations h and g (i.e. f(ai) := h(ai)∪ g(ai) for any element ai of A), which guarantee totality and surjectivity, respectively.\n• (totality) h(ai) := b′i\n• (surjectivity) g(ti) 3 bi.\nIt remains to show that f is preserving. This follows from B |= ϕA(r,t)(b′,b). LetR be a r-ary relational symbol such thatR(ai1 , . . . , air) holds inA. Let b′′i1 ∈ f(ai1), . . . , b ′′ ir ∈ f(ar). We will show that R(b ′′ i1 , . . . , b′′ir) holds in B. Assume for clarity of the exposition and w.l.o.g. that from i1 to ik the image is set according to h and from ik+1 to ir according to g: i.e. for 1 ≤ j ≤ k, h(aij) = b′ij = b ′′ ij\nand for k + 1 ≤ j ≤ r, there is some lj such that tlj = aij and g(tlj) 3 b′′ij = blj . By definition of A(r, t) the atom R(vi1 , . . . , vik , wlk+1 , . . . , wr) appears in ϕA(r,t)(v,w). It follows from B |= ϕA(r,t)(b′,b) that R(b′′i1 , . . . , b ′′ ir) holds in B.\nTheorem 2 (Containment for {∃,∀,∧,∨}-FO). Let A and B be two structures. The following are equivalent.\n(i) for every sentence ϕ in {∃, ∀,∧,∨}-FO, if A |= ϕ then B |= ϕ.\n(ii) The exists a surjective hypermorphism from A to B.\n(iii) B |= θA,|B| where ΘA,B is a canonical sentence of {∃,∀,∧,∨}-FO that is defined in terms of A and |B| and that is modelled by A by construction. Proof. By construction A |= θA,|B|, so (i) implies (iii). By Lemma 1, (ii) implies (i). By Lemma 2, (iii) implies (i).\nLet U and X be two subsets of A and a surjective hypermorphism h from A to A that satisfies h(U) = A and h−1(X) = A. Let B be the substructure of A induced by B := U ∪ X. Then f and g, the range and domain restriction of h to B, respectively, are surjective hypermorphisms between A and B witnessing that A and B satisfy the same sentence of {∃,∀,∧,∨}-FO. Note that in particular h induces a retraction of A to a subset of X; and, dually a retraction of the complement structure 3 of B to a subset of U . Additional minimality conditions on U , X and U ∪ X ensure that B is minimal.4 It is also unique up to isomorphism and within B the set U and X are uniquely determined. Consequently, B is called the U -X-core of A (for further details see [13]) and may be defined as follows.\nDefinition 4. The U-Xcore B of a structure A is a minimal substructure of A such that for every sentence ϕ in {∃,∀,∧,∨}-FO, A |= ϕ if and only if B |= ϕ. Example 2. The map h(1) := {1, 4}, h(2) := {2}, h(3) := {1, 3, 4}, h(4) := {1, 4} is a surjective hypermorphism from A4 to A4 with U = {2, 3} and X := {1, 2}. The substructure induced by U ∪X is A3. It can be checked that it is minimal.\nThe U -X-core is just like the core an induced substructure. There is one important difference in that U -X-cores should be genuinely viewed as a minimal equivalent substructure induced by two sets. Indeed, when evaluating a sentence of {∃,∀,∧,∨}-FO, we may assume w.l.o.g. that all ∀ variables range over U and all ∃ variables range over X. This is because for any play of ∀, we may extract a winning strategy for ∃ that can even restrict herself to play only on X [13, Lemma 5]. Hence, as a preprocessing step, one could compute U and X and restrict the domain of each universal variable to U and the domain of each universal variable to X. The complexity of this processing step is no longer of the same magnitude and is in general much lower than solving a QCSP∨.\n5 Thus, even when taking into account the uniform nature of the instance in a quantified constraints solver, this preprocessing step might be exploited in practice. This could turn out to be ineffective when there are few quantifier alternation (as in bilevel programming), but should be of particular interest when the quantifier alternation increases. Another interesting feature is that storing a winning strategy over U and X together with the surjective hypermorphism h from A to A, allows to recover a winning strategy even when ∀ plays in an unrestricted manner. This provides a compression mechanism to store certificates."}, {"heading": "4 The case of QCSP", "text": "In primitive positive and positive Horn logic, one normally considers equalities to be permitted. From the perspective of computational complexity of CSP and QCSP, this distinction is unimportant as equalities may be propagated out by substitution. In the case of positive Horn and QCSP,\n3It has the same domain as A and a tuple belongs to a relation R iff it did not in A. 4This is possible since given h1 s.t. h1(U) = A and h2 such that h −1 2 (X) = A, their composition h = h2 ◦ h1 satisfies both h(U) = A and h−1(X) = A. 5The question of U -X-core identification is in DP (and should be complete), whereas QCSP∨ is Pspace-complete in general\nthough, equality does allow the distinction of a trivial case that can not be recognised without it. The sentence ∀x x = x is true exactly on structures of size one. The structures K1 and 2K1, containing empty relations over one element and two elements, respectively, are therefore distinguishable in {∃,∀,∧,=}-FO, but not in {∃, ∀,∧}-FO. Since we disallow equalities, many results from this section apply only to non-trivial structures of size ≥ 2. Note that equalities can not be substituted out from {∃,∀,∧,∨,=}-FO, thus it is substantially stronger than {∃,∀,∧,∨}-FO.\nFor {∃,∀,∧}-FO, the correct concept to transfer winning strategies is that of surjective homomorphism from a power. Recall first that the product A × B of two structures A and B has domain {(x, y) : x ∈ A, y ∈ B} and for a relation symbol R, RA×B := { ( (a1, b1), . . . , (ar, br) ) : (a1, . . . , ar) ∈ RA, (b1, . . . , br) ∈ RB}; and, similarly for a constant symbol c, cA×B := (cA, cB). The mth power Am of A is A× . . .×A (m times).\nLemma 3 (strategy transfer). Let A and B be two structures and m ≥ 1 such that there is a surjective homomorphism from Am to B. Then, for every sentence ϕ in {∃, ∀,∧}-FO, if A |= ϕ then B |= ϕ.\nProof. For m = 1, the proof is similar to Lemma 1. A projection from Am to A is a surjective homomorphism. This means that for every sentence ϕ in {∃,∀,∧}-FO, if Ar |= ϕ then A |= ϕ. For the converse, one can consider the “product strategy” which consists in projecting over each coordinate of Am and applying the strategy for A. For further details see [6, Lemma 1&2].\nExample 3. Consider an undirected bipartite graphs with at least one edge G and K2 the graph that consists of a single edge. There is a surjective homomorphism from G to K2. Note also that K2×K2 = K2+K2 (where + stands for disjoint union) which we write as 2K2. Thus, K2j = 2j−1K2 (as × distributes over +). Hence, if G has no isolated element and m edges there is a surjective homomorphism from K1+log2m2 to G.\nThis examples provides a lower bound for m which we can improve.\nProposition 1 (lower bound). For any m ≥ 2, there are structures A and B with |A| = m and |B| = m+1 such that there is only a surjective homomorphism from Aj to B provided that j ≥ |A|.\nsketch. We consider a signature that consists of a binary symbol E together with a monadic predicate R. Consider for A an oriented cycle with m vertices, for which R holds for all but one. Consider for B an oriented cycle with m vertices, for which R does not hold, together with a self-loop on which R holds. The square of A will consists of |A| = m oriented cycles with m vertices: one cycle will be a copy of A, all the other will be similar but with two vertices on which R does not hold (this is depicted on Figure 1 in the case m = 3: white vertices do not satisfy R while black ones do). It is only for j = m that we will get as an induced substructure of Aj one copy of an oriented cycle on which R does not hold as in B.\nThere is also a canonical {∃,∀,∧}-FO-sentence which turns out to be in Π2-form, that is with a quantifier prefix of the form ∀?∃?. We consider temporarily structures with m constants c1, c2, . . . , cm; let t in A\nm describe the position of these constants in a structure A; and, write At for the corresponding structure with constants. We consider the canonical conjunctive query of the structure with constants ⊗ t∈Am At, (where ⊗ denote the product), identifying the constants with some variables w = w1, . . . , wm and using variables v for the other elements. We turn this quantifier-free formula into a sentence by adding the prefix ∀w∃v. Keeping this in mind, we can also give the following direct definition, but it dilutes the intuition somewhat.\nDefinition 5 (Canonical {∃,∀,∧}-FO sentence). Let A be a structure and m > 0. Let r be an enumeration of the elements of Ã := A|A|m.\nψA,m := ∀w∃vϕÃ(r)(v) ∧ ∧\nt∈Am w1 = vt,t[1] . . . ∧ wm = vt,t[m].\nObserve that we may propagate the equalities out of ψA,m to obtain an equivalent sentence: e.g. we remove w1 = vt,t[1] and replace every occurrence of vt,t[1] by w1. Observe also that A |= ψA,m. Indeed, assume that t ∈ Am is the assignment chosen for the universal variables w. There is a natural projection from ⊗ t∈Am At to At which is a homomorphism. This homomorphism corresponds precisely to a winning strategy for the existential variables v.\nTheorem 3 (Containment for {∃,∀,∧}-FO). Let A and B be two non-trivial structures. The following are equivalent.\n(i) for every sentence ϕ in {∃, ∀,∧}-FO, if A |= ϕ then B |= ϕ.\n(ii) There exists a surjective homomorphism from Ar to B, with r ≤ |A||B|.\n(iii) B |= ψA,|B|\nwhere ψA,|B| is a canonical sentence of {∃,∀,∧}-FO with quantifier prefix ∀|B|∃? that is defined in terms of A and modelled by A by construction.\nsketch. (ii) implies (i) by Lemma 3. (i) implies (iii) since A models ψA,|B|. (iii) implies (ii) by construction of ψA,|B|. We may chose for the universal variables w an enumeration of B. The winning strategy on B induces a surjective homomorphism from Ar (for further details see [6, Theorem 3] and comments on the following page).\nFollowing our approach for the other logics, we now define a minimal representative as follows.\nDefinition 6. A Q-core B of a structure A is a minimal substructure of A such that for every sentence ϕ in {∃,∀,∧}-FO, A |= ϕ if and only if B |= ϕ.\nExample 4. Consider A3 and A2 from Table 1. The map f(1) := 1, f(2) := 2, f(3) := 2 is a surjective homomorphism from A3 to A2. The square of A2 is depicted on Figure 2a; and, a surjective homomorphism from it to A3 is depicted on Figure 2b. Thus A3 and A2 are equivalent w.r.t. {∃,∀,∧}-FO. One can also check that A2 is minimal and is therefore a Q-core of A3, and a posteriori of A4.\nThe behaviour of the Q-core differs from its cousins the core and the U -X-core.\nProposition 2. The Q-core of a 3-element structure A is not always an induced substructure of A.\nProof. Consider the signature σ := 〈E,R,G〉 involving a binary relation E and two unary relations R and G. Let A and B be structures with domain {1, 2, 3} with the following relations.\nEA := {(1, 1), (2, 3), (3, 2)} RA := {1, 2} GA := {1, 3} EB := {(1, 1), (2, 3), (3, 2)} RB := {1} GB := {1}\nSince B is a substructure of A, we have B−→ A. Conversely, the square of A2 contains an edge that has no vertex in the relation R and G, which ensures that A2−→ B (see Figure 3). Observe also that no two-element structure C, and a fortiori no two-element substructure of A agrees with them on {∃, ∀,∧}-FO. Indeed, if a structure C agrees on {∃,∀,∧}-FO with B, it agrees also on {∃,∧}-FO. Thus, the core of B is also the core of C and must appear as an induced substructure of C. This core is the one-element substructure of B induced by 1. In order to have a surjective homomorphism from a power of C to B, this power must contain a non-loop, and so does C. This non-loop must in C be adjacent to another vertex (this is a {∃,∀,∧}-FO-expressible property that holds in B ∀x∃yE(x, y)). The structure C would therefore be a two element structure satisfying\nEC ⊆ {(1, 1), (1, 2), (2, 1)} RC ⊆ {1} GC ⊆ {1}\nA power of C would therefore be connected, which is not the case of B, preventing the existence of any surjective homomorphism.\nWe do not know whether the Q-core of a structure is unique. We will explore in the following section Q-cores over some special classes and show that it behaves well in these cases."}, {"heading": "5 Q-cores over classes", "text": ""}, {"heading": "5.1 The Boolean case", "text": "A Boolean structure B has domain B := {0, 1}. The results of this section apply to arbitrary (not necessarily finite) signatures. We give the following lemma ultimately for illustrative purposes (the gist of its proof will be reused several times). The pH-type T (b) of b ∈ B is the set of all formulae ϕ(x) in one free variable x from {∃, ∀,∧}-FO such that B |= ϕ(x) (pH stands for positive Horn).\nLemma 4. If B is a Boolean structure such that the pH-types T (0) and T (1) in B coincide, then B has an automorphism swapping 0 and 1.\nProof. Suppose there is no such automorphism, then w.l.o.g. we may assume there exists a conjunction of atoms θ(x, y), involving only variables x and y, such that B |= θ(0, 1) but B |=/ θ(1, 0). Now, B |= θ(0, 0) iff B |= θ(1, 1), since 0 and 1 are of the same pH-type. If B |= θ(0, 0) then B |= ∀xθ(x, 0) but B |=/ ∀xθ(x, 1) (contradiction). Similarly, if B |=/ θ(0, 0) then B |= ∃xθ(0, x) but B |=/ ∃xθ(1, x) (contradiction).\nTheorem 4. Let A and B be Boolean structures that are equivalent w.r.t. {∃,∀,∧}-FO. Then A and B are isomorphic.\nProof. We consider the pH-types TA(0) and TA(1) of 0 and 1 in A, respectively (likewise with B superscripts for B).\nCase I. TA(0) = TA(1). It follows that TA(0) = TA(1) = TB(0) = TB(1), since ϕ(x) ∈ TA(0) iff A |= ∀xϕ(x) iff B |= ∀xϕ(x) iff θ(x) ∈ TB(0) etc. In this case the function A → B given by 0 7→ 0 and 1 7→ 1 is an isomorphism, as in the proof of Lemma 4. (Of course, 0 7→ 1 and 1 7→ 0 is also an isomorphism.)\nCase II. TA(0) and TA(1) are incomparable. Let θ0(x) be in T A(0) but not in TA(1); and let θ1(x) be in T A(1) but not in TA(0). Let z(0) be the witness of ∃xθ0(x) in B; and let z(1) be the witness of ∃xθ1(x) in B. Since A |=/ ∃xθ0(x)∧θ1(x), B |=/ ∃xθ0(x)∧θ1(x) and z(0) 6= z(1). We claim z (0 7→ z(0), 1 7→ z(1)) is an isomorphism from A to B. If not, then w.l.o.g. we may assume there exists an atom (maybe with variables identified) θ(x, y) such thatA |= θ(0, 1) but B |=/ θ(z(0), z(1)). Now, A |= θ(0, 0) iff A |= θ0(0) ∧ θ(0, 0) iff A |= ∃xθ0(x) ∧ θ(x, x) iff B |= ∃xθ0(x) ∧ θ(x, x) iff B |= θ(z(0), z(0)). The proof is completed as in that of Lemma 4.\nCase III. W.l.o.g. TA(0) ⊆ TA(1) but TA(0) 6= TA(1). Let θ1(x) be in TA(1) but not in TA(0). Let z(1) be the witness of ∃xθ1(x) in B. z(1) is unique since B |=/ ∀xθ1(x). Let z(0) be the other element of B. We claim z is an isomorphism from A to B. If not, then there exists a conjunction of atoms θ(x, y) such that (we lose the w.l.o.g.) either A |= θ(0, 1) but B |=/ θ(z(0), z(1)), or B |= θ(0, 1) but A |=/ θ(z(0), z(1)). In fact, we can still deal with both cases at once, since A |= θ(1, 1) iff A |= θ1(1) ∧ θ(1, 1) iff A |= ∃xθ1(x) ∧ θ(x, x) etc. and B |= θ(1, 1). The proof concludes as in Lemma 4.\nIn the extended logic {∃,∀,∧,=}-FO, it follows that every structure of size at most 2 satisfies the ideal of core. For {∃,∀,∧}-FO we can only say the following.\nProposition 3. Every Boolean structure B is either a Q-core, or its Q-core is the substructure induced by either of its elements. In particular, the Q-core of B is unique up to isomorphism and is an induced substructure of B.\nProof. If B generates the same QCSP as a one-element structure A with domain {0}, then it is clear that the pH-types TB(0), TB(1) and TA(0) coincide. This gives uniqueness and induced substructure in this case. Otherwise, the only possibility – to violate the statement – is for B to have as Q-core a non-induced substructure. But this is impossible by Theorem 4.\nLemma 4 does not extend to structures of size three. There exists H1 of size three such that every element of H1 has the same pH-type and yet H1 has no non-trivial automorphism (H1 := {0, 1, 2} and EH1 := {(0, 0), (1, 1), (2, 2), (1, 2)}). However, H1 is not a Q-core."}, {"heading": "5.2 Unary structures", "text": "Let σ be a fixed relational signature that consists of n unary relation symbols M1,M2, . . . ,Mn. A structure over such a signature is deemed unary.\nLet w be a string of length n over the alphabet {0, 1}. We write w(x) as an abbreviation for the quantifier-free formula ∧ 1≤i≤n,w[i]=1Mi(x). Each element a of a unary structure A corresponds to a word w, which is the largest word bitwise such that A |= w(x/a). Let w∀ be the bitwise ∧ of the words associated to each element. The unary structure A satisfies the canonical universal sentence ∀y w∀(y) (note that w∀ is also the largest word bitwise among such satisfied universal formulae).\nProposition 4. The Q-core of a unary structure A is the unique substructure of A defined as follows. The Q-core of A is the core A′ of A if they share the same canonical universal sentence and the disjoint union of A′ with a single element corresponding to w∀ where ∀y w∀(y) is the canonical universal sentence of A.\nProof. A positive Horn sentence over a unary signature is logically equivalent to a conjunction of formulae that do not share any variables. Each conjunct is either a universal formulae of the form ∀y w(y) or an existential formulae of the form ∃xw(x).\nThe core A′ is a substructure of the Q-core, so we need only enforce that the Q-core and A′ satisfy the same canonical universal sentence. This is achieved with the optional addition of an element corresponding to w∀ where ∀yw∀(y) is the canonical universal sentence of A."}, {"heading": "5.3 Structures with an isolated element", "text": "We say that a pH-sentence is a proper pH-sentence, if it has at least one universally quantified variable x1 that occurs in some atom in the quantifier-free part. Generally, we will say that a sentence is proper if any variable x1 occurs in some atom and we will be always working with such sentences unless otherwise stated (otherwise, we would simply discard x1 and consider the equivalent sentence with one less variable). We will say that a proper pH-sentence ψ induced from a proper pH-sentence ϕ by the removal of some conjuncts is a proper subsentence of ψ.\nLet σ be a signature that consists of finitely many relation symbols Ri of respective arity ri. We will consider the set of minimal proper pH-sentences w.r.t. σ, that is all formulae of the form ∀x1∃x2 . . . ∃xri Ri(x̄), where the tuple x̄ is a permutation of the variables x1, x2, . . . xri where x1 has been transposed with some other variable. There are r(σ) = ΣRi∈σri such formulae.\nTheorem 5. Let A be a σ-structure. The following are equivalent.\n1. A does not satisfy any proper pH-sentence.\n2. A does not satisfy any of the r(σ) minimal proper pH-sentences w.r.t. σ.\n3. Ar(σ) contains an isolated element.\nProof. The first point implies trivially the second. We show the converse. Note that any proper pHsentence ϕ contains as a proper subinstance a sentence of the form Q1x1Q2x2 . . . ∀xj . . . Qrxr R(x̄), where the Qi represent some arbitrary quantifiers. By assumption, the structure A models ∃xj∀x1∀x2 . . . ∀xr ¬R(x̄). Thus, it follows thatAmodels the weaker sentence ∀x1∀x2 . . . ,∃xj . . . ∀xr ¬R(x̄) (the same strategy for selecting a witness for xj will work) and the even weaker sentence where some universal quantifiers are turned to existential ones, namely those for which Qj is universal (the strategy for these new existential variable can be chosen arbitrarily). So, A does not model the negation of this last sentence which is Q1x1Q2x2 . . . ∀xj . . . Qrxr R(x̄), which is a subinstance of ϕ. By monotonicity, A does not model ϕ either.\nWe now prove that the second point implies the third. Let ϕi be the ith minimal proper pHsentence w.r.t. σ. Let ai be a witness for the unique existential variable of ¬ϕi that A does not satisfy ϕi. It is a simple exercise to check that (a1, a2, . . . , ari) is an isolated element of Ar(σ).\nConversely, if ā := (a1, a2, . . . , ari) is an isolated element of Ar(σ) then ā is a witness that Ar(σ) does not satisfy any minimal proper pH-sentence ϕi. Consequently, there exists some aji witnessing that A does not satisfy ϕi and we are done.\nExample 5. In the case of directed graphs, the minimal proper pH-sentences are ∀x1∃x2E(x1, x2) and ∀x1∃x2E(x2, x1). A directed graph which does not satisfy them will satisfy their negation ∃x1∀x2¬E(x1, x2) and ∃x1∀x2¬E(x2, x1). A witness for the existential x1 in the first sentence will be a source, and in the second sentence a sink, respectively\nSo a directed graph has a source and a sink if, and only if, it does not satisfy any proper pH-sentence, if and only if, its square has an isolated element.\nCorollary 2. The Q-core of a structure A that does not satisfy any proper pH-sentence is the unique substructure of A may be found as follows. The Q-core of A is the core A′ of A, if A′r(σ) contains an isolated element, and the disjoint union of A′ and an isolated element, otherwise.\nProof. By assumption A does not satisfy any proper pH-sentence. Consequently a minimal structure A′ (both w.r.t. domain size and number of tuples) which satisfies the same pH-sentences as A will satisfy the same pp-sentences as A and none of the proper pH-sentences either. It follows that A′ must contain the core of A (and can be no smaller). If this core satisfies no proper pHsentence then we are done and by the previous theorem Ar(σ) has an isolated element. Otherwise, we must look for a structure that contains the core of A and does not satisfy any proper universal sentence. Adding tuples to A can clearly not force this property by monotonicity of QCSP. Thus, the minimal (and unique) such structure will be obtained by the addition of an isolated element. Note that in this second case we have also a substructure of A.\nRemark 1. It follows that checking whether a structure with an isolated element is a Q-core is of the same complexity as checking whether it is a core. Recall that the latter is known to be a co-NP-complete decision problem (the induced sub-structure that ought to be a core is given via an additional monadic predicate M), see [11]. We show that the former is also co-NP-complete (we also assume a monadic predicate as in this particular case the Q-core is an induced substructure), by showing inter-reducibility of both problem.\n(hardness) Let 〈A,M〉 be the input to the core problem (we assume that it is not trivial and that M does not contain any isolated element). If Ar(σ) has an isolated element (it can be done\nin polynomial time as r(σ) does not depend on A)) then we reduce to 〈A,M〉, and to 〈Ã, M̃〉 otherwise, where Ã consists of the disjoint union of A with an isolated element and M̃ is the union of M with this new element.\n(co-NP-complete algorithm) Let 〈Ã, M̃〉 be the input to the Q-core problem such that Ã has an isolated element. We check whether the alleged Q-core (the substructure of Ã induced by M̃) elevated to the rth power has an isolated element. If it does not we answer no. If the alleged Q-core has more than one isolated element we answer also no. Otherwise, we remove at most one isolated element from M̃ to derive M ⊆ M̃ and reduce to the core question w.r.t. 〈Ã,M〉."}, {"heading": "6 The usefulness of Q-cores", "text": "Graphs are relational structures with a single symmetric relation E. We term them partially reflexive (p.r.) to emphasise that any vertex may or may not have a self-loop. A p.r. tree may contain self-loops but no larger cycle Cn for n ≥ 3. A p.r. pseudotree contains at most one cycle Cn for n ≥ 3. A p.r. forest (resp., pseudoforest) is the disjoint union of p.r. trees (resp., p.r. pseudotrees).\nSince p.r. forests (resp., pseudoforests) are closed under substructures, we can be assured that a Q-core of a p.r. forest (resp., pseudoforest) is a p.r. forest (resp., pseudoforest). It is clear from inspection that the Q-core of p.r. forest (resp., pseudoforest, p.r. cycle) is unique up to isomorphism, but we do not prove this as it does not shed any light on the general situation. The doubting reader may substitute “a/ all” for “the” in future references to Q-cores in this section.\nThe complexity classifications of [14] were largely derived using the properties of equivalence w.r.t. {∃,∀,∧}-FO. This will be the central justification for the following propositions.\nLet K∗i and Ki be the reflexive and irreflexive i-cliques, respectively. Let [n] := {1, . . . , n}. For i ∈ [n] and α ∈ {0, 1}n, let α[i] be the ith entry of α. For α ∈ {0, 1}∗, let Pα be the path with domain [n] and edge set {(i, j) : |j − i| = 1} ∪ {(i, i) : α[i] = 1} For a tree T and vertex v ∈ T , let λT (v) be the shortest distance in T from v to a looped vertex (if T is irreflexive, then λT (v) is always infinite). Let λT be the maximum of {λT (v) : v ∈ T}. A tree is loop-connected if the self-loops induce a connected subtree. A tree T is quasi-loop-connected if either 1.) it is irreflexive, or 2.) there exists a connected reflexive subtree T0 (chosen to be maximal) such that there is a walk of length λT from every vertex of T to T0."}, {"heading": "6.1 Partially reflexive forests", "text": "It is not true that, if H is a p.r. forest, then either H admits a majority polymorphism, and QCSP(H) is in NL, or QCSP(H) is NP-hard. However, the notion of Q-core restores a clean delineation.\nProposition 5. Let H be a p.r. forest. Then either the Q-core of H admits a majority polymorphism, and QCSP(H) is in NL, or QCSP(H) is NP-hard.\nProof. We assume that graphs have at least one edge (otherwise the Q-core is K1). Irreflexive forests are a special case of bipartite graphs, which are all equivalent w.r.t. {∃,∀,∧}-FO, their Q-core being K2 when they have no isolated vertex (see example 3) and K2 +K1 otherwise.\nWe assume from now on that graphs have at least one edge and one self-loop. The one vertex case is K∗1. We assume larger graphs from now on. If the graph contains an isolated element then its Q-core is K1 +K?1. Assume from now on that the graph does not have an isolated element.\nWe deal with the disconnected case first. If the graph is reflexive, then its Q-core is K?1 + K?1. Otherwise, the graph is properly partially reflexive in the sense that it embeds both K?1 and K1. If the graph has an irreflexive component then its Q-core is K2 +K?1. If the graph has no irreflexive component, then its Q-core is K?1 +P10λ where λ is the longest walk from any vertex to a self-loop. To see this last case gives an equivalent QCSP, we may consider power surjective homomorphisms, together with the fact that the Q-core must not satisfy ∀x∃y1, . . . , yλ−1 E(x, y1)∧E(y1, y2)∧ . . .∧ E(yλ−2, yλ−1).\nWe now follow the classification of [14]. If a p.r. forest contains more than one p.r. tree, then the Q-core is among those formed from the disjoint union of exactly two (including the possibility of duplication) of K1, K∗1, P10λ , K2. Each of these singularly admits a majority polymorphism, therefore so does any of their disjoint unions.\nWe now move on to the connected case, i.e. it remains to consider p.r. trees T . If T is irreflexive, then its Q-core is K2 or K1, which admit majority polymorphisms. If T is loop-connected, then it admits a majority polymorphism [14]. If T is quasi-loop-connected, then it is QCSP-equivalent to one of its subtrees that is loop-connected [14] which will be its Q-core. In all other cases QCSP(T ) is NP-hard, and T does not admit majority [14]."}, {"heading": "6.2 Irreflexive Pseudoforests", "text": "A pseudotree is a graph that involves at most one cycle. A pseudoforest is the disjoint union of a collection of pseudotrees.\nProposition 6. Let H be an irreflexive pseudoforest. Then either the Q-core of H admits a majority polymorphism, and QCSP(H) is in NL, or QCSP(H) is NP-hard.\nProof. We follow the classification of [15]. If H is bipartite, then its Q-core is either K2, K1, K2 +K1 (see [6]) and this admits a majority polymorphism. Otherwise its Q-core contains an odd cycle, which does not admit a majority polymorphism, and QCSP(H) is NP-hard."}, {"heading": "7 Computing a Q-core", "text": "We may use Theorem 2 to provides a first algorithm (Algorithm 1). This does not appear very promising if we wish to use Q-cores as a preprocessing step. We will propose and illustrate a general and less naive method to compute Q-cores by computing U -X-core and cores first.\nAnother nice feature of cores and U -X-cores which implies their uniqueness is the following: any substructure C of A that agrees with it on {∃,∧}-FO (respectively on {∃,∀,∧,∨}-FO) will contain the core (respectively the U -X-core). Consequently, the core and the U -X-core may be computed in a greedy fashion. Assuming that the Q-core would not satisfy this nice property, why should this concern the Q-core? Well, we know that any Q-core will lie somewhere between the U -X-core and the core that are induced substructures: this is a direct consequence of the inclusion of the corresponding fragments of first-order logic and their uniqueness. Moreover, according to our current knowledge, checking for equivalence appears, at least on paper, much easier for {∃,∀,∧,∨}-FO than {∃,∀,∧}-FO: compare the number of functions from A to the power set of B (2|B| |A| = 2|B|×|A|) with the number of functions from Ar to B (|B||A|r) where r could be as large as |A||B| and can certainly be greater than r ≈ |A| (see Proposition 1). So it make sense to bound the naive search for Q-cores.\nAlgorithm 1: A naive approach to compute the Q-cores.\ninput : A structure A output : The list L of Q-cores of A initialisation: set L := {A} forall the substructure B of A do\nif there exists a surjective homomorphism from A|A||B| to B then if there exists a surjective homomorphism from B|B||A| to A then\nRemove any structure containing B in L; Add B to L;\nend\nend\nend output : List of Q-cores L\nFurthermore, we know that the U -X-core can be identified by specific surjective hypermorphisms that act as the identity on X and contain the identity on U [13] which makes the search for the U -X-core somewhat easier than its definition suggest (see Algorithm 2).\nObserve also that X must contain the core C of the U -X-core B, which is also the core of the original structure A (this is because h induces a so-called retraction of A to the substructure A|X induced by X). Thus we may compute the core greedily from X. Next, we do a little bit better than using our naive algorithm, by interleaving steps where we find a substructure that is {∃,∀,∧}-FO-equivalent, with steps where we compute its U -X-core (one can find a sequence of distinct substructures B, D and B′ such that B is a U -X-core, which is {∃,∀,∧}-FO-equivalent to D, whose U -X-core B′ is strictly smaller than B, see Example 6). Algorithm 3 describes this proposed method informally when we want to compute one Q-core (of course, we would have no guarantee that we get the smallest Q-core, unless the Q-core can be also greedily computed, which holds for all cases we have studied so far).\nIn Algorithm 3, we have purposely not detailed line ??. We could use the characterisation of {∃,∀,∧}-FO-containment via surjective homomorphism from a power of Theorem 3 as in Algorithm 1. Alternatively, we can use a refined form of (iii) in this Theorem and use the canonical sentences in Π2-form ψB,m1 and ψD,m2 , with m1 := min(|D|, |U |) and m2 := |U | (see Definition 5). The test would consists in checking that B satisfies ψD,m2 (where we may relativise to universal variables to U and existential variables to X) and D satisfies ψB,m1 . This is correct because we know that we may relativise every universal variable to U within B. Thus, it suffices to consider Π2-sentences with at most |U | universal variables. Example 6. We describe a run of Algorithm 3 on input A := A4. During the initialisation, we compute its U -X-core B := A3 and discover that U = {2, 3} and X = {1, 2}. We compute C := A1, the core of the substructure induced by X.\nNote that B = A3 is isomorphic to P110. Next the algorithm guesses a substructure D of B that contains C: e.g. it drops the self-loop around vertex 3 to obtain a structure isomorphic to P010 and checks successfully equivalence w.r.t. {∃,∀,∧}-FO (there is a surjective homomorphism from P010 to P110; and, conversely we can use the surjective homomorphism from P110 × P110 to P10 × P11 composed with that from the former to P010).\nNext the algorithm computes the U ′-X ′-core B′ of D which is A2 (witnessed by h′(1) = 1, h′(2) = h′(3) = {1, 2, 3}, U ′ := {2}, X ′ := {1}) and sets B := B′ = A2.\nAlgorithm 2: A greedy approach to compute the U -X-core.\ninput : a structure A. output : the U -X-core of A. variables : U and X two subsets of A. variable : h a surj. hypermorphism from A to A s.t. h(U) = A and h−1(X) = A. variable : B an induced substructure of A such that B = U ∪X. initialisation: set U := A, X := A, B := A, h the identity repeat\nguess a subset U ′ of U and a subset X ′ of X; let h′ be a map from B to B; forall the x′ in X ′ do set h′(x′) := {x′}; forall the u′ in U ′ \\X ′ do guess x′ in X ′ set h′(u′) := {u′, x′} ; forall the z′ in B \\ (U ′ ∪X ′) do\nguess x′ in X ′ set h(z′) := {x′}; guess u′ in U ′ set h(u′) := h(u′) ∪ {z′};\nend if h′ is a surj. hypermorphism from B to B then\nset B to be the substructure of B induced by U ′ ∪X ′; set U := U ′, X := X ′ and h := h′ ◦ h;\nend\nuntil U and X are minimal ; output : B.\nAlgorithm 3: Bounded Search for a Q-core.\ninput : a structure A output : a Q-core B of A initialisation: compute the U -X-core of A as in Algorithm 2; set B to be the U -X-core; set C to be the core C of the substructure of B induced by X; repeat\nguess D a substructure of B that contains C; check that B and C are equivalent w.r.t. {∃,∀,∧}-FO; set B to be the U -X-core of D;\nuntil B is minimal ; output : B.\nThe algorithm stops eventually and outputs A2 as it is minimal."}, {"heading": "8 Conclusion", "text": "We have introduced a notion of Q-core and demonstrated that it does not enjoy all of the properties of cores and U -X-core. In particular, there need not be a unique minimal element w.r.t. size in the equivalence class of structures agreeing on pH-sentences. However, we suspect that the notion of Q-core we give is robust, in that the Q-core of any structure B is unique up to isomorphism; and, that it sits inside any substructure of B that satisfies the same sentence of {∃,∀,∧}-FO, making it computable in a greedy fashion. Thus, the nice behaviour of Q-cores is almost restored, but “induced substructure” in the properties of core or U -X-core must be replaced by the weaker “substructure”.\nGeneralising the results about Q-cores of structures with an isolated element to disconnected structures is already difficult. Just as the pH-theory of structures with an isolated element is essentially determined by their pp-theory, so the pH-theory of disconnected structures is essentially determined by its ∀∃∗ fragment (see [15])."}], "references": [{"title": "The CSP dichotomy holds for digraphs with no sources and no sinks (a positive answer to a conjecture of Bang-Jensen and Hell)", "author": ["L. Barto", "M. Kozik", "T. Niven"], "venue": "SIAM Journal on Computing 38,", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 2009}, {"title": "The complexity of constraint satisfaction games and QCSP", "author": ["F. Börner", "A.A. Bulatov", "H. Chen", "P. Jeavons", "A.A. Krokhin"], "venue": "Inf. Comput. 207,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2009}, {"title": "A dichotomy theorem for constraint satisfaction problems on a 3-element set", "author": ["A. Bulatov"], "venue": "J. ACM 53,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 2006}, {"title": "Classifying the complexity of constraints using finite algebras", "author": ["A. Bulatov", "A. Krokhin", "P.G. Jeavons"], "venue": "SIAM Journal on Computing", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 2005}, {"title": "Optimal implementation of conjunctive queries in relational data bases", "author": ["A.K. Chandra", "P.M. Merlin"], "venue": "In Proceddings of STOC’77", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 1977}, {"title": "Quantified constraints and containment problems", "author": ["H. Chen", "F. Madelaine", "B. Martin"], "venue": "In 23rd Annual IEEE Symposium on Logic in Computer Science", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2008}, {"title": "The complexity of constraint languages", "author": ["D. Cohen", "P. Jeavons"], "venue": "Appears in: Handbook of Constraint Programming", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2006}, {"title": "Data exchange: getting to the core", "author": ["R. Fagin", "P.G. Kolaitis", "L. Popa"], "venue": "ACM Trans. Database Syst. 30,", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 2005}, {"title": "The computational structure of monotone monadic SNP and constraint satisfaction: A study through Datalog and group theory", "author": ["T. Feder", "M. Vardi"], "venue": "SIAM Journal on Computing", "citeRegEx": "9", "shortCiteRegEx": "9", "year": 1999}, {"title": "The core of a graph", "author": ["P. Hell", "J. Nesetril"], "venue": "Discrete Math", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 1992}, {"title": "On the complexity of H-coloring", "author": ["P. Hell", "J. Nešetřil"], "venue": "Journal of Combinatorial Theory, Series B", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 1990}, {"title": "Graphs and Homomorphisms", "author": ["P. Hell", "J. Nešetřil"], "venue": null, "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2004}, {"title": "A tetrachotomy for positive first-order logic without equality", "author": ["F.R. Madelaine", "B. Martin"], "venue": "LICS", "citeRegEx": "13", "shortCiteRegEx": "13", "year": 2011}, {"title": "QCSP on partially reflexive forests", "author": ["B. Martin"], "venue": "In Principles and Practice of Constraint Programming - 17th International Conference,", "citeRegEx": "14", "shortCiteRegEx": "14", "year": 2011}, {"title": "Towards a trichotomy for quantified H-coloring", "author": ["B. Martin", "F. Madelaine"], "venue": "In 2nd Conf. on Computatibility in Europe,", "citeRegEx": "15", "shortCiteRegEx": "15", "year": 2006}, {"title": "The complexity of satisfiability problems", "author": ["T.J. Schaefer"], "venue": "In Proceedings of STOC’78", "citeRegEx": "16", "shortCiteRegEx": "16", "year": 1978}], "referenceMentions": [{"referenceID": 8, "context": "Much of the theoretical research into CSPs is in respect of a large complexity classification project – it is conjectured that CSP(B) is always either in P or NP-complete [9].", "startOffset": 171, "endOffset": 174}, {"referenceID": 15, "context": "structures of size ≤ 3 [16, 3] and smooth digraphs [11, 1]).", "startOffset": 23, "endOffset": 30}, {"referenceID": 2, "context": "structures of size ≤ 3 [16, 3] and smooth digraphs [11, 1]).", "startOffset": 23, "endOffset": 30}, {"referenceID": 10, "context": "structures of size ≤ 3 [16, 3] and smooth digraphs [11, 1]).", "startOffset": 51, "endOffset": 58}, {"referenceID": 0, "context": "structures of size ≤ 3 [16, 3] and smooth digraphs [11, 1]).", "startOffset": 51, "endOffset": 58}, {"referenceID": 3, "context": "A conjectured delineation for the dichotomy was given in the algebraic language in [4].", "startOffset": 83, "endOffset": 86}, {"referenceID": 1, "context": "No overarching polychotomy has been conjectured for the complexities of QCSP(B), as B ranges over finite structures, but the only known complexities are P, NP-complete and Pspace-complete (see [2, 15] for some trichotomies).", "startOffset": 193, "endOffset": 200}, {"referenceID": 14, "context": "No overarching polychotomy has been conjectured for the complexities of QCSP(B), as B ranges over finite structures, but the only known complexities are P, NP-complete and Pspace-complete (see [2, 15] for some trichotomies).", "startOffset": 193, "endOffset": 200}, {"referenceID": 5, "context": "It is known that non-trivial A and B are equivalent iff there exist integers r and r′ and surjective homomorphisms from A to B and from Br to A (and one may give a bound on these exponents) [6].", "startOffset": 190, "endOffset": 193}, {"referenceID": 12, "context": "The erratic behaviour of Q-cores sits in contrast not just to that of cores, but also that of the UX-cores of [13], which are the canonical representatives of the equivalence classes associated with {∃,∀,∧,∨}-FO, and were instrumental in deriving a full complexity classification – a tetrachotomy – for QCSP∨ in [13].", "startOffset": 110, "endOffset": 114}, {"referenceID": 12, "context": "The erratic behaviour of Q-cores sits in contrast not just to that of cores, but also that of the UX-cores of [13], which are the canonical representatives of the equivalence classes associated with {∃,∀,∧,∨}-FO, and were instrumental in deriving a full complexity classification – a tetrachotomy – for QCSP∨ in [13].", "startOffset": 312, "endOffset": 316}, {"referenceID": 12, "context": "In Section 3, we recall results on coreness and spell out containment for {∃,∀,∧,∨}-FO that were only implicit in [13].", "startOffset": 114, "endOffset": 118}, {"referenceID": 5, "context": "In Section 4, we move on to QCSP and recall results on the decidability of containment from [6] together with new lower bounds before initiating a study of the notion of core for QCSP.", "startOffset": 92, "endOffset": 95}, {"referenceID": 4, "context": "Containment for {∃,∧}-FO is a special case of conjunctive query containment from databases [5].", "startOffset": 91, "endOffset": 94}, {"referenceID": 11, "context": "It is well known that the core is unique up to isomorphism and that it is an induced substructure [12].", "startOffset": 98, "endOffset": 102}, {"referenceID": 6, "context": "1 in [7]).", "startOffset": 5, "endOffset": 8}, {"referenceID": 7, "context": "The notion of a core can be extended and adapted suitably to solve important questions related to data exchange and query rewriting in databases [8].", "startOffset": 145, "endOffset": 148}, {"referenceID": 3, "context": "It is also very useful as a simplifying assumption when classifying the complexity: with the algebraic approach, it allows to study only idempotent algebras [4].", "startOffset": 157, "endOffset": 160}, {"referenceID": 9, "context": "Checking that a graph is a core is coNP-complete [10].", "startOffset": 49, "endOffset": 53}, {"referenceID": 7, "context": "Checking that a graph is the core of another given graph is DP-complete [8].", "startOffset": 72, "endOffset": 75}, {"referenceID": 12, "context": "Consequently, B is called the U -X-core of A (for further details see [13]) and may be defined as follows.", "startOffset": 70, "endOffset": 74}, {"referenceID": 0, "context": "t∈Am w1 = vt,t[1] .", "startOffset": 14, "endOffset": 17}, {"referenceID": 0, "context": "we remove w1 = vt,t[1] and replace every occurrence of vt,t[1] by w1.", "startOffset": 19, "endOffset": 22}, {"referenceID": 0, "context": "we remove w1 = vt,t[1] and replace every occurrence of vt,t[1] by w1.", "startOffset": 59, "endOffset": 62}, {"referenceID": 10, "context": "Recall that the latter is known to be a co-NP-complete decision problem (the induced sub-structure that ought to be a core is given via an additional monadic predicate M), see [11].", "startOffset": 176, "endOffset": 180}, {"referenceID": 13, "context": "The complexity classifications of [14] were largely derived using the properties of equivalence w.", "startOffset": 34, "endOffset": 38}, {"referenceID": 13, "context": "We now follow the classification of [14].", "startOffset": 36, "endOffset": 40}, {"referenceID": 13, "context": "If T is loop-connected, then it admits a majority polymorphism [14].", "startOffset": 63, "endOffset": 67}, {"referenceID": 13, "context": "If T is quasi-loop-connected, then it is QCSP-equivalent to one of its subtrees that is loop-connected [14] which will be its Q-core.", "startOffset": 103, "endOffset": 107}, {"referenceID": 13, "context": "In all other cases QCSP(T ) is NP-hard, and T does not admit majority [14].", "startOffset": 70, "endOffset": 74}, {"referenceID": 14, "context": "We follow the classification of [15].", "startOffset": 32, "endOffset": 36}, {"referenceID": 5, "context": "If H is bipartite, then its Q-core is either K2, K1, K2 +K1 (see [6]) and this admits a majority polymorphism.", "startOffset": 65, "endOffset": 68}, {"referenceID": 12, "context": "Furthermore, we know that the U -X-core can be identified by specific surjective hypermorphisms that act as the identity on X and contain the identity on U [13] which makes the search for the U -X-core somewhat easier than its definition suggest (see Algorithm 2).", "startOffset": 156, "endOffset": 160}, {"referenceID": 14, "context": "Just as the pH-theory of structures with an isolated element is essentially determined by their pp-theory, so the pH-theory of disconnected structures is essentially determined by its ∀∃∗ fragment (see [15]).", "startOffset": 202, "endOffset": 206}], "year": 2012, "abstractText": "The constraint satisfaction problem (CSP) and its quantified extensions, whether without (QCSP) or with disjunction (QCSP∨), correspond naturally to the model checking problem for three increasingly stronger fragments of positive first-order logic. Their complexity is often studied when parameterised by a fixed model, the so-called template. It is a natural question to ask when two templates are equivalent, or more generally when one “contain” another, in the sense that a satisfied instance of the first will be necessarily satisfied in the second. One can also ask for a smallest possible equivalent template: this is known as the core for CSP. We recall and extend previous results on containment, equivalence and “coreness” for QCSP∨ before initiating a preliminary study of cores for QCSP which we characterise for certain structures and which turns out to be more elusive.", "creator": "LaTeX with hyperref package"}}}