{"id": "1206.6856", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Jun-2012", "title": "Reasoning about Uncertainty in Metric Spaces", "abstract": "adjoined We set up a vignesh model .182 for 497.2 reasoning about paolillo metric spaces telecomasia with underestimates belief vijaynagar theoretic measures. The uncertainty in blackjacks these shikai spaces bas-rhin stems destler from cityscape both probability ventura and metric. meik To helliniko represent mint.com both aspect of rhodin uncertainty, shpetim we choose melançon an ballmer expected fatehpur distance 5.47 function padawan as four-bay a tardes measure drøbak of krla uncertainty. A haplotype formal isel logical system nbcolympics.com is under-11 constructed for tambi the reasoning about 6,620 expected distance. 611 Soundness 110.12 and completeness robida are shown for this beforu logic. hyperreal For reasoning on blakstad product metric ordaz space formula with uncertainty, a new metric is defined and shown syllogisms to usair have good properties.", "histories": [["v1", "Wed, 27 Jun 2012 16:26:12 GMT  (157kb)", "http://arxiv.org/abs/1206.6856v1", "Appears in Proceedings of the Twenty-Second Conference on Uncertainty in Artificial Intelligence (UAI2006)"]], "COMMENTS": "Appears in Proceedings of the Twenty-Second Conference on Uncertainty in Artificial Intelligence (UAI2006)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["seunghwan lee"], "accepted": false, "id": "1206.6856"}, "pdf": {"name": "1206.6856.pdf", "metadata": {"source": "CRF", "title": "Reasoning about Uncertainty in Metric Spaces", "authors": ["Seunghwan Han Lee"], "emails": ["seunlee@cs.indiana.edu"], "sections": [{"heading": null, "text": "We set up a model for reasoning about metric spaces with belief theoretic measures. The uncertainty in these spaces stems from both probability and metric structures. To represent both aspect of uncertainty, we choose an expected distance function as a measure of uncertainty. A formal logical system is constructed for the reasoning about expected distance. Soundness and completeness are shown for this logic. For reasoning on product metric spaces with uncertainty, a new metric is defined and shown to have good properties."}, {"heading": "1 Introduction", "text": "For formal representation of uncertainty with probabilistic or belief theoretic measures, there exists a wide spectrum of models with complete logical systems (eg. see Halpern 2003, Nilsson 1986, Bacchus 1990, Gerla 1994). There also exists a wide variety of formal systems on spatial reasoning (eg. see Gabelaia et al. 2005, Asher & Vieu 1995, Lemon & Pratt 1998) and especially on reasoning about metric spaces (eg. see Kutz et al. 2003, Wolter & Zakharyaschev 2005). But it is hard to find a formal system when probabilistic uncertainty is present on metric spaces.\nIn probabilistic or statistical analysis, it is usually assumed that values of random variables are real numbers. Since most of statistical inference is related to reasoning about expectation and variance, restricting the range of random variables to the spaces where those values are well defined is considered as an acceptable sacrifice. A formal reasoning system on expectations with respect to probability measures and other belief theoretic measures can be found in (Halpern & Pucella 2002).\nEven though expectations of an event cannot be defined on arbitrary metric spaces, the expectation of distances with respect to a fixed set is well defined in any metric space. For example, an expectation of a random location on a sphere cannot be defined, but an expected distance of a random location from the south hemisphere is a well defined notion. The expected distance is often interpreted as a loss function in statistical decision theory (Berger 1985).\nLoss(a) = EP (d(X, a)).\nIn this case, the distance function d(x, a) with respected to a fixed point a is used to calculate the cost for predicting x when a is a true state. A complimentary concept of a cost function in decision theory is a utility function. The expected utility function has been an important topic in economics for a long time (Von Neumann & Morgenstern 1944; Savage 1954; Schmeidler 1989). We can also find more generalized expected utility functions defined for plausibility measures and generalized utility functions. (Chu & Halpern 2003; 2004).\nThe objective of a decision problem is to find an action that minimizes a loss function. For example, if we have a uniform prior probability distribution on [0, 1] where d(x, y) = |x− y|, the loss minimizing prediction would be X = 0.5. But in inference problems, the objective is to derive more information from given information. As an example, for the previous distance function, if we know that EP (d(X, 0)) = 1, then we can deduce that EP (d(X, 1)) = 0. For inference problems, a viewpoint from fuzzy logic is also meaningful. Let’s assume that a fuzzy set Da represents a fuzzy concept “dissimilar from a” for a point a in a 1-bounded metric space Ω. A natural candidate for a membership function of Da would be d(x, a). Given a probability distribution P , Zadeh (1968) introduces the probability of a fuzzy concept.\nP (Da) = ∫\nΩ\nµDadP = EP (d(X, a)).\nWe can interpret this as an expected dissimilarity of a from Ω − {a}. Even though probability of fuzzy events is one possible representation of uncertainty in metric spaces, no formal reasoning system was provided yet. There has been various attempts to generalize Shannon’s entropy to the metric spaces using expected similarity and expected distance (Yager 1992; Lee 2006).\nIn this paper, we will generate a formal axiomatic reasoning system using expected distance measures and prove soundness and completeness of the system. Since the expected distance function turns out to be a doubt function, we can also define various dual measures. For reasoning on product spaces, we will introduce a new product metric and define mutual independence with respect to expected distance."}, {"heading": "2 Expected distance", "text": "A probability space is a tuple (Ω,F , P ) where Ω is a set, F is a σ-algebra of subsets of Ω and P : F → [0, 1] is a function satisfying the properties of probability\n• Prob1. P (A) ≥ 0 for any A ∈ F . • Prob2. P (Ω) = 1. • Prob3. P (⋂∞i=1 Ai) = ∑∞ i=1 P (Ai)\nif Ai ⊂ F are disjoint.\nTo exclude problems with measurability, we will further assume that F = PΩ. In most of applications Ω is a finite set and P is defined at every point.\nA 1-bounded pseudo metric space is a tuple (Ω, d) where Ω is a set and d is a function on Ω × Ω that satisfies\n• PMet1. d(x, x) = 0 (reflexive) • PMet2. d(x, y) = d(y, x) (symmetry) • PMet3. d(x, y) + d(y, z) ≥ d(x, z) (triangular in-\nequality)\n• PMet4. d(x, y) ≤ 1 (1-bounded)\nfor all x, y, z ∈ Ω. To become a metric space, d should satisfy an extra condition\nIf d(x, y) = 0 then x = y.\nIn practice, this condition is too strong for a reasoning system. Allowing a zero distance between two instances is a common approach in spatial reasoning.\nWe further assume that the metric in our system is bounded by 1 because of following reasons. First,\nin most applications distance functions are practically bounded. Even if it is not bounded, there are conventional methods that normalize a metric space (Ω, d) into a 1 bounded metric space such as (Ω, d1+d ). Especially if d is bounded by M , (Ω, dM ) is a straightforward conversion. Second, if metrics are not bounded by a certain number, it is hard to compare distances from multiple metrics. To get a normalized degree of uncertainty, a bound is a necessity. Third, 1 bounded metrics works well with probability or belief functions that are also 1 bounded. As an example, since Pr(A) is bounded by 1, for independent events A,B, we have Pr(A and B) ≤ Pr(A). Similar reasoning for expected distances when the distance functions are bounded.\nDefinition 1. Let’s assume that (Ω,F , P, d) is a metric probability space with a probability measure P on a σ-algebra F = PΩ and a 1 bounded pseudometric d. For a given subset U ⊂ Ω, the expected distance of U is defined as\nedP,d(U) = ∫\nΩ\nd(x,U)dP\n= ∫\nU\nd(x,U)dP\nwhere the distance between a point and a set is conventionally defined as\nd(x,U) = min y∈U d(x, y).\nSince d(x, ∅) = 1 and d(x, Ω) = 0 we have\nedP,d(∅) = 1 , edP,d(Ω) = 0 .\nEven though an expected distance of a set U is defined using P , when we perform an inference on edP,d(U) we do not assume any knowledge of P . Therefore, we can safely omit P from the notation in inference problems under unknown probability distribution P . We will also omit d if there is no confusion for a base metric. Since we assumed that F = PΩ, d(x,U) is always a measurable function.\nWe can also define expected distance functions with respect to any kind of belief theoretic measures (Shafer 1976). The only difference is that the probability measure P is changed into one of belief theoretic functions. A belief function Bel is a function that satisfies\n• B1. Bel(A) ≥ 0 for any A ∈ F . • B2. Bel(Ω) = 1. • B3. Bel(⋃ni=1 Ai) ≥∑n\nr=1 (−1)r+1 ∑ {I′⊂{1,··· ,n}||I′|=r} Bel( ⋂ i∈I′ Ai).\nA doubt function and a plausibility function are defined from Bel.\nDoubt(A) = Bel(Ac)\nPl(A) = 1−Bel(Ac).\nBut they can be also defined as set functions on Ω that satisfy the following properties.\nDoubt(∅) = 1, Doubt(Ω) = 0\nDoubt( n⋂\ni=1\nAi)\n≥ n∑\nr=1\n(−1)r+1 ∑\n{I⊂{1,2,··· ,n}||I|=r} Doubt(\n⋃ i∈I Ai)\nPlaus(∅) = 0, P laus(Ω) = 1\nPlaus( n⋂\ni=1\nAi)\n≤ n∑\nr=1\n(−1)r+1 ∑\n{I⊂{1,2,··· ,n}||I|=r} Plaus(\n⋃ i∈I Ai)"}, {"heading": "3 Inclusion-exclusion principle", "text": "The inclusion-exclusion principle about set union and intersection is one of the most important properties in combinatorics, and has applications in diverse areas. Especially belief theoretic functions of DempsterShafer theory are defined by modifying the equality of the inclusion exclusion principle (Shafer 1976). We will propose a theorem on minimum and maximum that is similar to the inclusion-exclusion principle.\nTheorem 1 (Alternating min-max). Let (G,≤, ∗) be a commutative group with a linear order ≤ and a group operation ∗. For d1, · · · , dn ∈ G we have\nmax(d1, · · · , dn) = n∑\nr=1\n[ ∑\n{I⊂{1,··· ,n}||I|=r} min i∈I di\n](−1)r+1\nmin(d1, · · · , dn) = n∑\nr=1\n[ ∑\n{I⊂{1,··· ,n}||I|=r} max i∈I di\n](−1)r+1\nwhere −1 represents the inverse in the group and the summation is for the group operation.\nThe proofs can be found in (Lee 2006). Let’s consider a special case when G = R and ∗ = + to get the following theorem.\nTheorem 2. Let (Ω, d) be a metric space. For a finite class {Ai}ni=1 of subsets of Ω we have\nd(x, n⋂\ni=1\nAi) ≥ n∑\nr=1\n(−1)r+1 ∑\n{I⊂{1,··· ,n}||I|=r} d(x,\n⋃ i∈I Ai)\nProof. From the definition of set distance, we have\nd(x, ⋂\ni∈I Ai) ≥ max i∈I d(x,Ai),\nd(x, ⋃\ni∈I Ai) = min i∈I d(x, Ai).\nThe theorem follows from theorem 1.\nWe have the following general fact of expectations for any belief theoretic measures since finite sums can be interchangeable with integrals.\nTheorem 3. Let (Ω, P ), be a space with a belief theoretic measure P . If measurable functions f , fi, i ∈ I satisfy an (in)equality\nf 4 ∑\ni∈I aifi\nwhere 4 is an (in)equality and ai, i ∈ I are constants, then\nEP (f) 4 ∑\ni∈I aiEP (fi).\nWe have the following property of the expected distance function as a special case of previous two theorems.\nTheorem 4. Let P be a belief theoretic function. Given Ai ⊂ (Ω, P, d), 1 ≤ i ≤ n, we have\nedP,d( n⋂\ni=1\nAi)\n≥ n∑\nr=1\n(−1)r+1 ∑\n{I⊂{1,2,··· ,n}||I|=r} edP,d(\n⋃ i∈I Ai)\nThis theorem shows that expected distance functions become doubt functions. An important property of belief theoretic functions is the Möbius inversion (Shafer 1976). A mass function m is defined to be a set function on Ω that satisfies\n1. m(∅) = 0 2. ∑ U⊂Ω m(U) = 1.\nIt is known that the following inversion theorem holds for any doubt function.\nTheorem 5. If ed is an expected distance function, there is a mass function m such that\ned(A) = ∑\nU⊂Ac m(U)\nm(A) = ∑\nU⊂A (−1)|A|−|U |ed(U)\nAt this point we note that our inequalities are fundamentally different from those in Halpern and Pucella’s paper (2002) that can be stated as\nEBel( n∨\ni=1\nXi)\n≥ n∑\nr=1\n(−1)r+1 ∑\n{I⊂{1,2,··· ,n}||I|=r} EBel(\n∧ i∈I Xi)\nwhere Xi’s are gambles (random variables). Our inequality is derived from the inequality of distance functions. It does not change the direction regardless of base measures. The above inequality came from the belief theoretic measure upon which the expectation is defined. Therefore, different inequalities hold for different base measures. For example, the above inequality becomes an equality when the base measure is a probability measure."}, {"heading": "4 Dual measures of the expected distance function", "text": "Since expected distance function is a doubt function, we can also consider dual functions of an expected distance function.\nDefinition 2. The expected similarity, expected absoluteness, and expected relativeness are defined as\nes(A) = 1− ed(A) ea(A) = ed(Ac) er(A) = 1− ed(AC)\nBecause ed(A) + ed(Ac) ≤ 1 we have ed(A) ≤ er(A) ea(A) ≤ es(A)\nThe equality holds when the distance function is crisp (values are 0 or 1) or when the probability measure is crisp. Let’s see ea in its integration form.\nea(A) = ∫\nA\nd(x,Ac)dP\nThis measures the expected distance between A and Ac. The bigger ea is, the more A becomes an absolute\nchoice. Therefore the bigger er is, the less A becomes an absolute choice. We can compare the meaning of ed and er in the following example.\nExample 1. Let’s assume that a search team for a lost child needs to pick up one of two places A, B as a starting point. If d(A,B) is small, it is not meaningful to spend time to optimize the starting point since the other point will be reached soon. This can be represented with expected distance and expected relativeness. Let d(A,B) = 0.2, and the real probability of the lost child being in A and B be P(A) = 0.1 and P(B) = 0.9. Then, ed({A}) = 0.2 · 0.9 = 0.18 . Because the cost of wrong prediction is low, even a relatively improbable place “A” has low expected distance. But the expected relativeness is big because the alternative “B” also has low expected distance.\ner({A}) = 1− ed({A}c) = 1− 0.2 · 0.1 = 0.98 .\nThis represents that even though predicting “A” has little risk, it need not be the best choice since predicting {A}c = {B} also has little risk.\nAs in belief theory we can consider a tuple\n[ed(A), er(A)]\nto represent the uncertainty of a probabilistic event A in metric space. The interval becomes smaller when the distance function is crisp with respect to A,Ac. It means that the set A becomes a more distinctive category with respect to the distance. If the interval is very small, an expected distance behaves like a probability measure. ed(A) + ed(Ac) ≈ 1 . Since ed(A) ≤ P (Ac), actual values can be derived from probabilities.\ned(A) ≈ P (Ac)."}, {"heading": "5 Inference on product of metric spaces", "text": "When we deal with inference problems with a large number of variables, it is almost impossible to maintain the data set without factoring the whole space into product spaces. To reduce the dimension of product spaces, statistical analysis often assumes that variables are independent. Events A1, · · · , An are mutually independent relative to probability if and only if\nPr( ⋂\ni∈I Ai) =\n∏ i∈I Pr(Ai)\nfor any I ⊂ {1, · · · , n}. A set of σ-fields F1, · · · ,Fn are said to be mutually independent when for any given Ai ∈ Fi, A1, · · · , An are mutually independent. We can extend this condition to expected distance functions.\nDefinition 3. Events A1, · · · , An are mutually independent relative to expected distance if and only if\n1− ed( ⋂\ni∈I Ai) =\n∏ i∈I (1− ed(Ai))\nfor any I ⊂ {1, · · · , n}.\nIn probability theory, the product measure space and the product probability are defined as\nn∏\ni=1\nFi = σ-field generated by\n{ n∏\ni=1\nAi|Ai ∈ Fi} ,\n(P1 × P2)(E) = ∫\nX\nP2(Ex) dP1(x)\n= ∫\nY\nP1(Ey) dP2(y) .\nwhere Ex = {y : (x, y) ∈ E} and Ey = {x : (x, y) ∈ E}. This product probability makes Ex, Ey independent events. We will construct a product expected distance function so that it also preserves the mutual independence. For that purpose we need a special product metric.\nDefinition 4. If {(Ωi, di)}1≤i≤n are 1 bounded metric spaces, a metric Λn ~d on ∏n i=1 Ωi is defined as\nΛn ~d(~x, ~y)\n= n∑\nr=1\n(−1)r+1 ∏\n{I⊂{1,2,··· ,n}||I|=r},i∈I di(xi, yi)\n= 1− n∏\ni=1\n(1− di(xi, yi))\nwhere ~xn = (x1, · · · , xn). Theorem 6. If {(Ωi, di)}1≤i≤n are 1 bounded metric spaces, then ( ∏n i=1 Ωi, Λ\nn ~d) becomes a 1 bounded metric space.\nBecause of restricted space, refer to (Lee 2006) for omitted proofs. Most of known metrics on product spaces such as Euclidean metric, product metric, supremum metric, etc. are not appropriate for reasoning. The Euclidean metric does not even become a 1- bounded metric on a product space. Other metrics are dependent on the order of spaces or not constructed\nrecursively. Λn ~d satisfies all such requirements. Furthermore, it is a unique distance function that satisfies following conditions. Theorem 7. Λn ~d is unique under the following conditions.\n1. Λn+1(d1, · · · , dn, dn+1) = Λ2(Λn(d1, · · · , dn), dn+1)\n2. Λn(d1, · · · , 1, · · · , dn) = 1 3. Λn(0, · · · , 0) = 0 4. Λn(d1, · · · , di, · · · , dj , · · · dn)\n= Λn(d1, · · · , dj , · · · , di, · · · , dn) 5. ∂Λ n\n∂di (d1, · · · , dn) = f(d1, · · · , d̂i · · · , dn)\nThe following theorem shows that if more different aspects are known, the distance between two concepts becomes bigger. Theorem 8. Given (Ω, di), 1 ≤ i ≤ n + 1,\nΛn(d1, · · · dn) ≤ Λn+1(d1, · · · , dn, dn+1)\nA partial order < on [0, 1]n can be defined as ~x < ~y if and only if xi < yi for some i, and not xi > yi for any 0 ≤ i ≤ n. Λn ~d preserves this order in the following sense. Theorem 9. If ~x < ~y < ~z, then Λn ~d(~x, ~y) < Λn ~d(~x, ~z).\nMetrics such as sup(d1, · · · , dn) does not preserve this order. Now we will prove the mutual independence under Λn ~d. Lemma 10. For Ai ⊂ (Ωi, di) we have\n1− Λn ~d(~x, n∏\ni=1\nAi) = n∏\ni=1\n(1− di(xi, Ai)).\nThe following theorem for mutual independence follows from this lemma. Theorem 11. Let Ai ⊂ (Ωi,Fi, Pi, di) for each i. If F1, · · · ,Fn are mutually independent, then on ( ∏n i=1 Ωi, ∏n\ni=1 Fi, P, Λn ~d) 1− edP,Λn ~d( ∏\ni∈I Ai) =\n∏ i∈I (1− edPi,di(Ai))\nGiven Ai ⊂ Ωi, it is a common convention to denote Ai ⊂ ∏n i=1 Ωi for Ω1×· · ·×Ωi−1×Ai×Ωi+1×· · ·×Ωn. Lemma 12. If Ai, Bi ⊂ (Ωi, di) for i = 1, · · · , n then Λn ~d(A1 × · · · × Ωi × · · · ×An,\nB1 × · · · ×Bi × · · · ×Bn) = Λn−1~d(A1 × · · · × Âi × · · · ×An,\nB1 × · · · × B̂i × · · · ×Bn).\nBecause of this lemma, for Ai, Bi ⊂ (Ωi, di) we have\ndi(Ai, Bi) = Λn ~d(Ai, Bi).\nTheorem 13. Let (Ωi,Fi, Pi, di) be the probability space with metric. If Ai ⊂ Ωi then\nedP,Λn ~d(Ω1 × · · · ×Ai × · · · × Ωn) = edPi,di(Ai) ."}, {"heading": "6 Axiomatizing expected distance", "text": ""}, {"heading": "6.1 Syntax and semantics", "text": "The syntax of a logic of expected distance LED is defined as follows.\nDefinition 5. Let Π = {P1, P2, · · · } be a set of primitive propositions. The set of propositional formulas is the closure of Π under the Boolean operations ∧,¬ as in the propositional logic. An expected distance term is an expression of the form a1ED(ϕ1) + · · · + anED(ϕn), where ϕi is a propositional formula and ai’s are real numbers. A basic expected distance formula is a statement of the form t ≥ α where t is a expected distance term and α is a real number. An expected distance formula or just a formula of the language LE is a Boolean combination of basic expected distance formulas.\nAs an example, (2ED(P ∧Q) + 0.23ED(¬Q) ≥ 0.2) ∨ (ED(¬P ) < 0.1) is a formula. We will use abbreviations such as t < α for ¬(t ≥ α), t ≤ α for (−1)t ≥ −α, t = α for (t ≤ α) ∧ (t ≥ α). The semantics of LED is defined on a probability structure with a metric, which is a tuple M = (Ω,F , P, d, π). (Ω,F , P ) is a probability space where all subsets of Ω are measurable. π : Π → {0, 1} is a truth assignment function of atomic propositions. d is a metric on Ω. We first define the interpretation of a propositional formula φ.\nϕM = {ω ∈ Ω|π(ω)(ϕ) = 1}. For a given model M ,\nM |= a1ED(ϕ1) + · · ·+ anED(ϕn) ≥ α iff a1ed(ϕM1 ) + · · ·+ aned(ϕMn ) ≥ α\nWe extend |= to arbitrary formulas as"}, {"heading": "M |= f1 ∧ f2 iff M |= f1 and M |= f2", "text": "M |= ¬f iff M 6|= f\nNote that even though we defined a semantics for probability structures, since an expected distance can be taken with respect to any other belief theoretic measures, we can make logics for those structures just by changing the probability structure into those.\n6.2 Axioms of LED\nNow we will construct a sound and complete axioms for our logic. First, we use the axioms AxioL that is defined in (Fagin, Halpern, & Megiddo 1990), (Fagin & Halpern 1994), and shown to be sound and complete.\nI. AxiomP : Axioms for propositional logic. II. AxiomL : Axioms for linear inequalities including AxiomP .\nThe following axioms characterize the logic of expected distances.\nIII. AxiomED: Axioms for expected distance including AxiomL.\n1. (true) ED(true) = 0.\n2. (false) ED(false) = 1.\n3. (nonnegative) ED(ϕ) ≥ 0.\n4. (inclusion-exclusion) ED( ∧n\ni=1 ϕi) ≥ ∑nr=1(−1)r+1 ∑ {I⊂{1,2,··· ,n}||I|=r}ED( ∨ i∈I ϕi).\n5. (substitution) ϕ ⇔ ψ in propositional logic, then ED(ϕ) = ED(ψ).\nThe inclusion exclusion axiom is the generalization of the simple case\nED(ϕ ∧ ψ) ≥ ED(ϕ) + ED(ψ)− ED(ϕ ∨ ψ) .\nEven though these axioms are for probability measures, the axioms for other belief theoretic measures would be the same. We can prove the following properties of expected distance from AxiomED.\nTheorem 14. 1. ED(¬ϕ) ≤ 1− ED(ϕ).\n2. ED(ϕ) ≥ ED(ϕ ∧ ψ) + ED(ϕ ∧ ¬ψ)− 1.\n3. If ϕ ⇒ ψ then ED(ϕ) ≤ ED(ψ)."}, {"heading": "6.3 Soundness and Completeness", "text": "Now we will prove the soundness and completeness theorems for the logic of expected distance. Even though an expected distance function is a doubt function, the axioms for doubt function need not be complete for the system of expected distance. For example, a probability measure is a plausibility measure, but the axiom set of plausibility measure is not complete for probabilistic systems.\nTheorem 15. AxiomED is sound and weakly complete.\nProof. As for soundness, all axioms except for inclusion-exclusion axiom can be easily proved to be sound. The inclusion-exclusion axiom comes from theorem 4.\nTo prove the weak completeness we will build a model for any given consistent formula f ∈ LED. Once we have the model existence, the completeness is proved as following. Let’s assume that Γ |= ϕ for a finite Γ. If Γ 6` φ then ∧ Γ ∨ ¬φ is consistent. By model existence we have a model M such that M |= ∧ Γ ∨ ¬ϕ. Therefore Γ 6|= ϕ. This contradiction solves the completeness.\nLet’s represent f in a disjunctive normal form g1∨· · ·∨ gn where each gi is a conjunction of basic expected distance formulas and their negations. If f is consistent, then some gi is consistent. Moreover, any model that satisfies gi also satisfies f . Therefore we only need to make a model for the formula gi.\nLet {P1, · · · , Pk} be the set of all primitive propositions that appears in gi. Let {ϕ1, · · · , ϕ2k} be the set of all possible formulas where ϕi = ±P1 ∧ · · · ∧ ±Pk. (±Pj represents Pj or ¬Pj). Let n = 2k. For any propositional formula ψ that appear in gi, we have a set I ⊂ {1, · · · , n} such that\n|= ψ ⇔ ∨\ni∈I ϕi .\nLet g′i be the formula made from gi by substituting all occurrences of propositional formula ψ with equivalent∨\ni∈I ϕi’s. Because of the soundness of the axioms, it is enough to construct a model for the formula g′i.\nNow consider the formula h that is the conjunction of g′i with the following formulas that represents the axioms. The idea is to add enough restrictions so that any solution of the linear equation satisfy conditions of expected distance.\nWe first conjunct a formula for true. Since true ≡∨n i=1 ϕi,\nED( n∨\ni=1\nϕi) = 0 .\nSecond, we conjunct a formula for the empty set. Since false ≡ ∨∅ ϕi,\nED( ∨\n∅ ϕi) = 1 .\nThird, we conjunct 2n formulas that represent the nonnegative conditions for all I ⊂ {1, · · · , n}.\nED( ∨\ni∈I ϕi) ≥ 0 .\nFinally, we conjunct formulas that represent the inclusion-exclusion conditions. For all K ⊂ P{0, · · · , n},\nED([ ∨\ni∈⋂ K ϕi])\n≥ |K|∑ r=1 (−1)r+1 ∑ {K′⊂K||K′|=r} ED( ∨ i∈⋃ K′ ϕi) .\nSince g′i is consistent in AxiomED, h is also consistent in AxiomED. Therefore it should be consistent in AxiomL. In AxiomL, the expected distance terms ED( ∨ i∈I ϕi)’s are considered as variables. Since we know the completeness of the AxiomL, h should have a model. A formula in the logic of linear inequalities is a system of linear inequalities. A model of a formula has an interpretation map that assigns a solution for the linear inequality system of the given formula. Therefore, the model of h assigns a number eI for each variable ED( ∨ i∈I ϕi)}. So that if the eI ’s are substituted into the variables, the linear inequality system is satisfied. So we have\ne∅ = 1, e{1,··· ,n} = 0,\neI ≥ 0,\ne⋂ K ≥ |K|∑ r=1 (−1)r+1 ∑ {K′⊂K||K′|=r} e⋃ K′ .\nFrom Lemma 16 there is a model M = (Ω,F , P, d, π) such that\nedP,d([ ∨\ni∈I ϕi]M ) = edP,d(\n⋃ i∈I ϕMi ) = eI .\nTherefore, M |= h and the theorem is proved. Lemma 16. For {eI ∈ R|I ⊂ {1, · · · , n}} such that\ne∅ = 1, e{1,··· ,n} = 0,\neI ≥ 0,\ne⋂ K ≥ |K|∑ r=1 (−1)r+1 ∑ {K′⊂K||K′|=r} e⋃ K′ .\nwhere K ⊂ P{1, · · · , n}, we have a probability metric space M = (Ω,F , P, d, π) such that\nedP,d([ ∨\ni∈I ϕi]M ) = edP,d(\n⋃ i∈I ϕMi ) = eI .\nProof. An underlying space Ω and a propositional interpretation π is constructed as follows.\nΩ = ⋃\ni\nϕMi\nϕMi = π(ϕi) = Xi ∪ Yi Xi = {xi,J}J⊂{1,···̂i··· ,n} Yi = ⋃\nj 6=i {yi,j,K}K⊂{1,··· ,ĵ,··· ,n}.\nBefore constructing a probability measure P , let’s consider a discrete space of n-points, Ω′ = {aϕM1 , · · · , aϕMn }. A set function ed′ : PΩ′ → R is defined as ed′(\n⋃ i∈I{aϕMi }) = eI . Because of the prop-\nerties of eI , ee′ satisfies all properties of doubt function. Therefore we can apply Möbius transformation to get the mass function m : PΩ′ → R. If we represent m( ⋃ i∈I ϕ M i ) = mI , we have the following equality from the definition of Möbius transformation.\nmI = ∑\nJ⊂I (−1)|I|−|J|eJ .\neI = ∑\nJ⊂Ic mJ .\nConsider the measurable space F = PΩ. Since Ω is finite, a probability distribution on F is determined by the probability at each point of Ω. So, we can construct the probability distribution P on F as\nP (xi,J ) = mJc\n|Jc| , P (yi,J,K) = 0 .\nNow we will define a pseudo distance function d on Ω as\nd(xj′,K′ , yi,j,K)\n= { 0 if j = j′ and K = K ′ and i 6∈ K 1 else\nd(yi,j,K , yi′,j′,K′) = max(d(xj,K , yi,j,K), d(xj′,K′ , yi′,j′,K′))\nd(xi,J , xi′,J ′) = 1\nLet’s show the triangular inequality. Since all values are 0 or 1, the only cases that we are concerned is the case of 0 + 0 ≥ 1. Since 0 distance can not happen between xi,J ’s, the remaining cases are as follows. First,\nd(xj,K , yi,j,K) + d(xj,K , yi′,j,K) ≥ d(yi,j,K , yi′,j,K) ,\nd(xj,K , yi,j,K) + d(yi,j,K , yi′,j,K) ≥ d(xj,K , yi′,j,K) follows from the definition of d. Finally,\nd(yi,j,K , yi′,j′,K′) + d(yi′,j′,K′ , yi′′,j′′,K′′) ≥ d(yi,j,K , yi′′,j′′,K′′)\nholds since\nmax(d(xj,K , yi,j,K), d(xj′,K′ , yi′,j′,K′)) +max(d(xj′,K′ , yi′,j′,K′), d(xj′′,K′′ , yi′′,j′′,K′′))\n≥ max(d(xj,K , yi,j,K), d(xj′′,K′′ , yi′′,j′′,K′′)) .\nThis proves that d is a pseudo distance function.\nSince we constructed M , we will check that the expected distance edP,d satisfies edP,d( ⋃ i∈I ϕ M i ) = eI .\nThe distance between xj,K and ⋃ i∈I ϕ M i is as follows.\nd(xj,K , ⋃\ni∈I ϕMi ) = min i∈I min j′,K′ d(xj,K , yi,j′,K′)\n= { 1 if I ⊂ K 0 else .\nwhere j 6∈ K by definition. Therefore,\ned( ⋃\ni∈I ϕMi )\n= ∑\nω∈Ω d(ω,\n⋃ i∈I ϕMi ) · P (ω)\n= ∑\nj∈Kc\n[ ∑\nK⊂{1,··· ,n} d(xj,K ,\n⋃ i∈I ϕMi ) · P (xj,K) ]\n= ∑\nj∈Kc\n[ ∑\nK⊂{1,··· ,n},I⊂K P (xj,K)\n]\n= ∑\nK⊂{1,··· ,n},I⊂K\n[ ∑\nj∈Kc\nmKc |Kc| ]\n= ∑\nK⊂{1,··· ,n},I⊂K mKc\n= ∑\nKc⊂Ic mKc =\n∑\nJ⊂Ic mJ = eI ."}, {"heading": "7 Discussion", "text": "We constructed reasoning systems on metric spaces using expected distance functions. These systems could be built on a metric space equipped with any kind of belief theoretic measures. The axioms we adopted for these systems were sound and complete. But symbols like “Pr” or “D” that represent probability or distance are not included in LED. We showed that probability logic and the logic of expected distance are not more expressive than each other (Lee 2006). Furthermore, extended languages including some of those symbols\nare strictly more expressive than LED. It is an interesting question whether there exist sets of complete axioms for those extended systems.\nReasoning with expected distance has many potential applications. One interesting application is a reasoning system for second order uncertainties (Gaifman 1986). Since uncertainty degrees are usually represented in metric spaces, we can adopt expected distance functions to represent second order uncertainties. As an example, an expression such as ED(“Prob(ϕ) = 0.5”) = 0.1 is an efficient representations when we represent a probability distribution over probabilities of ϕ. Since Prob(“Prob(ϕ) = 0.5”) would always become zero, a purely probabilistic second order reasoning system should chose an interval such as Prob(Prob(ϕ) ∈ [0.4, 0.6]) = 0.8. The reasoning for this choice is not clear, and tends to lose more information in the process. There is no explicit reason why we should choose the previous expression instead of Prob(Prob(ϕ) ∈ [0.2, 0.9]) = 0.9. The representation with expected distance is more natural and intuitive.\nAcknowledgement I thank Lawrence Moss for his support and guidance for this paper."}], "references": [{"title": "Toward a geometry of common sense: A semantics and a complete axiomatization of mereotopology", "author": ["N. Asher", "L. Vieu"], "venue": "IJCAI-95, 846–852.", "citeRegEx": "Asher and Vieu,? 1995", "shortCiteRegEx": "Asher and Vieu", "year": 1995}, {"title": "Representing and reasoning with probabilistic knowledge: a logical approach to probabilities", "author": ["F. Bacchus"], "venue": "Cambridge, Mass.: MIT Press.", "citeRegEx": "Bacchus,? 1990", "shortCiteRegEx": "Bacchus", "year": 1990}, {"title": "Statistical decision theory and Bayesian analysis", "author": ["J.O. Berger"], "venue": "Springer series in statistics. New York: Springer-Verlag, 2nd edition.", "citeRegEx": "Berger,? 1985", "shortCiteRegEx": "Berger", "year": 1985}, {"title": "Great expectations", "author": ["F.C. Chu", "J.Y. Halpern"], "venue": "part i: On the customizability of generalized expected utility. In Eighteenth International Joint Conference ofn Aritificial Intelligence (IJCAI03), 279–302.", "citeRegEx": "Chu and Halpern,? 2003", "shortCiteRegEx": "Chu and Halpern", "year": 2003}, {"title": "Great expectations", "author": ["F.C. Chu", "J.Y. Halpern"], "venue": "part ii: generalized expected utility as a universal decision rule. Artificial Intelligence 159(12):207–229.", "citeRegEx": "Chu and Halpern,? 2004", "shortCiteRegEx": "Chu and Halpern", "year": 2004}, {"title": "Reasoning about knowledge and probability", "author": ["R. Fagin", "J.Y. Halpern"], "venue": "J. ACM 41(2):340–367.", "citeRegEx": "Fagin and Halpern,? 1994", "shortCiteRegEx": "Fagin and Halpern", "year": 1994}, {"title": "A logic for reasoning about probabilities", "author": ["R. Fagin", "J.Y. Halpern", "N. Megiddo"], "venue": "Information and Computation 87(1-2):78–128.", "citeRegEx": "Fagin et al\\.,? 1990", "shortCiteRegEx": "Fagin et al\\.", "year": 1990}, {"title": "Combining spatial and temporal logics: Expressiveness vs", "author": ["D. Gabelaia", "R. Kontchakov", "A. Kurucz", "F. Wolter", "M. Zakharyaschev"], "venue": "complexity. Journal of Artificial Intelligence Research 23:167– 243.", "citeRegEx": "Gabelaia et al\\.,? 2005", "shortCiteRegEx": "Gabelaia et al\\.", "year": 2005}, {"title": "A theory of higher order probabilities", "author": ["H. Gaifman"], "venue": "1986 Conference on Theoretical aspects of reasoning about knowledge. Monterey, California, United States: Morgan Kaufmann Publishers Inc.", "citeRegEx": "Gaifman,? 1986", "shortCiteRegEx": "Gaifman", "year": 1986}, {"title": "Inferences in probability logic", "author": ["G. Gerla"], "venue": "Artificial Intelligence 70(1-2):33–52.", "citeRegEx": "Gerla,? 1994", "shortCiteRegEx": "Gerla", "year": 1994}, {"title": "Reasoning about expectation", "author": ["J.Y. Halpern", "R. Pucella"], "venue": "UAI’02, 18th Conference in Uncertainty in Artificial Intelligence, 217–215.", "citeRegEx": "Halpern and Pucella,? 2002", "shortCiteRegEx": "Halpern and Pucella", "year": 2002}, {"title": "Reasoning about uncertainty", "author": ["J.Y. Halpern"], "venue": "Cambridge, Mass.: MIT Press.", "citeRegEx": "Halpern,? 2003", "shortCiteRegEx": "Halpern", "year": 2003}, {"title": "Logics of metric spaces", "author": ["O. Kutz", "F. Wolter", "H. Sturm", "N.-Y. Suzuki", "M. Zakharyaschev"], "venue": "ACM Trans. Comput. Logic 4(2):260–294.", "citeRegEx": "Kutz et al\\.,? 2003", "shortCiteRegEx": "Kutz et al\\.", "year": 2003}, {"title": "Probabilistic reasoning on metric spaces", "author": ["S.H. Lee"], "venue": "Ph.D. Dissertation, Indiana University Bloomington.", "citeRegEx": "Lee,? 2006", "shortCiteRegEx": "Lee", "year": 2006}, {"title": "On the incompleteness of modal logics of space: advancing complete modal logics of place", "author": ["O. Lemon", "I. Pratt"], "venue": "Advances in Modal Logic, volume 1. CSLI Publications, Stanford. 115–132.", "citeRegEx": "Lemon and Pratt,? 1998", "shortCiteRegEx": "Lemon and Pratt", "year": 1998}, {"title": "Probabilistic logic", "author": ["N.J. Nilsson"], "venue": "Artificial Intelligence 28(1):71–87.", "citeRegEx": "Nilsson,? 1986", "shortCiteRegEx": "Nilsson", "year": 1986}, {"title": "The foundations of statistics", "author": ["L.J. Savage"], "venue": "New York,: Wiley.", "citeRegEx": "Savage,? 1954", "shortCiteRegEx": "Savage", "year": 1954}, {"title": "Subjective-probability and expected utility without additivity", "author": ["D. Schmeidler"], "venue": "Econometrica 57(3):571–587.", "citeRegEx": "Schmeidler,? 1989", "shortCiteRegEx": "Schmeidler", "year": 1989}, {"title": "A mathematical theory of evidence", "author": ["G. Shafer"], "venue": "Princeton, N.J.: Princeton University Press.", "citeRegEx": "Shafer,? 1976", "shortCiteRegEx": "Shafer", "year": 1976}, {"title": "Theory of games and economic behavior", "author": ["J. Von Neumann", "O. Morgenstern"], "venue": "Princeton,: Princeton university press.", "citeRegEx": "Neumann and Morgenstern,? 1944", "shortCiteRegEx": "Neumann and Morgenstern", "year": 1944}, {"title": "A logic for metric and topology", "author": ["F. Wolter", "M. Zakharyaschev"], "venue": "Journal of Symbolic Logic 70(3):795–828.", "citeRegEx": "Wolter and Zakharyaschev,? 2005", "shortCiteRegEx": "Wolter and Zakharyaschev", "year": 2005}, {"title": "Entropy measures under similarity relations", "author": ["R.R. Yager"], "venue": "International Journal of General Systems 20(4):341–358.", "citeRegEx": "Yager,? 1992", "shortCiteRegEx": "Yager", "year": 1992}, {"title": "Probability measures of fuzzy events", "author": ["L.A. Zadeh"], "venue": "Jour. of Math. anal. and appl. 23:412–427.", "citeRegEx": "Zadeh,? 1968", "shortCiteRegEx": "Zadeh", "year": 1968}], "referenceMentions": [{"referenceID": 2, "context": "The expected distance is often interpreted as a loss function in statistical decision theory (Berger 1985).", "startOffset": 93, "endOffset": 106}, {"referenceID": 16, "context": "The expected utility function has been an important topic in economics for a long time (Von Neumann & Morgenstern 1944; Savage 1954; Schmeidler 1989).", "startOffset": 87, "endOffset": 149}, {"referenceID": 17, "context": "The expected utility function has been an important topic in economics for a long time (Von Neumann & Morgenstern 1944; Savage 1954; Schmeidler 1989).", "startOffset": 87, "endOffset": 149}, {"referenceID": 1, "context": "see Halpern 2003, Nilsson 1986, Bacchus 1990, Gerla 1994). There also exists a wide variety of formal systems on spatial reasoning (eg. see Gabelaia et al. 2005, Asher & Vieu 1995, Lemon & Pratt 1998) and especially on reasoning about metric spaces (eg. see Kutz et al. 2003, Wolter & Zakharyaschev 2005). But it is hard to find a formal system when probabilistic uncertainty is present on metric spaces. In probabilistic or statistical analysis, it is usually assumed that values of random variables are real numbers. Since most of statistical inference is related to reasoning about expectation and variance, restricting the range of random variables to the spaces where those values are well defined is considered as an acceptable sacrifice. A formal reasoning system on expectations with respect to probability measures and other belief theoretic measures can be found in (Halpern & Pucella 2002). Even though expectations of an event cannot be defined on arbitrary metric spaces, the expectation of distances with respect to a fixed set is well defined in any metric space. For example, an expectation of a random location on a sphere cannot be defined, but an expected distance of a random location from the south hemisphere is a well defined notion. The expected distance is often interpreted as a loss function in statistical decision theory (Berger 1985). Loss(a) = EP (d(X, a)). In this case, the distance function d(x, a) with respected to a fixed point a is used to calculate the cost for predicting x when a is a true state. A complimentary concept of a cost function in decision theory is a utility function. The expected utility function has been an important topic in economics for a long time (Von Neumann & Morgenstern 1944; Savage 1954; Schmeidler 1989). We can also find more generalized expected utility functions defined for plausibility measures and generalized utility functions. (Chu & Halpern 2003; 2004). The objective of a decision problem is to find an action that minimizes a loss function. For example, if we have a uniform prior probability distribution on [0, 1] where d(x, y) = |x− y|, the loss minimizing prediction would be X = 0.5. But in inference problems, the objective is to derive more information from given information. As an example, for the previous distance function, if we know that EP (d(X, 0)) = 1, then we can deduce that EP (d(X, 1)) = 0. For inference problems, a viewpoint from fuzzy logic is also meaningful. Let’s assume that a fuzzy set Da represents a fuzzy concept “dissimilar from a” for a point a in a 1-bounded metric space Ω. A natural candidate for a membership function of Da would be d(x, a). Given a probability distribution P , Zadeh (1968) introduces the probability of a fuzzy concept.", "startOffset": 32, "endOffset": 2709}, {"referenceID": 21, "context": "There has been various attempts to generalize Shannon’s entropy to the metric spaces using expected similarity and expected distance (Yager 1992; Lee 2006).", "startOffset": 133, "endOffset": 155}, {"referenceID": 13, "context": "There has been various attempts to generalize Shannon’s entropy to the metric spaces using expected similarity and expected distance (Yager 1992; Lee 2006).", "startOffset": 133, "endOffset": 155}, {"referenceID": 18, "context": "We can also define expected distance functions with respect to any kind of belief theoretic measures (Shafer 1976).", "startOffset": 101, "endOffset": 114}, {"referenceID": 18, "context": "Especially belief theoretic functions of DempsterShafer theory are defined by modifying the equality of the inclusion exclusion principle (Shafer 1976).", "startOffset": 138, "endOffset": 151}, {"referenceID": 13, "context": "The proofs can be found in (Lee 2006).", "startOffset": 27, "endOffset": 37}, {"referenceID": 18, "context": "An important property of belief theoretic functions is the Möbius inversion (Shafer 1976).", "startOffset": 76, "endOffset": 89}, {"referenceID": 10, "context": "At this point we note that our inequalities are fundamentally different from those in Halpern and Pucella’s paper (2002) that can be stated as", "startOffset": 86, "endOffset": 121}, {"referenceID": 13, "context": "Because of restricted space, refer to (Lee 2006) for omitted proofs.", "startOffset": 38, "endOffset": 48}, {"referenceID": 13, "context": "We showed that probability logic and the logic of expected distance are not more expressive than each other (Lee 2006).", "startOffset": 108, "endOffset": 118}, {"referenceID": 8, "context": "One interesting application is a reasoning system for second order uncertainties (Gaifman 1986).", "startOffset": 81, "endOffset": 95}], "year": 2006, "abstractText": "We set up a model for reasoning about metric spaces with belief theoretic measures. The uncertainty in these spaces stems from both probability and metric structures. To represent both aspect of uncertainty, we choose an expected distance function as a measure of uncertainty. A formal logical system is constructed for the reasoning about expected distance. Soundness and completeness are shown for this logic. For reasoning on product metric spaces with uncertainty, a new metric is defined and shown to have good properties.", "creator": " TeX output 2006.05.21:2316"}}}