{"id": "1206.1319", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "5-Jun-2012", "title": "Certain Bayesian Network based on Fuzzy knowledge Bases", "abstract": "In this paper, crumpled we are frenzies trying nanite to imayev examine overdoing trade kagawa offs nunneries between mini-camp fuzzy silico logic sextuplets and certain ballyshannon Bayesian metrocall networks and we propose to timepieces combine factually their tigermania respective advantages finglass into farābād fuzzy certain Bayesian networks (abendroth FCBN ), gentlemanly a certain Bayesian 3:44 networks dimming of fuzzy haneefa random variables. bahaji This paper a-100 deals with mcglinn different filament definitions 4868 and classifications of hoisted uncertainty, sources yō of elegia uncertainty, huguet and evn theories and wnet methodologies screen-based presented to deal with blossomed uncertainty. Fuzzification carlsen of dashkova crisp certainty fourth-largest degrees poujade to fuzzy goofiness variables improves 525,000 the douches quality emrick of the shiyah network krzysztof and tends non-electrified to ira bring l'arc smoothness and robustness in nashua the network performance. jbesser The gellatly aim 3-d is 54.97 to provide sedge a jepara new approach for swingers decision changji under dandurand uncertainty that combines three methodologies: Bayesian vaigauskas networks certainty three-strip distribution resupplied and fuzzy logic. Within twellman the framework söder proposed in this paper, medically we sayenko address dlls the kabariti issue sentier of saidgai extending the lombarde certain deruyter networks pedicularis to houseplant a fuzzy tu'ifua certain networks in order to rexes cope dampened with unforced a vagueness kihl and limitations of existing gumbos models for jib decision under imprecise and uncertain nitsche knowledge.", "histories": [["v1", "Tue, 5 Jun 2012 19:53:43 GMT  (240kb)", "http://arxiv.org/abs/1206.1319v1", "arXiv admin note: substantial text overlap with1206.0918"]], "COMMENTS": "arXiv admin note: substantial text overlap with1206.0918", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["abdelkader heni", "mohamed nazih omri", "adel alimi"], "accepted": false, "id": "1206.1319"}, "pdf": {"name": "1206.1319.pdf", "metadata": {"source": "CRF", "title": "Internet and Information Technology in Modern Organizations: Challenges & Answers 826 Certain Bayesian Network based on Fuzzy knowledge Bases", "authors": ["Abdelkader HENI", "Adel M ALIMI"], "emails": ["abdelkader.heni@edunet.tn", "nazih.omri@ipeim.rnu.tn", "adel.alimi@enis.rnu.tn"], "sections": [{"heading": null, "text": "combination of the three approaches cited above. The model developed here can be built on any exact propagation methods, including clustering, joint tree decomposition, etc. The organization of this paper is as follows. A description of the representation process of uncertain imprecise propositions and its semantics are defined in next section. An overview of basic concepts is proposed in the section 3. In Section 4, 5 and 6 our approach to model uncertainty with certain Bayesian networks and fuzzy knowledge bases is discussed. Many of related work are described in many parts of this paper. Finally, a summary of our approach and its drawbacks are given in conclusion."}, {"heading": "2. Representing uncertain and imprecise information", "text": "Fuzziness and randomness are two distinct components of uncertainty. While fuzzy sets are a rigorous softening of random sets, many of the operations defined in fuzzy logic lack a complete formalism, and are not strongly supported by experimental evidence. On the other hand causal possibilistic networks (CPN) or possibilistic Bayesian networks provide an ultimately flexible inference mechanism based on certainty or possibility distribution principles. However, CPNs suffer from the overwhelmingly large conditional possibility tables with discrete variables likewise probabilistic networks namely Bayesian networks. Fuzzification of continuous or crisp variables reduces the size of conditional certainty tables (case of certain networks in witch we use certainty degrees instead of possibilities or probabilities) to practically acceptable levels and these tables exhaustively encompass all the intuitive and fuzzy rules for inference problems. In this way, we reach a new knowledge representing engine, called fuzzy certain Bayesian networks, which provides a rigorous formalism for inference under fuzziness and randomness. The main idea of our modeling system of uncertain and imprecise knowledge is inspired from [3] where the authors have extended Dubois and Prade's [2] definition about the possibility and necessity measures of classical propositions to the case of\nInternet and Information Technology in Modern Organizations: Challenges & Answers 827\nfuzzy propositions through fuzzy truth values [1]. A classical proposition is true in some possible worlds and false in the rest of possible worlds, while a fuzzy proposition Þ is true with respect to a possible world to a degree [3]. We model our uncertainty about the actual world by defining a fuzzy necessity distribution over all possible worlds to specify the degree of necessity that the actual world is in each certain world. More formally, we consider that each necessity degree associated to a propositional formula Þ is a fuzzy number mapping from an interval [β1,β2]⊆ [0 , 1] to [0 , 1] where [β1, β2] is given by expert. Here the exact necessity degree is not specified but we are \"certain\" that it belongs to the interval [β1, β2]. For each state (respectively for each formula), we associate a fuzzy necessity degree χ ∈ [β1, β2]. And then we map the fuzzy necessity distribution defined by a membership function µ (χ1). More formally: µ : [β1, β2] [0 1] (1) χ1 µ (χ1)\nFigure1 illustrates the structure of fuzzy certain Bayesian network with five nodes where nodes may receive fuzzy values. ℵ(*) is the associated fuzzy certainty (i.e. necessity) distribution. More explanation of necessity distribution and fuzzy logic will be presented in the second part of next section."}, {"heading": "3. Preliminary concepts", "text": ""}, {"heading": "3.1. Fuzzy logic", "text": "The fuzzy set theory was first presented by Zadeh [5]. In this theory, uncertainty has more to do with vague definitions of criteria than randomness. The basis of the fuzzy set theory is a membership function µ(x). This function describes the degree to which a certain statement is true [6]. For example, the statement ‘Jhon is tall’ can be more or less true. If we had a precise definition, such as ‘Jhon is tall if it has at least 1.75 of size’, the membership function would only have values 0 and 1, and fuzzy sets would not be needed. Otherwise, the membership function for a fuzzy set Â could be:\nµÂ : X → [0, 1]\nAnd µÂ(x) is interpreted as the degree of membership of element x in fuzzy set Â for each x∈ X."}, {"heading": "3.2. Possibilistic logic", "text": "Possibilistic logic [4] is logic of uncertainty to reason with classical propositions under incomplete information and partially inconsistent knowledge. Formulas of the necessity-valued fragment of possibilistic logic are of the form (ϕ,α) where ϕ is a classical (propositional or first-order) formula and α ∈[0,1] is understood as a lower bound for the necessity degree ofϕ. Let L be a finite propositional language. p; q; r; . . . denote propositional formulae. and ⊥, respectively, denote tautologies and contradictions. denotes the classical syntactic inference relation. Ω is the set of classical interpretations ω of L, and [p] is the set of classical models of p (i.e. interpretations where p is true {ω | ω p}) [9]."}, {"heading": "3.2.1 Fuzzy Possibility and fuzzy Certainty distributions", "text": "The basic element of possibility theory is the possibility distribution Π which is a mapping from Ω to the interval [0,1]. Formally a possibility distribution is defined as : Π : Ω [0 1] (2) ω π(ω) Where the degree π(ω) represents the compatibility of ω with the available information (or beliefs) about the real world. By convention, π(ω)= 0 means that the interpretation ω is impossible, and π(ω) = 1 means that nothing prevents ω from being the real world. [7]. Given a possibility distribution π, two different ways of rank ordering formulae of the language are defined from this possibility distribution. This is obtained using two mappings grading, respectively, the possibility and the certainty of a formula p: • The possibility (or consistency) degree: ∏(p) = max ( π (ω) : ω ∈ [p]) (3) Which evaluates the extent to which p is consistent with the available beliefs expressed by [p]. It satisfies: ∀p, ∀q ∏(p∨ q) = max (∏ (p), ∏ (q)) (4) Analogously we can define the fuzzy possibility distribution as follow: • The fuzzy possibility (or consistency) degree: µ∏(p) (t) = max (π (ω) : ω ∈ [p] and µp(ω) = t) (5)\nInternet and Information Technology in Modern Organizations: Challenges & Answers 828\nWhere µp denotes the fuzzy set of possible worlds of p in Ω. ω is a possible world in Ω and t is the degree of truth. µ∏(p) can be viewed as the possibility measure of a set of possible worlds in which the truth degree of p is equivalent to t [3], i.e., ∀p, ∀q µ∏ (p∨ q) = max (µ∏(p), µ∏(q)) (6) • The necessity (or certainty, entailment) degree N(p) = 1 – ∏ (¬ p) (7) Which evaluates the extent to which p is entailed by the available beliefs. We have [13]: ∀p, ∀q N (p∧ q) = min (N (p), N (q)) (8) Based on [3], we can define our fuzzy necessity as follow: • The fuzzy necessity (or certainty, entailment) degree: µN(p)(t)(p) = 1 – µN(p) (t) (¬ p) (9) Witch satisfies: ∀p, ∀q µN (p∧ q) = min (µN(p), µN (q)) (10) In both systems (certainty distribution and fuzzy certainty distribution) the fuzzy statement: \"its almost sure that ϕ is ω (ω∈[ϕ])\" where [ϕ] denotes the set of models of ϕ, can be represented by certainty weighted formula of the form (ϕ,α) where ϕ is a classical propositional formula and α is the lower bound of necessity degree and can be interpreted as a crisp value in case of necessity distribution and as µN (χ)∈ [β1,β2] in the case of fuzzy necessity distribution."}, {"heading": "4. Certain Knowledge bases: definitions and concepts", "text": "A certain formula (i.e. possibilistic formula) is a pair (ϕ, α) where ϕ is a classical first-order closed formula and α ∈ [0,1] is a positive number. (ϕ, α) expresses that ϕ is certain at least to the degree α , i.e. N(ϕ) ≥ α, where N is a necessity measure modelling our possibly incomplete state of knowledge. The right part of a certain formula, i.e. α, is called the weight of the formula. Thus a certain knowledge base ∑ is defined as the set of weighted formulae. More formally ∑= {(ϕι , αi) , i = 1….m} where ϕι is a propositional formula and αi is the lower bound of necessity accorded to this formula (certainty degree)."}, {"heading": "4.1. Certain Bayesian networks (CBN)", "text": "A standard certain Bayesian network is a decomposition of a multivariate necessity distribution according to:\nN (A1,…..,An) = mini=1..n N (Ai | parents(Ai)) (11) where parents(Ai) is the set of parents of variable Ai, which is made as small as certain by exploiting conditional independencies of the type indicated above [9] and [10]. Such a network is usually represented as a directed graph in which there is an edge from each of the parents to the conditioned variable (fig 2). In our work a certain Bayesian networks is considered as a graphical representation of uncertain information. It offers an alternative to probabilistic causal network when numerical data are not available.\nLet V= {A1,A2,..An} a set of variables (i.e attributes or proprieties). The set of interpretations is the Cartesian product of all domains of attributes in V. When each attribute is binary, domains are denoted by Di={ai,¬ai}. A certain graph denoted by NG is an acyclic graph where nodes represents attributes i.e a patient temperature and edges represent causal links between them. Uncertainty is represented by necessities distribution, and conditional necessities for each attribute explaining the link force between them. The conditional necessities distributions are associated to the graph as follow: For each root attribute Ai, we specify the prior necessity distribution N(ai), N(¬ai) with the constraint that:\nN(ai) = 1 N(¬ai) =0 (12)\n- For other attributes Aj, we specify the conditional necessities distribution N(aj|uj), N(¬aj|uj) with max(N(ai|uj), N(¬ai| uj)) =1 where uj is an instance of aj parents.\nExample: the next figure gives an example of certain Bayesian networks with four nodes and their conditional necessities.\nInternet and Information Technology in Modern Organizations: Challenges & Answers 829\nThe joint certainty distribution is obtained then by applying the chain rule:\nN(A1,...,An) = min( N (Ai|U(Ai)) (13)\nWhere:\n- N(A1,…..,An) is The joint certainty distribution.\n- min (N(Ai|U(Ai)) is the lower bound of\nthe necessities degrees associated to (Ai|U(Ai)\nExample: let the prior necessities and the conditional necessities be as described in table 1:\nTable 1: necessities distribution\na 0.6 ¬a 0.1\nB|A a ¬a b 0.5 0.2 ¬b 0.25 0\nC|A a ¬a c 0.3 0.2\n¬c 0.1 0.1\nD|BC bc b¬c Else d 0.2 0.1 0.3\n¬d 0.4 0.1 0.2 By the use of the chain rule defined by equation (13) we obtain the certain distribution associated with the certain Bayesian network cited above as described in table 2."}, {"heading": "4.2. From CBN to certain knowledge base", "text": "We would like to represent a class of certain Bayesian networks using a local certain valued knowledge base consisting of a collection of\npossibilistic logic sentences (formulae) in such a way that a network generated on the basis of the information contained in the knowledge base is isomorphic to a set of ground instances of the formulae. As the formal representation of the knowledge base, we use a set of certain formulae. We represent random variables with necessities weights. Formally a necessity valued knowledge base is defined as the set: ∑= {(ϕι , αi) , i = 1….m} (14) Where ϕι denotes a classical propositional formula, and αi denotes the lower bound of certainty (i.e necessity). We can represent the information contained in each node of a Bayesian network, as well as the quantitative information contained in the link matrices, if we can represent all the direct parent/child relations. We express the relation between each random variable and its parents over a class of networks with a collection of quantified formulae. The collection of formulae represents the relation between the random variable and its parents for any ground instantiation of the quantified variables. The network fragment consisting of a random variable and its parents with a set of formulae of the form (ϕ , α). We give next some definitions inspired from [9] and [10]. Definition 1: Two certain knowledge bases ∑1 and and ∑2 are said to be equivalent if their associated necessity distributions are equal, namely: ∀ω ∈Ω, N∑1 (ω) = N∑2 (ω) (15) Definition 2: Let (ϕ , α ) be a formula in ∑ Then (ϕ , α) is said to be subsumed by ∑ if ∑ and ∑\\{(ϕ , α )} are equivalent knowledge bases. This is means that each redundant formula should be removed from the certain valued knowledge base since it can be deduced from the rest of formulae. Next, we describe the process that permit to deduce a certain valued knowledge base from a certain network.\nLet NG be a certain Bayesian network consisting of a set of labeled variables V= {A1,A2,..An}. Now let A be a binary variable and let (a ¬a) be its instances. Given the measure N(ai|ui) witch represents the local necessity degree associated with the variable A where ui ∈ UA is an instance of parents(ai). The local certain knowledge base associated with A should be defined using the next equation:\n∑A = {(¬ai ∨ ui, αι ),αι = 1- N (ai|ui) ≠ 0 } (16)\nInternet and Information Technology in Modern Organizations: Challenges & Answers 830\nTo note here that in [15] the authors prove the possibility to recover conditional possibilities from ∑A where ∑A is a possibilistic knowledge base. Based o the results obtained in [9], we can check in our case that it is possible to recover conditional necessities from ∑A according to equations (17).\n1 if ∀ (ϕi , αi) ∈∑ ω ϕi N∑(ω) = (17) 1- max { αi : ω ϕi } otherwise Example: by applying equation (16), we get the certain knowledge base associated to the certain\nBayesian network described in section 4.1. ∑A = {(a, 0.9 )} ∑B = {(b∨a,0.7),(b∨¬a,0.75)(¬b∨a, 0.8)} ∑C={(c∨a, 0.9),(c∨¬a, 0.9) (¬c∨a, 0.8)} ∑D = {{(d∨b∨c, 0.8), (d∨b∨¬c, 0.8), (d∨¬b∨c,0.9), (d∨¬b∨¬c, 0.6 ), (¬d∨¬b∨c, 0.9 )} Next section shows the other form of certain valued knowledge where weighted formulae will be replaced by fuzzy membership function de define a new representation of uncertain information by the mean of what we call fuzzy knowledge bases."}, {"heading": "5. CBN based on fuzzy necessity distribution", "text": "Logical formulae with a weight strictly greater than a given levels (lower bounds of necessity degrees) are immune to inconsistency and can be safely used in deductive reasoning [11]. However in order to perform reasoning for both imprecise and uncertain information, two important issues should be addressed. First, any improvement of the possibility level for a piece of information can only be achieved at the expense of the specificity of the information; second the accorded levels to the causality explained in terms of rules (case of fuzzy logic) and conditional dependencies (case of Bayesian networks) are somewhat expensive due to the fact that these confidence level is somewhat critical. We propose so to combine these three approaches (Bayesian networks certainty distribution and fuzzy logic) to develop a method for uncertain and imprecise knowledge representation that may improve decision based systems. Our fuzzy beliefs are to emulate a certain Bayesian necessity measure. For simplicity each variable here has two states: the presence or absence of an entity. The belief that A is present takes the form of a fuzzy truth fA. The extent to witch the belief of variable state influences the state beliefs of parent\nor child is modelled by a fuzzy set membership function: one for each influence direction. Example: Let our certain network be as described in figure representing a Bayesian network in metastatic cancer.\nFig. 4 shows a Bayesian network representing the above cause and effect relationships. Table 2 lists the causal influences in terms of fuzzy certainty distributions. Each variable is characterized by an unknown necessity degree given the state of its parents. For instance: C ∈ [0, 1] represents the dichotomy between having a brain tumor and not having one, c denotes the assertion C = 1 or “Brain tumor is present”, and ¬c is the negation of c, namely, C =0. The root node, A, which has no parent, is characterized by its prior fuzzy certainty distribution. Example Le the conditional fuzzy necessities associated to the graph presented in figure 4 be as described in table 3. For reason of simplicity we kept here four nodes only as in the graph presented in figure 3.\nFor instance N(d| b,¬c) cannot be 0.1 as described in table 1 but rather is a fuzzy number say χ1 ∈[βD|BC1 , β D|BC2 ] where χ1 = ℵ(d| b,¬c) is the fuzzy necessity associated with the fuzzy formula (d| b,¬c) and is associated with a membership function µ ( χ1 ) supposed to be a triangular function (respectively µ can be trapezoid or other kind of functions). µ is represented as follow (figure 5):\nInternet and Information Technology in Modern Organizations: Challenges & Answers 831\nThen we can deduce the next possible representation of µ(χ1) as: µ(χ1) = k1 x (χ1 –βD|BC1) – k2 x (|χ1 – βD|BC2| + χ1 – α) Where:\n- α, k1 and k2 are two defined constants.. - | * | is the absolute value of term *\nThe above expression and figure mean that the interval of χ1 is [βD|BC1 , β D|BC2 ]. If χ1 = α then µ(χ1)=1, implying that the fuzzy necessity χ1 = α is the most possible situation. If χ1 ≥ β D|BC2 or χ1≤ βD|BC1 then µ(χ1) = 0, the possible manifestation of χ1."}, {"heading": "6. Transformation between FBN and FNB", "text": "Analogously, when the given necessities degree are fuzzy numbers as we described in section 5, the necessity distribution N(X) associated to a node X is considered as a fuzzy distribution defined by a membership function µ : [β1, β2] [0 1] (18) χ µ (χ) Example: consider the graph of figure 3. For simplicity each variable here has two states: the presence or absence of an entity and we will define the same membership function to a as to ¬a.\nLet the different membership be as follow: µi(χ) = ki1 x (χ –βij1) – ki2 x (|χ – βij2| + χ – αi) Where:\n- µi(χ) is the membership function associated to the fuzzy variable χ, supposed to be triangular. - ki1 and ki2 are the used constant in each membership function supposed to be triangular. - βij1 and βij2 are the two min and the max boundary of a necessity degree.\nFinally by maximization of each membership function, we can deduce an optimal value for the certainty degree associated to each fuzzy variable (i.e. proposition). Namely: ℵ( χ ) = µ( χ ) = 1 Then it will be easy to deduce the value of χ as follow: λ + ki1 x βij1 + ki2 x βij2 +1 χ = (19) ki1 By replacing λ by 1 (the maximization of µ( χ )), the value of χ will be: λ + ki1 x βij1 + ki2 x βij2 +1 χ = (20) ki1 Analogously, the definition of the fuzzy joint necessity distribution is obtained by applying the fuzzy chain rule: ℵ(A1,...,An) = min(χi), χi = ℵ(Ai|U(Ai) From a semantic point of view, a certain knowledge base ∑= {(ϕι , αi) , i = 1….m} where each αi a crisp necessity value, is understood as the necessity distribution N∑ representing the fuzzy sets of models of ∑ : N∑(ω) = min max ( µ[Pi] (ω), 1-α) where [Pi] denotes the set of models of Pi, so that : µ[Pi] = α if ω Pi µ[Pi] (ω) = (21) 0 otherwise\nInternet and Information Technology in Modern Organizations: Challenges & Answers 832\nFrom (21) we can clearly deduce clearly that N∑(ω) is naturally a fuzzy distribution applied to a crisp set of values and µ[Pi] is the crisp membership function. Finally a fuzzy knowledge base can be defined so as the set of fuzzy certain formulae. We represent random variables with fuzzy necessities weights. Formally a fuzzy necessity valued knowledge base ℑ is defined as the set: ℑ= {(ϕι , µi\n-1(1)), i = 1….m} (22) Given that:\n- ϕι = (¬ai ∨ ui)\n- µi is the fuzzy membership function\n- χ = 1- ℵ (ai|ui) ≠ 0\n- µi -1(1) = χ the reciprocal function of µi"}, {"heading": "7. Conclusion and discussion", "text": "The present paper pretended to be an attempt to show and understand partially the world complexity that is being increasingly observed, being a try to contribute to ordering and organizing it. The considered approach combined the fuzzy logic and possibilistic logic in a framework of causal networks, which makes it an efficient tool that models knowledge taking into account the expert's subjectivity, vagueness and imprecision. Certain Bayesian networks with fuzzy knowledge bases approach in a natural way gives us the subsethood of the evidence for each logical formula. Although the methodology proposed in this paper, is aimed and illustrated by some typical examples, the developed techniques require experimental results. A future work is to extend this representation by definition of efficient algorithms for locally inferences. A future work will consist also on validating this approach by applying methodologies developed here on a real problem of knowledge representation with large scale data."}, {"heading": "8. References", "text": "[1] R.E. Bellman, L.A. Zadeh, Local and fuzzy logics, in: J.M. Dunn, G. Epstein (Eds.), Modern Uses of Multiple- Valued Logic, Reidel, Dordrecht, 1977, pp. 103-165. [2] D. Dubois, H. Prade, Théorie des Possibilités: Applications à la Représentation des Connaissances en Informatique, Masson, Paris,1985. [3] F. Esteva, P. Garcia-Calves, L. Godo, Relating and extending semantical approaches to possibilistic reasoning, Internat. J. Approx. Reason. 10 (1994) 311-344.\n[4] D. Dubois, J. Lang, and H. Prade. Possibilistic logic. In D.M. Gabbay, C.J. Hogger and J.A. Robinson, editor, Handbook of Logic in Artificial Intelligence and Logic Programming, pages 439– 513. Oxford University Press, 1994. [5] Zadeh, L.A., 1965. Fuzzy sets. Information and Control 8, 338–353. [6] Zimmermann, H.-J., 1985. Fuzzy Set Theory and its Applications. Kluwer Academic Publishers 355 pp. [7] S. Benferhat, D. Dubois, L. Garcia, H. Prade. On the transformation between possibilistic logic bases and possibilistic causal networks. International Journal of Approximate Reasoning, Vol. 29, N. 21, 35-173, 2002. [8] J. Pearl. Probabilistic Reasoning in Intelligent Systems: Networks of Plausible Inference.Morgan Kaufmann Publishers, Palo Alto, (1988). [9] Salem Benferhat and Salma Smaoui Possibilistic networks with locally weighted knowledge bases 4th International Symposium on Imprecise Probabilities and Their Applications, Pittsburgh, Pennsylvania, 2005 [10] S. Benferhat, S. Smaoui. Hybrid possibilistic networks. in proceeding of the Twentieth National Conference on Artificial Intelligence (AAAI05),AAAI Press. Pittsburgh, 2005. [11] Dubois and Prade Possibilistic logic : a retrospective and prospective view. Fuzzy Sets and Systems 144 (2004) pp 3-23. [12] Han-Lin Li and Han-Ying Kao. Constrained abductive reasoning with fuzzy parameters in Bayesian networks. Computers & Operations Research 32 (2005) 87–105 [13] D. Dubois, H. Prade, Fuzzy Sets and Systems: Theory and applications, Academic Press, New York, 1980."}], "references": [{"title": "Local and fuzzy logics", "author": ["R.E. Bellman", "L.A. Zadeh"], "venue": "in: J.M. Dunn, G. Epstein (Eds.), Modern Uses of Multiple- Valued Logic, Reidel, Dordrecht", "citeRegEx": "1", "shortCiteRegEx": null, "year": 1977}, {"title": "Relating and extending semantical approaches to possibilistic reasoning", "author": ["F. Esteva", "P. Garcia-Calves", "L. Godo"], "venue": "Internat. J. Approx. Reason. 10 ", "citeRegEx": "3", "shortCiteRegEx": null, "year": 1994}, {"title": "Possibilistic logic", "author": ["D. Dubois", "J. Lang", "H. Prade"], "venue": "D.M. Gabbay, C.J. Hogger and J.A. Robinson, editor, Handbook of Logic in Artificial Intelligence and Logic Programming, pages 439– 513. Oxford University Press", "citeRegEx": "4", "shortCiteRegEx": null, "year": 1994}, {"title": "Fuzzy Set Theory and its Applications", "author": ["Zimmermann", "H.-J"], "venue": null, "citeRegEx": "6", "shortCiteRegEx": "6", "year": 1985}, {"title": "On the transformation between possibilistic logic bases and possibilistic causal networks", "author": ["S. Benferhat", "D. Dubois", "L. Garcia", "H. Prade"], "venue": "International Journal of Approximate Reasoning, Vol. 29, N. 21, 35-173", "citeRegEx": "7", "shortCiteRegEx": null, "year": 2002}, {"title": "Probabilistic Reasoning in Intelligent Systems: Networks of Plausible Inference.Morgan", "author": ["J. Pearl"], "venue": null, "citeRegEx": "8", "shortCiteRegEx": "8", "year": 1988}, {"title": "Possibilistic networks with locally weighted knowledge bases", "author": ["Salem Benferhat", "Salma Smaoui"], "venue": "4th International Symposium on Imprecise Probabilities and Their Applications, Pittsburgh, Pennsylvania,", "citeRegEx": "9", "shortCiteRegEx": "9", "year": 2005}, {"title": "Hybrid possibilistic networks", "author": ["S. Benferhat", "S. Smaoui"], "venue": "proceeding of the Twentieth National Conference on Artificial Intelligence (AAAI- 05),AAAI Press. Pittsburgh", "citeRegEx": "10", "shortCiteRegEx": null, "year": 2005}, {"title": "Possibilistic logic : a retrospective and prospective view", "author": ["Dubois", "Prade"], "venue": "Fuzzy Sets and Systems", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2004}, {"title": "Constrained abductive reasoning with fuzzy parameters in Bayesian networks", "author": ["Han-Lin Li", "Han-Ying Kao"], "venue": "Computers & Operations Research", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2005}, {"title": "Fuzzy Sets and Systems: Theory and applications", "author": ["D. Dubois", "H. Prade"], "venue": "Academic Press, New York", "citeRegEx": "13", "shortCiteRegEx": null, "year": 1980}], "referenceMentions": [{"referenceID": 6, "context": "First, the certain Bayesian network definition with prior fuzzy certainties values, second fuzzy certain nodes and values are transformed into a set of uncertain classical propositions with fuzzy necessities to construct another structure called local knowledge base defined in each standard form in [9] and [10] by means of tow rules.", "startOffset": 300, "endOffset": 303}, {"referenceID": 7, "context": "First, the certain Bayesian network definition with prior fuzzy certainties values, second fuzzy certain nodes and values are transformed into a set of uncertain classical propositions with fuzzy necessities to construct another structure called local knowledge base defined in each standard form in [9] and [10] by means of tow rules.", "startOffset": 308, "endOffset": 312}, {"referenceID": 1, "context": "The main idea of our modeling system of uncertain and imprecise knowledge is inspired from [3] where the authors have extended Dubois and Prade's [2] definition about the possibility and necessity measures of classical propositions to the case of", "startOffset": 91, "endOffset": 94}, {"referenceID": 0, "context": "fuzzy propositions through fuzzy truth values [1].", "startOffset": 46, "endOffset": 49}, {"referenceID": 1, "context": "A classical proposition is true in some possible worlds and false in the rest of possible worlds, while a fuzzy proposition Þ is true with respect to a possible world to a degree [3].", "startOffset": 179, "endOffset": 182}, {"referenceID": 0, "context": "More formally, we consider that each necessity degree associated to a propositional formula Þ is a fuzzy number mapping from an interval [β1,β2]⊆ [0 , 1] to [0 , 1] where [β1, β2] is given by expert.", "startOffset": 146, "endOffset": 153}, {"referenceID": 0, "context": "More formally, we consider that each necessity degree associated to a propositional formula Þ is a fuzzy number mapping from an interval [β1,β2]⊆ [0 , 1] to [0 , 1] where [β1, β2] is given by expert.", "startOffset": 157, "endOffset": 164}, {"referenceID": 0, "context": "μ : [β1, β2] [0 1] (1) χ1 μ (χ1)", "startOffset": 13, "endOffset": 18}, {"referenceID": 3, "context": "This function describes the degree to which a certain statement is true [6].", "startOffset": 72, "endOffset": 75}, {"referenceID": 0, "context": "Otherwise, the membership function for a fuzzy set Â could be: μÂ : X → [0, 1] And μÂ(x) is interpreted as the degree of membership of element x in fuzzy set Â for each x∈ X.", "startOffset": 72, "endOffset": 78}, {"referenceID": 2, "context": "Possibilistic logic Possibilistic logic [4] is logic of uncertainty to reason with classical propositions under incomplete information and partially inconsistent knowledge.", "startOffset": 40, "endOffset": 43}, {"referenceID": 0, "context": "Formulas of the necessity-valued fragment of possibilistic logic are of the form (φ,α) where φ is a classical (propositional or first-order) formula and α ∈[0,1] is understood as a lower bound for the necessity degree ofφ.", "startOffset": 156, "endOffset": 161}, {"referenceID": 6, "context": "interpretations where p is true {ω | ω p}) [9].", "startOffset": 43, "endOffset": 46}, {"referenceID": 0, "context": "1 Fuzzy Possibility and fuzzy Certainty distributions The basic element of possibility theory is the possibility distribution Π which is a mapping from Ω to the interval [0,1].", "startOffset": 170, "endOffset": 175}, {"referenceID": 0, "context": "Π : Ω [0 1] (2) ω π(ω)", "startOffset": 6, "endOffset": 11}, {"referenceID": 4, "context": "[7].", "startOffset": 0, "endOffset": 3}, {"referenceID": 1, "context": "μ∏(p) can be viewed as the possibility measure of a set of possible worlds in which the truth degree of p is equivalent to t [3], i.", "startOffset": 125, "endOffset": 128}, {"referenceID": 10, "context": "We have [13]:", "startOffset": 8, "endOffset": 12}, {"referenceID": 1, "context": "Based on [3], we can define our fuzzy necessity as follow:", "startOffset": 9, "endOffset": 12}, {"referenceID": 0, "context": "possibilistic formula) is a pair (φ, α) where φ is a classical first-order closed formula and α ∈ [0,1] is a positive number.", "startOffset": 98, "endOffset": 103}, {"referenceID": 6, "context": "where parents(Ai) is the set of parents of variable Ai, which is made as small as certain by exploiting conditional independencies of the type indicated above [9] and [10].", "startOffset": 159, "endOffset": 162}, {"referenceID": 7, "context": "where parents(Ai) is the set of parents of variable Ai, which is made as small as certain by exploiting conditional independencies of the type indicated above [9] and [10].", "startOffset": 167, "endOffset": 171}, {"referenceID": 6, "context": "We give next some definitions inspired from [9] and [10].", "startOffset": 44, "endOffset": 47}, {"referenceID": 7, "context": "We give next some definitions inspired from [9] and [10].", "startOffset": 52, "endOffset": 56}, {"referenceID": 6, "context": "Based o the results obtained in [9], we can check in our case that it is possible to recover conditional necessities from ∑A according to equations (17).", "startOffset": 32, "endOffset": 35}, {"referenceID": 8, "context": "CBN based on fuzzy necessity distribution Logical formulae with a weight strictly greater than a given levels (lower bounds of necessity degrees) are immune to inconsistency and can be safely used in deductive reasoning [11].", "startOffset": 220, "endOffset": 224}, {"referenceID": 9, "context": "A Bayesian network for metastatic cancer[12]", "startOffset": 40, "endOffset": 44}, {"referenceID": 0, "context": "For instance: C ∈ [0, 1] represents the dichotomy between having a brain tumor and not having one, c denotes the assertion C = 1 or “Brain tumor is present”, and ¬c is the negation of c, namely, C =0.", "startOffset": 18, "endOffset": 24}, {"referenceID": 0, "context": "μ : [β1, β2] [0 1] (18) χ μ (χ)", "startOffset": 13, "endOffset": 18}], "year": 2006, "abstractText": "In this paper, we are trying to examine trade offs between fuzzy logic and certain Bayesian networks and we propose to combine their respective advantages into fuzzy certain Bayesian networks (FCBN), a certain Bayesian networks of fuzzy random variables. This paper deals with different definitions and classifications of uncertainty, sources of uncertainty, and theories and methodologies presented to deal with uncertainty. Fuzzification of crisp certainty degrees to fuzzy variables improves the quality of the network and tends to bring smoothness and robustness in the network performance. The aim is to provide a new approach for decision under uncertainty that combines three methodologies: Bayesian networks certainty distribution and fuzzy logic. Within the framework proposed in this paper, we address the issue of extending the certain networks to a fuzzy certain networks in order to cope with a vagueness and limitations of existing models for decision under imprecise and uncertain knowledge", "creator": "PDFCREATOR Version 0.8.0"}}}