{"id": "1301.2306", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jan-2013", "title": "A Mixed Graphical Model for Rhythmic Parsing", "abstract": "olaya A method is presented confluence for carpi the stringed rhythmic fatwa parsing problem: Given a ganassi sequence oquist of 7:27 observed cordic musical note 4.700 onset dendy times, we point-like estimate n.l. the massieu corresponding notated rhythm clomiphene and non-fifa tempo process. burros A graphical model roslyn is pontin developed 2113 that represents rivergate the simultaneous evolution cloakrooms of tempo giamatti and rhythm boxmoor and relates arratia these becke hidden quantities to zaborowski observations. scheers The shtml rhythm slavish variables are discrete and the tempo tarn and hereafter observation palia variables are tmk continuous. We masterful show thread how to compute stockbridge the sylvers globally most comalcalco likely fulton configuration tuxtepec of the tempo gisborough and rhythm booby-trapped variables given an vasundhara observation hofheinz of note 101.08 onset (915) times. Preliminary pascarella experiments are presented soybeans on orseno a small data argobba set. A anani generalization 32,292 to arbitrary conditional 48.47 Gaussian distributions is 5,846 outlined.", "histories": [["v1", "Thu, 10 Jan 2013 16:26:12 GMT  (1287kb)", "http://arxiv.org/abs/1301.2306v1", "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)"]], "COMMENTS": "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)", "reviews": [], "SUBJECTS": "cs.AI cs.SD", "authors": ["christopher s raphael"], "accepted": false, "id": "1301.2306"}, "pdf": {"name": "1301.2306.pdf", "metadata": {"source": "CRF", "title": "A Mixed Graphical Model for Rhythmic Parsing", "authors": ["Christopher Raphael"], "emails": ["raphael@math.umass.edu"], "sections": null, "references": [], "referenceMentions": [], "year": 2011, "abstractText": "A method is presented for the rhythmic pars­<lb>ing problem: Given a sequence of observed<lb>musical note onset times, we simultaneously<lb>estimate the corresponding notated rhythm<lb>and tempo process. A graphical model is<lb>developed that<lb>represents the evolution of<lb>tempo and rhythm and relates these hid­<lb>den quantities to an observable performance.<lb>The rhythm variables are discrete and the<lb>tempo and observation variables are contin­<lb>uous. We show how to compute the<lb>glob­<lb>ally most likely configuration of the tempo<lb>and rhythm variables given an observation of<lb>note onset times. Preliminary experiments<lb>are presented on a small data set. A gen­<lb>eralization to computing MAP estimates for<lb>arbitrary conditional Gaussian distributions<lb>is outlined.", "creator": "pdftk 1.41 - www.pdftk.com"}}}