{"id": "1301.2297", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jan-2013", "title": "A Case Study in Knowledge Discovery and Elicitation in an Intelligent Tutoring Application", "abstract": "Most tankini successful acum Bayesian encephalopathies network (agjobs BN) punster applications to califano datehave been offseason built chotanagpur through knowledge elicitation from experts. mayorships This is quatro difficult metering and ancher time consuming, trave which has oneda lead liangjiang to recentinterest in automated 12.06 methods timah for learning BNs from falgun data. We present subalgebra a 2,912 case study in the construction magaw of airconditioning a BN in millie anintelligent east-european tutoring application, cincinnatian specifically kyuma decimal misconceptions. 475-221 Wedescribe the fwg BN 1,529 construction using 河東 expert gąbin elicitation and then 55-mph investigate how certainexisting automated kandī knowledge fiza discovery gorleston methods overclocking might pasaban support proscription the 35.67 BN knowledge spezza engineering animacy process.", "histories": [["v1", "Thu, 10 Jan 2013 16:25:34 GMT  (1123kb)", "http://arxiv.org/abs/1301.2297v1", "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)"]], "COMMENTS": "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["ann nicholson", "tal boneh", "tim wilkin", "kaye stacey", "liz sonenberg", "vicki steinle"], "accepted": false, "id": "1301.2297"}, "pdf": {"name": "1301.2297.pdf", "metadata": {"source": "CRF", "title": "A Case Study in Knowledge Discovery and Elicitation in an Intelligent Tutoring Application", "authors": ["Ann Nicholson", "Tal Bonehf", "Tim Wilkinf", "Kaye Stacey", "Liz Sonenberg", "Vicki Steinlell"], "emails": [], "sections": null, "references": [], "referenceMentions": [], "year": 2011, "abstractText": "Most successful Bayesian network (BN) ap­ plications to date have been built through knowledge elicitation from experts. This is difficult and time consuming, which has lead to recent interest in automated methods for learning BNs from data. We present a case study in the construction of a BN in an intel­ ligent tutoring application, specifically dec­ imal misconceptions. We describe the BN construction using expert elicitation and then investigate how certain existing automated knowledge discovery methods might support the BN knowledge engineering process.", "creator": "pdftk 1.41 - www.pdftk.com"}}}