{"id": "1301.2301", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jan-2013", "title": "Sufficiency, Separability and Temporal Probabilistic Models", "abstract": "visva Suppose we are given ballynahinch the conditional probability unpoliced of neurosky one galotti variable given leaming some other dmitar variables. quijano Normally chely the full joint puncturella distribution smyrnis over the vpg conditioning ginwala variablesis guiren required finklea to templin determine 32-draw the llenas probability of the panlungsod conditioned schulenburg variable. Under coregency what circumstances are the marginal distributions over the conditioning variables sufficient ondina to determine the probability methone ofthe suntimes.com conditioned variable? chauncey Sufficiency kazimieras in antenen this cincture sense mazzante is 607,000 equivalent 61.76 to zampieri additive separability tradicionales ofthe conditional liyang probability c.e. distribution. ivashov Such gesticulations separability amares structure is crosslinking natural 43.76 and hoar can worlders be exploited forefficient two-door inference. 1,554 Separability has a golden-winged natural generalization to conditional anberlin separability. Separability provides carteles a daher precise grebel notion tekel of extinctions weaklyinteracting subsystems shalal in olusegun temporal drillships probabilistic boothville models. juren Given contursi a system sabak that is decomposed hillers into separable burrata subsystems, sansern exactmarginal probabilities over subsystems hallahan at future führerbunker points collège in time can centaurus becomputed by gavrilenkov propagating jamma marginal subsystem resolvable probabilities, rather chowed thancomplete pummeling system joint probabilities. Thus, separability can make n.t. exact hamidah prediction tractable. However, observations harrie can topological break chlordiazepoxide separability, creede so exact mtp02 monitoring of coccineus dynamic gifs systems infant remains hard.", "histories": [["v1", "Thu, 10 Jan 2013 16:25:51 GMT  (1066kb)", "http://arxiv.org/abs/1301.2301v1", "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)"]], "COMMENTS": "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["avi pfeffer"], "accepted": false, "id": "1301.2301"}, "pdf": {"name": "1301.2301.pdf", "metadata": {"source": "CRF", "title": "Sufficiency, Separability and Temporal Probabilistic Models", "authors": ["Avi Pfeffer"], "emails": ["avi@eecs.harvard.edu"], "sections": null, "references": [{"title": "Context-specific indepen­ dence in Bayesian networks", "author": ["C. Boutilier", "N. Friedman", "M. Goldszrnidt", "D. Koller"], "venue": "In UAI,", "citeRegEx": "Boutilier et al\\.,? \\Q1996\\E", "shortCiteRegEx": "Boutilier et al\\.", "year": 1996}, {"title": "Tractable infer­ ence for complex stochastic processes", "author": ["X. Boyen", "D. Koller"], "venue": "In UAI,", "citeRegEx": "Boyen and Koller.,? \\Q1998\\E", "shortCiteRegEx": "Boyen and Koller.", "year": 1998}, {"title": "Exploiting the architecture of dynamic systems", "author": ["X. Boyen", "D. Koller"], "venue": "In AAAI,", "citeRegEx": "Boyen and Koller.,? \\Q1999\\E", "shortCiteRegEx": "Boyen and Koller.", "year": 1999}, {"title": "Pfef­ fer. Structured representation of complex stochastic systems", "author": ["N. Friedman", "D. Koller"], "venue": "In AAAI,", "citeRegEx": "Friedman et al\\.,? \\Q1998\\E", "shortCiteRegEx": "Friedman et al\\.", "year": 1998}, {"title": "A new look at causal independence", "author": ["D. Heckerman", "J.S. Breese"], "venue": "Technical report, Microsoft Research MSR-TR-94-08,", "citeRegEx": "Heckerman and Breese.,? \\Q1994\\E", "shortCiteRegEx": "Heckerman and Breese.", "year": 1994}, {"title": "Probabilistic partial evaluation: Exploiting rule structure in probabilistic inference", "author": ["D. Poole"], "venue": "In IJCAI,", "citeRegEx": "Poole.,? \\Q1997\\E", "shortCiteRegEx": "Poole.", "year": 1997}, {"title": "Fundamental concepts of qualitative probabilistic networks", "author": ["M. Wellman"], "venue": "Artifi­ cial Intelligence,", "citeRegEx": "Wellman.,? \\Q1990\\E", "shortCiteRegEx": "Wellman.", "year": 1990}, {"title": "On the role of context-specific independence in proba­ bilistic reasoning", "author": ["N.L. Zhang", "D. Poole"], "venue": "In IJCAI,", "citeRegEx": "Zhang and Poole.,? \\Q1999\\E", "shortCiteRegEx": "Zhang and Poole.", "year": 1999}], "referenceMentions": [], "year": 2011, "abstractText": "Suppose we are given the conditional proba­ bility of one variable given some other vari­ ables. Normally the full joint distribution over the conditioning variables is required to determine the probability of the conditioned variable. Under what circumstances are the marginal distributions over the conditioning variables sufficient to determine the probabil­ ity of the conditioned variable? Sufficiency in this sense is equivalent to additive separa­ bility of the conditional probability distribu­ tion. Such separability structure is natural and can be exploited for efficient inference. Separability has a natural generalization to conditional separability. Separability provides a precise notion of hi­ erarchical decomposition in temporal prob­ abilistic models. Given a system that is decomposed into separable subsystems, ex­ act marginal probabilities over subsystems at future points in time can be computed by propagating marginal subsystem probabil­ ities, rather than complete system joint prob­ abilities. Thus, separability can make exact prediction tractable. However, observations can break separability, so exact monitoring of dynamic systems remains hard.", "creator": "pdftk 1.41 - www.pdftk.com"}}}