{"id": "1301.2277", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jan-2013", "title": "A Clustering Approach to Solving Large Stochastic Matching Problems", "abstract": "dhalee In iweb this work we shudder focus gigantoraptor on mihailo efficient margaux heuristics for solving talovic a class shuang of 51.64 stochastic gladrags planning problems inniskeen that arise late-medieval in a thugs variety 1-of-10 of business, investment, sisisky and industrial applications. inskip The anti-lock problem is pensively best middle-aged described in cues terms of pesa future buy badsha and donofrio sell contracts. By begrudges buying amia less lyudi reliable, re-enacted but less expensive, buy (supply) contracts, a company kv or fatso a akwa trader subequal can 2,804 cover jaovisidha a butterworth position cereceda of more reliable and domovchiyski more expensive 45.13 sell ucmp contracts. spasskaya The goal pioneerof is dilemmas to three-lobed maximize oligosaccharides the expected jullien net gain (kva profit) by constructing a dose chernetsky to 117.68 optimum portfolio out hekmati of kittleson the available hairlessness buy and sell contracts. jarosik This stochastic land-owning planning nalgene problem ff can previewed be formulated as a two - swanberg stage linköpings stochastic animal-like linear programming problem all-rounders with batiste recourse. moroccan However, macinnes this formalization leads to solutions 60.81 that translit. are exponential vegetation in the 76.89 number of dlls possible witzenhausen failure combinations. Thus, lump-sum this approach is not feasible izapa for large chaulk scale atilla problems. In this ponchartrain work wolfe we parcell investigate heuristic caprolactam approximation techniques relegation-threatened alleviating swan the smithing efficiency idrisov problem. vsmpo We salma primarily focus reinemund on nosegay the cict clustering π1 approach boruchowitz and devise leader-post heuristics for euro539 finding clusterings leading 1937-45 to lanceolata good dumbuya approximations. We 30n illustrate the freetime quality carboxyhemoglobin and buddies feasibility of the 332.7 approach nine-foot through experimental d'amelio data.", "histories": [["v1", "Thu, 10 Jan 2013 16:24:06 GMT  (885kb)", "http://arxiv.org/abs/1301.2277v1", "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)"]], "COMMENTS": "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)", "reviews": [], "SUBJECTS": "cs.AI cs.DS", "authors": ["milos hauskrecht", "eli upfal"], "accepted": false, "id": "1301.2277"}, "pdf": {"name": "1301.2277.pdf", "metadata": {"source": "CRF", "title": "A Clustering Approach to Solving Large Stochastic Matching Problems", "authors": ["Milos Hauskrecht", "Eli Upfal"], "emails": ["milos@cs.pitt.", "eli@cs.brown.edu"], "sections": null, "references": [{"title": "Introduction to Stochastic Programming", "author": ["John R. Birge", "Francois Louveaux"], "venue": null, "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1997}, {"title": "Decision-theoretic planning: Structural assumptions and computational leverage", "author": ["Craig Boutilier", "Thomas Dean", "Steve Hanks"], "venue": "Artificial Intelligence,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 1999}], "referenceMentions": [{"referenceID": 0, "context": "The problem can be formu­ lated as a two stage stochastic programm ing problem with recourse [4, 1].", "startOffset": 93, "endOffset": 99}, {"referenceID": 1, "context": "There has been extensive research in AI in recent years on solving stochastic planning problems with large ac­ tion and state spaces and variety of techniques for re­ ducing the complexity (typically exponential in the num­ ber of components) of these problems have been proposed [3, 7, 6, 5, 9, 12, 2, 11].", "startOffset": 280, "endOffset": 306}, {"referenceID": 0, "context": "[1]):", "startOffset": 0, "endOffset": 3}, {"referenceID": 0, "context": "For a survey of appli­ cable techniques see [1].", "startOffset": 44, "endOffset": 47}], "year": 2011, "abstractText": "In this work we focus on efficient heuristics for solving a class of stochastic planning problems that arise in a variety of business, investment, and industrial applications. The problem is best de­ scribed in terms of future buy and sell contracts. By buying less reliable, but less expensive, buy (supply) contracts, a company or a trader can cover a position of more reliable and more expen­ sive sell contracts. The goal is to maximize the expected net gain (profit) by constructing a close to optimum portfolio out of the available buy and sell contracts. This stochastic planning problem can be formulated as a two-stage stochastic linear programm ing problem with recourse. However, this formalization leads to solutions that are ex­ ponential in the number of possible failure com­ binations. Thus, this approach is not feasible for large scale problems. In this work we investi­ gate heuristic approximation techniques alleviat­ ing the efficiency problem. We primarily focus on the clustering approach and devise heuristics for finding clusterings leading to good approxi­ mations. We illustrate the quality and feasibility of the approach through experimental data.", "creator": "pdftk 1.41 - www.pdftk.com"}}}