{"id": "1301.2295", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jan-2013", "title": "Recognition Networks for Approximate Inference in BN20 Networks", "abstract": "goodwyn We propose bialystock using nichimen recognition networks nimzowitsch for woodgate approximate inference u-10 inBayesian daito networks (garnica BNs ). A m43 recognition burillo network hmong is a shireman multilayerperception (mortiz MLP) trained polita to jaxon predict balding posterior dohyō marginals given observedevidence sops in 60-39 a curtilage particular cómo BN. The input to frontals the skygazers MLP mersey is a bruny vector of majel thestates scavenges of scenographic the evidential nodes. knee-length The take-down activity of an output unit gages isinterpreted monkeys as dealbreakers a 100,000-dollar prediction of the alminova posterior habaniya marginal year.the of thecorresponding adverbs variable. dance-like The MLP chah-e is trained using tavlaridis samples generated parvis fromthe corresponding BN. gheorghiu We director-general evaluate sisno a recognition 88.96 network millwork that was dhawalagiri trained to bachi do inference ina large autori Bayesian 1-41 network, similar eyewitness in structure and steffans complexity nphc to theQuick Medical grafenwöhr Reference, 84.45 Decision ripstop Theoretic (rotted QMR - DT ). wittingly Our 1.166 networkis lto a arian binary, moneyer two - abdullaev layer, noisy - abkhaz OR heidorn network 18.6-mile containing over marinovic 4000 potentially haiqiang observable nodes and over tulis 600 unobservable, hidden 2,594 nodes. Inreal medical re-chartered diagnosis, keppoch most bluma observables are unavailable, cát and hamrun there bordelais isa complex catling and then-attorney unknown kajaani bias that selects which tulipa ones are tingler provided. nuncios Weincorporate a very visar basic type of sulaiman selection bias ascheberg in our network: a gigha knownpreference that diluting available bettye observables weylandt are xinpeng positive dyanne rather suchlicki than pallomari negative. Even this simple bias garcon has plesiomorphic a significant effect designers on triangle the etana posterior. We 11:49 compare mufulira the khabra performance of anti-smuggling our recognition network tostate - lavochkin of - the - art kutler approximate inference algorithms on geoghegan a whithouse large set oftest fulong cases. pachulski In sakir order to al-saffar evaluate the farabundo effect sebastes of our simplistic modelof mots the sipaliwini selection meditators bias, dekaser we macadamias evaluate kenyan-born algorithms using a variety n.b.a. ofincorrectly jaziri modeled infrageneric observation biases. Recognition linguists networks presumable performwell cemal using fateh both ahavath correct myrtle and incorrect observation mp3s biases.", "histories": [["v1", "Thu, 10 Jan 2013 16:25:25 GMT  (888kb)", "http://arxiv.org/abs/1301.2295v1", "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)"]], "COMMENTS": "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["quaid morris"], "accepted": false, "id": "1301.2295"}, "pdf": {"name": "1301.2295.pdf", "metadata": {"source": "CRF", "title": "Recognition Networks for Approximate Inference in BN20 Networks", "authors": ["Quaid Morris"], "emails": ["quaid@gatsby.ucl.ac.uk"], "sections": null, "references": [{"title": "AIS-BN: An adaptive importance sampling algorithm for evidential reasoning in large Bayesian networks", "author": ["Cheng", "Druzdzel", "J. 2000] Cheng", "M.J. Druzdzel"], "venue": "Journal of Artificial Intelligence Research,", "citeRegEx": "Cheng et al\\.,? \\Q2000\\E", "shortCiteRegEx": "Cheng et al\\.", "year": 2000}, {"title": "Sequentially fitting \"in­ clusive\" trees for inference in noisy-OR networks", "author": ["Frey et al", "B.J. 2001] Frey", "R. Patrascu", "T.S. Jaakkola", "J. Moran"], "venue": "In Advances in Neural Information Processing Sys­ tems,", "citeRegEx": "al. et al\\.,? \\Q2001\\E", "shortCiteRegEx": "al. et al\\.", "year": 2001}, {"title": "Prob­ abilistic diagnosis using a reformulation of the INTERNIST-1/QMR knowledge base: II. Evalua­", "author": ["Middleton et al", "B. 1991] Middleton", "M.A. Shwe", "D.E. Beckerman", "M. Henrion", "E.J. Horvitz", "H.P. Lehmann", "G.F. Cooper"], "venue": null, "citeRegEx": "al. et al\\.,? \\Q1991\\E", "shortCiteRegEx": "al. et al\\.", "year": 1991}], "referenceMentions": [], "year": 2011, "abstractText": "A recognition network is a multilayer per­ ception (MLP) trained to predict posterior marginals given observed evidence in a par­ ticular Bayesian network. The input to the MLP is a vector of the states of the eviden­ tial nodes. The activity of an output unit is interpreted as a prediction of the posterior marginal of the corresponding variable. The MLP is trained using samples generated from the corresponding Bayesian network. We evaluate a recognition network that was trained to do inference in a large Bayesian network, similar in structure and complex­ ity to the Quick Medical Reference, Decision Theoretic (QMR-DT) network. Our network is a binary, two-layer, noisy-OR (BN20) net­ work containing over 4000 potentially observ­ able nodes and over 600 unobservable, hidden nodes. In real medical diagnosis, most ob­ servables are unavailable, and there is a com­ plex and unknown process that selects which ones are provided. We incorporate a very ba­ sic type of selection bias in our network: a known preference that available observables are positive rather than negative. Even this simple bias has a significant effect on the pos­ terior. We compare the performance of our recogni­ tion network to state-of-the-art approximate inference algorithms on a large set of test cases. In order to evaluate the effect of our simplistic model of the selection bias, we eval­ uate algorithms using a variety of incorrectly modelled selection biases. Recognition net­ works perform well using both correct and incorrect selection biases. • also affiliated with Department of Brain and Cogni­ tive Sciences at MIT", "creator": "pdftk 1.41 - www.pdftk.com"}}}