{"id": "1301.2312", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "10-Jan-2013", "title": "Causal Discovery from Changes", "abstract": "polebrook We bd1 propose 2,525 a hnida new method of ingrida discovering trance-like causal mcgavock structures, sloe based on prematch the cyrix detection zigli of local, fpi spontaneous kirkby-in-ashfield changes in riderless the 1969/70 underlying data - generating model. We analyze the classes of counterbalance structures 68-66 that www.nbc.com are equivalent relative traversing to a rfe1 stream of distributions produced 167 by goga local changes, and dinaburg devise bäckman algorithms kokolo that peformances output sakia graphical lect representations of these 4.27 equivalence classes. scm We present millbrook experimental results, shannxi using wrap-up simulated posadnik data, and methodios examine backhouse the errors macaque associated schulich with detection of hornberger changes swcc and ctbt recovery of structures.", "histories": [["v1", "Thu, 10 Jan 2013 16:26:39 GMT  (1372kb)", "http://arxiv.org/abs/1301.2312v1", "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)"]], "COMMENTS": "Appears in Proceedings of the Seventeenth Conference on Uncertainty in Artificial Intelligence (UAI2001)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["jin tian", "judea pearl"], "accepted": false, "id": "1301.2312"}, "pdf": {"name": "1301.2312.pdf", "metadata": {"source": "CRF", "title": "Causal Discovery from Changes", "authors": ["Jin Tian"], "emails": ["@cs."], "sections": null, "references": [], "referenceMentions": [], "year": 2011, "abstractText": "We propose a new method of discovering causal structures, based on the detection of local, spontaneous changes in the un­ derlying data-generating model. We ana­ lyze the classes of structures that are equiv­ alent relative to a stream of distributions produced by local changes, and devise algo­ rithms that output graphical representations of these equivalence classes. We present ex­ perimental results, using simulated data, and examine the errors associated with detection of changes and recovery of structures.", "creator": "pdftk 1.41 - www.pdftk.com"}}}