{"id": "1302.6816", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Feb-2013", "title": "A Decision-Based View of Causality", "abstract": "sleepwalk Most huaman traditional yashida models shooter of wna uncertainty begović have precipice focused on the caryocolum associational relationship ra5 among variables as captured by sdn conditional dependence. vrch In order to klinkert successfully manage ajaye intelligent systems budinger for decision making, vaillancourt however, antidote we must be able to predict 104-95 the alanson effects of actions. wuhai In this paper, we attempt ausonia to unite caylee two mmol/l branches of research tajikistan that gillikin address such haslemere predictions: inform causal akahoshi modeling 128.7 and decision analysis. 3,488 First, we sneaky provide a honeymoons definition sammes of causal bucaram dependence in athabascan decision - keyboardists analytic mourns terms, which hardware-based we derive from akwasi consequences lispector of causal topklasse dependence cited long-eared in the literature. Using qb1 this definition, willaumez we show bridgeheads how spider-like causal mondadori dependence nuestras can be albo represented yers within an lorimer influence 1,472 diagram. liturgics In ticonderoga particular, veissiere we reidar identify two inadequacies avantis of an ordinary naville influence diagram as sapphire a falaschi representation 28.33 for drove cause. bungaku We danderyd introduce a special d'etre class of discectomy influence vlaicu diagrams, jasdaq called causal schabel influence loadout diagrams, tratan which plumpton corrects leonova one of these problems, and 11-july identify drogin situations where kasprzyk the 1969/70 other siradze inadequacy 1958-1962 can beitrag be 313.4 eliminated. seekers In addition, we describe honganji the mutiara relationships gardena between Howard (305) Canonical Form +.12 and claras existing chaat graphical representations of bestow cause.", "histories": [["v1", "Wed, 27 Feb 2013 14:16:56 GMT  (1126kb)", "http://arxiv.org/abs/1302.6816v1", "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)"], ["v2", "Sat, 16 May 2015 23:48:17 GMT  (161kb)", "http://arxiv.org/abs/1302.6816v2", "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)"]], "COMMENTS": "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["david heckerman", "ross d shachter"], "accepted": false, "id": "1302.6816"}, "pdf": {"name": "1302.6816.pdf", "metadata": {"source": "CRF", "title": "A Decision-Based View of Causality", "authors": ["David Heckerman"], "emails": ["heckerma@microsoft", "shachter@camis.stanford.edu"], "sections": null, "references": [{"title": "Decision Analysis, EES231 Course Notes. Department of Engineering­", "author": ["Howard", "R. 1994] Howard"], "venue": "Economic Systems,", "citeRegEx": "Howard and Howard,? \\Q1994\\E", "shortCiteRegEx": "Howard and Howard", "year": 1994}, {"title": "In Readings on the Principles and Appli­ cations of Decision Analysis, volume II, pages 721762", "author": ["Howard", "Matheson", "R. 1981] Howard", "J. Math­ eson"], "venue": "Strategic Decisions Group,", "citeRegEx": "Howard et al\\.,? \\Q1981\\E", "shortCiteRegEx": "Howard et al\\.", "year": 1981}], "referenceMentions": [], "year": 2011, "abstractText": "Most traditional models of uncertainty have focused on the associational relationship among variables as captured by conditional dependence. In order to successfully man­ age intelligent systems for decision making, however, we must be able to predict the ef­ fects of actions. In this paper, we attempt to unite two branches of research that address such predictions: causal modeling and deci­ sion analysis. First, we provide a definition of causal dependence in decision-analytic terms, which we derive from consequences of causal dependence cited in the literature. Using this definition , we show how causal depen­ dence can be represented within an influence diagram. In particular, we identify two in­ adequacies of an ordinary influence diagram as a representation for cause. We introduce a special class of influence diagrams, called causal influence diagrams, which corrects one of these problems, and identify situations where the other inadequacy can be elimi­ nated. In addition, we describe the relation­ ships between Howard Canonical Form and existing graphical representations of cause.", "creator": "pdftk 1.41 - www.pdftk.com"}}}