{"id": "1302.1558", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Feb-2013", "title": "Computational Advantages of Relevance Reasoning in Bayesian Belief Networks", "abstract": "lefevere This myelodysplastic paper pissed introduces frankham a shamila computational framework for terrance reasoning in modaresi Bayesian zaranj belief networks that derives significant advantages from focused maternus inference and relevance llewyn reasoning. This toiyabe framework gedgersglobe.com is mattea based on d - bilkent separation plentifully and other gunilla simple and abraded computationally efficient ,570 techniques guanling for 208.3 pruning irrelevant emley parts wbgu of escalon a network. Our main throwdown contribution 2:02 is a fayum technique jpod that controla we call relevance - momix based backhaus decomposition. Relevance - gentiana based decomposition approaches baccalauréat belief updating capito in turhapuro large keyboard networks by focusing on giggly their witharanage parts townhill and decomposing allier them prk into apprentice partially overlapping subnetworks. oyebola This chiloquin makes 38.93 reasoning word-for-word in some tarso intractable macaria networks billboards possible and, in dullsville addition, often 3-million results in hik significant kuchins speedup, sintering as the total cussin time taken to update all mirador subnetworks is exceptionalism in lüders practice often berganza considerably less wagonways than 43-percent the naypyidaw time taken to update the machrihanish network as a whole. aglow We żeligowski report results zadkiel of empirical tests gardening that demonstrate wairau practical nyange significance audel of sederot our clt approach.", "histories": [["v1", "Wed, 6 Feb 2013 15:58:06 GMT  (1336kb)", "http://arxiv.org/abs/1302.1558v1", "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)"]], "COMMENTS": "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["yan lin", "marek j druzdzel"], "accepted": false, "id": "1302.1558"}, "pdf": {"name": "1302.1558.pdf", "metadata": {"source": "CRF", "title": "Computational Advantages of Relevance Reasoning in Bayesian Belief Networks", "authors": ["Yan Lin", "Marek J. Druzdzel"], "emails": ["yan@isp.pitt.", "marek@sis."], "sections": null, "references": [{"title": "The com­ putational complexity of probabilistic inference us­ ing Bayesian belief networks. A rtificial Intelligence", "author": ["Cooper", "1990] Cooper", "Gregory F"], "venue": null, "citeRegEx": "Cooper et al\\.,? \\Q1990\\E", "shortCiteRegEx": "Cooper et al\\.", "year": 1990}, {"title": "Pradhan e t a", "author": ["Malcolm Pradhan", "Gregory Provan", "Blackford Middleton", "Max Henrion"], "venue": "Proceedings of the Tenth A nnual Confer­ ence. on Un cert ainty in Artificial Int elligence (U A l-", "citeRegEx": "Pradhan et al\\.,? \\Q1994\\E", "shortCiteRegEx": "Pradhan et al\\.", "year": 1994}, {"title": "198'6", "author": ["Shachter", "Ross D"], "venue": "Evaluating influence diagrams. Opera tions Re.search :34(6) :87", "citeRegEx": "Shachter . 1 986", "shortCiteRegEx": null, "year": 1882}], "referenceMentions": [{"referenceID": 1, "context": "[Pradhan et al., 1994] .", "startOffset": 0, "endOffset": 22}], "year": 2011, "abstractText": "This paper introduces a computational framework for reasoning in Bayesian belief networks that derives significant advantages from focused inference and relevance reason­ ing. This framework is based on d-separation and other simple and computationally effi­ cient techniques for pruning irrelevant parts of a network. Our main contribution is a technique that we call relevance-based decom­ position. Relevance-based decomposition ap­ proaches belief updating in large networks by focusing on their parts and decompos­ ing them into partially overlapping subnet­ works. This makes reasoning in some in­ tractable networks possible and, in addition, often results in significant speedup, as the to­ tal time taken to update all subnetworks is in practice often considerably less than the time taken to update the network as a whole. We report results of empirical tests that demon­ strate practical significance of our approach.", "creator": "pdftk 1.41 - www.pdftk.com"}}}