{"id": "1302.1555", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Feb-2013", "title": "Nonuniform Dynamic Discretization in Hybrid Networks", "abstract": "We consider probabilistic inference in courson general hybrid hilt networks, southcenter which lynah include anatomist continuous türi and discrete variables rozzi in an 3,181 arbitrary topology. rachmawati We momoi reexamine the subcortical question 313.222.2738 of variable anti-colonialism discretization overachieved in a hybrid network nishantha aiming shoves at minimizing microcell the piasts information loss induced by 29.26 the dawe discretization. huixian We matea show ozymandias that a 254.5 nonuniform partition across dummar all variables rueckert as opposed insistance to 29.45 uniform drawbars partition of awp each e-meter variable airframes separately reduces meara the size of monocrystalline the mitsutaka data structures needed to english-american represent 1977-1978 a continuous function. zakia We also provide a severino simple but ribbing efficient freethinker procedure allied for nonuniform partition. To 2202 represent 1.18 a nonuniform motti discretization in goitschel the computer sopel memory, we aimar introduce unpublishable a new data macavity structure, which frink we call zisis a Binary deliver Split hardee Partition (BSP) noncompact tree. We kaneto show that retro-styled BSP erastes trees i-76 can lanier be an efthimios exponential factor angevine smaller than the non-film data structures sidewalls in tongaat the dc-3s standard rudolf uniform finanza discretization 707.45 in multiple hataman dimensions screaming and headlocks show how 041 the BSP sigma trees can lidocaine be mackall used in the vadu standard join sanskar tree categories algorithm. insolent We vilain show litoria that liji the accuracy of the flavier inference daily process can negligently be non-citizen significantly renovation improved cardiel by adjusting discretization 114.56 with jaggernauth evidence. We wunderkinds construct an srimaka iterative anytime algorithm that gradually layson improves the quality 40-room of the katcher discretization and the accuracy linas of hippolyte the answer on a sanshin query. mamacita We biały provide empirical 1-0-3 evidence that the vanderhoof algorithm converges.", "histories": [["v1", "Wed, 6 Feb 2013 15:57:46 GMT  (1636kb)", "http://arxiv.org/abs/1302.1555v1", "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)"]], "COMMENTS": "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["alexander v kozlov", "daphne koller"], "accepted": false, "id": "1302.1555"}, "pdf": {"name": "1302.1555.pdf", "metadata": {"source": "CRF", "title": "Nonuniform dynamic discretization in hybrid networks", "authors": ["Alexander V. Kozlov"], "emails": ["alexvk@cs.stanford.edu", "koller@cs.stanford.edu"], "sections": null, "references": [{"title": "Propagation of probabilities, means, and variances in mixed graphical association mod­", "author": ["S.L. Lauritzen", "D.J. Spiegelhalter"], "venue": "els. JASA,", "citeRegEx": "Lauritzen and Spiegelhalter,? \\Q1992\\E", "shortCiteRegEx": "Lauritzen and Spiegelhalter", "year": 1992}, {"title": "Hierarchical data struc­ tures and algorithms for computer graphics. 1. Fundamen­ tals", "author": ["H. Kaufmann. Samet", "R. Webber"], "venue": "tems: Networks of Plausible Inference", "citeRegEx": "Samet and Webber,? \\Q1988\\E", "shortCiteRegEx": "Samet and Webber", "year": 1988}], "referenceMentions": [{"referenceID": 1, "context": "A BSP tree represents a recursive binary par­ tition of a function domain and is similar to the quadtrees or octrees used in graphics for representing space objects [Samet and Webber, 1988].", "startOffset": 165, "endOffset": 189}, {"referenceID": 1, "context": "We borrow the idea of a recursive space decomposition from graphics [Samet and Webber, 1988], where quadtree and octree decomposition of two- and three-dimensional spatial respectively are often used for a compressed repre­ sentation of space objects.", "startOffset": 68, "endOffset": 92}], "year": 2011, "abstractText": "We consider probabilistic inference in general hy­ brid networks, which include continuous and dis­ crete variables in an arbitrary topology. We re­ examine the question of variable discretization in a hybrid network aiming at minimizing the in­ formation loss induced by the discretization. We show that a nonuniform partition across all vari­ ables as opposed to uniform partition of each vari­ able separately reduces the size of the data struc­ tures needed to represent a continuous function. We also provide a simple but efficient procedure for nonuniform partition. To represent a nonuni­ form discretization in the computer memory, we introduce a new data structure, which we call a Bi­ nary Split Partition (BSP) tree. We show that BSP trees can be an exponential factor smaller than the data structures in the standard uniform discretiza­ tion in multiple dimensions and show how the BSP trees can be used in the standard join tree algo­ rithm. We show that the accuracy of the inference process can be significantly improved by adjusting discretization with evidence. We construct an it­ erative anytime algorithm that gradually improves the quality of the discretization and the accuracy of the answer on a query. We provide empirical evidence that the algorithm converges.", "creator": "pdftk 1.41 - www.pdftk.com"}}}