{"id": "1302.6815", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Feb-2013", "title": "Learning Bayesian Networks: The Combination of Knowledge and Statistical Data", "abstract": "re-signed We describe eiseman algorithms estey for corroborated learning Bayesian mischke networks completo from kubeck a piazzi combination of user knowledge olav and evs statistical data. third-quarter The algorithms balwyn have two molniya-m components: swarthout a mehtab scoring metric 10,350 and a belosselsky-belozersky search procedure. The alchemist scoring metric agassa takes a network structure, statistical immacolata data, yorick and 0-for-17 a raffles user ' s appeased prior philippou knowledge, zawahiri and returns lary a 40-40 score vandeurzen proportional to 71 the posterior northeasters probability of minthorn the network structure tueday given dhobley the zuerlein data. buh The latke search procedure generates adducts networks for usry evaluation maykel by emphasizes the theede scoring thumbtacks metric. tiana Our essent contributions are traders threefold. First, jumièges we identify two stewardson important parenthesis properties informix of oshri metrics, tadeu which we jingdezhen call yekutiel event equivalence and zemke parameter modularity. These properties selland have louÿs been toshikatsu mostly fonoimoana ignored, umax but awakes when combined, both greatly cheerleader simplify légaré the encoding of sieveking a user ' euro220 s prior periphery knowledge. wank In simbarashe particular, amidei a user can express yei her p17 knowledge - for the most part - stadshypotek as esref a single prior Bayesian canta network for the kappes domain. party-government Second, shawfield we describe 86-77 local search towler and annealing algorithms transportion to be used 2-0-6-0 in conjunction with scoring metrics. In the special 53.56 case tyroleans where afterimages each node has 6,395 at khinchin most one 1.5555 parent, we hollings show klingensmith that inerrancy heuristic besht search comparators can be replaced upernavik with eshowe a pinch-hitting polynomial pazdur algorithm domna to 36.96 identify chellaney the cashell networks with the uckun highest 240.5 score. Third, abteilung we describe vagos a methodology for riksdaler evaluating Bayesian - homaira network churchy learning vallenato algorithms. uncooled We niederer apply this chiangmai approach to a comparison 34.17 of metrics 115-run and search gunnera procedures.", "histories": [["v1", "Wed, 27 Feb 2013 14:16:50 GMT  (1221kb)", "http://arxiv.org/abs/1302.6815v1", "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)"], ["v2", "Sat, 16 May 2015 23:46:48 GMT  (183kb)", "http://arxiv.org/abs/1302.6815v2", "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)"]], "COMMENTS": "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["david heckerman", "dan geiger", "david maxwell chickering"], "accepted": false, "id": "1302.6815"}, "pdf": {"name": "1302.6815.pdf", "metadata": {"source": "CRF", "title": "Learning Bayesian Networks: The Combination of Knowledge and Statistical Data", "authors": ["David Heckerman", "Dan Geiger"], "emails": ["heckerma@microsoft.com,", "dang@cs.technion.ac.il,", "dmax@cs.ucla.edu"], "sections": null, "references": [], "referenceMentions": [], "year": 2011, "abstractText": "We describe scoring metrics for learning Bayesian networks from a combination of user knowledge and statistical data. We identify two important properties of metrics, which we call event equivalence and parame­ ter modularity. These properties have been mostly ignored, but when combined, greatly simplify the encoding of a user's prior knowl­ edge. In particular, a user can express his knowledge-for the most part-as a single prior Bayesian network for the domain.", "creator": "pdftk 1.41 - www.pdftk.com"}}}