{"id": "1302.1527", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Feb-2013", "title": "Structured Arc Reversal and Simulation of Dynamic Probabilistic Networks", "abstract": "peuples We merryn present an vajgl algorithm oyster for gudgeon arc reversal tytler in bharihoke Bayesian networks yanta with tree - harelip structured conditional non-serb probability tables, and consider some of +.12 its excavatum advantages, especially for exiled the freamunde simulation of armorlike dynamic ambassadorships probabilistic networks. In sirous particular, the method subtitling allows one uspsa to produce 30,250 CPTs for killigrew nodes backcheck involved in the reversal 1994-2002 that exploit 18.58 regularities casillas in the conditional carretero distributions. We 78-66 argue that this approach alleviates dornberger some cheiry of regularity the navigation overhead associated reyat with heptagonal arc poire reversal, plays an biocatalysis important gables role in evidence integration and 43-nation can be used iftu to zerihoun restrict sampling counterinsurgency of fadak variables in 17-15 DPNs. sann We gelowicz also provide aberrational an o.c.u. algorithm cauldron that moisan detects the al-qadir dynamic birdcages irrelevance humanist of state variables in forward simulation. gaelicised This yubileyny algorithm exploits burdeau the businesman structured koblin CPTs 2364 in nontraditional a endorsers reversed pullets network cowbells to 112.12 determine, newtie in blonder a kentuckian time - independent fashion, the conditions contrôle under which faboideae a di-pertua variable does or does carline not jaegerstaetter need to drucker be bébé sampled.", "histories": [["v1", "Wed, 6 Feb 2013 15:54:19 GMT  (1094kb)", "http://arxiv.org/abs/1302.1527v1", "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)"]], "COMMENTS": "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["adrian y w cheuk", "craig boutilier"], "accepted": false, "id": "1302.1527"}, "pdf": {"name": "1302.1527.pdf", "metadata": {"source": "CRF", "title": "Structured Arc Reversal and Simulation of Dynamic Probabilistic Networks", "authors": [], "emails": ["cheuk@cs.ubc.ca", "cebly@cs.ubc.ca"], "sections": null, "references": [], "referenceMentions": [], "year": 2011, "abstractText": "We present an algorithm for arc reversal in Bayesian networks with tree-structured condi­ tional probability tables, and consider some of its advantages, especially for the simulation of dy­ namic probabilistic networks. In particular, the method allows one to produce CPTs for nodes in­ volved in the reversal that exploit regularities in the conditional distributions. We argue that this approach alleviates some of the overhead asso­ ciated with arc reversal, plays an important role in evidence integration and can be used to re­ strict sampling of variables in DPNs. We also provide an algorithm that detects the dynamic ir­ relevance of state variables in forward simula­ tion. This algorithm exploits the structured CPTs in a reversed network to determine, in a time­ independent fashion, the conditions under which a variable does or does not need to be sampled.", "creator": "pdftk 1.41 - www.pdftk.com"}}}