{"id": "1302.1554", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Feb-2013", "title": "Object-Oriented Bayesian Networks", "abstract": "Bayesian dorsen networks provide vichar a normandin modeling first-rate language and pertaining associated kasar inference algorithm udot for 1946-1950 stochastic domains. They have knifed been píc successfully applied in a lomas variety hazara of doberan medium - manzar scale applications. połaniec However, 3-34 when faced with a communication large writing complex viitorul domain, geest the cosmides task ordine of rggi modeling joal using pelisson Bayesian hubu networks thaha begins user-mode to jan/feb resemble the lithotripsy task pizzeria of harbaugh programming using logical circuits. endymion In revisit this shandon paper, we sechelt describe an pipkin object - oriented gecf Bayesian context network (gambo OOBN) language, blázquez which allows complex 1523 domains to kansans be described in terms österreichs of overpumping inter - related a51 objects. timkat We use a 10-8 Bayesian alhaznawi network caris fragment to describe sub-prefecture the probabilistic relations between minority the lohra attributes schoeffler of an object. malo These attributes can shamoon themselves pervasive be objects, providing many-sided a asseo natural framework wordgirl for www.blogs.tampabay.com encoding part - 1991-97 of hierarchies. Classes are used psychohistory to bersuit provide awes a reusable probabilistic model which libbie can plastique be nt22 applied attorney to multiple similar kursad objects. e-sharif Classes also bevilaqua support devotio inheritance akqa of model fragments muszynski from a voiceless class bawa to a yaht subclass, cup-winning allowing the common aspects of related encompass classes .193 to be defined 50.9 only ovide once. mapinduzi Our apk language has hiding clear declarative longhorns semantics: pneumonic an euro414 OOBN can irfu be interpreted as algie a high-brow stochastic pmqs functional program, psionically so panus that it uniquely specifies mints a ahi probabilistic model. baryons We rosyth provide subscription an inference rezoning algorithm unreadable for OOBNs, 37.4 and go-karts show minang that 3-132 much donabate of fiel the ltk structural vocalism information timotheus encoded safura by lilli an OOBN - - particularly gregorian the sangathan encapsulation danneskiold of variables within murgor an object and the reuse of model 140kg fragments in different contexts - - lewins can also consenting be schjoldager used to speed up berruyer the 106.9 inference boqueron process.", "histories": [["v1", "Wed, 6 Feb 2013 15:57:36 GMT  (1425kb)", "http://arxiv.org/abs/1302.1554v1", "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)"]], "COMMENTS": "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["daphne koller", "avi pfeffer"], "accepted": false, "id": "1302.1554"}, "pdf": {"name": "1302.1554.pdf", "metadata": {"source": "CRF", "title": "Object-Oriented Bayesian Networks", "authors": ["Daphne Koller"], "emails": ["koller@cs.stanford.edu", "@cs.stanford.edu"], "sections": null, "references": [{"title": "Data model i ssues for object-oriented applications", "author": ["J. Banerjee", "H.-T. Chou", "J.F. Garza", "W. Kim", "D. Woelk", "N. Ballou", "H.-J. Kim"], "venue": "[Banerjee et a!.,", "citeRegEx": "Banerjee et al\\.,? \\Q1987\\E", "shortCiteRegEx": "Banerjee et al\\.", "year": 1987}, {"title": "P­ Classic: A tractable probabilistic description logic", "author": ["Koller"], "venue": "In Proc. AAAI-97,", "citeRegEx": "Koller,? \\Q1997\\E", "shortCiteRegEx": "Koller", "year": 1997}, {"title": "Probabilistic Reasoning in Intelligent Systems", "author": ["J. Pearl"], "venue": "[Pearl,", "citeRegEx": "Pearl.,? \\Q1988\\E", "shortCiteRegEx": "Pearl.", "year": 1988}, {"title": "A probabilistic approach to hi­ erarchical model-based diagnosis", "author": ["S. Srinivas"], "venue": "In Proc. UA/-94,", "citeRegEx": "Srinivas.,? \\Q1994\\E", "shortCiteRegEx": "Srinivas.", "year": 1994}], "referenceMentions": [{"referenceID": 0, "context": "Similarly, object-oriented database systems [Banerjee et al., 1987] provide tools for managing rich, complex data.", "startOffset": 44, "endOffset": 67}], "year": 2011, "abstractText": "Bayesian networks provide a modeling language and associated inference algorithm for stochastic domains. They have been successfully applied in a variety of medium-scale applications. However, when faced with a large complex domain, the task of modeling using Bayesian networks begins to resemble the task of pro­ gramming using logical circuits. In this paper, we de­ scribe an object-oriented Bayesian network (OOBN) lan­ guage, which allows complex domains to be described in terms of inter-related objects. We use a Bayesian net­ work fragment to describe the probabilistic relations be­ tween the attributes of an object. These attributes can themselves be objects, providing a natural framework for encoding part-of hierarchies. Classes are used to pro­ vide a reusable probabilistic model which can be applied to multiple similar objects. Classes also support inher­ itance of model fragments from a class to a subclass, allowing the common aspects of related classes to be defined only once. Our language has clear declarative semantics: an OOBN can be interpreted as a stochas­ tic functional program, so that it uniquely specifies a probabilistic model. We provide an inference algorithm for OOBNs, and show that much of the structural infor­ mation encoded by an OOBN-particularly the encap­ sulation of variables within an object and the reuse of model fragments in different contexts--can also be used to speed up the inference process.", "creator": "pdftk 1.41 - www.pdftk.com"}}}