{"id": "1302.6800", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Feb-2013", "title": "Localized Partial Evaluation of Belief Networks", "abstract": "Most algorithms for propagating tahoma evidence hungered through belief naismith networks have been exact and tarpishchev exhaustive: igaya they produce an exact (point - qxd5 valued) marginal unconcern probability dagher for every croatians node kingma in communio the network. latchmere Often, 65.23 however, relapsed an pela application vsam will not kbit/s need singes information d'azeglio about every sekera n high-yield ode u.n.-sponsored in euro37 the network 10-3 nor will it krasnoyarsk-26 need 8-18 exact grage probabilities. We freestar present chamila the :33 localized genetica partial pumbedita evaluation (participacion LPE) periventricular propagation communiqué algorithm, which pvo computes gehad interval cipto bounds krulewitz on the hpg marginal saxe-hildburghausen probability larosa of trypanosomiasis a specified 871,000 query node by examining a 194.5 subset of stacom the nodes macivor in riboflavin the dwars entire coulouris network. Conceptually, monteagudo LPE 16th-century ignores brynjolfsson parts of the 218th network sipan that are \" too kelty far away \" from 6,706 the 22-page queried node to have much firstplus impact on nudist its aakhri value. preferente LPE has the \" gledhill anytime \" property of being able to johnnys produce 7in better unr solutions (gyms tighter intervals) zerihoun given more 51-48 time nccaa to time-travel consider more obelisks of oversea the mcmillen network.", "histories": [["v1", "Wed, 27 Feb 2013 14:15:20 GMT  (1820kb)", "http://arxiv.org/abs/1302.6800v1", "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)"]], "COMMENTS": "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["denise l draper", "steve hanks"], "accepted": false, "id": "1302.6800"}, "pdf": {"name": "1302.6800.pdf", "metadata": {"source": "CRF", "title": "Localized Partial Evaluation of Belief Networks", "authors": [], "emails": ["@cs."], "sections": null, "references": [{"title": "The computa­ tional complexity of p robab i l istic i n fernce usi ng Bayesian belief networks", "author": ["Gregory F. Cooper"], "venue": "A rtificial Inte llige n ee , 42:393-405,", "citeRegEx": "Cooper. 1 990", "shortCiteRegEx": null, "year": 1990}, {"title": "Fertig a 1 1 d J", "author": ["W K ."], "venue": "S . Breese . Interval influence d i agrams. l n PI 'Oceedings UA I-89, pages 1 02- 1 1 1 , Windsor, Ontar io ,", "citeRegEx": "Fertig and Breese . 1 989", "shortCiteRegEx": null, "year": 1989}, {"title": "An Algorithm for Probabil is­ tic Planning", "author": ["Kushmerick"], "venue": "A rt ificwl Inte lligence,", "citeRegEx": "Kushmerick,? \\Q1994\\E", "shortCiteRegEx": "Kushmerick", "year": 1994}, {"title": "An efficient approach to probabilis­ tic inference in belief nets", "author": ["Li", "D 'Ambrosio", "1992] Zhaoyu Li", "Bruce D'Ambrosio"], "venue": "CAAI-", "citeRegEx": "Li et al\\.,? \\Q1992\\E", "shortCiteRegEx": "Li et al\\.", "year": 1992}, {"title": "Princeton", "author": ["G lenn Shafer . A Mathematical Theory of Evidence. Princeton U niversity Press"], "venue": "NJ ,", "citeRegEx": "Shafer. 1 976", "shortCiteRegEx": null, "year": 1976}, {"title": "Initialization for the method of con d it ioning in Bayesian belief networks", "author": ["Suermon d t", "Cooper", "1991] H. J aques Suermondt", "G regory F. Cooper"], "venue": null, "citeRegEx": "t et al\\.,? \\Q1991\\E", "shortCiteRegEx": "t et al\\.", "year": 1991}, {"title": "Extending the A/R algori thm for i n terval probability propagation", "author": ["Bjl?lrnar Tessem"], "venue": "[Tessem,", "citeRegEx": "Tessem.,? \\Q1989\\E", "shortCiteRegEx": "Tessem.", "year": 1989}], "referenceMentions": [], "year": 2011, "abstractText": "Most algorithms for propagating evidence through belief networks have been exact and exhaustive: they produce an exact (point­ valued) marginal probability for every node in the· network. Often, however, an appli­ cation will not need information about ev­ ery node in the network nor will it need ex­ act probabilities. We present the localized partial evaluation (LPE) propagation algo­ rithm, which computes interval bounds on the marginal probability of a specifted query node by examining a subset of the nodes in the entire network. Conceptually, LPE ig­ nores parts of the network that are \"too far away\" from the queried node to have much impact on its value. LPE has the \"anytime\" property of being able to produce better so­ lutions (tighter intervals) given more time to consider more of the network.", "creator": "pdftk 1.41 - www.pdftk.com"}}}