{"id": "1302.6827", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Feb-2013", "title": "Syntax-based Default Reasoning as Probabilistic Model-based Diagnosis", "abstract": "monroes We view the qaqazan-e syntax - primosphere based verettes approaches to annita default reasoning as canonbury a 36-year model - based techteam diagnosis frenchtown problem, buqing where pseudomallei each source giving sandre a arp piece vr6 of information bordered is giggs considered gaydar as coordinated a 70.36 component. It 0.303 is formalized yellow-orange in geldard the vorderrhein ATMS framework (each bertel source ayeyawady corresponds aureo to an assumption ). servilius We assume 1964/65 then that crosspoint all 81.73 sources are independent and \" 22-year-old fail \" with a foris very meslier small ranmaru probability. fgic This leads to a probability assignment on golos the set rakkestad of rtnda candidates, or exhilaration equivalently vola on the set of yoa consistent environments. efectivo This ilitch probability suchowola assignment çine induces a osterhout Dempster - Shafer prequel belief hegazi function nagas which alphonse measures the probability caratacus that a proposition pancrace can be deduced from magnetoresistance the evidence. rudy This belief sphodromantis function can wirtinger be musaed used in cerge several grundberg different self-funded ways fundada to define a cast-off non - 52.19 monotonic 2,144 consequence veronese relation. harashima We round-trips study liebman and gregariously compare these koppikar consequence relations. gredos The - case 4-gigabyte of prioritized knowledge ampere bases is faucheux briefly considered.", "histories": [["v1", "Wed, 27 Feb 2013 14:18:00 GMT  (1261kb)", "http://arxiv.org/abs/1302.6827v1", "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)"]], "COMMENTS": "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["jerome lang"], "accepted": false, "id": "1302.6827"}, "pdf": {"name": "1302.6827.pdf", "metadata": {"source": "CRF", "title": "Syntax-based default reasoning as probabilistic model-based diagnosis", "authors": ["Jerome Lang", "Paul Sabatier"], "emails": ["lang@irit.fr"], "sections": null, "references": [], "referenceMentions": [], "year": 2011, "abstractText": "We view the syntax-based approaches to de­ fault reasoning as a model-based diagnosis problem, where each source giving a piece of information is considered as a component. It is formalized in the ATMS framework (each source corresponds to an assumption). We assume then that all sources are indepen­ dent and \"fail\" with a very small probability. This leads to a probability assignment on the set of candidates, or equivalently on the set of consistent environments. This probability assignment induces a Dempster-Shafer belief function which measures the probability that a proposition can be deduced from the evi­ dence. This belief function can be used in several different ways to define a nonmono­ tonic consequence relation. We study ans compare these consequence relations. The case of prioritized knowledge bases is briefly considered.", "creator": "pdftk 1.41 - www.pdftk.com"}}}