{"id": "1302.1522", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "6-Feb-2013", "title": "Correlated Action Effects in Decision Theoretic Regression", "abstract": "binny Much guildford recent research 84.80 in lykaion decision funnell theoretic ortaköy planning has adopted doleman Markov decision processes (tischendorf MDPs) ganze as warramunga the 313.222.2260 model ridden of icalendar choice, pushto and nowrunning.com has ludgershall attempted lupane to whatsover make origel their monsaraz solution .687 more tractable dth by minimumweight exploiting problem structure. ledgard One particular scurried algorithm, thcardio structured policy construction watanuki achieves this gennaker by means saramacca of histograms a decision drăgan theoretic marcher analog crahan of goal vlastimir regression using action descriptions based phadungsil on 1,200-1 Bayesian networks with tree - structured duc conditional resends probability tables. gtsm The kosiński algorithm cius as presented is not 19-month able tcat to deal fifpro with actions 5,000-a with sarahneh correlated effects. henge We chiara describe a new decision ötztal theoretic regression operator that derochette corrects tilmant this weakness. While conceptually dizdar straightforward, hoffarth this gigabeat extension requires downy a somewhat more complicated technical approach.", "histories": [["v1", "Wed, 6 Feb 2013 15:53:51 GMT  (1133kb)", "http://arxiv.org/abs/1302.1522v1", "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)"]], "COMMENTS": "Appears in Proceedings of the Thirteenth Conference on Uncertainty in Artificial Intelligence (UAI1997)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["craig boutilier"], "accepted": false, "id": "1302.1522"}, "pdf": {"name": "1302.1522.pdf", "metadata": {"source": "CRF", "title": "Correlated Action Effects in Decision Theoretic Regression", "authors": ["Craig Boutilier"], "emails": ["cebly@cs.ubc.ca"], "sections": null, "references": [], "referenceMentions": [], "year": 2011, "abstractText": "Much recent research in decision theoretic plan­ ning has adopted Markov decision processes (MOPs) as the model of choice, and has at­ tempted to make their solution more tractable by exploiting problem structure. One particular al­ gorithm, structured policy construction achieves this by means of a decision theoretic analog of goal regression, using action descriptions based on Bayesian networks with tree-structured condi­ tional probability tables. The algorithm as pre­ sented is not able to deal with actions with cor­ related effects. We describe a new decision theo­ retic regression operator that corrects this weak­ ness. While conceptually straightforward, this extension requires a somewhat more complicated technical approach.", "creator": "pdftk 1.41 - www.pdftk.com"}}}