{"id": "1302.6780", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "27-Feb-2013", "title": "Probabilistic Constraint Satisfaction with Non-Gaussian Noise", "abstract": "We have noggin previously hegen reported noves a ratzinger Bayesian bilardo algorithm boilerplate for 109.41 determining the coordinates lyudi of 3-woods points in gradin three - monnat dimensional funciona space from balaclavas uncertain untruth constraints. 500-watt This ussachevsky method is useful in the melia determination of biological molecular yardwork structure. 6.47 It is limited, however, kyustendil by the sempill requirement that captives the uncertainty pentarchy in mykhailo the neuville constraints 35,000-pound be normally 122.22 distributed. yevtushenko In sulfone this paper, belneftekhim we allu present funicular an 11:10 extension of the original algorithm that allows constraint euro624 uncertainty mila to mikaila be vannatta represented rieders as a marple mixture of tallied Gaussians, and arletty thereby hylidae allows campobello arbitrary elting constraint distributions. malisevo We illustrate the performance of jachnow this algorithm 11:53 on katowice a problem ganymede drawn from tegument the cobequid domain vexation of molecular shikshan structure determination, punj in co-owner which ofheo a steinhardt multicomponent re-appearance constraint representation contraptions produces cilla a salee much more angerer accurate nugan solution than the shirvanshahs old single component lyttle mechanism. vernand The rumblings new schaff mechanism uses subdivision mixture distributions to decompose the bharathidasan problem 1,138 into neu a set of nishimoto independent problems hilker with topmast unimodal stilian constraint montego uncertainty. The freekicks results of the unimodal jabareen subproblems are periodically diminishing recombined using dining Bayes ' law, to avoid combinatorial continue explosion. underpricing The new algorithm is particularly tangestan suited for zurlini parallel sloppiness implementation.", "histories": [["v1", "Wed, 27 Feb 2013 14:13:22 GMT  (828kb)", "http://arxiv.org/abs/1302.6780v1", "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)"]], "COMMENTS": "Appears in Proceedings of the Tenth Conference on Uncertainty in Artificial Intelligence (UAI1994)", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["russ b altman", "cheng c chen", "william b poland", "jaswinder pal singh"], "accepted": false, "id": "1302.6780"}, "pdf": {"name": "1302.6780.pdf", "metadata": {"source": "CRF", "title": "Probabilistic Constraint Satisfaction with Non-Gaussian Noise", "authors": ["Russ B. Altman", "Cheng C. Chen"], "emails": ["@camis.stanford.edu", "@cam"], "sections": null, "references": [{"title": "The Heuristic Refinement Method for the Determination of the Solution Structure of Proteins from NMR Data", "author": ["R. Altman"], "venue": null, "citeRegEx": "Altman,? \\Q1989\\E", "shortCiteRegEx": "Altman", "year": 1989}, {"title": "A probabilistic algorithm for calculating structure: borrowing from simulated annealing", "author": ["R.B. Altman"], "venue": "Ninth Annual Conference on Uncertainty in Artificial Intelligence,", "citeRegEx": "Altman,? \\Q1993\\E", "shortCiteRegEx": "Altman", "year": 1993}, {"title": "Probabilistic structure calculations: A three-dimensional tRNA structure from sequence correlation data", "author": ["R.B. Altman"], "venue": "First International Conference on Intelligent Systems for Molecular Biology,", "citeRegEx": "Altman,? \\Q1993\\E", "shortCiteRegEx": "Altman", "year": 1993}, {"title": "The Solution Structures of E. coli trp Repressor and trp Aporepressor at an Intermediate Resolution.", "author": ["C. Arrowsmith", "R. Pachter"], "venue": "European Journal of Biochemistry", "citeRegEx": "Arrowsmith and Pachter,? \\Q1991\\E", "shortCiteRegEx": "Arrowsmith and Pachter", "year": 1991}, {"title": "Applied Optimal Estimation", "author": ["A. Gelb"], "venue": null, "citeRegEx": "Gelb,? \\Q1984\\E", "shortCiteRegEx": "Gelb", "year": 1984}, {"title": "Limited Sampling of Conformational Space by Distance Geometry Algorithm: Implications for Structures Generated from NMR Data.\" Biochemistry", "author": ["Metzler", "W.J.D.R. Hare"], "venue": null, "citeRegEx": "Metzler and Hare,? \\Q1989\\E", "shortCiteRegEx": "Metzler and Hare", "year": 1989}, {"title": "Mixtures of Gaussians and Minimum Relative Entropy Techniques for Modeling Continuous Uncertainties", "author": ["W.B. Poland", "R.D. Shachter"], "venue": "Uncertainty in Artificial Intelligence,", "citeRegEx": "7052", "shortCiteRegEx": "7052", "year": 1993}, {"title": "An Influence Diagram Approach to Medical Technology Assessment", "author": ["Kaufmann", "San Mateo", "CA"], "venue": null, "citeRegEx": "Kaufmann et al\\.,? \\Q1990\\E", "shortCiteRegEx": "Kaufmann et al\\.", "year": 1990}], "referenceMentions": [{"referenceID": 1, "context": "We have therefore developed an algorithm that is specifically geared towards providing estimates of structures as well as their uncertainty (Altman and Jardetzky 1989; Altman 1993).", "startOffset": 140, "endOffset": 180}, {"referenceID": 4, "context": "In previous work, we have shown that the model update can proceed in a Bayesian fashion, based on a modification of the extended, iterated Kalman filter (Gelb 1984) with measurement updates but no time updates.", "startOffset": 153, "endOffset": 164}, {"referenceID": 1, "context": "We discuss the details of this iteration, and the similarity of our procedure, in some aspects, to simulated annealing in (Altman 1993).", "startOffset": 122, "endOffset": 135}, {"referenceID": 1, "context": "1991) and predicting structure from uncertain theoretical constraints (Altman 1993).", "startOffset": 70, "endOffset": 83}, {"referenceID": 1, "context": "Through the iterative reheating strategy of the algorithm (Altman 1993)(using the solution after introducing all constraints as a starting point, and resetting the covariance matrix to its initial value), it appears that the multicomponent algorithm has the same local minima-avoiding behavior that has been demonstrated in the unimodal algorithm (Altman 1993).", "startOffset": 58, "endOffset": 71}, {"referenceID": 1, "context": "Through the iterative reheating strategy of the algorithm (Altman 1993)(using the solution after introducing all constraints as a starting point, and resetting the covariance matrix to its initial value), it appears that the multicomponent algorithm has the same local minima-avoiding behavior that has been demonstrated in the unimodal algorithm (Altman 1993).", "startOffset": 347, "endOffset": 360}, {"referenceID": 4, "context": "Bayesian parameter estimation is reviewed in (Gelb 1984).", "startOffset": 45, "endOffset": 56}], "year": 2011, "abstractText": "We have previously reported a Bayesian algorithm for determining the coordinates of points in three­ dimensional space from uncertain constraints. This method is useful in the determination of biological molecular structure. It is limited, however, by the requirement that the uncertainty in the constraints be normally distributed. In this paper, we present an extension of the original algorithm that allows constraint uncertainty to be represented as a mixture of Gaussians, and thereby allows arbitrary constraint distributions. We illustrate the performance of this algorithm on a problem drawn from the domain of molecular structure determination, in which a multicomponent constraint representation produces a much more accurate solution than the old single component mechanism. The new mechanism uses mixture distributions to decompose the problem into a set of independent problems with unimodal constraint uncertainty. The results of the unimodal subproblems are periodically recombined using Bayes' law, to avoid combinatorial explosion. The new algorithm is particularly suited for parallel", "creator": "pdftk 1.41 - www.pdftk.com"}}}