{"id": "1305.7345", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "31-May-2013", "title": "Algebraic Properties of Qualitative Spatio-Temporal Calculi", "abstract": "Qualitative joinville spatial and ladd temporal viard reasoning transmitters is based uniaxial on so - verzasca called qualitative olin calculi. Algebraic properties of kardashians these kurung calculi 269.8 have yengejeh several implications macaddict on 1984-1993 reasoning 'n algorithms. oftel But djerassi what exactly is a dosb qualitative calculus? And to which extent peridioles do the salmeron qualitative kathleen calculi cheapened proposed arion meet miso these demands? The thakar literature nachrowi provides goju various answers to weiyue the leaman first question 64.05 but only few facts sub-machine about reveller the mataya second. rechristened In this paper chetumal we bissix identify tiesto the minimal requirements golitsyn to binary albela spatio - temporal vrbas calculi and eagan we discuss the xiaoxiao relevance vorobiov of opine the formula according axioms bryher for panglossian representation and reasoning. interkom We constantinescu also analyze briana existing cellulose qualitative calculi and información provide a fruchter classification 1962-63 involving different notions withdrew of a relation morphology algebra.", "histories": [["v1", "Fri, 31 May 2013 10:15:18 GMT  (99kb,D)", "https://arxiv.org/abs/1305.7345v1", "COSIT 2013 paper including supplementary material"], ["v2", "Fri, 13 Sep 2013 11:59:17 GMT  (101kb,D)", "http://arxiv.org/abs/1305.7345v2", "COSIT 2013 paper including supplementary material"]], "COMMENTS": "COSIT 2013 paper including supplementary material", "reviews": [], "SUBJECTS": "cs.AI", "authors": ["frank dylla", "till mossakowski", "thomas schneider", "diedrich wolter"], "accepted": false, "id": "1305.7345"}, "pdf": {"name": "1305.7345.pdf", "metadata": {"source": "CRF", "title": "Algebraic Properties of Qualitative Spatio-Temporal Calculi", "authors": ["Frank Dylla", "Till Mossakowski", "Thomas Schneider", "Diedrich Wolter"], "emails": ["dylla@informatik.uni-bremen.de", "till@informatik.uni-bremen.de", "dwolter@informatik.uni-bremen.de", "Till.Mossakowski@dfki.de", "tschneider@informatik.uni-bremen.de"], "sections": [{"heading": "1 Introduction", "text": "Qualitative spatial and temporal reasoning is a sub-field of knowledge representation involved with representations of spatial and temporal domains that are based on finite sets of so-called qualitative relations. Qualitative relations serve to explicate knowledge relevant for a task at hand while at the same time they abstract from irrelevant knowledge. Often, these relations aim to relate to cognitive concepts. Qualitative spatial and temporal reasoning thus link cognitive approaches to knowledge representation with formal methods. Computationally, qualitative spatial and temporal reasoning is largely involved with constraint satisfaction problems over infinite domains where qualitative relations serve as constraints. Typical domains include, on the temporal side, points and intervals and, on the spatial side, regions or oriented points in the Euclidean plane. In the past decades, a vast number of qualitative representations have been developed that are commonly referred to as qualitative calculi (see [18] for a recent overview). Yet the literature provides us with several definitions of what a qualitative calculus exactly is. Nebel and Scivos [30] have introduced the rather general and weak notion of a constraint algebra, which is a set of relations closed under converse, finite intersection, and composition. Ligozat and Renz [19] focus ? The final publication is available at http://link.springer.com; this version contains\nsupplementary material\nar X\niv :1\n30 5.\n73 45\nv2 [\ncs .A\nI] 1\n3 Se\np 20\n13\non so-called non-associative algebras, which are relation algebras without associativity axioms, and which have a much richer structure. Both approaches assume that the converse operation is strong, which is not the case for calculi like the Cardinal Direction (Relations) Calculus (CDR) [38] or its recently introduced rectangular variant (RDR) [29].\nThe goal of this paper is to relate the existing definitions and to identify the essential representation-theoretic properties that characterize a qualitative calculus. It is achieved by the following contributions:\n– We propose a definition of a qualitative calculus that includes existing spatiotemporal calculi by weakening the conditions usually imposed on the converse and composition relation (Section 2). – We generalize the notions of constraint algebra and non-associative algebra to cover calculi with weak converse (Section 3.1). – We discuss the role of algebraic properties of calculi for spatial reasoning, especially in connection with general-purpose reasoning tools like SparQ [43, 42] and GQR [10] (Section 3.2). – We experimentally evaluate the algebraic properties of calculi and derive a reasoning procedure that is sensitive to these properties (Section 4). – We examine information preservation properties of calculi during reasoning, i.e., how general relations evolve after several compositions (Section 5)."}, {"heading": "2 Qualitative Representations", "text": "In this section, we formulate minimal requirements to a qualitative calculus, discuss their relevance to spatio-temporal representation and reasoning, and list existing calculi. We restrict ourselves to calculi with binary relations because we want to examine their algebraic properties using the notion of a relation algebra, which is best understood for binary relations."}, {"heading": "2.1 Requirements to Qualitative Representations", "text": "We start with minimal requirements used in the literature. Let us first fix some notation. Let r, s, t range over binary relations over a non-empty universe U , i.e., r ⊆ U ×U . We use ∪, ∩, ,̄ ˘ and ◦ to denote the union, intersection, complement, converse, and composition of relations, as well as the identity and universal relations id = {(u, u) | u ∈ U} and u = U × U . A relation r ⊆ U × U is called serial if, for every u ∈ U , there is some v ∈ U such that (u, v) ∈ r.\nLigozat and Renz [19] note that most spatial and temporal calculi are based on a set of JEPD (jointly exhaustive and pairwise disjoint) relations. The following definition is standard in the QSR literature [19, 4].\nDefinition 1. Let U be a non-empty universe and R a set of non-empty binary relations over U . R is called a set of JEPD relations over U if the relations in R are pairwise disjoint and U × U = ⋃ r∈R r.\nAn abstract partition scheme is a pair (U ,R) where R is a set of JEPD relations over U . (U ,R) is called a partition scheme [19] if R contains the identity relation id and, for every r ∈ R, there is some s ∈ R such that r˘ = s.\nThe universe U represents the set of all spatial or temporal entities, and R being a set of JEPD relations ensures that each two entities are in exactly one relation from R. Incomplete information about two entities is modeled by taking the union of base relations, with the universal relation (the union of all base relations) representing that no information is available. Disjointness of the base relations ensures that there is a unique way to represent an arbitrary relation, and exhaustiveness ensures that the empty relation can never occur in a consistent set of constraints (which are defined in Section 2.2).\nLigozat and Renz [19] base their definition of a qualitative calculus on the notion of a partition scheme. This excludes calculi like CDR and RDR which do not have strong converses. Hence, we take a more general approach based on the notion of an abstract partition scheme. This accommodates existing calculi with these weaker properties: some existing spatio-temporal representations do not require an identity relation, and some representations are deliberately kept coarse and thus do not guarantee that the converse of a base relation is again a (base) relation. Furthermore, the computation of the converse operation may be easier when weaker properties are postulated. The same rationale applies to the composition operation. Thus, the following definition of a spatial calculus, based on abstract partition schemes, contains minimal requirements.\nDefinition 2. A qualitative calculus with binary relations is a tuple (Rel, Int,̆ , ) with the following properties.\n– Rel is a finite, non-empty set of base relations. The subsets of Rel are called relations. We use r, s, t to denote base relations and R,S, T to denote relations. – Int = (U , ϕ) is an interpretation with a non-empty universe U and a map ϕ : Rel → 2U×U with (U , {ϕ(r) | r ∈ Rel}) being a weak partition scheme. The map ϕ is extended to arbitrary relations by setting ϕ(R) = ⋃ r∈R ϕ(r)\nfor every R ⊆ Rel. – The converse operation ˘ is a map ˘ : Rel→ 2Rel that satisfies\nϕ(r )̆ ⊇ ϕ(r)̆ (1)\nfor every r ∈ Rel. The operation ˘ is extended to arbitrary relations by setting R˘ = ⋃ r∈R r˘ for every R ⊆ Rel.\n– The composition operation is a map : Rel× Rel→ 2Rel that satisfies\nϕ(r s) ⊇ ϕ(r) ◦ ϕ(s) (2)\nfor all r, s ∈ Rel. The operation is extended to arbitrary relations by setting R S = ⋃ r∈R ⋃ s∈S r s for every R,S ⊆ Rel.\nWe call Properties (1) and (2) abstract converse and abstract composition, following Ligozat’s naming [17]. Our notion of a qualitative calculus makes weaker\nrequirements on the converse operation than Ligozat and Renz’s notions of a weak representation [17, 19]. We have already discussed a rationale behind choosing these “weaker than weak” variants and will name another one in Section 2.2. On the other hand, our notion makes stronger requirements on the converse than Nebel and Scivos’s notion of a constraint algebra [30]. In Section 2.2, we will discuss a reason for adopting the minimal requirements we pose to abstract converse and composition. The following definition gives the stronger variants of converse and composition existing in the literature.\nDefinition 3. Let C = (Rel, Int,̆ , ) be a qualitative calculus. C has weak converse if, for all r ∈ Rel:\nr˘ = ⋂ {S ⊆ Rel | ϕ(S) ⊇ ϕ(r)̆ } (3)\nC has strong converse if, for all r ∈ Rel:\nϕ(r )̆ = ϕ(r)̆ (4)\nC has weak composition if, for all r, s ∈ Rel: r s = ⋂ {T ⊆ Rel | ϕ(T ) ⊇ ϕ(r) ◦ ϕ(s)} (5)\nC has strong composition if, for all r, s ∈ Rel:\nϕ(r s) = ϕ(r) ◦ ϕ(s) (6)\nThe following fact captures that Properties (1)–(6) immediately carry over to arbitrary relations; the straightforward proof is given in the appendix A. It has consequences for efficient spatio-temporal reasoning, which are explained in Section 2.2.\nFact 4 Given a qualitative calculus (Rel, Int,̆ , ) and relations R,S ⊆ Rel, the following hold:\nϕ(R )̆ ⊇ ϕ(R)̆ (7) ϕ(R S) ⊇ ϕ(R) ϕ(S) (8)\nIf C has weak converse, then, for all R ⊆ Rel: R˘ = ⋂ {S ⊆ Rel | ϕ(S) ⊇ ϕ(R)̆ } (9)\nIf C has strong converse, then, for all R ⊆ Rel:\nϕ(R )̆ = ϕ(R)̆ (10)\nIf C has weak composition, then, for all R,S ⊆ Rel: R S = ⋂ {T ⊆ Rel | ϕ(T ) ⊇ ϕ(R) ◦ ϕ(S)} (11)\nIf C has strong composition, then, for all R,S ⊆ Rel:\nϕ(R S) = ϕ(R) ◦ ϕ(S) (12)\nSince base relations are non-empty and JEPD, we have\nFact 5 For any qualitative calculus, ϕ is injective.\nComparing Definitions 1–3 with the basic notions of a qualitative calculus in [19], a weak representation is a calculus with identity relation, strong converse and abstract composition. Our basic notion of a qualitative calculus is more general: it does not require an identity relation, and it only requires abstract converse and composition. Conversely, [19] are slightly more general than we are, because the map ϕ need not be injective. However, this extra generality is not very meaningful: if base relations are JEPD, ϕ could only be non-injective in giving multiple names to the empty relation. Furthermore, in [19], a representation is a weak representation with strong composition and an injective map ϕ."}, {"heading": "2.2 Spatio-Temporal Reasoning", "text": "The most important flavor of spatio-temporal reasoning is constraint-based reasoning. Like with a classical constraint satisfaction problem (CSP), we are given a set of variables and constraints. The task of constraint satisfaction is to decide whether there exists a valuation of all variables that satisfies the constraints. In calculi for spatio-temporal reasoning, variables range over the specific spatial or temporal domain of a qualitative representation. The relations defined by the calculus serve as constraint relations. More formally, we have:\nDefinition 6 (QCSP). Let (Rel, Int,̆ , ) be a binary qualitative calculus with Int = (U , ϕ) and let X be a set of variables ranging over U . A qualitative constraint is a formula xi Rj xk with variables xi, xk ∈ X and relation Rj ∈ Rel. We say that a valuation ψ : X → U satisfies xi Rj xk if (ψ(x1), ψ(xk)) ∈ φ(Rj) holds.\nA qualitative constraint satisfaction problem (QCSP) is the task to decide whether there is a valuation ψ for a set of variables satisfying a set of constraints.\nIn the following we use X to refer to the set of variables and rx,y stands for the constraint relation between variables x and y. For simplicity and wlog. it is assumed that for every pair of variables exactly one constraint relation is given.\nSeveral techniques originally developed for finite domain CSP can be adapted to spatio-temporal QCSPs. Since deciding CSP instances is already NP-complete for search problems with finite domains, heuristics are important. One particular valuable technique is constraint propagation which aims at making implicit constraints explicit in order to identify variable assignments that would violate some constraint. By pruning away these variable assignments, a consistent valuation can be searched more efficiently. A common approach is to enforce k-consistency.\nDefinition 7. A CSP is k-consistent if for all subsets of variables X ′ ⊂ X with |X ′| = k− 1 we can extend any valuation of X ′ that satisfies the constraints to a valuation of X ′ ∪ {x} also satisfying the constraints, where x ∈ X \\X ′ is any additional variable.\nQCSPs are naturally 1-consistent as the domains are infinite and there are no unary constraints. A QCSP is 2-consistent if rx,y = ry,x˘ and rx,y 6= ∅ as relations are typically serial. A 3-consistent QCSP is also called path-consistent and Definition 7 can be rewritten using compositions as\nrx,y ⊆ ⋂\nz∈X rx,z ◦ rz,y (13)\nand we can enforce the 3-consistency by iterating the refinement operation\nrx,y ← rx,y ∩ rx,z ◦ rz,y (14)\nfor all variables x, y, z ∈ X until a fix point is reached. This procedure is known as the path-consistency algorithm [5]. For finite constraint networks the algorithm always terminates since the refinement operation is monotone and there are only finitely many relations.\nIf a qualitative calculus does not provide strong composition, iterating Equation (14) is not possible as it would lead to relations not contained in Rel. It is however straightforward to weaken Equation (14) using weak composition.\nrx,y ← rx,y ∩ rx,z rz,y (15)\nThis procedure is called enforcing algebraic closure or a-closure for short. The reason why, in Definition 2, we require composition to be at least abstract is that the underlying inequality guarantees that reasoning via a-closure is sound.\nEnforcing k-consistency or algebraic closure does not change the solutions of a CSP, as only impossible valuations are removed. If during application of Equation (15) an empty relation occurs, the QCSP is thus known to be inconsistent. By contrast, an algebraically closed QCSP may not be consistent though. However, for several qualitative calculi (or at least sub-algebras thereof) algebraic closure and consistency coincide.\nThough we speak about composition in the following two paragraphs, the same statements hold for converse.\nFact 4 has the consequence that the composition operation of a calculus is uniquely determined if the composition of each pair of base relations is given. This information is usually stored in a table, the composition table. Then, computing the composition of two arbitrary relations is just a matter of table look-ups which allows algebraic closure to be enforced efficiently. Speaking in terms of composition tables, abstract composition implies that each cell corresponding to r s contains at least those base relations t whose interpretation intersects with ϕ(r) ◦ ϕ(s). In addition, weak composition implies that each cell contains exactly those t. If composition is strong, then Rel and ϕ even have to ensure that whenever ϕ(t) intersects with ϕ(r) ◦ϕ(s), it is contained in ϕ(r) ◦ϕ(s) – i.e., the composition of the interpretation of any two base relations has to be the union of interpretations of certain base relations."}, {"heading": "2.3 Existing Qualitative Spatio-Temporal Representations", "text": "This paper is concerned with properties of binary spatio-temporal calculi that are described in the literature and implemented in the spatial representation and reasoning tool SparQ [43, 42]. Table 1 lists these calculi."}, {"heading": "3 Relation Algebras", "text": ""}, {"heading": "3.1 Definition", "text": "If we focus our attention on spatio-temporal calculi with binary relations, it is reasonable to ask whether they are relation algebras (RAs). If a calculus is a RA, it is guaranteed to have properties that allow several optimizations in constraint reasoners. For example, associativity of the composition operation\nensures that, if the reasoner encounters a path ArBsCtD of length 3, then the relation between A and D can be computed “from left to right”. Without associativity, (r s) t as well as r (s t) would have to be computed. RAs have been considered in the literature for spatio-temporal calculi [19, 6, 25].\nAn (abstract) RA is defined in [21]; here we use the symbols ∪, , and id instead of +, ;, and 1′. Let A be a set containing id and 1, and let ∪, be binary and ,̄ ˘ unary operations on A. The relevant axioms (R1–R10, WA, SA, and PL) are given in Table 2. All axioms except PL can be weakened to only one of two inclusions, which we denote by a superscript ⊇ or ⊆. For example, R⊇7 denotes (r )̆̆ ⊇ r. Likewise, we use PL⇒ and PL⇐. Then, A = (A,∪, ,̄ , ,̆ id) is a\n– non-associative relation algebra (NA) if it satisfies Axioms R1–R3, R5–R10; – semi-associative relation algebra (SA) if it is an NA and satisfies Axiom SA, – weakly associative relation algebra (WA) if it is an NA and satisfies WA, – relation algebra (RA) if it satisfies R1–R10,\nfor all r, s, t ∈ A. Every RA is a WA; every WA is an SA; every SA is an NA. In the literature, a different axiomatization is sometimes used, for example in [19]. The most prominent difference is that R10 is replaced by PL, “a more intuitive and useful form, known as the Peircean law or De Morgan’s Theorem K” [12]. It is shown in [12, Section 3.3.2] that, given R1–R3, R5, R7–R9, the axioms R10 and PL are equivalent. The implication PL ⇒ R10 does not need R5 and R8.\nFurthermore, Table 2 contains the redundant axiom R6l because it may be satisfied when some of the other axioms are violated. It is straightforward to establish that R6 and R6l are equivalent given R7 and R9, see the appendix B.\nDue to our minimal requirements to a qualitative calculus given in Def. 2, certain axioms are always satisfied; see the appendix for a proof of the following\nFact 8 Every qualitative calculus satisfies R1–R3, R5, R ⊇ 7 , R8, WA⊇, SA⊇ for all (base and complex) relations. This axiom set is maximal: each of the remaining axioms in Table 2 is not satisfied by some qualitative calculus."}, {"heading": "3.2 Discussion of the Axioms", "text": "We will now discuss the relevance of the above axioms for spatio-temporal representation and reasoning. Due to Fact 8, we only need to consider axioms R4, R6, R7, R9, R10 (or PL) and their weakenings R6l, SA, WA. R4 (and SA, WA). Axiom R4 is helpful for modeling. It allows for writing chains of compositions without parentheses, which have an unambiguous meaning. For example, consider the following statement in natural language about the relative length and location of two intervals A and D. Interval A is before some equally long interval that is contained in some longer interval that meets the shorter D. This statement is just a conjunction of relations between A, the unnamed intermediary intervals B,C, and D. When we evaluate it, it intuitively does not matter whether we give priority to the composition of the relations between A,B and B,C or to the composition of the relations between B,C and C,D.\nHowever, INDU does not satisfy Axiom R4 and, therefore, here the two ways of parenthesizing the above statement lead to different relations between A and D. This behavior is sometimes attributed to the absence of strong composition, which we will refute in Section 4. Conversely, strong composition implies R4 since composition of binary relations over U is associative:\nFact 9 Let C = (Rel, Int,̆ , ) be a qualitative calculus with strong composition. Then C satisfies R4.\nNote that INDU still satisfies the weakenings SA and WA of R4, and we already know from Fact 8 that the inequalities SA⊇ and WA⊇ are always satisfied.\nFurthermore, Axiom R4 is useful for optimizing reasoning algorithms: suppose a scenario that contains the constraints {WrX,XsY, Y tZ,Wr′Z} with variables W,X, Y, Z needs to be checked for consistency. If one of the inclusions R⊇4 and R⊆4 is satisfied – say, r (s t) ⊆ (r s) t – then it suffices to compute the “finer” composition result r (s t) and check whether it contains r′. Otherwise, both results have to be computed and checked for containment of r′.\nIn case neither R⊇4 not R ⊆ 4 is satisfied, it is possible to establish associativity, at the cost of coarsening the composition operation and thereby reducing the “information content” inherent in the composition table, but with the benefit of providing a sound approximation with the advantages discussed so far. This can be done as follows. If there is some triple (r, s, t) of base relations that violates associativity, for example, r (s t) ( (r s) t, then enrich the table entries that are used to compute r (s t) with the base relations that are missing to reach r (s t) = (r s) t. Repeat this step until no more violations are found. This procedure terminates – in the worst case, it runs until all entries contain the universal relation. The resulting table represents an abstract composition operation that satisfies associativity, but its “information content” is lower than that of the original table because, by adding relations to certain entries, the disjunctions represented by these entries have been enlarged.\nR6 and R6l. Axioms R6 and R6l do not seem to play a significant role in (optimizing) satisfiability checking, but the presence of an id relation is needed for\nthe standard reduction from the correspondence problem to satisfiability: to test whether a constraint system admits the equality of two variables x, y, one can add an id-constraint between x, y and test the extended system for satisfiability.\nFurthermore, the absence of an id relation may lead to an earlier loss of precision. For example, assume two variants of the 1D Point Calculus [41]: PC= with the relations less than (<), equal (=), and greater than (>), interpreted as the natural relations <,=, > over the domain of the reals, and its approximation PC≈ with the relations less than (<), approximately equal (≈), and greater than (>), where ≈ is interpreted as the set of pairs of points whose distance is below a certain threshold. Then, = is the id-relation of PC= and = = results in {=}, whereas PC≈ has no id-relation and ≈ ≈ results in the universal relation.\nR7 and R9. These axioms allow for certain optimizations in decision procedures for satisfiability based on algebraic operations like algebraic closure. If R7 holds, the reasoning system does not need to store both constraints ArB and B r′A, since r′ can be reconstructed as r˘ if needed. Similarly, R9 grants that, when enforcing algebraic closure by using Equation (15) to refine constraints between variable A and B, it is sufficient to compute composition once and, after applying converse, reuse it to refine the constraint between B and A too.\nCurrent reasoning algorithms and their implementations use the described optimizations; they produce incorrect results for calculi violating R7 or R9.\nR10 and PL. These axioms reflect that the relation symbols of a calculus indeed represent binary relations, i.e., pairs of elements of a universe. This can be explained from two different points of view.\n1. If binary relations are considered as sets, R10 is equivalent to r˘ r s ⊆ s̄. If we further assume the usual set-theoretic interpretation of the composition of two relations, the above inclusion reads as: For any X,Y , if Z rX for some Z and, Z r U implies not U sY for any U , then not X sY . This is certainly true because X is one such U . 2. Under the same assumptions, each side of PL says (in a different order) that there can be no triangle X r Y, Y sZ,Z tX. The equality then means that the “reading direction” does not matter, see also [6]. This allows for reducing nondeterminism in the a-closure procedure, as well as for efficient refinement and enumeration of consistent scenarios."}, {"heading": "3.3 Prerequisites for Being a Relation Algebra", "text": "The following correspondence between properties of a calculus and notions of a relation algebra is due to Ligozat and Renz [19].\nProposition 10. Every calculus C based on a partition scheme is an NA. If, in addition, the interpretations of the base relations are serial, then C is an SA.\nFurthermore, R7 is equivalent to the requirement that a calculus has strong converse. This is captured by the following lemma.\nLemma 11. Let C = (Rel, Int,̆ , ) be a qualitative calculus. Then the following properties are equivalent.\n1. C has strong converse. 2. Axiom R7 is satisfied for all base relations r ∈ Rel. 3. Axiom R7 is satisfied for all relations R ⊆ Rel.\nProof. Items (2) and (3) are equivalent due to distributivity of ˘ over ∪, which is introduced with the cases for non-base relations in Definition 2.\nFor “(1) ⇒ (2)”, the following chain of equalities, for any r ∈ Rel, is due to C having strong converse: ϕ(r˘̆ ) = ϕ(r )̆̆ = ϕ(r)̆ ˘ = ϕ(r). Since Rel is based on JEPD relations and ϕ is injective, this implies that r˘̆ = r.\nFor “(2) ⇒ (1)”, we show the contrapositive. Assume that C does not have strong converse. Then ϕ(r )̆ ) ϕ(r)̆ , for some r ∈ Rel; hence ϕ(r )̆̆ ) ϕ(r)̆ .̆ We can now modify the above chain of equalities replacing the first two equalities with inequalities, the first of which is due to Requirement (1) in the definition of the converse (Def. 2): ϕ(r˘̆ ) ⊇ ϕ(r )̆̆ ) ϕ(r)̆ ˘ = ϕ(r). Since ϕ(r˘̆ ) 6= ϕ(r), we have that r˘̆ 6= r. ut"}, {"heading": "4 Algebraic Properties of Existing Calculi", "text": "In this section, we report on tests for algebraic properties we have performed on spatio-temporal calculi. We want to answer the following questions. (1) Which existing calculi correspond to relation algebras? (2) Which weaker notions of relation algebras correspond to calculi that do not fall under (1)?\nWe examined the corpus of the 31 calculi4 listed in Table 1. This selection is restricted to calculi with (a) binary relations – because the notion of a relation algebra is best understood for binary relations – and (b) an existing implementation in SparQ.\nTo answer Questions (1) and (2), we use the axioms for relation algebras listed in Table 2 using both the heterogeneous tool set HETS [26] and SparQ. Due to Fact 8, it suffices to test Axioms R4, R6, R7, R9, R10 (or PL) and, if necessary, the weakenings SA, WA, and R6l. The weakenings are relevant to capture weaker notions such as semi-associative or weakly associative algebras, or algebras that violate either R6 or some of the axioms that imply the equivalence of R6 and R6l. Because all axioms except R10 contain only operations that distribute over the union ∪, it suffices to test them for base relations only. Therefore, we have written a CASL specification of R4, R6, R7, R9, PL, SA, WA, and R6l, and used a HETS parser that reads the definitions of the above listed calculi in SparQ to test them against our CASL specification. In addition, we have tested all definitions against R4, R6, R7, R9, PL, and R6l using SparQ’s built-in function analyze-calculus.\nA part of the calculi have already been tested by Florian Mossakowski [25], using a different CASL specification based on an equivalent axiomatization from [19]. He comprehensively reports on the outcome of these tests, and on repairs made to the composition table where possible. 4 For the parametrized calculi DRA, OPRA, QTC, we count every variant separately.\nThe results of our and Mossakowski’s tests are summarized in Table 3; details are listed in the appendix. With the exceptions of QTC, Cardinal Direction Relations (CDR) and Rectangular Direction Relations (RDR), all tested calculi are at least semi-associative relation algebras; most of them are even relation algebras. Hence, these calculi enjoy the advantages for representation and reasoning optimizations discussed in Section 3.2. In particular, current reasoning procedures, which already implement the optimizations described for R7 and R9, yield correct results for these calculi, and they could be optimized further by implementing the optimizations described for R4, R10, and PL.\nThe three groups of calculi that are SAs but not RAs are the Dipole Calculus variants DRAf (variants DRAfp and DRA-connectivity are even RAs!), as well as INDU and OPRAm for m = 1, . . . , 8. These calculi do not even satisfy one of the inclusions R⊇4 and R ⊆ 4 , which implies that the reasoning optimizations described in Section 3.2 for Axiom R4 cannot be applied, but this is the only disadvantage of these calculi over the others. Our observations suggest that the meaning of the letter combination “RA” in the abbreviations “DRA” and “OPRA” should stand for “Reasoning Algebra”, not for “Relation Algebra”.\nIn principle, it cannot be completely ruled out that associativity is reported to be violated due to errors in either the implementation of the respective calculus or the experimental setup. This even applies to non-violations, although it is much more likely that errors cause sporadic violations than systematic non-violations. In the case of DRAf, INDU and OPRAm, m = 1, . . . , 8, the relatively high\npercentage of violations make implementation errors seem unlikely to be the cause. However, to obtain certainty that these calculi indeed violate R4, one has to find concrete counterexamples and verify them using the original definition of the respective calculus. For DRAf and INDU, this has been done in the literature [23, 3]. Interestingly, the violation of associativity has been attributed to the absence of strong converse and strong composition, respectively. We remark, however, that the latter cannot be responsible because, for example, DRAfp has an associative, but only weak, composition operation. While DRAfp has been proven to be associative due to strong composition in [23], for OPRAm, it can be shown that none of the variants for any m are associative (see [28]).\nThe B-variants of QTC violate only the identity law R6 and R6l. As observed in [25], it is possible to equip them with a new id relation, modify the interpretation of the other relations such that they become JEPD, and adapt the converse and composition table accordingly. The thus modified calculi are then relation algebras.\nThe C-variants of QTC additionally violate R4, R9, R10, and PL. We call the corresponding notion of algebra semi-associative Boolean algebra with converseinvolution. As a consequence, most of the reasoning optimizations described in Section 3.2 cannot be applied to the C-variants of QTC; hence, reasoning with these calculi is expected to be less efficient than with the calculi described so far. It is possible that the noticeably few violations of R9, R10, and PL are due to errors in the composition table; the non-trivial verification is part of future work.\nCardinal Direction Relations and Rectangular Direction Relations are the only calculi with weak converse that we have tested. The former satisfies only WA in addition to the axioms that are always satisfied by a Boolean algebra with distributivity. We call the corresponding notion of algebra weakly associative Boolean algebra. Hence, this calculus enjoys none of the advantages for representation and reasoning discussed in Section 3.2. Similarly to the C-variants of QTC, the relatively small number of violations of PL may be due to errors in the implementation. Rectangular Direction Relations additionally satisfies R4 and therefore corresponds to what we call an associative Boolean algebra. Since both calculi satisfy neither R7 nor R9, current reasoning algorithms and their implementations yield incorrect results for them, as seen in Section 3.2.\nAn overview of the algebra notions identified is given in Figure 1. When making using of algebraic closure as inference mechanism it is essential to acknowledge that some axiom violations require special procedures in order to compute algebraic closure. Our analysis reveals that there indeed exist calculi that do not meet axioms that have been taken for granted. For example, the current version of GQR can fail to compute algebraic closure correctly for calculi that violate R9. In Algorithm 1 we present a universal algorithm to compute algebraic closure. For clarity and brevity of the presentation we stick to the well-known but simple control structure of PC-1. A real implementation would use an advanced control structure to avoid unnecessary invocations of the revise function, i.e., to use at least PC-2 [20]. Conformance with R7 allows CSP storage to be restricted (flag s in the algorithm), while violation of R9 requires two computations for\nAlgorithm 1 Universal algebraic closure algorithm 1: function lookup((C, i, j, s)) 2: if s ∨ (i < j) then 3: return Ci,j 4: else 5: return Cj,i˘ 6: end function 7: function revise((C, i, j, k, s)) 8: u← false . update flag to signal whether relation was updated 9: r ← Ci,j ∩ lookup(C, i, k, s) lookup(C, k, j, s) 10: if s ∨ R9 does not hold then 11: r′ ← lookup(C, j, i, s) ∩ (lookup(C, j, k, s) lookup(C, k, i, s)) 12: r ← r ∩ r′˘ 13: r′ ← r′ ∩ r˘ 14: if r′ 6= Cj,i then 15: assert r′ 6= ∅ . stop if inconsistency is detected 16: u← true 17: Cj,i ← r′\n18: if r 6= Ci,j then 19: assert r 6= ∅ . stop if inconsistency is detected 20: u← true 21: Ci,j ← r 22: return (C, u) 23: end function 24: function a-closure((n, {x1 r1 y1, . . . , xm rm ym})) 25: if R7 does not hold then 26: s← true . without R7 we must store converse relations 27: Ci,j ← U , i = 1, . . . , n, j = 1, . . . , n 28: else 29: s← false . for small calculi/CSPs storing converses may be more efficient 30: Ci,j ← U , i = 1, . . . , n, j = i + 1, . . . , n . use triangular matrix storage 31: Ci,i ← id, i = 1, . . . , n 32: for i = 1, . . . , m do 33: x← xi, r ← ri, y ← yi . process constraint xi ri yi 34: if ¬s ∧ (x > y) then 35: (x, y)← (y, x), r ← r˘ . only write into upper half of matrix 36: Cx,y ← Cx,y ∩ r 37: assert (x = y)→ (id ∈ Cx,y) 38: end for 39: update ← true 40: while update do 41: update ← false 42: for i = 1, . . . , n, j = i+1, . . . , n, k = 1, . . . n, k 6= i, k 6= j do 43: (u, C)← revise(C, i, j, k, s) 44: update ← update ∨ u 45: end for 46: return C . fix point reached 47: end function\nthe refinement operation Eq. 15, namely Ci,j C(j, k) and (Cj,k˘ Ci,j )̆̆ (lines 10–17). R4 and R10 are not used by the algorithm, since this would complicate the algorithm unduly."}, {"heading": "5 A Quantitative Account of Qualitative Calculi", "text": "In this section, we report on computational properties of specific calculi which are beyond the computational complexity of constraint-based reasoning. For example, one might be interested to know how many relations are typically sufficient to describe a scene of n objects unequivocally or with a specific residual uncertainty. To this end, we developed two empirical measures that characterize certain aspects of qualitative calculi that are arguably relevant to applications. We want to answer two questions: (1) How well do calculi with many relations make use of the usually higher information content? (2) Does information content differ significantly between the six classes of calculi established in Section 4?\nThe first measure we consider is information content of the composition operation. Our motivation is to estimate how much additional information can be gained by applying a composition operation. This allows us to estimate whether, for example, having observed relations r(A,B) and r′(B,C) in a scene, it is worthwhile to observe r′′(A,C) too, as it may be improbable to derive r′′ by composition (r ◦ r′). To obtain more general results we consider sequences of compositions r ◦ r′ ◦ r′′ ◦ . . . for several lengths. We define the information content I of a relation R ⊆ Rel to be\nI(R) = 1− |R| |Rel| (16)\nwhere |Rel| denotes the number of base relations of the calculus, and |R| the number of base relations R consists of. In case of the universal relation this results in I(U) = 0 as nothing is known, I(r) = 1 − 1|Rel| for all base relations\nr ∈ Rel, and I(∅) = 1. Obviously, the more base relations a calculus involves, the higher the information content can be for base relations. Therefore, we define\nIkC = ∑\nR∈rk I(R) |Rel|k+1 (17)\nfor a calculus C with rk = {r0 ◦ . . . ◦ rk|r0, . . . , rk ∈ Rel} to be the average information content after k composition operations, i.e., how restrictive relation are on average after information propagation with composition. In particular, IkC is 1 minus the average proportion of base relations in any cell in the composition table. For example, for QTCC22 (|Rel| = 209) or the Cardinal Direction Relations (CDR) (|Rel| = 218) I0 ≈ 1, whereas for the Point Calculus with three base relations I0P C ≈ 0.67. We apply an iterative method to derive the values of IkC that constructs rk for k = 0, 1, . . . rather than looping across combinations of base relations. Despite the potentially exponential size of rk, the calculation remains feasible in many cases. Only for OPRAm with m ≥ 3 and some QTC variants we were not able to derive values for higher k in reasonable time. For the other calculi, computation was terminated after 14 compositions or if IkC drops below 0.5.\nAs a second measure we determine the average degree of overlap that occurs after k steps of composition for selected calculi. The degree of overlapping O(Ri, Rj) is determined by counting the number of atomic relations shared by two relations, normalized by the total number of base relations:\nO(Ri, Rj) = |Ri ∩Rj | |Rel| (18)\nFor example, if two relations in a calculus with eight base relations share four base relations, the overlap is 0.5. This value indicates how the information content differs between dealing with base relations only versus dealing with arbitrary relations (and thus how the results on information content generalize to arbitrary relations). Similar to I(R) and IkC , we define OkC to be the average overlap over all composition chains of length k.\nOkC = ∑ Ri,Rj∈rk O(Ri, Rj) |Rel|k+1 (19)\nThe results of the two measures are summarized in Figure 2 and Table 4, showing information content versus length k of composition chains.\nFigure 2 shows that the average information content for the Point Calculus after 1 step is ≈ 0.52 and additionally, the overlap of ≈ 0.33 is already quite high after a single composition. Therefore, in order to obtain detailed information it is reasonable to also observe rAC between objects A and C even if rAB and rBC are already known. By contrast, the INDU calculus has a very high information content (≈ 0.87) and a much smaller overlap. Therefore, it is not so informative to observe rAC as a lot of information is preserved after a composition. It is clear that the OkC grows for increasing k as composition results become coarser step\nby step. Nevertheless, information loss for PC is much higher than compared to Allen and INDU calculus: I5INDU and I5Allen are close to I2P C (OkC respectively).\nOur results show that there is no evidence for a relation between the information content of a calculus and its classification as per Figure 1. The only exceptions are some of the QTC calculi as IkC starts to increase after some k with increasing k.\nAlthough the calculi start with quite different values for I0, most calculi have an information content less than 0.1 after six steps. The most notable exception is the Block Algebra where I6BA ≈ 0.43 and even after ten compositions it remains above 16%. Only Allen, INDU and CDR are somehow comparable. Concerning the classes we derived in Section 4 no uniform behavior can be observed. Thus, from a perspective of expressive power of calculi, there is no argument against working with calculi that are not relation algebras. We have to note that the comparison of the values for calculi where it is known that a-closure decides consistency and those where it does not (or is unknown) is problematic. The latter ones may contain relations which are not physically realizable and thus reduce the value of information content.\nThere are some interesting observations wrt. the various QTC variants. The QTCB1x, QTCB21 and QTCC21 calculi behave differently from other calculi, whereas QTCB22 behaves ‘normally’, i.e., Ik increases, although it is very closely related to the other QTC variants. Interestingly, QTCB1x and QTCC21 are the only calculi where Ik increases with growing k. From our perspective, the reason lies in the multimodal structure of the calculus. As it combines points with line segments, the composition table (CT) contains empty relations, since an object cannot be interpreted as a point and a line segment at the same time. Additionally, the CT contains only fairly small relations, i.e., with small |R|. For example, the CT of QTCB12 contains 29% empty relations, 29% atomic relations, and 42% other relations which have a maximal size of |R| ≤ 3. The results for QTCB21 are not surprising as the composition table only contains the universal relation and thus, for all k, Ik = 0.0 and Ok = 100.0. For QTCC21 we observe that Ik decreases to 69.5% at step 4, but starts to increase for k ≥ 5. We assume that this is also the case for QTCC22, as it is a refinement of QTCC21, but we were not able to calculate necessary values due to the high complexity. So far, we have no explanation for this decrease.\nAn additional observation is that PC and QTCB22 are similar with respect to information content, i.e., IkP C ≈ IkQT CB22 for k ≤ 14. This congruence is interesting as the overlap values vary, the underlying partition scheme is different and the difference in base relations is significant (three for PC vs. 27 for QTCB22). We leave the question of connections between these two calculi for future research."}, {"heading": "6 Conclusion", "text": "We have looked at spatio-temporal representation and reasoning from an algebraic perspective, examining the implications of algebraic properties on modeling and reasoning algorithms, and testing these properties for a representative corpus of\nexisting calculi. The resulting classification shows that calculi which have been described early in the literature tend to reside in the upper part of Figure 1; that is, they tend to have a rich algebraic structure. Few more recently developed calculi are based on generalizations and have a weaker structure. We have been able to conclude that common reasoning procedures are incorrect for the latter class of calculi, and have proposed a corrected universal a-closure algorithm that makes use of reasoning optimizations where they are allowed. Furthermore, we found that algebraic properties do not necessarily relate to how much information is preserved in successive reasoning steps.\nAn interesting and significant line of future work is to extend this study to ternary calculi, which requires an extension of binary relation algebras to ternary relations, see also [36].\nAcknowledgments: We would like to thank Immo Colonius, Arne Kreutzmann, Jae Hee Lee, André Scholz and Jasper van de Ven for inspiring discussions during the “spatial reasoning tea time”. This work has been supported by the DFG-funded SFB/TR 8 “Spatial Cognition”, projects R3-[QShape] and R4-[LogoSpace]."}, {"heading": "A Additional proofs from Section 2.1", "text": ""}, {"heading": "A.1 Proof of Fact 4", "text": "Given a qualitative calculus (Rel, Int,̆ , ) and relations R,S ⊆ Rel, the following hold:\nϕ(R )̆ ⊇ ϕ(R)̆ (20) ϕ(R S) ⊇ ϕ(R) ◦ ϕ(S) (21)\nIf C has weak converse, then, for all R ⊆ Rel: R˘ = ⋂ {S ⊆ Rel | ϕ(S) ⊇ ϕ(R)̆ } (22)\nIf C has strong converse, then, for all R ⊆ Rel:\nϕ(R )̆ = ϕ(R)̆ (23)\nIf C has weak composition, then, for all R,S ⊆ Rel: R S = ⋂ {T ⊆ Rel | ϕ(T ) ⊇ ϕ(R) ◦ ϕ(S)} (24)\nIf C has strong composition, then, for all R,S ⊆ Rel:\nϕ(R S) = ϕ(R) ◦ ϕ(S) (25)\nProof. For (20), consider\nϕ(R )̆ = ⋃\nr∈R ϕ(r )̆ definition of ϕ(R )̆\n⊇ ⋃\nr∈R ϕ(r)̆ property (1)\n= (⋃\nr∈R ϕ(r)\n) ˘ distributivity in set theory\n= ϕ(R)̆ definition of ϕ(R).\nFor (21), consider\nϕ(R S) = ⋃\nr∈R ⋃ s∈S ϕ(r s) definition of ϕ(R S)\n⊇ ⋃\nr∈R ⋃ s∈S ϕ(r) ◦ ϕ(s) property (2)\n= (⋃\nr∈R ϕ(r)\n) ◦ (⋃ s∈S ϕ(s) )\ndistributivity in set theory\n= ϕ(R) ◦ ϕ(S) definition of ϕ(R) and ϕ(S)\nProperties (23) and (25) are proven using (4) and (6) in the same way as we have just proven (20) and (21) using (1) and (2).\nFor (22), let R = {r1, . . . , rn} for some n > 1 and r1, . . . , rn ∈ Rel. Due to Definition 3 (3), we have that\nri˘ = ⋂ {S ⊆ Rel | ϕ(S) ⊇ ϕ(ri)̆ }\nfor every i = 1, . . . , n. Let Si1, . . . , Simi be the S over which the above intersection ranges, i.e.,\nri˘ = mi⋂ j=1 Sij .\nDue to Definition 2, we have that\nR˘ = n⋃\ni=1 ri˘ = n⋃ i=1 mi⋂ j=1 Sij = m1⋂ j1=1 · · · mn⋂ jn=1 n⋃ i=1 Siji ,\nwhere the last equality is due to the distributivity of intersection over union. Now (22) follows if we show that, for every S ∈ Rel, the following are equivalent. 1. ϕ(S) ⊇ ϕ(R)̆ 2. there exist S1, . . . , Sn with S = S1 ∪ · · · ∪ Sn and ϕ(Si) ⊇ ϕ(ri)̆ for every i = 1, . . . , n.\nFor “1 ⇒ 2”, assume ϕ(S) ⊇ ϕ(R)̆ , i.e., ϕ(S) ⊇ ⋃n\ni=1 ϕ(ri)̆ (Definition 2). If we further assume that S = {s1, . . . , s`}, which implies that ϕ(S) ⊇ ⋃` j=1 ϕ(sj) (Definition 2), then we can choose Si = {sj | ϕ(sj) ∪ ϕ(ri)̆ = ∅} for every i = 1, . . . , n. Because C is based on JEPD relations, we have that ϕ(Si) ⊇ ϕ(ri)̆ .\nFor “2⇒ 1”, let S = S1 ∪ · · · ∪ Sn and ϕ(Si) ⊇ ϕ(ri)̆ for every i = 1, . . . , n. Due to Definition 2 and because C is based on JEPD relations, we have that ϕ(S) = ⋃n i=1 ϕ(Si). Hence, ϕ(S) ⊇ ⋃n i=1 ϕ(ri)̆ due to the assumption, and ϕ(S) ⊇ ϕ(R)̆ due to Definition 2. (24) is proven analogously. ut\nA.2 R5 and R5l from Table 2 are equivalent given R1, R4 and R6–R9 We only show that R5 implies R5l; the converse direction is analogous.\nr (s ∪ t) = (r )̆̆ ((s ∪ t)̆ )̆ (R7) = ((s ∪ t)̆ r )̆̆ (R9) = ((t̆ ∪ s̆ ) r )̆̆ (R8) = ((t̆ r )̆ ∪ (s̆ r )̆)̆ (R5) = ((r t)̆ ∪ (r s)̆ )̆ (R9) = ((r t)̆ )̆ ∪ ((r s)̆ )̆ (R8) = (r t) ∪ (r s) (R7) = (r s) ∪ (r t) (R1)\nut\nA.3 R6 and R6l from Table 2 are equivalent given R7 and R9 We only show that R6 implies R6l; the converse direction is analogous. We first establish that id̆ = id.\nid̆ = id̆ id (R6) = id̆ (id̆ )̆ (R7) = (id̆ id)̆ (R9) = (id̆ )̆ (R6) = id (R7)\nNow we use this lemma to establish R6l.\nid r = (id̆ )̆ (r )̆̆ (R7) = (r˘ id̆ )̆ (R9) = (r˘ id)̆ (Lemma) = (r )̆̆ (R6) = r (R7)\nut"}, {"heading": "B Additional proofs from Section 3", "text": ""}, {"heading": "B.1 Proof of Fact 8", "text": "Axioms R1–R3 are always satisfied because they are a characterization of a Boolean algebra; and the set operations on the relations form a Boolean algebra because ϕ maps base relations to a set of JEPD relations and complex relations to sets of interpretations of base relations.\nThe definition of the converse and composition operations for non-base relations in Definition 2 ensures that Axioms R5 and R8 hold.\nAxiom R⊇7 always holds due to JEPD and weak converse: For every r ∈ Rel, we have that ϕ(r˘̆ ) ⊇ ϕ(r )̆̆ ⊇ ϕ(r)̆ ˘ = ϕ(r), where the first inclusion is due to Fact 4 (7) with R = r ,̆ the second inclusion is due to Definition 2 (1) for r, and the equation is due to the properties of binary relations over the universe U . Since the ϕ(r) are a set of JEPD relations, r˘̆ ⊇ r follows. This reasoning carries over to arbitrary relations.\nAxioms WA⊇ and SA⊇ always hold due to JEPD and weak composition: For every r ∈ Rel, we have that\nϕ((r 1) 1) ⊇ ϕ(r 1) ◦ ϕ(1) = ϕ(r 1) ◦ (U × U) ⊇ ϕ(r 1),\nwhere the first inclusion is due to to Fact 4 (8) with R = r 1 and S = 1, and the last inclusion is due to the fact that R ◦ (U × U) ⊇ R for any binary relation\nR ⊆ U × U . Since the ϕ(r) are a set of JEPD relations, (r 1) 1 ⊇ r 1 follows. Again, this reasoning carries over to arbitrary relations.\nAxioms R⊆6 , R ⊆ 6l , R ⊆ 7 are violated by the following calculus. Let Rel = {r1, r2},\nU = {0, 1}, id = r1, 1 = {r1, r2} with:\nϕ(r1) = {(0, 0), (0, 1)} r1˘ = 1 r1 r1 = 1 ϕ(r2) = {(1, 0), (1, 1)} r2˘ = 1 r1 r2 = r1\nr2 r1 = 1 r2 r2 = r2\nThis calculus satisfies the conditions from Definition 2 but violates Axioms R⊆6 , R⊆6l , R ⊆ 7 :\nR⊆6 r1 id = 1 * r1 R⊆6l id r1 = 1 * r1 R⊆7 r1˘̆ = 1 * r1\nAxioms WA⊆, SA⊆, R⊆4 , R ⊇ 4 , R ⊇ 6 , R ⊇ 6l , R ⊆ 9 , R ⊇ 9 , R ⊆ 10, R ⊇ 10, PL⇒, PL⇐ are violated by the following calculus. Let Rel = {r1, r2, r3, r4}, U = {0, 1}, id = r1, 1 = {r1, r2} with:\nϕ(r1) = {(0, 0)} r1˘ = r1 ϕ(r2) = {(1, 1)} r2˘ = r2 ϕ(r3) = {(0, 1)} r3˘ = r4 ϕ(r4) = {(1, 0)} r4˘ = r3\nright operand r1 r2 r3 r4 left operand\nr1 r1 ∅ r3 ∅ r2 ∅ r3 ∅ r4 r3 ∅ r3 ∅ r1, r4 r4 r1, r4 ∅ r2 ∅\nThis calculus satisfies the conditions from Definition 2 but violates Axioms WA⊆, SA⊆, R⊆4 , R ⊇ 4 , R ⊇ 6 , R ⊇ 6l , R ⊆ 9 , R ⊇ 9 , R ⊆ 10, R ⊇ 10, PL⇒, PL⇐:\nWA⊆, SA⊆ : (r1 1) 1 = 1 * {r1, r3, r4} = r1 1\nR⊆4 : (r1 r3) r4 = r3 r4 = {r1, r4} * r1 = r1 {r1, r4} = r1 (r3 r4) R⊇4 : (r4 r3) r4 = r2 r4 = r4 + {r1, r4} = r4 {r1, r4} = r4 (r3 r4) R⊇6 : r2 id = r2 r1 = ∅ + r2 R⊇6l : id r2 = r1 r2 = ∅ + r2\nR⊆9 , R ⊇ 9 : (r3 r4)̆ = {r1, r4}̆ = {r1, r3} * + {r1, r4} = r3 r4 = r4˘ r3˘\nR⊆10, R ⊇ 10 : r3˘ r3 r1 = r4 ∅ = r4 1 = {r1, r2, r4} * + {r2, r3, r4} = r1\nPL⇒ : (r1 r4) ∩ r1˘ = ∅ ∩ r1 = ∅ but (r4 r1) ∩ r1˘ = {r4, r1} ∩ r1 = r4 6= ∅ PL⇐ : (r4 r1) ∩ r1˘ = {r4, r1} ∩ r1 = r1 6= ∅ but (r1 r1) ∩ r4˘ = r1 ∩ r3 = ∅\nut\nRemark 12. Of course, there are calculi that satisfy only the weak conditions from Definition 2 but are a relation algebra, for example the following. Let Rel = {r0, r1}, U = {0, 1}, id = r1, 1 = {r1, r2} with:\nϕ(r1) = {(0, 0), (0, 1)} r1˘ = r2 r1 r1 = r1 ϕ(r2) = {(1, 0), (1, 1)} r2˘ = r1 r1 r2 = 1\nr2 r1 = 1 r2 r2 = r2"}, {"heading": "C Detailed description of the test results in Section 4 by calculus", "text": "9-Intersection\n– HETS: all axioms are satisfied. – SparQ: all 6 tests are passed."}, {"heading": "Allen’s interval relations", "text": "– [25]: this calculus is a relation algebra. – HETS: all axioms are satisfied. – SparQ: all 6 tests are passed."}, {"heading": "Block Algebra", "text": "– HETS: all axioms are satisfied. – SparQ: all 6 tests are passed.\nCardinal Direction Calculus\n– [25]: this calculus is a relation algebra, as already reported in [16]. – HETS: all axioms are satisfied. – SparQ: all 6 tests are passed.\nCardinal Direction Relations\n– HETS: R6 is violated for all base relations but one, R6l for only 209 base relations, R7 for 214 base relations, R9 for 5,607 pairs, R10 for 41,834 pairs, PL for 22,976 triples, R4 for 2,936,946 triples, and SA for 38 base relations. WA is satisfied. CDC is therefore just a Boolean algebra with distributivity, weak associativity and weak involution.\n– SparQ: the version with 218 base relations fails all 6 tests: R6 and R6l for 217 base relations, R7 for 214 base relations, R9 for 45,939 pairs (97%),5 PL for 22,976 triples (< 1%), and R4 for 2,936,946 triples (28%).\n5 This number is too large because SparQ uses a variant of R9.\nCounterexamples:\nFirst 5 counterexamples for PL\n(W-NW-N-NE-E NW-N-NE) ∩ B-S˘ = {} 6= {B} = (NW-N-NE B-S) ∩W-NW-N-NE-E˘\n(W-NW-N-NE-E NW-N-NE) ∩ B˘ = {} 6= {B} = (NW-N-NE B) ∩W-NW-N-NE-E˘\n(W-NW-N-NE-E NW-N) ∩ S-E-SE˘ = {} 6= {B} = (NW-N S-E-SE) ∩W-NW-N-NE-E˘\n(W-NW-N-NE-E NW-N) ∩ B-S-SE˘ = {} 6= {B} = (NW-N B-S-SE) ∩W-NW-N-NE-E˘\n(W-NW-N-NE-E NW-N) ∩ B-S-E-SE˘ = {} 6= {B} = (NW-N B-S-E-SE) ∩W-NW-N-NE-E˘\nFirst 10 counterexamples for R9\n(S S)̆ 6= S̆ S̆ (S SW)̆ 6= SW˘ S˘\n(S W)̆ 6= W˘ S˘ (S NW)̆ 6= NW˘ S˘\n(S N)̆ 6= N˘ S˘ (S NE)̆ 6= NE˘ S̆\n(S E)̆ 6= E˘ S˘ (S SE)̆ 6= SE˘ S˘ (S B)̆ 6= B˘ S˘\n(S S-SW)̆ 6= S-SW˘ S˘\nFirst 10 counterexamples for R10\nS˘ S S * S S˘ S SW * SW\nS˘ S W * W S˘ S NW * NW\nS˘ S N * N S˘ S NE * NE\nS˘ S E * E S̆ S SE * SE S̆ S B * B\nS˘ S S-SW * S-SW\nFirst 10 counterexamples for SA\n(B-S-W-NW 1) 1 6= B-S-W-NW 1 (B-W-N-NE 1) 1 6= B-W-N-NE 1 (B-N-E-SE 1) 1 6= B-N-E-SE 1 (B-S-SW-E 1) 1 6= B-S-SW-E 1 (B-S-NE-E 1) 1 6= B-S-NE-E 1 (B-S-W-SE 1) 1 6= B-S-W-SE 1\n(B-SW-W-N 1) 1 6= B-SW-W-N 1 (B-NW-N-E 1) 1 6= B-NW-N-E 1\n(B-S-W-NW-SE 1) 1 6= B-S-W-NW-SE 1 (B-SW-W-N-NE 1) 1 6= B-SW-W-N-NE 1\nFirst 5 counterexamples for R4\nW-NW-N-NE-E-SE (W-NW-N-NE-E-SE W-NW-N-NE-E) 6= (W-NW-N-NE-E-SE W-NW-N-NE-E-SE) W-NW-N-NE-E\nW-NW-N-NE-E-SE (W-NW-N-NE-E-SE W-NW-N-NE) 6= (W-NW-N-NE-E-SE W-NW-N-NE-E-SE) W-NW-N-NE\nW-NW-N-NE-E-SE (W-NW-N-NE-E-SE W-NW-N) 6= (W-NW-N-NE-E-SE W-NW-N-NE-E-SE) W-NW-N\nW-NW-N-NE-E-SE (W-NW-N-NE-E-SE S-SW-W-SE) 6= (W-NW-N-NE-E-SE W-NW-N-NE-E-SE) S-SW-W-SE\nW-NW-N-NE-E-SE (W-NW-N-NE-E-SE S-SW-W-E-SE) 6= (W-NW-N-NE-E-SE W-NW-N-NE-E-SE) S-SW-W-E-SE\nCYCb – HETS: all axioms are satisfied. – SparQ: all 6 tests are passed."}, {"heading": "Dependency Calculus", "text": "– [25]: this calculus is a relation algebra (and homomorphically embeddable\ninto RCC-5). – HETS: all axioms are satisfied. – SparQ: All 5 tests are passed."}, {"heading": "Dipole Calculus", "text": "– HETS: and DRAf violates R4 for 71,424 triples of base relations. For\nexample, we have that\nrrrl (rrrl llrl) 6= (rrrl rrrl) llrl.\nHowever, DRAf satisfies the weaker WA and SA. The violation of associativity attributed in [23] to the converse operation being weak, illustrated by the example bfii lllb = llll for DRAf. DRAfp and DRA-connectivity satisfy all axioms. – SparQ: R4 fails for 71,424 triples in DRAf (about 19%). The other 4 tests are passed. DRAfp and DRA-connectivity pass all 6 tests.\nGeometric Orientation – HETS: all axioms are satisfied. – SparQ: all 6 tests are passed."}, {"heading": "INDU", "text": "– HETS: 1,880 triples violate R4; the violation of associativity has already\nbeen reported and attributed to the absence of strong composition in [3]: for example,\nbi> (mi> m>) 6= (bi> mi>) m>.\nAll other axioms are satisfied, including SA and WA. Therefore, the Interval-Duration Calculus is a semi-associative relation algebra.\n– SparQ: All tests except R4 are passed; R4 fails on 1880 triples (12 %). OPRAn\n– [25]: for n = 1, 2, 3, 4, either the calculus is not associative, or there is an error in the composition table. – HETS: R4 is violated by 1,664 triples for OPRA1, 257,024 triples for OPRA2,\n2,963,952 triples for OPRA3, 16,711,680 triples for OPRA4, 63,840,000 triples for OPRA5, 190,771,200 triples for OPRA6, 481,275,648 triples for OPRA7,\n1,072,693,248 triples for OPRA8. All other axioms are satisfied, including SA and WA. Therefore, OPRAn, n 6 8, are semi-associative relation algebras. – SparQ: All tests except R4 are passed. In OPRA1, 1664 triples (21%) do not agree with R4; in OPRA2, there are 257,024 violations (69%); in OPRA3 2,963,952 (78%); in OPRA4 16,711,680 (83%); in OPRA5 63,840,000 (86%); and in OPRA6 190,771,200 (88%).\nFirst 10 counterexamples for R4, OPRA1:\n33 (32 x) 6= (33 32) x, x = 03, . . . , 00 33 (30 x) 6= (33 30) x, x = 23, . . . , 20 33 (23 x) 6= (33 23) x, x = 32, 30\nFirst 10 counterexamples for R4, OPRA2:\n77 (77 x) 6= (77 77) x, x = 67, . . . , 60, 57, 56\nFirst 10 counterexamples for R4, OPRA3:\n1111 (1111 11i) 6= (1111 1111) 11i, i = 10, 8, 6, 4, 2, 0 1111 (1111 10i) 6= (1111 1111) 10i, i = 11, . . . , 8\nFirst 10 counterexamples for R4, OPRAn, n = 4, . . . , 8, with m = 4n− 1:\nmm (mm mi) 6= (mm mm) mi, i = m, . . . , m− 9"}, {"heading": "Point Calculus", "text": "– HETS: all axioms are satisfied. – SparQ: all 6 tests are passed."}, {"heading": "QTC", "text": "– [25]: id is not a neutral element of composition in QTCB11 and QTCB12.\nAfter introducing a new id relation and making the relations JEPD, these two calculi pass all tests. – HETS: QTCB11 and QTCB12 violate R6 and R6l for all base relations that are not id. QTCB21 (9 base relations) and QTCB22 (27 base relations) violate R6 and R6l for all base relations. QTCC21 (81 base relations) does not satisfy R6 and R6l for all base relations but one, R4 for 292,424 triples, R9 for 160 pairs, R10 for 80 pairs,\nand PL for 1056 triples.6 QTCC22 (209 base relations) does not satisfy R6 and R6l for 208 relations, R9 for 1248 pairs, R10 for 624 pairs, PL for 12,768 triples, and R4 for 7,201,800 triples, see also footnote 6.\n– SparQ: QTCB11 and QTCB12 are reported to have no identity relation, and they both fail the test for R6 and R6l with all base relations but one. QTCB21 and QTCB22 are also reported to have no identity relation and fail the test for R6 and R6l with all base relations. QTCC21 (81 base relations) fails the test for R4 (292,424 triples, 55%), R6 and R6l (80 out of 81 relations), R9 (160 pairs, 2%), and PL (1056 triples, <1%). QTCC22 (209 base relations) shows a similar result: it fails the test for R4 (7,201,800 triples, 79%), R6 and R6l (208 out of 209 relations), R9 (1248 pairs, 3%), and PL (12,768 triples, <1%)."}, {"heading": "RCC", "text": "– [25]: after certain repairs to the composition table, RCC-5 and RCC-8 are found to be relation algebras.\n– HETS: all axioms are satisfied. – SparQ: after one repair (removing EC from the entry NTPPi NTPP),\nRCC-5 and RCC-8 pass all 6 tests."}, {"heading": "Rectangular Direction Relations", "text": "– HETS: R6 is violated for all base relations but one, R6l for only 33 base relations, R7 for 32 base relations, R9 for 855 pairs, R10 for 671 pairs, and PL for 3424 triples. R4, SA, and WA are satisfied. CDC is therefore just a Boolean algebra with distributivity, associativity and weak involution.\n– SparQ: the calculus fails the following tests: R6 and R6l for 35 out of 36 base relations, R7 for 32 base relations, R9 for 855 pairs (66%), and PL for 3424 triples (7%).\n6 Note that, for calculi that violate R9, the equivalence between PL and R10 is no longer ensured, hence the mentioning of both of them. Furthermore, R10 is the only axiom that should be tested for all relations, but we have only tested it for all base relations. Therefore, there could be more violations than the four listed. The same cautions apply to QTCC22.\nCounterexamples: First 10 counterexamples for PL\n(B N) ∩ B:W˘ = ∅ < (N B:W) ∩ B˘ = ∅ (B N) ∩ B˘ = ∅ < (N B) ∩ B˘ = ∅\n(B S) ∩ B:W:NW:N:NE:E˘ = ∅ < (S B:W:NW:N:NE:E) ∩ B˘ = ∅ (B S) ∩ B:N:NE:E˘ = ∅ < (S B:N:NE:E) ∩ B˘ = ∅\n(B S) ∩ B:W:NW:N˘ = ∅ < (S B:W:NW:N) ∩ B˘ = ∅ (B S) ∩ B:W:E˘ = ∅ < (S B:W:E) ∩ B˘ = ∅\n(B S) ∩ B:N˘ = ∅ < (S B:N) ∩ B˘ = ∅ (B S) ∩ B:E˘ = ∅ < (S B:E) ∩ B˘ = ∅\n(B S) ∩ B:W˘ = ∅ < (S B:W) ∩ B˘ = ∅ (B S) ∩ B˘ = ∅ < (S B) ∩ B˘ = ∅\nFirst 10 counterexamples for R9\n(B S:SW)̆ 6= S:SW˘ B˘ (B SW)̆ 6= SW˘ B˘ (B SE)̆ 6= SE˘ B˘\n(B NW)̆ 6= NW˘ B˘ (B NE)̆ 6= NE˘ B˘ (B W)̆ 6= W˘ B˘ (B E)̆ 6= E˘ B˘ (B N)̆ 6= N˘ B˘ (B S)̆ 6= S˘ B˘ (B B)̆ 6= B˘ B˘\nFirst 10 counterexamples for R10\nB˘ B S:SW * S:SW B˘ B SW * SW B˘ B SE * SE\nB˘ B NW * NW B˘ B NE * NE B˘ B W * W B˘ B E * E B˘ B N * N B˘ B S * S B˘ B B * B\nSTAR4 – HETS: all axioms are satisfied. – SparQ: all 6 tests are passed."}], "references": [{"title": "Maintaining knowledge about temporal intervals", "author": ["J.F. Allen"], "venue": "Communications of the ACM, 26(11):832–843, November", "citeRegEx": "1", "shortCiteRegEx": null, "year": 1983}, {"title": "Tractability results in the block algebra", "author": ["P. Balbiani", "J. Condotta", "L. Fariñas del Cerro"], "venue": "J. Log. Comput.,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2002}, {"title": "On the consistency problem for the INDU calculus", "author": ["P. Balbiani", "J. Condotta", "G. Ligozat"], "venue": "J. Applied Logic, 4(2):119–140,", "citeRegEx": "3", "shortCiteRegEx": null, "year": 2006}, {"title": "Qualitative spatial representation and reasoning", "author": ["A. Cohn", "J. Renz"], "venue": "F. van Harmelen, V. Lifschitz, and B. Porter, editors, Handbook of Knowledge Representation, chapter 13, pages 551–596. Elsevier,", "citeRegEx": "4", "shortCiteRegEx": null, "year": 2008}, {"title": "Constraint processing", "author": ["R. Dechter"], "venue": "Elsevier Morgan Kaufmann,", "citeRegEx": "5", "shortCiteRegEx": null, "year": 2003}, {"title": "Relation algebras and their application in temporal and spatial reasoning", "author": ["I. Düntsch"], "venue": "Artif. Intell. Rev., 23(4):315–357,", "citeRegEx": "6", "shortCiteRegEx": null, "year": 2005}, {"title": "A combined calculus on orientation with composition based on geometric properties", "author": ["F. Dylla", "J.H. Lee"], "venue": "ECAI-10, pages 1087–1088,", "citeRegEx": "7", "shortCiteRegEx": null, "year": 2010}, {"title": "Reasoning about binary topological relations", "author": ["M. Egenhofer"], "venue": "Proc. of SSD-91, volume 525 of LNCS, pages 143–160. Springer,", "citeRegEx": "8", "shortCiteRegEx": null, "year": 1991}, {"title": "Qualitative spatial reasoning with cardinal directions", "author": ["A. Frank"], "venue": "Proc. of ÖGAI-91, volume 287 of Informatik-Fachberichte, pages 157–167. Springer,", "citeRegEx": "9", "shortCiteRegEx": null, "year": 1991}, {"title": "GQR - A Fast Reasoner for Binary Qualitative Constraint Calculi", "author": ["Z. Gantner", "M. Westphal", "S. Wölfl"], "venue": "Proc. of the AAAI-08 Workshop on Spatial and Temporal Reasoning,", "citeRegEx": "10", "shortCiteRegEx": null, "year": 2008}, {"title": "Topological inference", "author": ["M. Grigni", "D. Papadias", "C.H. Papadimitriou"], "venue": "Proc. of IJCAI-95 (1), pages 901–907. Morgan Kaufmann,", "citeRegEx": "11", "shortCiteRegEx": null, "year": 1995}, {"title": "Relation algebras by games, volume 147 of Studies in logic and the foundations of mathematics", "author": ["R. Hirsch", "I. Hodkinson"], "venue": "Elsevier,", "citeRegEx": "12", "shortCiteRegEx": null, "year": 2002}, {"title": "A new approach to cyclic ordering of 2D orientations using ternary relation algebras", "author": ["A. Isli", "A. Cohn"], "venue": "Artif. Intell., 122(1-2):137–187,", "citeRegEx": "13", "shortCiteRegEx": null, "year": 2000}, {"title": "A complete classification of tractability in RCC-5", "author": ["P. Jonsson", "T. Drakengren"], "venue": "J. Artif. Intell. Res. (JAIR), 6:211–221,", "citeRegEx": "14", "shortCiteRegEx": null, "year": 1997}, {"title": "Spatial logics with connectedness predicates", "author": ["R. Kontchakov", "I. Pratt-Hartmann", "F. Wolter", "M. Zakharyaschev"], "venue": "Log. Meth. Comp. Sci., 6(3),", "citeRegEx": "15", "shortCiteRegEx": null, "year": 2010}, {"title": "Reasoning about cardinal directions", "author": ["G. Ligozat"], "venue": "J. Vis. Lang. Comput., 9(1):23–44,", "citeRegEx": "16", "shortCiteRegEx": null, "year": 1998}, {"title": "Categorical methods in qualitative reasoning: The case for weak representations", "author": ["G. Ligozat"], "venue": "Proc. of COSIT-05, pages 265–282,", "citeRegEx": "17", "shortCiteRegEx": null, "year": 2005}, {"title": "Qualitative Spatial and Temporal Reasoning", "author": ["G. Ligozat"], "venue": "Wiley,", "citeRegEx": "18", "shortCiteRegEx": null, "year": 2011}, {"title": "What is a qualitative calculus? A general framework", "author": ["G. Ligozat", "J. Renz"], "venue": "Proc. of PRICAI-04, volume 3157 of LNCS, pages 53–64. Springer,", "citeRegEx": "19", "shortCiteRegEx": null, "year": 2004}, {"title": "Consistency in networks of relations", "author": ["A.K. Mackworth"], "venue": "Artif. Intell., 8:99–118,", "citeRegEx": "20", "shortCiteRegEx": null, "year": 1977}, {"title": "Relation algebras, volume 150 of Studies in logic and the foundations of mathematics", "author": ["R. Maddux"], "venue": "Elsevier,", "citeRegEx": "21", "shortCiteRegEx": null, "year": 2006}, {"title": "Representing Relative Direction as a Binary Relation of Oriented Points", "author": ["R. Moratz"], "venue": "Proc. of ECAI-06, pages 407–411. IOS Press,", "citeRegEx": "22", "shortCiteRegEx": null, "year": 2006}, {"title": "A condensed semantics for qualitative spatial reasoning about oriented straight line segments", "author": ["R. Moratz", "D. Lücke", "T. Mossakowski"], "venue": "Artif. Intell., 175:2099– 2127,", "citeRegEx": "23", "shortCiteRegEx": null, "year": 2011}, {"title": "Qualitative spatial reasoning about line segments", "author": ["R. Moratz", "J. Renz", "D. Wolter"], "venue": "Proc. of ECAI-00, pages 234–238. IOS Press,", "citeRegEx": "24", "shortCiteRegEx": null, "year": 2000}, {"title": "Algebraische Eigenschaften qualitativer Constraint-Kalküle", "author": ["F. Mossakowski"], "venue": "Diplom thesis, Dept. of Comput. Science, University of Bremen,", "citeRegEx": "25", "shortCiteRegEx": null, "year": 2007}, {"title": "The heterogeneous tool set, Hets", "author": ["T. Mossakowski", "C. Maeder", "K. Lüttich"], "venue": "Proc. of TACAS-07, volume 4424 of LNCS, pages 519–522. Springer,", "citeRegEx": "26", "shortCiteRegEx": null, "year": 2007}, {"title": "Qualitative reasoning about relative direction of oriented points", "author": ["T. Mossakowski", "R. Moratz"], "venue": "Artif. Intell., 180–181:34–45,", "citeRegEx": "27", "shortCiteRegEx": null, "year": 2012}, {"title": "Spatial reasoning with rectangular cardinal relations – the convex tractable subalgebra", "author": ["I. Navarrete", "A. Morales", "G. Sciavicco", "M. Cárdenas-Viedma"], "venue": "Ann. Math. Artif. Intell., 67(1):31–70,", "citeRegEx": "29", "shortCiteRegEx": null, "year": 2013}, {"title": "Formal properties of constraint calculi for qualitative spatial reasoning", "author": ["B. Nebel", "A. Scivos"], "venue": "KI, 16(4):14–18,", "citeRegEx": "30", "shortCiteRegEx": null, "year": 2002}, {"title": "A new framework for reasoning about points, intervals and durations", "author": ["A.K. Pujari", "A. Sattar"], "venue": "Proc. of IJCAI-99, pages 1259–1267,", "citeRegEx": "31", "shortCiteRegEx": null, "year": 1999}, {"title": "Dependency calculus: Reasoning in a general point relation algebra", "author": ["M. Ragni", "A. Scivos"], "venue": "Proc. of KI-05, pages 49–63. Springer,", "citeRegEx": "32", "shortCiteRegEx": null, "year": 2005}, {"title": "A spatial logic based on regions and “Connection", "author": ["D.A. Randell", "Z. Cui", "A.G. Cohn"], "venue": "Proc. of KR-92, pages 165–176,", "citeRegEx": "33", "shortCiteRegEx": null, "year": 1992}, {"title": "Qualitative Spatial Reasoning with Topological Information, volume 2293 of LNCS", "author": ["J. Renz"], "venue": "Springer-Verlag, Berlin,", "citeRegEx": "34", "shortCiteRegEx": null, "year": 2002}, {"title": "Qualitative direction calculi with arbitrary granularity", "author": ["J. Renz", "D. Mitra"], "venue": "Proc. of PRICAI-04, volume 3157 of LNAI, pages 65–74. Springer,", "citeRegEx": "35", "shortCiteRegEx": null, "year": 2004}, {"title": "Einführung in eine Theorie der ternären RST-Kalküle für qualitatives räumliches Schließen", "author": ["A. Scivos"], "venue": "Diplom thesis, University of Freiburg,", "citeRegEx": "36", "shortCiteRegEx": null, "year": 2000}, {"title": "Composing cardinal direction relations", "author": ["S. Skiadopoulos", "M. Koubarakis"], "venue": "Artif. Intell., 152(2):143–171,", "citeRegEx": "37", "shortCiteRegEx": null, "year": 2004}, {"title": "On the consistency of cardinal direction constraints", "author": ["S. Skiadopoulos", "M. Koubarakis"], "venue": "Artif. Intell., 163(1):91–135,", "citeRegEx": "38", "shortCiteRegEx": null, "year": 2005}, {"title": "Representing and Reasoning about Moving Objects: A Qualitative Approach", "author": ["N. Van de Weghe"], "venue": "PhD thesis, Ghent University,", "citeRegEx": "39", "shortCiteRegEx": "39", "year": 2004}, {"title": "A qualitative trajectory calculus and the composition of its relations", "author": ["N. Van de Weghe", "B. Kuijpers", "P. Bogaert", "P. De Maeyer"], "venue": "In Proc. of GeoS-05,", "citeRegEx": "40", "shortCiteRegEx": "40", "year": 2005}, {"title": "Constraint propagation algorithms for temporal reasoning: a revised report", "author": ["M. Vilain", "H. Kautz", "P. van Beek"], "venue": "In Readings in qualitative reasoning about physical systems,", "citeRegEx": "41", "shortCiteRegEx": "41", "year": 1989}, {"title": "Qualitative spatial representation and reasoning in the SparQ-toolbox", "author": ["J. Wallgrün", "L. Frommberger", "D. Wolter", "F. Dylla", "C. Freksa"], "venue": "Proc. of Spatial Cognition-06, volume 4387 of LNCS, pages 39–58. Springer,", "citeRegEx": "42", "shortCiteRegEx": null, "year": 2008}, {"title": "SparQ User Manual V0.7", "author": ["J.O. Wallgrün", "L. Frommberger", "F. Dylla", "D. Wolter"], "venue": "User manual,", "citeRegEx": "43", "shortCiteRegEx": "43", "year": 2009}, {"title": "Qualitative matching of spatial information", "author": ["J.O. Wallgrün", "D. Wolter", "K.-F. Richter"], "venue": "Proceedings of ACM GIS,", "citeRegEx": "44", "shortCiteRegEx": null, "year": 2010}, {"title": "Qualitative reasoning with directional relations", "author": ["D. Wolter", "J.H. Lee"], "venue": "Artificial Intelligence, 174(18):1498–1507,", "citeRegEx": "45", "shortCiteRegEx": null, "year": 2010}], "referenceMentions": [{"referenceID": 17, "context": "In the past decades, a vast number of qualitative representations have been developed that are commonly referred to as qualitative calculi (see [18] for a recent overview).", "startOffset": 144, "endOffset": 148}, {"referenceID": 28, "context": "Nebel and Scivos [30] have introduced the rather general and weak notion of a constraint algebra, which is a set of relations closed under converse, finite intersection, and composition.", "startOffset": 17, "endOffset": 21}, {"referenceID": 18, "context": "Ligozat and Renz [19] focus", "startOffset": 17, "endOffset": 21}, {"referenceID": 36, "context": "Both approaches assume that the converse operation is strong, which is not the case for calculi like the Cardinal Direction (Relations) Calculus (CDR) [38] or its recently introduced rectangular variant (RDR) [29].", "startOffset": 151, "endOffset": 155}, {"referenceID": 27, "context": "Both approaches assume that the converse operation is strong, which is not the case for calculi like the Cardinal Direction (Relations) Calculus (CDR) [38] or its recently introduced rectangular variant (RDR) [29].", "startOffset": 209, "endOffset": 213}, {"referenceID": 41, "context": "– We discuss the role of algebraic properties of calculi for spatial reasoning, especially in connection with general-purpose reasoning tools like SparQ [43, 42] and GQR [10] (Section 3.", "startOffset": 153, "endOffset": 161}, {"referenceID": 40, "context": "– We discuss the role of algebraic properties of calculi for spatial reasoning, especially in connection with general-purpose reasoning tools like SparQ [43, 42] and GQR [10] (Section 3.", "startOffset": 153, "endOffset": 161}, {"referenceID": 9, "context": "– We discuss the role of algebraic properties of calculi for spatial reasoning, especially in connection with general-purpose reasoning tools like SparQ [43, 42] and GQR [10] (Section 3.", "startOffset": 170, "endOffset": 174}, {"referenceID": 18, "context": "Ligozat and Renz [19] note that most spatial and temporal calculi are based on a set of JEPD (jointly exhaustive and pairwise disjoint) relations.", "startOffset": 17, "endOffset": 21}, {"referenceID": 18, "context": "The following definition is standard in the QSR literature [19, 4].", "startOffset": 59, "endOffset": 66}, {"referenceID": 3, "context": "The following definition is standard in the QSR literature [19, 4].", "startOffset": 59, "endOffset": 66}, {"referenceID": 18, "context": "(U ,R) is called a partition scheme [19] if R contains the identity relation id and, for every r ∈ R, there is some s ∈ R such that r ̆ = s.", "startOffset": 36, "endOffset": 40}, {"referenceID": 18, "context": "Ligozat and Renz [19] base their definition of a qualitative calculus on the notion of a partition scheme.", "startOffset": 17, "endOffset": 21}, {"referenceID": 16, "context": "We call Properties (1) and (2) abstract converse and abstract composition, following Ligozat’s naming [17].", "startOffset": 102, "endOffset": 106}, {"referenceID": 16, "context": "requirements on the converse operation than Ligozat and Renz’s notions of a weak representation [17, 19].", "startOffset": 96, "endOffset": 104}, {"referenceID": 18, "context": "requirements on the converse operation than Ligozat and Renz’s notions of a weak representation [17, 19].", "startOffset": 96, "endOffset": 104}, {"referenceID": 28, "context": "On the other hand, our notion makes stronger requirements on the converse than Nebel and Scivos’s notion of a constraint algebra [30].", "startOffset": 129, "endOffset": 133}, {"referenceID": 18, "context": "Comparing Definitions 1–3 with the basic notions of a qualitative calculus in [19], a weak representation is a calculus with identity relation, strong converse and abstract composition.", "startOffset": 78, "endOffset": 82}, {"referenceID": 18, "context": "Conversely, [19] are slightly more general than we are, because the map φ need not be injective.", "startOffset": 12, "endOffset": 16}, {"referenceID": 18, "context": "Furthermore, in [19], a representation is a weak representation with strong composition and an injective map φ.", "startOffset": 16, "endOffset": 20}, {"referenceID": 4, "context": "This procedure is known as the path-consistency algorithm [5].", "startOffset": 58, "endOffset": 61}, {"referenceID": 7, "context": "Domain #BR RM 9-Intersection [8] simple 2D regions 8 I [11, 15] Allen’s interval relations [1] intervals (order) 13 A [41] Block Algebra [2] n-dimensional blocks 13 A [2] Cardinal Dir.", "startOffset": 29, "endOffset": 32}, {"referenceID": 10, "context": "Domain #BR RM 9-Intersection [8] simple 2D regions 8 I [11, 15] Allen’s interval relations [1] intervals (order) 13 A [41] Block Algebra [2] n-dimensional blocks 13 A [2] Cardinal Dir.", "startOffset": 55, "endOffset": 63}, {"referenceID": 14, "context": "Domain #BR RM 9-Intersection [8] simple 2D regions 8 I [11, 15] Allen’s interval relations [1] intervals (order) 13 A [41] Block Algebra [2] n-dimensional blocks 13 A [2] Cardinal Dir.", "startOffset": 55, "endOffset": 63}, {"referenceID": 0, "context": "Domain #BR RM 9-Intersection [8] simple 2D regions 8 I [11, 15] Allen’s interval relations [1] intervals (order) 13 A [41] Block Algebra [2] n-dimensional blocks 13 A [2] Cardinal Dir.", "startOffset": 91, "endOffset": 94}, {"referenceID": 39, "context": "Domain #BR RM 9-Intersection [8] simple 2D regions 8 I [11, 15] Allen’s interval relations [1] intervals (order) 13 A [41] Block Algebra [2] n-dimensional blocks 13 A [2] Cardinal Dir.", "startOffset": 118, "endOffset": 122}, {"referenceID": 1, "context": "Domain #BR RM 9-Intersection [8] simple 2D regions 8 I [11, 15] Allen’s interval relations [1] intervals (order) 13 A [41] Block Algebra [2] n-dimensional blocks 13 A [2] Cardinal Dir.", "startOffset": 137, "endOffset": 140}, {"referenceID": 1, "context": "Domain #BR RM 9-Intersection [8] simple 2D regions 8 I [11, 15] Allen’s interval relations [1] intervals (order) 13 A [41] Block Algebra [2] n-dimensional blocks 13 A [2] Cardinal Dir.", "startOffset": 167, "endOffset": 170}, {"referenceID": 8, "context": "Calculus CDC [9, 16] directions (point abstr.", "startOffset": 13, "endOffset": 20}, {"referenceID": 15, "context": "Calculus CDC [9, 16] directions (point abstr.", "startOffset": 13, "endOffset": 20}, {"referenceID": 15, "context": ") 9 A [16] Cardinal Dir.", "startOffset": 6, "endOffset": 10}, {"referenceID": 35, "context": "Relations CDR [37] regions 218 P CycOrd, binary CYCb [13] oriented lines 4 U Dependency Calculus [32] points (partial order) 5 A [32] Dipole Calculusa DRAf [24, 23] directions from line segm.", "startOffset": 14, "endOffset": 18}, {"referenceID": 12, "context": "Relations CDR [37] regions 218 P CycOrd, binary CYCb [13] oriented lines 4 U Dependency Calculus [32] points (partial order) 5 A [32] Dipole Calculusa DRAf [24, 23] directions from line segm.", "startOffset": 53, "endOffset": 57}, {"referenceID": 30, "context": "Relations CDR [37] regions 218 P CycOrd, binary CYCb [13] oriented lines 4 U Dependency Calculus [32] points (partial order) 5 A [32] Dipole Calculusa DRAf [24, 23] directions from line segm.", "startOffset": 97, "endOffset": 101}, {"referenceID": 30, "context": "Relations CDR [37] regions 218 P CycOrd, binary CYCb [13] oriented lines 4 U Dependency Calculus [32] points (partial order) 5 A [32] Dipole Calculusa DRAf [24, 23] directions from line segm.", "startOffset": 129, "endOffset": 133}, {"referenceID": 23, "context": "Relations CDR [37] regions 218 P CycOrd, binary CYCb [13] oriented lines 4 U Dependency Calculus [32] points (partial order) 5 A [32] Dipole Calculusa DRAf [24, 23] directions from line segm.", "startOffset": 156, "endOffset": 164}, {"referenceID": 22, "context": "Relations CDR [37] regions 218 P CycOrd, binary CYCb [13] oriented lines 4 U Dependency Calculus [32] points (partial order) 5 A [32] Dipole Calculusa DRAf [24, 23] directions from line segm.", "startOffset": 156, "endOffset": 164}, {"referenceID": 43, "context": "72 I [45] DRAfp [23] directions from line segm.", "startOffset": 5, "endOffset": 9}, {"referenceID": 22, "context": "72 I [45] DRAfp [23] directions from line segm.", "startOffset": 16, "endOffset": 20}, {"referenceID": 42, "context": "80 I DRA-connectivity [44] connectivity of line segm.", "startOffset": 22, "endOffset": 26}, {"referenceID": 6, "context": "7 U Geometric Orientation [7] relative orientation 4 U INDU [31] intervals (order, rel.", "startOffset": 26, "endOffset": 29}, {"referenceID": 29, "context": "7 U Geometric Orientation [7] relative orientation 4 U INDU [31] intervals (order, rel.", "startOffset": 60, "endOffset": 64}, {"referenceID": 21, "context": ", 8 [22, 27] oriented points 4m · (4m + 1) (Oriented Point Rel.", "startOffset": 4, "endOffset": 12}, {"referenceID": 26, "context": ", 8 [22, 27] oriented points 4m · (4m + 1) (Oriented Point Rel.", "startOffset": 4, "endOffset": 12}, {"referenceID": 43, "context": "Algebra) I [45] Point Calculus [41] points (total order) 3 A [41] Qualitat.", "startOffset": 11, "endOffset": 15}, {"referenceID": 39, "context": "Algebra) I [45] Point Calculus [41] points (total order) 3 A [41] Qualitat.", "startOffset": 31, "endOffset": 35}, {"referenceID": 39, "context": "Algebra) I [45] Point Calculus [41] points (total order) 3 A [41] Qualitat.", "startOffset": 61, "endOffset": 65}, {"referenceID": 37, "context": "QTCB11 [39, 40] moving point obj.", "startOffset": 7, "endOffset": 15}, {"referenceID": 38, "context": "QTCB11 [39, 40] moving point obj.", "startOffset": 7, "endOffset": 15}, {"referenceID": 31, "context": "RCC-5 [33] regions 5 A [14] RCC-8 [33] regions 8 A [34] Rectangular Cardinal Rel.", "startOffset": 6, "endOffset": 10}, {"referenceID": 13, "context": "RCC-5 [33] regions 5 A [14] RCC-8 [33] regions 8 A [34] Rectangular Cardinal Rel.", "startOffset": 23, "endOffset": 27}, {"referenceID": 31, "context": "RCC-5 [33] regions 5 A [14] RCC-8 [33] regions 8 A [34] Rectangular Cardinal Rel.", "startOffset": 34, "endOffset": 38}, {"referenceID": 32, "context": "RCC-5 [33] regions 5 A [14] RCC-8 [33] regions 8 A [34] Rectangular Cardinal Rel.", "startOffset": 51, "endOffset": 55}, {"referenceID": 27, "context": "s RDR [29] regions 36 A [29] Star Algebra STAR4 [35] directions from a point 9 P aVariant DRAc is not based on a weak partition scheme – JEPD is violated [23].", "startOffset": 6, "endOffset": 10}, {"referenceID": 27, "context": "s RDR [29] regions 36 A [29] Star Algebra STAR4 [35] directions from a point 9 P aVariant DRAc is not based on a weak partition scheme – JEPD is violated [23].", "startOffset": 24, "endOffset": 28}, {"referenceID": 33, "context": "s RDR [29] regions 36 A [29] Star Algebra STAR4 [35] directions from a point 9 P aVariant DRAc is not based on a weak partition scheme – JEPD is violated [23].", "startOffset": 48, "endOffset": 52}, {"referenceID": 22, "context": "s RDR [29] regions 36 A [29] Star Algebra STAR4 [35] directions from a point 9 P aVariant DRAc is not based on a weak partition scheme – JEPD is violated [23].", "startOffset": 154, "endOffset": 158}, {"referenceID": 41, "context": "This paper is concerned with properties of binary spatio-temporal calculi that are described in the literature and implemented in the spatial representation and reasoning tool SparQ [43, 42].", "startOffset": 182, "endOffset": 190}, {"referenceID": 40, "context": "This paper is concerned with properties of binary spatio-temporal calculi that are described in the literature and implemented in the spatial representation and reasoning tool SparQ [43, 42].", "startOffset": 182, "endOffset": 190}, {"referenceID": 20, "context": "Axioms for relation algebras and weaker variants [21].", "startOffset": 49, "endOffset": 53}, {"referenceID": 18, "context": "RAs have been considered in the literature for spatio-temporal calculi [19, 6, 25].", "startOffset": 71, "endOffset": 82}, {"referenceID": 5, "context": "RAs have been considered in the literature for spatio-temporal calculi [19, 6, 25].", "startOffset": 71, "endOffset": 82}, {"referenceID": 24, "context": "RAs have been considered in the literature for spatio-temporal calculi [19, 6, 25].", "startOffset": 71, "endOffset": 82}, {"referenceID": 20, "context": "An (abstract) RA is defined in [21]; here we use the symbols ∪, , and id instead of +, ;, and 1′.", "startOffset": 31, "endOffset": 35}, {"referenceID": 18, "context": "In the literature, a different axiomatization is sometimes used, for example in [19].", "startOffset": 80, "endOffset": 84}, {"referenceID": 11, "context": "The most prominent difference is that R10 is replaced by PL, “a more intuitive and useful form, known as the Peircean law or De Morgan’s Theorem K” [12].", "startOffset": 148, "endOffset": 152}, {"referenceID": 39, "context": "For example, assume two variants of the 1D Point Calculus [41]: PC= with the relations less than (<), equal (=), and greater than (>), interpreted as the natural relations <,=, > over the domain of the reals, and its approximation PC≈ with the relations less than (<), approximately equal (≈), and greater than (>), where ≈ is interpreted as the set of pairs of points whose distance is below a certain threshold.", "startOffset": 58, "endOffset": 62}, {"referenceID": 5, "context": "The equality then means that the “reading direction” does not matter, see also [6].", "startOffset": 79, "endOffset": 82}, {"referenceID": 18, "context": "The following correspondence between properties of a calculus and notions of a relation algebra is due to Ligozat and Renz [19].", "startOffset": 123, "endOffset": 127}, {"referenceID": 25, "context": "To answer Questions (1) and (2), we use the axioms for relation algebras listed in Table 2 using both the heterogeneous tool set HETS [26] and SparQ.", "startOffset": 134, "endOffset": 138}, {"referenceID": 24, "context": "A part of the calculi have already been tested by Florian Mossakowski [25], using a different CASL specification based on an equivalent axiomatization from [19].", "startOffset": 70, "endOffset": 74}, {"referenceID": 18, "context": "A part of the calculi have already been tested by Florian Mossakowski [25], using a different CASL specification based on an equivalent axiomatization from [19].", "startOffset": 156, "endOffset": 160}, {"referenceID": 24, "context": "Direction Relations HS 3 3 3 97 92 89 66 7 52 Cardinal Direction Relations HS 28 17 3 99 99 98 12 <1 88 acalculus was tested by: M = [25], H = HETS, S = SparQ b21%, 69%, 78%, 83%, 86%, 88%, 90%, 91% for OPRAn, n = 1, .", "startOffset": 133, "endOffset": 137}, {"referenceID": 22, "context": "For DRAf and INDU, this has been done in the literature [23, 3].", "startOffset": 56, "endOffset": 63}, {"referenceID": 2, "context": "For DRAf and INDU, this has been done in the literature [23, 3].", "startOffset": 56, "endOffset": 63}, {"referenceID": 22, "context": "While DRAfp has been proven to be associative due to strong composition in [23], for OPRAm, it can be shown that none of the variants for any m are associative (see [28]).", "startOffset": 75, "endOffset": 79}, {"referenceID": 24, "context": "As observed in [25], it is possible to equip them with a new id relation, modify the interpretation of the other relations such that they become JEPD, and adapt the converse and composition table accordingly.", "startOffset": 15, "endOffset": 19}, {"referenceID": 19, "context": ", to use at least PC-2 [20].", "startOffset": 23, "endOffset": 27}, {"referenceID": 34, "context": "An interesting and significant line of future work is to extend this study to ternary calculi, which requires an extension of binary relation algebras to ternary relations, see also [36].", "startOffset": 182, "endOffset": 186}], "year": 2013, "abstractText": "Qualitative spatial and temporal reasoning is based on socalled qualitative calculi. Algebraic properties of these calculi have several implications on reasoning algorithms. But what exactly is a qualitative calculus? And to which extent do the qualitative calculi proposed meet these demands? The literature provides various answers to the first question but only few facts about the second. In this paper we identify the minimal requirements to binary spatio-temporal calculi and we discuss the relevance of the according axioms for representation and reasoning. We also analyze existing qualitative calculi and provide a classification involving different notions of relation algebra.", "creator": "LaTeX with hyperref package"}}}