{"id": "1401.3895", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "16-Jan-2014", "title": "On the Intertranslatability of Argumentation Semantics", "abstract": "Translations legibly between longman different nonmonotonic formalisms bkc always have been an kamiya important topic holzemer in herbig the field, burgaw in benicàssim particular autuori to understand t-37 the knowledge - representation chikhli capabilities those alloudi formalisms offer. We provide 21.18 such endangered an accelerometers investigation in buñuel terms of heresies different vishram semantics proposed matinuddin for abstract 609 argumentation frameworks, turjeman a nonmonotonic grael yet simple israels formalism airfoils which kapono received l993 increasing interest squeegees within barrier the last easthope decade. jcf Although the properties of these 1898-99 different semantics ejiri are latvian nowadays shinjo well 17-year-old understood, vlasova there pierantoni are no explicit wys results lapilli about bethea intertranslatability. startling We oppama provide such translations wrt. different gawain properties larix and also give a 2218 few ivory novel cirencester complexity polygraph results which underlie .423 some negative zuccosptimes.com results.", "histories": [["v1", "Thu, 16 Jan 2014 05:17:48 GMT  (338kb)", "http://arxiv.org/abs/1401.3895v1", null]], "reviews": [], "SUBJECTS": "cs.AI", "authors": ["wolfgang dvorak", "stefan woltran"], "accepted": false, "id": "1401.3895"}, "pdf": {"name": "1401.3895.pdf", "metadata": {"source": "CRF", "title": "On the Intertranslatability of Argumentation Semantics", "authors": ["Wolfgang Dvořák", "Stefan Woltran"], "emails": ["dvorak@dbai.tuwien.ac.at", "woltran@dbai.tuwien.ac.at"], "sections": [{"heading": "1. Introduction", "text": "Studies on the intertranslatability of different approaches to nonmonotonic reasoning have always been considered as an important contribution to the field in order to understand the expressibility and representation capacity of the various formalisms. By intertranslatability we understand a function Tr which maps theories from one formalism into another such that intended models of a theory ∆ from the source formalism are in a certain relation to the intended models of Tr (∆). Several desired properties for such translation functions have been identified, including to be polynomial (Tr (∆) can be computed in polynomial time wrt. the size of ∆) or to be modular (roughly speaking, that allows to transform parts of the theory independently of each other). In particular, the relationship between (variants of) default logic (Reiter, 1980) and nonmonotonic modal logics, e.g. autoepistemic logic (Moore, 1985), has always received a lot of attention, (see, e.g., Denecker, Marek, & Truszczyński, 2003; Konolige, 1988; Marek & Truszczyński, 1993). Perhaps most notably, Gottlob (1995) showed that a modular translation from default logic to autoepistemic logic is impossible. Other important contributions in this direction include translations between default logic and circumscription (Imielinski, 1987), modal nonmonotonic logics and logic programs (see, e.g., de Bruijn, Eiter, & Tompits, 2008 for an overview and recent applications) and the work by Janhunen (1999). Let us also refer here to recent work by Pearce and Uridia (2011), who show that translations of the aforementioned kind have already been known in the context of non-classical logics and related results date back to the work of Gödel.\nIn this work, we study translation functions within a particular formalism of nonmonotonic reasoning but wrt. to different semantics proposed for this formalism. In the area of default logic, similar research was undertaken, for instance by Liberatore (2007) or Delgrande and Schaub (2005). Likewise, for work concerning the relationship between different logic programming semantics we refer to the work of Janhunen, Niemelä, Seipel, Simons,\nc©2011 AI Access Foundation. All rights reserved.\nand You (2006) and the references therein. The formalism we focus on in this paper are Dung’s argumentation frameworks (Dung, 1995) which received increasing interest within the last decade. In a nutshell, such argumentation frameworks (AFs, for short) represent abstract statements1 together with a relation denoting attacks between them. Different semantics provide different ways to solve the inherent conflicts between statements by selecting acceptable subsets — usually called extensions — of them. Several such semantics have already been proposed by Dung in his seminal paper (Dung, 1995), but also alternative approaches play a major role nowadays (see, e.g., Baroni, Dunne, & Giacomin, 2011; Baroni, Giacomin, & Guida, 2005; Caminada, 2006; Dung, Mancarella, & Toni, 2007; Verheij, 1996). Compared to other nonmonotonic formalisms (which are built on top of classical logical syntax), argumentation frameworks are a much simpler formalism (in the end, they are just directed graphs). However, this simplicity made them an attractive modeling tool in several diverse areas, like formalizations of legal reasoning (Bench-Capon & Dunne, 2005) or multi-agent negotiation (Amgoud, Dimopoulos, & Moraitis, 2007).\nIn the field of argumentation, intertranslatability has mainly been studied in connection with generalizations of Dung’s argumentation frameworks. By generalization we mean here the augmentation of simple frameworks by further concepts as priorities or additional relations between arguments. In this context, translations were used to show that proposed semantics for such generalizations are in a close relation with the corresponding semantics of standard AFs. In other words, given such a generalized AF one is interested in translating them to standard AFs while preserving semantics. Such translations have been discussed, for instance, in terms of bipolar AFs (Cayrol & Lagasquie-Schiex, 2009), valuebased AFs (Bench-Capon & Atkinson, 2009), AFs with recursive attacks (Baroni, Cerutti, Giacomin, & Guida, 2011), or abstract dialectical frameworks (Brewka, Dunne, & Woltran, 2011). A recent exception where intertranslatability within Dung AFs is discussed, is the work by Baumann and Brewka (2010), who consider to enforce a desired extension in Dung AFs by adding new arguments and switching semantics. From a slightly different perspective, also the work by Gabbay (2009) is related, since it investigates the substitution of an argumentation framework as a node in another framework.\nWe focus here exclusively on standard argumentation frameworks and have the following main objective: Given an AF F and argumentation semantics σ and σ′, find a function Tr such that the σ-extensions of F are in certain correspondence to the σ′-extensions of Tr (F ). We believe that such results are important from different points of view.\nFirstly, consider there is an advanced argumentation engine for a semantics σ′, but one wants to evaluate an AF F wrt. to a different semantics σ. Then, it might be a good plan to transform F in such a way into an AF F ′ such that evaluating F ′ wrt. semantics σ′ allows for an easy reconstruction of the σ-extensions of F . If the required transformations are efficiently computable, this leads to a potentially more successful approach than implementing a distinguished algorithm for the σ-semantics from scratch. Figure 1 illustrates this idea. The concept of a filter is required in case Tr (F ) introduces further arguments (which thus might appear in the σ′-extensions of Tr (F )) in the course of the translation making a filter-\n1. In general, arguments are not considered as simple statements but contain a number of reasons that lead to a conclusion (see, e.g., Besnard & Hunter, 2001; Caminada & Amgoud, 2007). However, for the purpose of this work, we will treat arguments as atomic entities thus abstracting from their internal structure.\ning of these new arguments necessary to obtain the desired original extensions. However, we will also consider translations for which such a back-translation is not necessary.\nA second motivation of our work is concerned with meta(level) argumentation (see, e.g., Modgil & Bench-Capon, 2011; Villata, 2010) which can be explained as follows: “A meta-level Dung argumentation framework is itself instantiated by arguments that make statements about arguments, their interactions, and their evaluation in an object-level argumentation framework”(Modgil & Bench-Capon, 2011). The translations we shall present here exactly fit into this picture in the sense that we have to model certain features of a semantics σ within another semantics σ′, when giving a translation from σ to σ′. To have a more concrete example, let σ′ be the complete semantics and σ denote stable semantics (we will provide the formal details about the different semantics in Section 2; for the sake of this illustration the details are not required). Then, the transformation has to capture the concept of admissibility (informally speaking, a set of arguments has to defend itself) which is implicitly present in complete semantics by a suitable introduction of new arguments, such that stable semantics can perform such a type of reasoning. In other words, translatability results between different semantics of AFs yield an understanding of how certain properties, which are specified implicitly within one semantics, can be made (syntactically) explicit within an AF in order to make these properties amenable to another semantics.\nAs a third important application of our work, we consider situations where different semantics of argumentation have to be dealt with simultaneously. This might be the case if different agents share their views about a certain situation (modeled as AFs) but these agents use different semantics to reason over their frameworks. As well, the problem of combining frameworks which have been constructed under the assumption that they will be evaluated under different semantics falls into a possible application area of our work.\nFinally, we emphasize that understanding which translations can be efficiently performed wrt. different semantics complements the picture about expressibility of argumentation semantics. For instance, if there exists an efficient translation from semantics σ to semantics σ′, but there is no such translation in the other direction, σ could be understood as more expressible than σ′, although complexity analysis for typical decision problems associated to AFs does not show any difference between σ and σ′. As an example consider semi-stable and stage semantics. For both semantics the credulous acceptance problem is ΣP2 -complete and the skeptical acceptance problem is ΠP2 -complete (Dvořák & Woltran, 2010). But when considering what we call efficient exact translations one can map stage semantics to semistable semantics but not vice versa. Thus semi-stable semantics are more expressible than stage semantics wrt. efficient exact translations. However we will argue that the notion of exact translations may be too restrictive for comparing the expressibility of argumentation semantics.\nBeside these aspects of motivation, we would like to mention that positive results on intertranslations indicate a certain form of independence of semantics in argumentation. This is of particular importance, having in mind that the argumentation community nowadays is overwhelmed with different proposals of semantics. Thus understanding the basic principles underlying different semantics is crucial, and we believe the results provided in this paper contribute to this question.\nThe organization of the remainder of the paper and its main contributions are as follows:\n• In Section 2, we introduce argumentation frameworks and the different semantics we deal with in this paper. We also review known complexity results which we complement in the sense that we show some of the known tractable problems to be P -hard; a fact we will use for some impossibility results in Section 5.\n• Section 3 defines properties for translations basically along the lines of Janhunen (1999). In particular, we consider here as desired properties efficiency (the translation can be computed in logarithmic space wrt. the given AF), modularity (the translation can be done independently for certain parts of the framework) and faithfulness (there should be a clear correspondence between the extensions of the translated AF and the original AF). However, we also consider some additional features which are needed to deal with some of the argumentation semantics (for instance, the admissible semantics always yields the empty set as one solution; thus filtering such an entire solution is necessary).\n• Section 4 contains our main results, in particular we provide translations between Dung’s original semantics (admissible, preferred, stable, complete, grounded), stage semantics (Verheij, 1996) and semi-stable semantics (Caminada, 2006). We analyze these translations wrt. the properties mentioned above using as minimal desiderata efficiency and (a particular form of) faithfulness.\n• As already mentioned, Section 5 then provides negative results, i.e. we show that certain translations between semantics are not possible. Some of these impossibility results make use of typical complexity-theoretic assumptions; others are genuine due to the different properties of the compared semantics.\n• Finally, in Section 6 we conclude the paper with a summary and discussion of the presented results. As well, an outlook to potential future work is given there."}, {"heading": "2. Argumentation Frameworks", "text": "In this section we introduce (abstract) argumentation frameworks (Dung, 1995) and recall the semantics we study in this paper (see also Baroni & Giacomin, 2009, for an overview). Moreover, we highlight and complement complexity results for typical decision problems associated to such frameworks.\nDefinition 1. An argumentation framework (AF) is a pair F = (A, R) where A is a nonempty set of arguments 2 and R ⊆ A×A is the attack relation. For a given AF F = (A, R)\n2. For technical reasons we only consider AFs with A 6= ∅.\nwe use AF to denote the set A of its arguments and RF to denote its attack relation R. The pair (a, b) ∈ R means that a attacks b.\nWe sometimes use the notation a R b instead of (a, b) ∈ R. For S ⊆ A and a ∈ A, we also write S R a (resp. a R S) in case there exists an argument b ∈ S, such that b R a (resp. a R b). In case no ambiguity arises, we use  instead of R.\nAn AF can naturally be represented as a directed graph. Semantics for argumentation frameworks are given via a function σ which assigns to each AF F = (A, R) a set σ(F ) ⊆ 2A of extensions. We shall consider here for σ the functions stb, adm, prf , com, grd , stg , and sem which stand for stable, admissible, preferred, complete, grounded, stage, and respectively, semi-stable semantics. Before giving the actual definitions for these semantics, we require a few more formal concepts.\nDefinition 2. Given an AF F = (A, R), an argument a ∈ A is defended (in F ) by a set S ⊆ A if for each b ∈ A, such that b  a, also S  b holds. Moreover, for a set S ⊆ A, we define the range of S, denoted as S+R , as the set S ∪ {b | S  b}.\nWe continue with the definitions of the considered semantics. Observe that their common feature is the concept of conflict-freeness, i.e. arguments in an extension are not allowed to attack each other.\nDefinition 3. Let F = (A, R) be an AF. A set S ⊆ A is conflict-free (in F ), if there are no a, b ∈ S, such that (a, b) ∈ R. For such a conflict-free set S, it holds that\n• S ∈ stb(F ), if for each a ∈ A \\ S, S  a, i.e. S+R = A;\n• S ∈ adm(F ), if each a ∈ S is defended by S;\n• S ∈ prf (F ), if S ∈ adm(F ) and there is no T ∈ adm(F ) with T ⊃ S;\n• S ∈ com(F ), if S ∈ adm(F ) and for each a ∈ A that is defended by S, a ∈ S;\n• S ∈ grd(F ), if S ∈ com(F ) and there is no T ∈ com(F ) with T ⊂ S;\n• S ∈ stg(F ), if there is no conflict-free set T in F , such that T+R ⊃ S + R ;\n• S ∈ sem(F ), if S ∈ adm(F ) and there is no T ∈ adm(F ) with T+R ⊃ S + R .\nFor all semantics σ, the sets defined above are the only ones in σ(F ).\nWe recall that for each AF F ,\nstb(F ) ⊆ sem(F ) ⊆ prf (F ) ⊆ com(F ) ⊆ adm(F )\nholds, and that for each of the considered semantics σ except stable semantics, σ(F ) 6= ∅ holds. The grounded semantics always yields exactly one extension. Moreover if an AF has at least one stable extension then its stable, semi-stable, and stage extensions coincide.\nExample 1. Consider the AF F = (A, R), with A = {a, b, c, d, e} and R = {(a, b), (c, b), (c, d), (d, c), (d, e), (e, e)}. The graph representation of F is given as follows.\na b c d e\nWe have stb(F ) = stg(F ) = sem(F ) = {{a, d}}. Further we have as admissible sets of F the collection {}, {a}, {c}, {d}, {a, c}, {a, d}, thus prf (F ) = {{a, c},{a, d}}. Finally the complete extensions of F are {a}, {a, c} and {a, d}, with {a} being the grounded extension of F . ♦\nWe now turn to the complexity of reasoning in AFs. To this end, we define the following decision problems for the semantics σ introduced in Definition 3.\n• Credulous Acceptance Credσ: Given AF F = (A, R) and an argument a ∈ A. Is a contained in some S ∈ σ(F )?\n• Skeptical Acceptance Skeptσ: Given AF F = (A, R) and an argument a ∈ A. Is a contained in each S ∈ σ(F )?\n• Verification of an extension Verσ: Given AF F = (A, R) and a set of arguments S ⊆ A. Is S ∈ σ(F )?\n• Existence of an extension Existsσ: Given AF F = (A, R). Is σ(F ) 6= ∅?\n• Existence of a nonempty extension Exists¬∅σ : Given AF F = (A, R). Does there exist a set S 6= ∅ such that S ∈ σ(F )?\nBefore giving an overview about known results, we provide a few lower bounds which, to the best of our knowledge, have not been established yet.\nProposition 1. The problems Credgrd = Skeptgrd = Skeptcom as well as Vergrd are P-hard (under L-reductions, i.e. reductions using logarithmic space).\nProof. We use a reduction from the P-hard problem to decide, given a propositional definite Horn theory T and an atom x, whether x is true in the minimal model of T .\nLet, for a definite Horn theory T = {rl : bl,1 ∧ · · · ∧ bl,il → hl | 1 ≤ l ≤ n} over atoms X and an atom z ∈ X, FT,z = (A, R) be an AF defined as follows:\nA = T ∪ X ∪ {t}\nR = {(x, x), (t, x) | x ∈ X} ∪ {(z, t)} ∪\n{(rl, hl), (bl,j , rl) | rl ∈ T, 1 ≤ j ≤ il)}\nwhere t is a fresh argument. See Figure 2 for an example. Clearly the AF FT,z can be constructed using only logarithmic space in the size of T .\nIn the following we show that z is in the minimal model of T iff t is in the grounded extension of FT,z iff grd(FT,z) = {T ∪ {t}}.\nFirst we attend that t is in the grounded extension E of FT,z iff E = {T∪{t}}. Obviously the if-direction holds. Thus let us assume t ∈ E, then each x ∈ X is attacked by E and thus each r ∈ T is defended by E. Hence E = {T ∪ {t}}.\nIt remains to show that z is in the minimal model of T iff t is in the grounded extension E of FT,z. We recall the definition of the characteristic function FF of an AF F , defined as FF (S) = {x ∈ AF | x is defended by S}, and that the grounded extension of F is the least fix-point of FF . To show the only-if part, let us assume that z is in the minimal model of T . Thus there exists a finite sequence of rules (rli)1≤i≤k, such that (i) for each rule rli and each atom bli,s there exists a rule rlj , j < i with hlj = bli,s and (ii) hlk = z. Clearly rl1 has empty body and thus the corresponding argument has no attackers in FT,z, i.e. rl1 ∈ E. We now claim that for each i, 1 ≤ i ≤ k, rli ∈ E holds as well and prove this by induction. To this end, we assume the claim holds for all m < i, i.e. rlm ∈ E, and thus E  hlm for m < i holds. Using (i) we get that for each argument a ∈ A with a  rli , it holds that E  a. Hence rli ∈ E. Now in particular rlk ∈ E and by (ii) we have that E  z. As z is the only argument attacking t we also have that t ∈ E.\nTo show the if-part, let us assume that t is contained in the grounded extensions E of FT,z. Then by construction E  z and thus there exists an integer k, such that F k F (∅)  z and for each m < k : FmF (∅) 6 z. We claim that for 1 ≤ m ≤ k and x ∈ X it holds that if FmF (∅)  x then x is in the minimal model of T . The proof is by induction on m. As induction base consider FF (∅). By construction FF (∅) is the set of arguments that correspond to rules in T having empty body. The arguments attacked by FF (∅) are the head atoms of these rules, which are clearly in the minimal model. For the induction step assume that Fm−1F (∅) only attacks arguments corresponding to atoms in the minimal model. As Fm−1F (∅) 6 z we have t 6∈ F m−1 F (∅). Let x ∈ X be an argument such that F m F (∅)  x, but Fm−1F (∅) 6 z. Then there exists an ri ∈ T such that hi = x and ri ∈ F m F (∅). By construction of FT,z we have that the argument ri is defended by F m−1 F (∅) iff each atom in the body of ri is attacked by F m−1 F (∅). Hence, by assumption each atom in the body of ri is contained in the minimal model of T . But then the head hi of ri is in the minimal model of T . Hence, as FkF (∅)  z, we get that z is in the minimal model of T .\nProposition 2. Verstg is coNP-hard.\nProof. We prove the assertion by reducing the (NP-hard) problem 3-SAT to the complementary problem of Verstg . We assume that a 3-CNF formula is given as a set C of clauses, where each clause is a set over atoms and negated atoms (denoted by x̄). For such a CNF ϕ over variables X, define the AF Fϕ = (A, R) with\nA = X ∪ X̄ ∪ C ∪ {s, t, b}\nR = {(x, x̄), (x̄, x) | x ∈ X} ∪ {(l, c) | l ∈ c, c ∈ C} ∪\n{(c, t) | c ∈ C} ∪ {(s, y), (y, s) | y ∈ A \\ {s, b}} ∪ {(t, b), (b, b)}\nwhere X̄ = {x̄ | x ∈ X} and s, t, b are fresh arguments. See Figure 3 for an illustrating example. We show that ϕ is satisfiable iff {s} is not a stage extension of Fϕ. First let us assume ϕ is satisfiable and let T be any satisfying assignment of ϕ. Then the set\nE = {t} ∪ {x | x ∈ X, T (x) = true} ∪ {x̄ | x ∈ X, T (x) = false} is a stable extension of Fϕ, i.e. E + R = A, and since {s} + R = A \\ {b}, {s} is not a stage extension of Fϕ. Now let us assume that {s} is a stage extension. By the same argumentation as above, i.e. using {s}+R ⊂ A, we get that Fϕ has no stable extension. But as we have seen before each satisfying assignment of ϕ corresponds to a stable extension of Fϕ. Thus we can conclude that ϕ is unsatisfiable.\nTogether with results from the literature (Coste-Marquis, Devred, & Marquis, 2005; Dimopoulos & Torres, 1996; Dung, 1995; Dunne & Bench-Capon, 2002; Dunne & Caminada, 2008; Dvořák & Woltran, 2010), we obtain the complexity-landscape of abstract argumentation as given in Table 1."}, {"heading": "3. Properties for Translations", "text": "In what follows, we understand as a translation Tr a function which maps AFs to AFs. In particular, we seek translations, such that for given semantics σ, σ′, the extensions σ(F ) are in a certain relation to extensions σ′(F ) for each AF F . To start with, we introduce a few additional properties which seem desirable for such translations. To this end, we define, for\nAFs F = (A, R), F ′ = (A′, R′), the union of AFs as F ∪F ′ = (A∪A′, R∪R′), and inclusion as F ⊆ F ′ iff jointly A ⊆ A′ and R ⊆ R′.\nDefinition 4. A translation Tr is called\n• efficient if for every AF F , the AF Tr (F ) can be computed using logarithmic space wrt. to |F |;\n• covering if for every AF F , F ⊆ Tr (F );\n• embedding if for every AF F , AF ⊆ ATr (F ) and RF = RTr (F ) ∩ (AF × AF );\n• monotone if for any AFs F, F ′, F ⊆ F ′ implies Tr (F ) ⊆ Tr (F ′);\n• modular if for any AFs F, F ′, Tr (F ) ∪ Tr (F ′) = Tr (F ∪ F ′).\nA translation should not reduce the expressiveness of a semantic using some expensive computation. Thus the computational cost of a translation should be less than the computational cost of any semantic under our focus, i.e. less than P. Thus using the class of logarithmic space computable functions is appropriate for our purposes. In addition, one could seek translations which are minimal wrt. certain parameters (for instance, number of additional arguments and attacks). However, we decided not to design our translations towards such aims, since this would partly hide the main intuitions underlying the translations.\nWhile the property of efficiency is clearly motivated, let us spend a few words on the other properties. Covering holding ensures that the translation does not hide some original arguments or conflicts. Being embedding, in addition, ensures that no additional attacks between the original arguments are pretended. While efficiency is motivated by expressiveness and the possibility to reuse reasoning algorithms, the properties of covering and embedding can be motivated by the meta-argumentation scenario. Translations which are covering or embedding preserve the arguments and conflicts we (meta)-argue about, an assumption one usually has in mind in the context of meta-argumentation. To put it in other words, having an embedding translation, the original framework and the meta-level part are clearly separated in the translated framework.\nMonotonicity and modularity are crucial when extending the source AF after translation. Let us first consider monotonicity. In multi-agent scenarios it may be impossible for one agent to withdraw already interchanged arguments and attacks, as the other agents may not agree to forget arguments and conflicts they already know about; hence, re-translating the augmented source AF should respect the already existing translation. Now let us consider modularity and adding only a few arguments/attacks to a huge AF. When updating the translation it suffices to only consider the new arguments/attacks, instead of the whole source AF, which indeed can be of computational value. In the field of meta-argumentation, modular translations are in particular interesting as they are compatible with merging AFs. Thus one can interchange merge- and translation-operations, i.e. it does not make a difference if one first merges two AFs and then translates the union or first translates both AFs and then merges the translations. Moreover, as it can be easily checked each modular transformation is also monotone.\nNext, we give two properties which refer to semantics. We note that our concept of faithfulness follows the definition used by Janhunen (1999); while exactness is in the spirit of bijective faithfulness wrt. equivalence as used by Liberatore (2007).\nDefinition 5. For semantics σ, σ′ we call a translation Tr\n• exact for σ ⇒ σ′ if for every AF F , σ(F ) = σ′(Tr (F ));\n• faithful for σ ⇒ σ′ if for every AF F , σ(F ) = {E ∩ AF | E ∈ σ ′(Tr (F ))} and\n|σ(F )| = |σ′(Tr (F ))|.\nHowever, due to the very nature of the different semantics we want to consider, we need some less restricted notions. For instance, if we consider a translation from stable to some other semantics, we have to face the fact that some AFs do not possess a stable extension, while other semantics always yield at least one extension. The following definition takes care of this issue.\nDefinition 6. For semantics σ, σ′, we call a translation Tr\n• weakly exact for σ ⇒ σ′ if there exists a collection S of sets of arguments, such that for any AF F , σ(F ) = σ′(Tr (F )) \\ S;\n• weakly faithful for σ ⇒ σ′ if there exists a collection S of sets of arguments, such that for any AF F , σ(F ) = {E ∩ AF | E ∈ σ ′(Tr (F )) \\ S} and |σ(F )| = |σ′(Tr (F )) \\ S|.\nWe sometimes refer to the elements from S as remainder sets. Note that S depends only on the translation, but not on the input AF. Thus, by definition, each S ∈ S only contains arguments which never occur in AFs subject to translation. In other words, we reserve certain arguments for introduction in weak translations.\nFinally, we mention that the properties from Definition 4 as well as being exact, weakly exact and faithful are transitive, i.e. for two transformations satisfying one of these properties, also the concatenation satisfies the respective property. However, transitivity is not guaranteed for being weakly faithful."}, {"heading": "4. Translations", "text": "In this section, we provide numerous faithful translations between the semantics introduced in Definition 3. As minimal desiderata, we want the translations to be efficient, monotone, and covering (see Definition 4). Thus, in this section when speaking about translations we tacitly assume that they satisfy at least these three properties."}, {"heading": "4.1 Exact Translations", "text": "We start with a rather simple such translation, which we will show to be exact for prf ⇒ sem and adm ⇒ com.\nTranslation 1. The translation Tr1 is defined as Tr1(F ) = (A ∗, R∗), where\nA∗ = AF ∪ A ′ F R∗ = RF ∪ {(a, a ′), (a′, a), (a′, a′) | a∈AF },\nwith A′F = {a ′ | a∈AF }.\nA few words about the intuition behind the above translation (for illustration see Figure 4 which depicts the translation of our example AF from Example 1): the new arguments a′ ∈ A′F are all self-attacking and thus never appear in any extension of the resulting framework. However, each a′ attacks the original argument a (and a attacks a′), thus an argument a is only defended by a set E in Tr1(F ) if a ∈ E. Consequently, we have that in Tr1(F ) each admissible set is also a complete one.\nLemma 1. For an AF F and a set E of arguments, the following propositions are equivalent:\n1. E ∈ adm(F )\n2. E ∈ adm(Tr1(F ))\n3. E ∈ com(Tr1(F ))\nProof. As all arguments in A′F are self-conflicting, every conflict-free set E of Tr1(F ) satisfies E ⊆ AF . Further, since Tr1 is embedding, E is conflict-free in F iff E is conflict-free in Tr1(F ). Moreover, since Tr1 only adds symmetric attacks against arguments a ∈ AF , we have that E defends its arguments in F iff E defends its arguments in Tr1(F ). Thus, adm(F ) = adm(Tr1(F )) and (1)⇔(2) follows. For (2)⇒(3), let a ∈ A be an arbitrary argument and E ⊆ A. In Tr1(F ) the argument a is attacked by a\n′ and a is the only attacker (except a′ itself) of a′. Hence, for each a ∈ A, E defends a only if a ∈ E and thus every admissible set of Tr1(F ) is also a complete one. Finally, (2)⇐(3) holds since com(F ) ⊆ adm(F ) is true for any AF F .\nConcerning Tr1 we observe another side effect. As already mentioned a ∈ A is the only argument attacking a′. Thus different preferred extensions of Tr1(F ) have incomparable range (recall Definition 2), and therefore each preferred extension of Tr1(F ) is also a semistable extension of Tr1(F ).\nLemma 2. For an AF F and a set E of arguments, the following propositions are equivalent:\n1. E ∈ prf (F )\n2. E ∈ prf (Tr1(F ))\n3. E ∈ sem(Tr1(F ))\nProof. For (1)⇔(2), it is sufficient to show that E ∈ adm(F ) iff E ∈ adm(Tr1(F )) holds for each E. This is captured by Lemma 1. For (2)⇒(3), let D, E ∈ prf (Tr1(F )) and, towards a contradiction, assume that D+R∗ ⊂ E + R∗ , i.e. D /∈ sem(Tr1(F )). As both D and\nE are preferred extensions, we have D 6⊆ E. Thus, there exists an argument a ∈ D \\ E. By construction of Tr1(F ), we get a ′ ∈ D+R∗ but a ′ /∈ E+R∗ , a contradiction to D + R∗ ⊂ E + R∗ . (2)⇐(3) follows from the fact sem(F ) ⊆ prf (F ) for any AF F .\nObviously Tr1 is an embedding translation and as the introduction of a new argument or attack in Tr1 only depends on one original argument it is also modular. Together with the results from Lemma 1 and 2 we thus get our first main result.\nTheorem 1. Tr1 is a modular, embedding, and exact translation for prf ⇒ sem and adm ⇒ com.\nOur next translation, Tr2, is concerned with stage and semi-stable semantics. In addition to Tr1, we make all attacks from the original AF symmetric (thus Tr2 will not be embedding) and add for each original attack (a, b) also an attack (a, b′).\nTranslation 2. The translation Tr2 is defined as Tr2(F ) = (A ∗, R∗), where\nA∗ = AF ∪ A ′ F R∗ = RF ∪ {(b, a), (a, b ′) | (a, b) ∈ RF }\n∪ {(a, b) | a ∈ AF , (b, b) ∈ RF } ∪ {(a, a′), (a′, a′) | a ∈ AF }\nThe symmetric attacks in Tr2(F ) mirror the fact that we do not mind the orientation of attacks when considering conflict-freeness. In other words, we exploit the well known property that for symmetric frameworks conflict-free and admissible sets coincide. However, making attacks symmetric destroys the original range of extensions. Thus we make use of arguments a′ ∈ A′F in the sense that, for a given set E of arguments, an argument a\n′ is contained in E+R∗ iff a is contained in E + R . Likewise, we have to add attacks into selfdefeating arguments. The technical reason for this is that we require that each original argument is attacked by a maximal conflict-free non-empty set in Tr2(F ) (see also the proof of the forthcoming lemma). For illustration we refer to Figure 5.\nLemma 3. For an AF F and any set E of arguments, the following propositions are equivalent:\n1. E ∈ stg(F )\n2. E ∈ stg(Tr2(F ))\n3. E ∈ sem(Tr2(F ))\nProof. First, we mention that every stage extension of an AF F is also maximal (wrt. ⊆) conflict-free in F . Let us now consider the case where ∅ ∈ stg(F ). We then have that stg(F ) = {∅} which is equivalent to, for each a ∈ AF also (a, a) ∈ RF . Then by construction of Tr2 for each a ∈ A\n∗ also (a, a) ∈ R∗ and therefore stg(Tr2(F )) = sem(Tr2(F )) = {∅}. Hence the lemma holds for such AFs, and for the remainder of the proof we can assume that ∅ 6∈ stg(F ).\nFor (1)⇔(2), we again observe that a set E is conflict-free in F iff it is conflict-free in Tr2(F ). In the following we use (E\n+ RF )′ as a short hand for {a′ ∈ A′ | a ∈ E+RF }. Then\nwe have that (E+RF ) ′ ⊆ E+R∗ , since for each (a, b) ∈ RF , we have (a, b ′) ∈ R∗. Furthermore, for each maximal conflict-free set E in F (and thus in Tr2(F )), it holds that AF ⊆ E + R∗ . We show this by contradiction. To this end, let us assume that AF 6⊆ E + R∗ , i.e. there exists a ∈ AF such that a 6∈ E + R∗ . As E 6= ∅ we have that all self-attacking arguments are contained in E+R∗ , thus (a, a) 6∈ R ∗. As a 6∈ E+R∗ we have that E 6\nR a and a 6R E, but then the set E∪{a} is conflict-free in F and as E is maximal a ∈ E; a contradiction. Hence, for each maximal conflict-free set E ⊆ AF in F , i.e. the candidates for stage extensions, it holds that E+R∗ = AF ∪ (E + RF )′ and thus E+RF is maximal (wrt. subset inclusion) iff E + R∗ is maximal.\nFor (2)⇔(3), observe that each a ∈ AF with (a, a) 6∈ R ∗ defends itself in Tr2(F ) and all arguments a′ ∈ A′F are self-conflicting. Thus, admissible and conflict-free sets coincide in Tr2(F ). Consequently, the stage and semi-stable extensions of Tr2(F ) coincide.\nBy definition the translation Tr2 is covering, but not embedding. Moreover, as each selfattacking argument is attacked by all of the other arguments Tr2 is not modular. Together with the above lemma, we thus obtain the following result.\nTheorem 2. Tr2 is an exact translation for stg ⇒ sem.\nThe next translations consider the stable semantics as source formalism. Recall that not all AFs possess a stable extension, while this holds for all other semantics (also recall we excluded empty AFs for our considerations). Thus we have to use weak translations as introduced in Definition 6. Our first such translation is weakly exact and uses a single remainder set {t} (recall the definition of remainder sets as given in Definition 6).\nTranslation 3. The translation Tr3(F ) is defined as Tr3(F ) = (A ∗, R∗) where\nA∗ = AF ∪ {t} R∗ = RF ∪ {(t, a), (a, t) | a ∈ AF }\nHere the intuition is rather simple, see also Figure 6. In fact, the new argument t in Tr3(F ) encodes that there might not exist a stable extension for F . Thus none of the (other) arguments in Tr3(F ) is accepted, whenever t is accepted. Since the argument t guards that there exists at least one stable extension of Tr3(F ) (for any AF F ), namely {t}, we can make use of the fact that stable, semi-stable and stage semantics thus coincide for Tr3(F ).\nLemma 4. Let F = (A, R) be an AF and E ⊆ A. Then the following statements are equivalent:\n1. E ∈ stb(F )\n2. E ∈ stb(Tr3(F ))\n3. E ∈ sem(Tr3(F ))\n4. E ∈ stg(Tr3(F ))\nFurther for each E ∈ σ(Tr3(F )) with σ ∈ {stb, sem, stg} either E = {t} or t 6∈ E holds.\nProof. As the translation does not modify the original AF F , i.e. Tr3 is embedding, we have that for each E ⊆ AF , E is conflict-free in F iff E is conflict-free in Tr3(F ).\n(1)⇒(2): Each E ∈ stb(F ) by definition is non-empty, conflict-free and satisfies E+RF =\nAF . By construction it also holds that E  R∗ t and thus E+R∗ = A ∗, i.e. E ∈ stb(Tr3(F )). For (1)⇐(2) consider E ∈ stb(Tr3(F )), E ⊆ AF . Then by definition we have that E is conflict-free in Tr3(F )) and thus in F ; moreover, E + R∗ = A\n∗ and as Tr3 is embedding also E+R = AF . Hence E ∈ stb(F ).\nFor (2)⇔(3)⇔(4), we mention that {t} is a stable extension of Tr3(F ) for any AF F . Furthermore, we know that if there exists a stable extension for an AF, then stable, semi-stable and stage extensions coincide.\nFinally as the argument t is in conflict with all of the other arguments the only extension E with t ∈ E is the set {t}.\nAdding argument t and the corresponding attacks to the source AF is a modular operation and as no further attacks are added Tr3 is also embedding.\nTheorem 3. Tr3 is modular, embedding and weakly exact for stb⇒σ, σ∈{sem, stg}.\nProof. The result follows from Lemma 4, which states that sem(Tr3(F )) = stg(Tr3(F )) = stb(F ) ∪ {{t}}. Thus by taking as remainder set S = {{t}}, Tr3 is weakly exact.\nWe continue with a different translation from stable to other semantics.\nTranslation 4. Tr4 is defined as Tr4(F ) = (A ∗, R∗) where\nA∗ = AF ∪ A ′ F R∗ = RF ∪ {(b ′, a) | a, b ∈ AF }\n∪ {(a′, a′), (a, a′) | a ∈ AF } ∪ {(a, b′) | (a, b) ∈ RF }.\nAs before in translation Tr2, new arguments a ′ ∈ A′F are used to encode the range of an extension in the sense that a′ is attacked by a set E in Tr4(F ) only if a is in the range of E in F . However, given the fact that each a′ ∈ A′F attacks back all original arguments a ∈ A, we can now accept an argument in a set E only if all arguments are in the range of E. For illustration on our running example, see Figure 7. Observe that in our example each of the arguments a′, b′, c′, d′, e′ attacks each of the arguments a, b, c, d, e.\nLemma 5. Let F = (A, R) be an AF and E ⊆ A with E 6= ∅. Then, the following statements are equivalent:\n1. E ∈ stb(F )\n2. E ∈ stb(Tr4(F ))\n3. E ∈ adm(Tr4(F ))\n4. E ∈ prf (Tr4(F ))\n5. E ∈ com(Tr4(F ))\n6. E ∈ sem(Tr4(F ))\nFurther for each conflict-free set E of Tr4(F ) it holds that E ⊆ A.\nProof. First, as all arguments a′ ∈ A′ are self-attacking, for each conflict-free set E in Tr4(F ) it holds that E ⊆ A. Since the translation is embedding, any set E is conflict-free in F iff it is conflict-free in Tr4(F ). To show (1)⇒(2), let E ∈ stb(F ). Hence, for all a ∈ A \\ E, E R a. We now claim that each argument in A∗ \\ E is attacked by E in Tr4(F ). We distinguish between two cases for the different arguments in A ∗ \\ E:\n(i) a ∈ A \\ E: The construction of Tr4(F ) preserves all attacks in R. Thus as each a ∈ A \\ E satisfies E R a, we obtain that E R ∗ a\n(ii) a′ ∈ A′: In case a ∈ E we have E R ∗ a′, since (a, a′) ∈ R∗ In case a ∈ A \\ E, by the assumption E ∈ stb(F ), there exists an argument b ∈ E such that (b, a) ∈ R. But then by construction (b, a′) ∈ R∗ and thus E R ∗ a′.\nTogether with our observations about conflict-free sets, we get E ∈ stb(Tr4(F )). Vice versa, to show (1)⇐(2) we get, for E ∈ stb(Tr4(F )), E \nR∗ a, for each a ∈ A∗ \\E, and thus, in particular, for each a ∈ A \\ E. By definition of Tr4, we also have E \nR a for each a ∈ A \\ E. Thus E ∈ stb(F ) follows.\nTo show (2)⇐(3), let E be a nonempty admissible extension of Tr4(F ) and a ∈ E. By construction, we have that a− := {b ∈ A∗ | (b, a) ∈ R∗} ⊇ A′. As E ∈ adm(Tr4(F )), E R ∗ a′ for each a′ ∈ A′. But E  a′ only if either a ∈ E or E R ∗\na. Thus for every a ∈ A∗ it holds that either a ∈ E or E R ∗\na; hence, E ∈ stb(Tr4(F )). The remaining implications follow by well-known relations between the semantics, i.e. stb(G) ⊆ sem(G) ⊆ prf (G) ⊆ com(G) ⊆ adm(G), for each AF G. Hence, in particular, since for Tr4(F ), stable extensions and non-empty admissible sets coincide, the claim follows.\nClearly Tr4 is an embedding translation, but as for each new argument we add attacks to all original arguments, Tr4 is not modular.\nTheorem 4. Tr4 is an embedding and weakly exact translation for stb ⇒ σ with σ ∈ {adm, com, prf , sem}.\nProof. By Lemma 5, we in particular have that stb(F ) = σ(Tr4(F )) \\ {∅}, for any AF F . Thus taking ∅ as a remainder set, we obtain that Tr4 is weakly exact for the involved semantics.\nThus we have that both Tr3 and Tr4 are weakly exact translations for stb ⇒ sem, of course with different remainder sets. Due the to different properties of two translations it depends on the concrete application which of them would be the better choice."}, {"heading": "4.2 Faithful Translations", "text": "So far, we have only introduced exact and weakly exact translations. We now present translations which relax this semantical property, i.e. we switch to faithful translations. As a first example, we consider a translation for stg ⇒ sem which is faithful and embedding, but not exact. This is in contrast to translation Tr2 which is exact for stg ⇒ sem but not embedding. As we will see in Section 5 it is impossible to give a translation that is both embedding and exact for stg ⇒ sem, thus one has to decide which property is more important for a concrete application scenario.\nTranslation 5. The translation Tr5(F ) is defined as Tr5(F ) = (A ∗, R∗) where\nA∗ = AF ∪ ĀF ∪ A ′ F R∗ = RF ∪ {(a, ā), (ā, a) | a ∈ AF }\n∪ {(a, a′), (a′, a′) | a ∈ AF } ∪ {(a, b′) | (a, b) ∈ RF }\nAs in Tr2(F ) the arguments a ′ ∈ A′F handle the range of the original extensions. But instead of making original attacks symmetric (as in Tr2) we add the arguments ā ∈ ĀF to encode that an argument is not in the extension (also compare Figures 5 and 8). In fact, such meta-arguments indicating that some a is out of an extension will be used in all faithful translations presented in this subsection.\nLemma 6. Let F = (A, R) be an AF, E ⊆ A and E∗ = E ∪ (A \\ E). The following statements are equivalent:\n1. E ∈ stg(F )\n2. E∗ ∈ stg(Tr5(F ))\n3. E∗ ∈ sem(Tr5(F ))\nMoreover for each S ∈ sem(Tr5(F )) there exists a set E ⊆ A such that S = E ∪ (A \\ E).\nProof. First we prove that each S ∈ stg(Tr5(F )) is of the form S = E ∪ (A \\ E). As S is conflict-free we have that A′F ∩ S = ∅ (each a\n′ ∈ A′ is self-attacking) and for each a ∈ A that {a, ā} 6⊆ E∗ (as a attacks ā and vice versa). Further as each stage extension is also a ⊆-maximal conflict-free set we have that for each a ∈ A either a ∈ S or ā ∈ S. Hence there exists an E ⊆ A such that S = E ∪ (A \\ E).\n(1)⇒(2): Let E ∈ stg(F ). It is easy to see that E∗ is conflict-free in Tr5(F ). By construction for each argument a ∈ A either a ∈ E∗ or ā ∈ E∗ holds and there are mutual attacks between a and ā, hence we have that A ∪ Ā ⊆ (E∗)+R∗ . Next we observe that each a′ ∈ A′ is self-attacking and thus a′ ∈ (E∗)+R∗ iff E\n∗  a′. Further by the definition of Tr5(F ) each argument a\n′ is attacked by a and all arguments b such that (b, a) ∈ R. That is a′ ∈ (E∗)+R∗ iff either a ∈ E or there exists a b ∈ A such that (b, a) ∈ R iff a ∈ (E) + R. By assumption E is a stage extension of F and thus we have that (E)+R is ⊆-maximal. Using the above observation we have that also (E∗)+R∗ is ⊆-maximal in Tr5(F ) and therefore E∗ ∈ stg(Tr5(F )).\n(1)⇐(2): Let E∗ ∈ stg(Tr5(F )). We recall that E ∗ is of the form S = E ∪ (A \\ E), for some E ⊆ A. It can be easily checked that E is conflict-free in F . By the above observation that a′ ∈ (E∗)+R∗ iff a ∈ (E) + R and the fact that (E\n∗)+R∗ is ⊆-maximal in Tr5(F ) we get that also E+R is ⊆-maximal in F . Hence, E ∈ stg(F ).\n(2)⇔(3): Let us consider E∗ ∈ stg(Tr5(F )). As we have already observed, E ∗ is of the desired form and for each a ∈ AF ∪ĀF either a ∈ E ∗ or E∗  a. Further by construction an argument b ∈ A′F does not attack E ∗. We can conclude that each stage extension defends itself against all attackers, i.e. is an admissible set. Hence, stage and semi-stable extensions of Tr5(F ) coincide.\nBy above lemma and construction of Tr5, the following result is immediate.\nTheorem 5. Tr5 is a modular, embedding and faithful translation for stg ⇒ sem.\nNext we give a faithful translation from admissible semantics to stable, semi-stable and stage semantics.\nTranslation 6. The translation Tr6(F ) is defined as Tr6(F ) = (A ∗, R∗) where\nA∗ = AF ∪ ĀF ∪ RF R∗ = RF ∪ {(a, ā), (ā, a) | a ∈ AF }\n∪ {(r, r) | r ∈ RF }\n∪ {(ā, r) | r = (y, a) ∈ RF }\n∪ {(a, r) | r = (z, y) ∈ RF , (a, z) ∈ RF }\nThe main idea is to use additional arguments (a, b) ∈ A∗ which represent the attack relations from the source framework in order to capture admissibility as follows: (a, b) is attacked by an extension E∗ in Tr6(F ) if (a, b) is not critical wrt. the corresponding extension E in F , meaning that either b /∈ E or there exists a c ∈ E such (c, b) ∈ RF , i.e. a is defended by E. For instance, consider the argument (c, b) in the translation of our example framework as depicted in Figure 9. Then, we have that (1) b̄ attacks (c, b) since if b is chosen to be out (i.e. b̄ is chosen in), there is no need to defend b; (2) d attacks (c, b) since if d is chosen in, d defends b against attacker c (recall that (d, c) is present in the source AF). Thus, as long as (c, b) is attacked by some argument, b is treated corrected in terms of admissibility (wrt. attacker c). Note that in our example b cannot be defended against a, thus the only way to get (a, b) into the range is to select b to be out.\nLemma 7. Let F = (A, R) be an AF, E ⊆ A and E∗ = E ∪ (A \\ E). The following statements are equivalent:\n1. E ∈ adm(F )\n2. E∗ ∈ stb(Tr6(F ))\n3. E∗ ∈ sem(Tr6(F ))\n4. E∗ ∈ stg(Tr6(F ))\nMoreover for each E∗ ∈ σ(Tr6(F )) (σ ∈ {stb, sem, stg}) there exists a set E ⊆ A such that E∗ = E ∪ (A \\ E).\nProof. (1)⇒(2): Let E ∈ adm(F ). It is easy to see that E∗ is conflict-free in Tr6(F ) and further that A ∪ Ā ⊆ (E∗)+R∗ . It remains to show that each argument r ∈ A ∗ for r ∈ R is\nattacked by E∗. Let (a, b) be such an argument r. If b /∈ E then b̄ ∈ E∗ and thus E∗ R ∗\nr. Otherwise, b ∈ E (thus b ∈ E∗) and, by assumption, E defends b in F , i.e. (c, a) ∈ R for some c ∈ E (thus c ∈ E∗). By construction, (c, r) ∈ R∗ and E∗ R ∗\nr. (1)⇐(2): Let E∗ ∈ stb(Tr6(F )). E ∗ is conflict-free, thus R ∩ E∗ = ∅ and {a, ā} 6⊆ E∗ for all a ∈ A. By construction, E is conflict-free in F . It remains to show that E defends all its arguments in F . Let b ∈ A \\ E such that b R a for some a ∈ E. Then there exists an argument (b, a) in Tr6(F ) attacked by E. As a ∈ E we have that ā /∈ E\n∗ and thus there exists an argument c ∈ E such that (c, b) ∈ R.\n(2)⇔(3)⇔(4): As the empty set is always admissible we have that Ā is always a stable extension of Tr6(F ). Hence, stable, semi-stable and stage extensions coincide in Tr6(F ), for any AF F .\nObserve that in the construction of Tr6 drawing attacks {(a, r) | r = (z, y) ∈ RF , (a, z) ∈ RF } depends on two attacks and three arguments from the original framework. Hence Tr6 is not modular. By Lemma 7 the next result follows quite easily.\nTheorem 6. Translation Tr6 is embedding and faithful for adm ⇒ σ (σ ∈ {stb, sem, stg}).\nIn our faithful translation from complete to stable semantics which we present next, we extend the given AF by arguments that represent whether an argument is attacked in the corresponding extension or not. Further we add arguments that ensure admissibility and completeness. The entire translation is thus slightly more complicated; see also Figure 10 which depicts the translated framework for our running example.\nTranslation 7. The translation Tr7(F ) is defined as Tr7(F ) = (A ∗, R∗) where\nA∗ = AF ∪ ĀF ∪ A ◦ F ∪ Ā ◦ F ∪ A ′ F ∪ RF R∗ = RF ∪ {(x, x) | x ∈ A ′ F ∪ RF }\n∪ {(a, ā), (ā, a), (ā◦, a◦), (a, a′) | a ∈ AF } ∪ {(a, b̄◦), (ā◦, b′) | (a, b) ∈ RF } ∪ {(ā, r′), (b◦, r′) | r = (b, a) ∈ RF }\nThe intuition behind arguments A′F , ĀF , and RF is similar as in previous translations. An argument a◦ ∈ A◦F indicates that a is attacked by an extension E of F , while ā\n◦ ∈ Ā◦F says that a is not attacked by E.\nLemma 8. Let F = (A, R) be an AF, E ⊆ A and E∗ = E∪ (A \\ E)∪{a◦ | E R a}∪{ā◦ | E 6R a}. Then the following statements are equivalent:\n1. E ∈ com(F )\n2. E∗ ∈ stb(Tr7(F ))\n3. E∗ ∈ sem(Tr7(F ))\n4. E∗ ∈ stg(Tr7(F ))\nMoreover for each E∗ ∈ σ(Tr6(F )) (σ ∈ {stb, sem, stg}) there exists a set E ⊆ A such that E∗ = E ∪ (A \\ E) ∪ {a◦ | E R a} ∪ {ā◦ | E 6R a}.\nProof. To show (1)⇒(2), let E ∈ com(F ). Then by construction E∗ is conflict-free in Tr7(F ) (for x, y ∈ E we have x  R y ⇔ x R ∗\ny). Moreover, by definition of E∗, it can be verified that A ∪ Ā ∪ A◦ ∪ Ā◦ ⊆ (E∗)+R∗ . Thus it remains to show that (i) A\n′ ⊆ (E∗)+R∗ and (ii) R ⊆ (E∗)+R∗ .\n(i) Let a ∈ A be an arbitrary argument of F . As E is a complete extension we have that either a ∈ E, and thus a ∈ E∗, or there exists an attack (b, a) ∈ R with E 6R b, and thus b̄◦ ∈ E∗. As by construction (b̄◦, a′) ∈ R∗ we thus have that E∗ R ∗ a′.\n(ii) Let r = (b, a) ∈ R be an arbitrary attack of F . As E is admissible it holds that either a /∈ E, and thus ā ∈ E∗, or E R b, and thus b◦ ∈ E∗. In both cases E∗ R ∗ r.\nPutting things together, we get that A ∪ Ā ∪ A◦ ∪ Ā◦ ∪ A′ ∪ R = A∗ ⊆ (E∗)+R∗ which is equivalent to E∗ being a stable extension of Tr7(F ).\nTo show (1)⇐(2), let E∗ ∈ stb(Tr7(F )). First we prove that E ∗ is of the desired form. As E∗ is both conflict-free and ⊆-maximal we clearly have that E∗ ∩ (A ∪ Ā) = E ∪ A \\ E for some E ⊆ A. Let now a ∈ A be an arbitrary argument. We have that a◦ ∈ E∗ iff ā◦ 6∈ E∗. But as E∗ is stable ā◦ 6∈ E∗ iff there exists an attack (b, ā◦) such that b ∈ E∗. By construction of Tr7(F ) this is equivalent to b ∈ E and therefore E \nR a. Thus E∗ is of the desired form, it remains to show that E is complete. As mentioned before we have for x, y ∈ E : x R y ⇔ x R ∗\ny and thus E is conflict-free in F . Thus it remains to show that (i) E defends each of its arguments in F and (ii) E contains each argument defended by E in F .\n(i) Let us assume there exists an argument a ∈ E not defended by E. Thus there exists r = (b, a) ∈ R, E 6 b. By construction we also have that ā /∈ E∗ (as a ∈ E) and b◦ 6∈ E∗ (as E 6 b). But in Tr7(F ) the self-attacking argument r is only attacked by the arguments ā, b◦ (and itself). Hence, this is in contradiction to E∗ being a stable extension.\n(ii) Let a ∈ A be an argument defended by E. Then for all arguments b R a we have that E R b and thus b◦ ∈ E∗ and b̄◦ /∈ E∗. Recall that in Tr7(F ) the argument a\n′ is self-attacking and thus does not belong to E∗ and is only attacked by the arguments b̄◦ and a. As E∗ is a stable extension and a′ 6∈ E∗ we have that a ∈ E∗ and a ∈ E.\n(2) ⇔ (3) ⇔ (4): As there always exists a complete extension we know that any framework Tr7(F ) has a stable extension. But then stable, stage and semi-stable extensions coincide.\nTranslation Tr7 introduces a huge number of new arguments, despite this the introduction of a concrete argument or attack only depends on a single argument or attack. Hence Tr7 is modular. It is easily checked that Tr7 is also embedding. Together with Lemma 8 we thus can state the following result for Tr7.\nTheorem 7. Tr7 is a modular, embedding and faithful translation for com ⇒ σ (σ ∈ {stb, sem, stg}).\nFinally we present a translation from grounded semantics to most of the other semantics under our focus, i.e. to all semantics except admissible semantics. The main idea is to simulate the computation of the least fixed-point of the characteristic function FF (S) = {x ∈ AF | x is defended by S} of an AF F within the target AF.\nTranslation 8. The translation Tr8(F ) is defined as Tr8(F ) = (A ∗, R∗) where\nA∗ = AF,1 ∪ Ā ◦ F,1 ∪ · · · ∪ AF,l ∪ Ā ◦ F,l R∗ = RF ∪ {(ā ◦ i , bi) | (a, b) ∈ R, i ∈ [l]}\n∪ {(ai, b̄ ◦ i+1) | (a, b) ∈ R, i ∈ [l − 1]}\nwith AF = AF,l and l = ⌈ |AF |\n2 ⌉.\nFor illustration, we use here a slightly different example depicted in Figure 11(a). Observe that this AF has {a, c, d} as its grounded extension. The translated framework is given in Figure 11(b).\nThe intuition behind arguments ai ∈ AF,i is that a ∈ F i F (∅), while the intuition of\nā◦i ∈ Ā ◦ F,i is that F (i−1) F (∅) 6 a. The integer l is an upper bound for the number of iterations we need to reach the least fixed-point, i.e. the grounded extension.\nLemma 9. Let F = (A, R) be an AF and E∗ the grounded extension of Tr8(F ). Then E∗ ∩ A is the grounded extension of F . We further have that on Tr8(F ) the grounded, stable, complete, preferred, semi-stable and stage extensions coincide.\nProof. We recall the definition of the characteristic function FF of an AF F , defined as FF (S) = {x ∈ AF | x is defended by S}, and that the grounded extension of F is the least fix-point of FF . Further we use as a shorthand F\n∗ = Tr8(F ). One can show that for arbitrary a ∈ A we have\n(i) ai ∈ E ∗ iff a ∈ F iF (∅);\n(ii) ā◦i ∈ E ∗ iff F i−1F (∅) 6 R a; and\n(iii) AF,i ⊆ (E ∗)+R∗ .\n(iv) Ā◦F,i ⊆ (E ∗)+R∗ .\nWe prove this by structural induction. As induction base we show (ii) and (iv) for the arguments ā◦1. For a ∈ A we have that ā ◦ 1 ∈ E\n∗ as they are not attacked by any argument. This coincides with the fact that F0F (∅) = ∅ doesn’t attack any argument and thus (ii) and (iv) holds.\nWe have two induction steps: (1) Showing that (i) and (iii) hold for arbitrary n iff (ii) and (iv) hold for n; and (2) showing that (ii) and (iv) hold for arbitrary n iff (i) and (iii) hold for n − 1.\n(1) We assume (ii) and (iv) hold for all ā◦n. By the definition of FF we have that a ∈ F n F (∅)\niff all b ∈ a− = {b ∈ A | b  a} are attacked by Fn−1F (∅). Applying the induction hypothesis (ii) to b ∈ a− we obtain that a ∈ FnF (∅) iff each b̄ ◦ i ∈ {b̄ ◦ i | (b, a) ∈ R} is attacked by E∗. Further, as by the construction of Tr8(F ) these are the only attackers of a, this is equivalent to argument ai being defended by E\n∗. Now recall that the each argument defended by the grounded extension is indeed contained in the grounded extension. Hence, a ∈ FnF (∅) iff ai ∈ E ∗ and (i) holds. To show (iii) we consider ai ∈ AF,i. If ai ∈ E ∗ then clearly ai ∈ (E\n∗)+R∗ . Thus let us consider ai /∈ E\n∗. Then, by the above observations, there exists a b̄◦i such that b̄◦i  ai and E\n∗ 6 b̄◦i . Using the latter and the induction hypothesis (iv) we obtain that b̄◦i ∈ E ∗. Now we have that E∗  ai, hence ai ∈ (E ∗)+R∗ and we obtain (iii).\n(2) Now let us assume that (i) and (iii) hold for all an−1. We have that F n−1 F (∅)  a\niff there exists b ∈ Fn−1F (∅) ∩ {b | (b, a) ∈ R ∗}. By induction hypothesis this holds iff\nthere exists a bi−1 ∈ E ∗ such that (b, a) ∈ R. In other words there exists bi−1 ∈ E ∗ such that bi−1  R∗ ā◦i , which implies that ā ◦ i 6∈ E ∗. Moreover if there is no bi−1 ∈ E ∗ such that bi−1  R∗ ā◦i , by assumption (iii) we have that E\n∗ defends ā◦i and thus ā◦i ∈ E ∗. Hence (ii) and (iv) hold.\nFurthermore when applying the FF operator we either add a new argument to the set and attack an additional argument or we reach the fixed-point. So in each step we make a decision about at least two arguments and thus F lF (∅) = grd(F ). In combination with (i), we get that al ∈ E\n∗ iff a ∈ grd(F ). Moreover by (iii) and (iv) it holds that E∗ is also a stable extension and thus grd(F ∗) = stb(F ∗) = com(F ∗) = prf (F ∗) = sem(F ∗) = stg(F ∗).\nAs in Tr8 the integer value l depends on the size S of the source AF, Tr8 is not modular. However, it can be verified that the computation of the translation only requires logarithmic space wrt. S and that Tr8 is embedding (the original AF is indeed contained in the resulting AF; see also the bottom layer in Figure 11(b)). Our final result concerning translations thus follows immediately from Lemma 9.\nTheorem 8. Tr8 is an embedding and faithful translation for grd ⇒ σ (σ ∈ {stb, com, prf , stg , sem})."}, {"heading": "5. Negative Results", "text": "In this section, we present results fortifying that for several semantics there does not exist any translation with the desired properties. The first result, which is rather straight forward, relies on the fact that the grounded semantics is a unique-status semantics.\nProposition 3. There is no (weakly) faithful translation for σ ⇒ grd with σ ∈ {sem, stg , prf , com, stb, adm}.\nProof. For instance consider the AF F = ({a, b}, {(a, b), (b, a)}). We have that {{a}, {b}} ⊆ σ(F ) for σ ∈ {sem, stg , prf , com, stb, adm} but the grounded semantics always proposes a unique extension.\nWe observe that in general it holds that if σ is a multiple status semantics and σ′ is a unique status semantics then there is no (weakly) faithful translation for σ ⇒ σ′.\nFurther results are based on complexity gaps between different semantics (see Table 1) and the fact that certain translations preserve some decision problem. We start with cases where it is impossible to find efficient faithful translations; even if we allow for weakly faithful translations, cf. Definition 6. Afterwards, we give some negative results concerning (weakly) exact translations.\nThe following theorem concerns the intertranslatability of preferred, semi-stable and stage semantics, i.e. the semantics where skeptical acceptance is ΠP2 -complete. The underlying reason for the impossibility result is the complexity gap for the credulous acceptance problems.\nTheorem 9. There is no efficient (weakly) faithful translation for sem ⇒ prf or stg ⇒ prf unless ΣP2 = NP.\nProof. Let Tr be an efficient (weakly) faithful translation from σ ∈ {sem, stg} to prf . By definition this translation is L-computable and as we show next reduces Credσ to Credprf : Let F = (A, R) be an arbitrary AF, x ∈ A an argument. First let us assume that x is credulously accepted wrt. to σ. Hence, there exists an E ∈ σ(F ) with x ∈ E. As Tr is a weakly faithful translation, there is an E∗ ∈ prf (Tr (F )), such that E∗ ∩ A = E. Thus x ∈ E∗, i.e. x is credulously accepted wrt. preferred semantics in Tr (F ).\nSo assume x is credulously accepted in Tr (F ) wrt. to prf , i.e. x ∈ E∗ for some E∗ ∈ prf (Tr (F )). By x ∈ E∗∩A we can conclude that E∗ is not a remainder set of Tr . As Tr is a weakly faithful translation we have that E = E∗ ∩A is in σ(F ), and thus x is credulously accepted in F wrt. σ. Thus, Tr is a L-reduction from the ΣP2 -hard problem Credσ to the NP-easy problem Credprf .\nThe following theorem makes use of complexity gaps for the skeptical acceptance.\nTheorem 10. There is no efficient (weakly) faithful translation for σ ⇒ σ′, where σ ∈ {sem, stg , prf } and σ′ ∈ {com, stb, adm}, unless ΣP2 = NP.\nProof. Given an efficient weakly faithful translation Tr with remainder set S for σ ⇒ σ′ we have that Skeptσ is translated to the problem Skept S σ′ , that is deciding whether an argument is in each σ′-extension which is not in the set S. Next we show that the problem SkeptSσ′ remains in coNP. One can disprove SkeptSσ′ , by guessing a set E ⊆ A, such that a 6∈ E and verify that E ∈ σ′(F ) and E 6∈ S. As Verσ′ ∈ P and the set S is fixed, i.e. S does not depend on the input, this is an NP-algorithm. Hence proving SkeptSσ′ is in coNP. Thus Tr would be an L-reduction from the ΠP2 -hard problem Skeptσ to the coNP-easy problem SkeptSσ′ , which implies Σ P 2 = NP.\nOne might prefer (weakly) exact over (weakly) faithful translations. As we have seen in Section 4, several of our translations are not exact but only faithful. In these cases we are interested in either finding an exact translation or an evidence that an exact translation is not possible. The following theorems approve that it was appropriate to have given only a (weakly) faithful translation in Section 4, as there cannot be any exact such translation.\nTheorem 11. There is no (weakly) exact translation for σ ⇒ σ′ where σ ∈ {adm, com} and σ′ ∈ {stb, prf , sem, stg}.\nProof. This is basically by the fact that admissible resp. complete extensions may be in a ⊂-relation; consider e.g. F = ({a, b}, {(a, b), (b, a)}) with σ(F ) = {{a}, {b}, ∅}. Let us now assume there exists a (weakly) exact translation Tr for σ ⇒ σ′. By definition, σ(F ) = {{a}, {b}, ∅} ⊆ σ′(Tr (F )), but as ∅ ⊂ {a} this contradicts σ′ ∈ {stb, prf , sem, stg}.\nTheorem 12. There is no (weakly) exact translation for com ⇒ adm.\nProof. We observe that for every AF F it holds that ∅ ∈ adm(F ), but there are AFs where ∅ /∈ com(F ). Thus for a weakly exact translation Tr , with the collection S of remainder sets, it holds that ∅ ∈ S. But then, given an AF F with ∅ ∈ com(F ), e.g. F = ({a, b}, {(a, b), (b, a)}), we can conclude that ∅ ∈ adm(Tr (F )) \\ S, a contradiction.\nTheorem 13. There is no efficient (weakly) exact translation for grd ⇒ σ where σ ∈ {stb, adm, com}, unless L = P.\nProof. Let us, towards a contradiction, assume that there exists an efficient (weakly) exact translation Tr for grd ⇒ σ. For a given AF F = (A, R) with a set E ⊆ A it holds that E ∈ grd(F ) iff E ∈ σ(Tr (F )). Thus Tr would be an L-reduction from the P-hard problem Vergrd (see Proposition 1) to Verσ (σ ∈ {stb, adm, com}) which is in L.\nIn Section 4 we presented two translations for stg ⇒ sem: Tr2 which is an exact translation, but not embedding, and Tr5 which is an embedding and faithful translation, but not exact. Let us also mention at this point that Tr2 was the only translation presented in Section 4 that is not embedding. Hence a natural question that occurs is whether a translation that is embedding and exact for stg ⇒ sem is possible. We give a negative answer to this question.\nTheorem 14. There is no embedding and (weakly) exact translation for stg ⇒ sem.\nProof. Let us assume there exists an embedding and (weakly) exact translation Tr for stg ⇒ sem. Consider the AF F = ({a, b}, {(a, a), (a, b)}) with stg(F ) = {{b}}. As Tr is a (weakly) exact translation we have that {b} ∈ sem(Tr (F )) and thus {b} ∈ adm(Tr (F )). Further we have that (a, b) ∈ RTr (F ) (Tr (F ) is embedding) and thus {b} must attack a. But then we have (b, a) ∈ RTr (F ) which is contradiction to Tr being an embedding translation.\nFinally we present an impossibility result for prf ⇒ stg and sem ⇒ stg .\nTheorem 15. There is no (weakly) exact translation for σ ⇒ stg (σ ∈ {sem, prf }).\nProof. Consider the AF F = ({a, b, c, d, e, f, g1, g2, h}, {(g1, g1), (g2, g2), (a, b), (b, a), (c, d), (d, c), (a, g1), (b, e), (c, e), (d, g2), (e, f), (f, h), (h, e)}) illustrated in Figure 12. We have that sem(F ) = {{b, d, f}, {a, c, f}, {a, d}} and prf (F ) = sem(F ) ∪ {{b, c, f}}.\nTo prove that there is no weakly exact translation for σ ⇒ stg (σ ∈ {sem, prf }), we will show that there exists no AF F ′ with sem(F ) ⊆ stg(F ′). To this end, let us assume that F ′ = (A′, R′) is such an AF with {{b, d, f}, {a, c, f}, {a, d}} ⊆ stg(F ′). Using the fact that {b, d, f} is conflict-free in F ′ we obtain that (d, f), (f, d) 6∈ R′ and similar by using that {a, c, f} is conflict-free in F ′ we get that (a, f), (f, a) 6∈ R′. By assumption {a, d} ∈ stg(F ′) and thus {a, d} is a maximal conflict-free set of F ′, but by the above observations the set {a, d, f} is also conflict-free in F ′, a contradiction."}, {"heading": "6. Conclusion", "text": "In this work, we investigated intertranslations between different semantics for abstract argumentation. We focused on translations which are efficiently computable and faithful (with a few relaxations due to certain differences implicit to the semantics). An overview of our results is given in Table 2.3 The entry in row σ and column σ′ is to read as follows: “–” states that we have shown (Section 5) that no efficient faithful (even weakly faithful) translation for σ ⇒ σ′ exists. If the entry refers to a translation (or a concatenation of translations), we have found an efficient (weakly) exact translation for σ ⇒ σ′. An entry which is split into two parts, e.g. “Tr8 / -”, means that we have found an efficient (weakly) faithful translation, but there is no such exact translation. “?” indicates an open problem. We mention that all the concatenated translations are weakly faithful as they are built from a weakly exact translation Tr4 (which has as only remainder set the empty set) and a faithful translation (either Tr6, Tr7, or Tr8).\nFigure 13 illustrates our intertranslatability results at one glance. Here, a solid arrow expresses that there is an efficient faithful translation while a dotted arrow depicts that there may exist such a translation, but so far we have neither found one nor have an argument against its existence. Furthermore, if for two semantics σ, σ′ there is no path from σ to σ′ then it is proven (partly under typical complexity theoretical assumptions) that there is no efficient faithful translation for σ ⇒ σ′. If we consider the relations between the semantics wrt. exactness rather than just faithfulness, the overall picture changes; see Figure 14. Here, we get a more detailed picture about the relations between stable, admissible, and complete semantics. One conclusion, we can draw from these pictures is that semi-stable semantics is the most expressive one, since each of the other investigated semantics can be efficiently embedded. Moreover, we believe that our investigations complements recent results about comparisons between the different semantics proposed for argumentation frameworks.\nLet us at this point also mention that, instead of considering different properties for the translations, we could also have used slightly revised semantics. The notion of remainder sets (as given in Definition 6) can partly be circumvented by, for instance, using a quasiadmissible semantics instead of admissible semantics, where the quasi-admissible extensions\n3. One may notice that Tr5 does not appear in the table. Recall that Tr5 was proposed as an alternative to Tr2 satisfying slightly different properties for stg ⇒ sem; see also the discussion before Theorem 14.\nof an AF are all non-empty admissible extensions (in case such ones exist), or is only the empty set otherwise. Also it is obvious that the more restricted the properties for a translation are, the less such translations exist (compare Figures 13 and 14). Hence, we observe a certain trade-off between translation criteria and comparability between semantics.\nAn alternative option to obtain translations would have been to exploit known relations between argumentation semantics and logic-programming semantics (see, e.g., Dung, 1995; Wu, Caminada, & Gabbay, 2009) and making use of known translatability results for the latter. However, we refrained from such an approach here, since it might blur the minimal requirements for the translations under consideration. In particular, from the point of meta-argumentation, translations via logic-programming semantics might introduce new arguments just for technical reasons due to the logic-programming syntax, but which have no meaning on the level of AFs.\nFor future work, we identify the following tasks: First, we want to solve the few open slots in Table 2. Second, further properties for translations could be of interest. For instance, one could even strengthen the property of being exact (which is defined in terms of the extensions) to the requirement that the labelings (Caminada & Gabbay, 2009) of the source and target framework coincide. Labelings provide additional information, in particular for arguments not contained in an extension. Likewise, it would be interesting to investigate intertranslatability in the more general approach of equational semantics for argumentation frameworks (Gabbay, 2011). Further properties for translations could be given in terms of graph properties. As an example, acyclic AFs should remain acyclic after the translations, or parameters as tree-width should remain unchanged. Requirements of such a form are also termed “structural preservation” (Janhunen et al., 2006). Such properties are of interest from a computational point of view in the sense that, in case the source AF is easy to evaluate (because of its structure), this advantage should not be lost during the translation; recall here Figure 1 where we suggested to use our translations for a rapid prototyping approach to compute the extensions of a semantics via an argumentation engine based on a different semantics. Finally, we plan to extend our considerations to other important semantics like the ideal semantics (Dung et al., 2007), cf2-semantics (which is proposed among others in Baroni et al., 2005), or resolution-based semantics (Baroni, Dunne, & Giacomin, 2011), among which the resolution-based grounded semantics is of particular interest. As well studying translations between semantics for generalizations of Dung-style AFs as EAFs (Modgil, 2009) or AFRAs (Baroni, Cerutti, et al., 2011) is an interesting subject for future work."}, {"heading": "Acknowledgments", "text": "This work was supported by the Vienna Science and Technology Fund (WWTF) under grant ICT08-028. A preliminary version of this paper has been presented at the International Conference “30 Years of Nonmonotonic Logic”.\nThe authors are grateful to Christof Spanring for suggesting the counterexample used in the proof of Theorem 15. Moreover, the authors want to thank Tomi Janhunen as well as the anonymous referees from the “30 Years of Nonmonotonic Logic” symposium and from JAIR for valuable comments which helped to improve the paper."}], "references": [], "referenceMentions": [], "year": 2011, "abstractText": "Translations between different nonmonotonic formalisms always have been an important topic in the field, in particular to understand the knowledge-representation capabilities those formalisms offer. We provide such an investigation in terms of different semantics proposed for abstract argumentation frameworks, a nonmonotonic yet simple formalism which received increasing interest within the last decade. Although the properties of these different semantics are nowadays well understood, there are no explicit results about intertranslatability. We provide such translations wrt. different properties and also give a few novel complexity results which underlie some negative results.", "creator": "dvips(k) 5.96 Copyright 2005 Radical Eye Software"}}}