{"id": "1401.0044", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "30-Dec-2013", "title": "Approximating the Bethe partition function", "abstract": "When forcibly belief poiree propagation (secon BP) potties converges, it telegraaf does so rtsh to disease-causing a toskala stationary macaulays point of the Bethe free dispatching energy $ F $, 1976-1982 and kreuz is zweiten often strikingly accurate. monthy However, racs it annamacharya may converge only to kawakami a roseman local outhitting optimum or sitter may 18-acre not scdma converge monkayo at all. pontefract An bonneville algorithm was recently suddenness introduced hylton for attractive intimacies binary bubanza pairwise ghaziabad MRFs which barbarities is groundstroke guaranteed 2625 to daguan return narrow-gauge an $ \\ .658 epsilon $ - nevoso approximation lakhisarai to nulls the fissurella global 226-3433 minimum mineracao of $ F $ in 2,000-megawatt polynomial brasilcel time misleydis provided 100-95 the motola maximum khail degree $ \\ wendling Delta = O (\\ bjørn log nationaltheater n) $, where $ cholsey n $ l’industrie is perwaja the pentti number of variables. 81.47 Here sudja we 37-nation significantly pinheiros improve enlisting this algorithm 5:29 and derive chokes several results including a new establecimiento approach anick based 3.0-4 on firebug analyzing emporiki first derivatives traveler of $ rancheria F $, kuser which calydonian leads burgon to performance that war-torn is flosse typically relayed far superior premisys and fuggers yields 1903-4 a fully polynomial - time nabet approximation scheme (FPTAS) chappaquiddick for eylau attractive gyeongjeon models husic without any degree windeyer restriction. philbert Further, the lusignan method applies to general (non - attractive) marathi-speaking models, though with zamolodchikova no tongans polynomial time tuz guarantee 77-kilogram in this sheaf case, renju leading lig to gemme the subcarriers important short-time result railyard that 194-page approximating $ \\ pagai log $ antipasti of the Bethe motivated partition namouh function, $ \\ west-germany log Z_B = - \\ slesin min F $, for toothache a mysa general modiano model to sta additive $ \\ epsilon $ - 36.62 accuracy may be 14-play reduced to euro423 a takshaka discrete MAP wintersmith inference problem. We explore an dendronotid application to predicting equipment vintsuk failure berryz on lendava an 104.66 urban gaurs power network and bruces demonstrate worldview that defferre the meaningfully Bethe 32,900 approximation magnetite can 8,260 perform well even balaz when egnot BP pre-configured fails shastriji to converge.", "histories": [["v1", "Mon, 30 Dec 2013 22:40:50 GMT  (124kb)", "http://arxiv.org/abs/1401.0044v1", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["adrian weller", "tony jebara"], "accepted": false, "id": "1401.0044"}, "pdf": {"name": "1401.0044.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["Adrian Weller", "Tony Jebara"], "emails": ["adrian@cs.columbia.edu", "jebara@cs.columbia.edu"], "sections": [{"heading": null, "text": "ar X\niv :1\n40 1.\n00 44\nv1 [\ncs .L\nG ]\n3 0\nD ec\n2 01\nWhen belief propagation (BP) converges, it does so to a stationary point of the Bethe free energy F , and is often strikingly accurate. However, it may converge only to a local optimum or may not converge at all. An algorithm was recently introduced for attractive binary pairwise MRFs which is guaranteed to return an ǫ-approximation to the global minimum of F in polynomial time provided the maximum degree ∆ = O(log n), where n is the number of variables. Here we significantly improve this algorithm and derive several results including a new approach based on analyzing first derivatives of F , which leads to performance that is typically far superior and yields a fully polynomial-time approximation scheme (FPTAS) for attractive models without any degree restriction. Further, the method applies to general (non-attractive) models, though with no polynomial time guarantee in this case, leading to the important result that approximating log of the Bethe partition function, logZB = −minF , for a general model to additive ǫaccuracy may be reduced to a discrete MAP inference problem. We explore an application to predicting equipment failure on an urban power network and demonstrate that the Bethe approximation can perform well even when BP fails to converge."}, {"heading": "1 INTRODUCTION", "text": "Undirected graphical models, also termed Markov random fields (MRFs), are flexible tools used in many areas including speech recognition, systems biology and computer vision. A set of variables and a score function is specified such that the probability of a configuration of variables is proportional to the value of the score function, which typi-\nColumbia University CUCS Technical Report.\ncally factorizes into sub-functions over subsets of variables in a way that defines a topology on the variables.\nThree central problems are:\n1. To evaluate the partition function Z , which is the sum of the score function over all possible settings, and hence is the normalization constant for the probability distribution.\n2. Marginal inference, which is computing the probability distribution of a given subset of variables.\n3. Maximum a posteriori (MAP) inference, which is the task of identifying a setting of all the variables which has maximum probability.\nThe first two problems are related (marginals are a ratio of two partition functions). Computing Z belongs to the class of counting problems #P (Valiant, 1979). Further, exact marginal inference is NP-hard (Cooper, 1990). The MAP problem is typically easier, yet is still NP-hard (Shimony, 1994), even to approximate (Abdelbar & Hedetniemi, 1998). Much work has focused on trying to find good approximate solutions, or restricted domains where exact solutions may be found efficiently. One popular method is to use a message-passing algorithm called belief propagation (Pearl, 1988), which returns an exact solution in linear time in n, the number of variables, if the topology of the model is a tree. If this method is applied to general topologies, termed loopy belief propagation (LBP), results are sometimes strikingly good (McEliece et al., 1998; Murphy et al., 1999), though in general it may not converge at all, and if it does, it may not be to a global optimum.\n(Yedidia et al., 2001) showed a remarkable connection between LBP and an earlier approach from statistical physics (Bethe, 1935; Peierls & Born, 1936), in that any fixed point of LBP corresponds to a stationary point of a function of the system, termed the Bethe free energy F . In fact, LBP can be seen as an iteration of the fixed point equations of the Bethe free energy. Variational approaches led to a better understanding of this relationship, showing that the negative of the global minimum of the Bethe free energy is the log of the Bethe partition function ZB. Thus, ZB should yield a good approximation to the true partition function Z , though this is not a formal result - there are cases where\n2 it performs poorly, typically when there are many short cycles with strong edge interactions (Wainwright & Jordan, 2008, § 4.1). Even then, however, it can still be remarkably effective and in practice, LBP is widely used, often with excellent results. One motivation for our algorithm is to allow exploration of the limits for when ZB performs well, even when LBP or other local optimization approaches fail, which has not previously been possible. We demonstrate this application in Experiments §6. Another interesting example is the demonstration (Chandrasekaran et al., 2011) that the Bethe approximation is very useful to count independent sets of a graph. Further, it was shown that if the shortest cycle cover conjecture of Alon and Tarsi (Alon & Tarsi, 1985) is true, then the Bethe approximation is very good indeed for a random 3-regular graph.\nExtensive analysis has focused on understanding conditions under which LBP is guaranteed to converge to the global optimum (Heskes, 2004; Mooij & Kappen, 2007; Watanabe, 2011), but outside these restricted settings, until recently, there were no polynomial time methods even to approximate ZB . One major area of study is the important subclass of models which are binary, i.e. each variable takes one of just two possible values, and pairwise, i.e. all score sub-functions are evaluated over at most two variables. These play a key role in areas such as computer vision, both directly and as critical subroutines in solving more complex problems (Pletscher & Kohli, 2012). Further, it is possible to convert a general MRF into an equivalent binary pairwise model (Yedidia et al., 2001), though potentially with a much enlarged state space.\nAn algorithm was introduced in (Shin, 2012) guaranteed to return an approximately stationary point of F in polynomial time for such binary pairwise models, though with a bound on the maximum degree, ∆ = O(log n). (Weller & Jebara, 2013a) then used a discretizing approach to derive a polynomial-time approximation scheme (PTAS) for logZB for the significant subclass of attractive1 binary pairwise models, also with ∆ = O(log n). Interestingly, (Ruozzi, 2012) recently proved that ZB ≤ Z for attractive models. Similarly, for graphical models whose partition function is the permanent of a non-negative matrix, ZB is recoverable via convex optimization and, here too, ZB ≤ Z (Huang & Jebara, 2009; Vontobel, 2010; Watanabe & Chertkov, 2010; Gurvits, 2011). Otherwise, beyond trivial cases where the graph is acyclic, efficiently computing or approximating ZB remains an active research topic.\n1An attractive model has all pairwise relationships of the type that tend to pull adjacent variables toward the same value (see §2 for a more precise definition). Equivalent terms used are associative, regular or ferromagnetic."}, {"heading": "1.1 Contribution and Summary", "text": "We obtain important new results for binary pairwise MRFs as described in the Abstract. We adopt ideas from (Weller & Jebara, 2013a) but go significantly further to derive much stronger results. The overall approach is to construct a sufficient mesh of discretized points in such a way that the optimum mesh point q∗ is guaranteed to have F(q∗) within ǫ of the true optimum. The new, first derivative approach, generally results in a much coarser, yet still sufficient mesh, and also admits adaptive methods to focus points in regions where F may vary rapidly. Separately, we also refine the second derivative method of (Weller & Jebara, 2013a) to derive a method that performs well for very small ǫ. We then consider how best to solve the resulting discrete optimization problem, which may be framed as multi-label MAP inference, and for which many techniques are available, some of which are efficient for sub-classes of problem.2\nIn §2, we establish notation and present various preliminary results, then apply these in §3 to present our new approach for mesh construction based on analyzing first derivatives of F . This leads to much improved performance (often by orders of magnitude), immediately admits general (nonattractive) models, and in the attractive setting yields a FPTAS for models with no restriction on topology.\nIn §4 we revisit the second derivative approach of (Weller & Jebara, 2013a). We show how this method can be refined and extended to yield better performance and also to admit non-attractive models, though for most cases of interest, unless ǫ is very small, the method of §3 will be superior. In §5, we discuss the derived discrete optimization problem, which may be viewed as a multi-label MAP inference problem. In certain settings the problem is tractable, and in general we mention several features that can make it easier to find a satisfactory solution, or at least to bound its value. Experiments are described in §6 demonstrating practical application of the algorithm. Finally, we present conclusions in §7."}, {"heading": "1.1.1 Structure of the overall algorithm", "text": "Input: Parameters {θi,Wij} for a general binary pairwise MRF (convert format using the reparameterization of §2.1 if required), and a desired accuracy ǫ.\n1. Preprocess by computing bounds {Ai, Bi} on the locations of minima (see §2.4).\n2. Construct a sufficient mesh using one of the methods in this paper. Indeed, all approaches are fast, so several may be used, then the most efficient mesh selected.\n2Computing ZB is at least PPAD or PLS-hard in general since it not only requires a fixed point but also the global minimizer (Shin, 2013; Daskalakis & Papadimitriou, 2011).\n3 3. Attempt to solve the resulting multi-label MAP inference problem, see §5.\n4. If unsuccessful, but a strongly persistent partial solution was obtained, then improved {Ai, Bi} may be generated (see §5.2.1), repeat from 2.\nAt anytime, one may stop and compute bounds on F , see §5.2."}, {"heading": "1.2 Related work", "text": "Methods such as CCCP (Yuille, 2002) or UPS (Teh & Welling, 2002) are guaranteed to converge to a local minimum of the Bethe free energy, but this may be far from the global optimum. In earlier work, a fully polynomial-time randomized approximation scheme (FPRAS) for the true partition function was derived (Jerrum & Sinclair, 1993), but only when singleton potentials are uniform (i.e. a uniform external field) and the resulting runtime is high at O(ǫ−2m3n11 logn). It was recently shown (Heinemann & Globerson, 2011) that models exist such that the true marginal probability cannot possibly be the location of a minimum of the Bethe free energy. Our work demonstrates an interesting connection between MAP inference techniques (NP-hard) and estimating the partition function Z (#P-hard). Recently (Hazan & Jaakkola, 2012) showed a different connection by using MAP inference on randomly perturbed models to approximate and bound Z ."}, {"heading": "2 NOTATION & PRELIMINARIES", "text": "Our notation is similar to (Weller & Jebara, 2013a) and (Welling & Teh, 2001). We focus on a binary pairwise model with n variables X1, . . . , Xn ∈ B = {0, 1} and graph topology (V , E) with m = |E|; that is V contains nodes {1, . . . , n} where i corresponds to Xi, and E ⊆ V × V contains an edge for each pairwise score relationship. Let N(i) be the neighbors of i. Let x = (x1, . . . , xn) be one particular configuration, and introduce the notion of energy E(x) through3\np(x) = e−E(x)\nZ , E = −\n∑ i∈V θixi − ∑ (i,j)∈E Wijxixj , (1)\nwhere the partition function Z = ∑ x e −E(x) is the normalizing constant.\nGiven any joint probability distribution p(X1, . . . , Xn) over all variables, the (Gibbs) free energy is defined as FG(p) = Ep(E) − S(p), where S(p) is the (Shannon)\n3The probability or score function can always be reparameterized in this way, with finite θi and Wij terms provided p(x) > 0 ∀x, which is a requirement for our approach. There are reasonable distributions where this does not hold, i.e. distributions where ∃x : p(x) = 0, but this can often be handled by assigning such configurations a sufficiently small positive probability ǫ.\nentropy of the distribution. Using variational methods, a remarkable result is easily shown (Wainwright & Jordan, 2008): minimizing FG over the set of all globally valid distributions (termed the marginal polytope) yields a value of − logZ , exactly at the true marginal distribution, given in (1).\nMinimizing FG is, however, computationally intractable, hence the approach of minimizing the Bethe free energy F makes two approximations: (i) the marginal polytope is relaxed to the local polytope, where we require only local consistency, that is we deal with a pseudo-marginal distribution q, which in our context may be considered {qi = q(Xi = 1) ∀i ∈ V , µij = q(xi, xj) ∀(i, j) ∈ E} subject to qi = ∑\nj µij ∀i ∈ V , j ∈ N(i); and (ii) the entropy S is approximated by the Bethe entropy SB = ∑\n(i,j)∈E Sij + ∑ i∈V(1 − di)Si, where Sij is the entropy of µij , Si is the entropy of the singleton distribution and di = |N(i)| is the degree of i. We assume the model is connected so di ≥ 1 ∀i (else each component may be analyzed independently), and take x log x = 0 for x = 0. Hence, the global optimum of the Bethe free energy,\nF(q) = Eq(E)− SB(q) (2) = ∑\n(i,j)∈E\n− ( Wijξij + Sij(qi, qj) )\n+ ∑\ni∈V\n( − θiqi + (zi − 1)Si(qi) ) ,\nis achieved by minimizing F over the local polytope, with ZB defined s.t. the result obtained equals − logZB. See (Wainwright & Jordan, 2008) for details.\nConsidering the local polytope, given qi and qj , we must have\nµij =\n(\n1 + ξij − qi − qj qj − ξij qi − ξij ξij\n)\n(3)\nfor some ξij ∈ [0,min(qi, qj)], where µij(a, b) = q(Xi = a,Xj = b). Let αij = eWij − 1. αij = 0 ⇔ Wij = 0 may be assumed not to occur else the edge (i, j) may be deleted. αij has the same sign as Wij , if positive then the edge (i, j) is attractive; if negative then the edge is repulsive. The MRF is attractive if all edges are attractive. As in (Welling & Teh, 2001), one can solve for ξij explicitly in terms of qi and qj by minimizing F , leading to a quadratic equation with real roots,\nαijξ 2 ij − [1 + αij(qi + qj)]ξij + (1 + αij)qiqj = 0. (4)\nFor αij > 0, ξij(qi, qj) is the lower root, for αij < 0 it is the higher. Collecting the pairwise terms of F from (2) for one edge, define\nfij(qi, qj) = −Wijξij(qi, qj)− Sij(qi, qj). (5)\nThus we may consider the minimization of F over q = (q1, . . . , qn) ∈ [0, 1]n.\n4 We are interested in discretized pseudo-marginals where for each qi, we restrict its possible values to a discrete mesh Mi of points in [0, 1], which may be spaced unevenly. We allow Mi 6= Mj . Write M for the entire mesh. Let Ni = |Mi| and define N = ∑ i∈V Ni and Π = ∏\ni∈V Ni, the sum and product respectively of the number of mesh points in each dimension. Let q̂ be the location of a global optimum of F . We say that a mesh construction M(ǫ) is sufficient if, given ǫ > 0, it can be guaranteed that ∃ a mesh point q∗ ∈ ∏\ni∈V Mi s.t. F(q∗)−F(q̂) ≤ ǫ. We shall make use of the standard sigmoid function, σ(x) = 1/(1 + exp(−x)) for various bounds."}, {"heading": "2.1 Input model specification", "text": "Throughout this paper, we assume the reparameterization in (1) for all analysis, but a different specification is more natural for input models avoiding bias. We assume an input model is given with singleton terms θi as in (1), but with pairwise energy terms instead given by −Wij2 xixj − Wij 2 (1−xi)(1−xj). With this format, varying Wij simply alters the degree of push/pull between i and j, without also changing the probability that each variable will be 0 or 1, as is the case with the format of (1). We assume maximum possible values W and T are known with |θi| ≤ T ∀i ∈ V , and |Wij | ≤ W ∀(i, j) ∈ E . The required transformation to convert from input model to the format of (1), simply takes θi ← θi − ∑ j∈N(i) Wij/2, leaving Wij unaffected."}, {"heading": "2.2 Submodularity", "text": "In our context, a pairwise multi-label function on a set of ordered labels Xij = {1, . . . ,Ki} × {1, . . . ,Kj} is submodular iff ∀x, y ∈ Xij , f(x ∧ y) + f(x ∨ y) ≤ f(x) + f(y), where for x = (x1, x2) and y = (y1, y2), (x ∧ y) = (min(x1, y1),min(x2, y2)) and (x ∨ y) = (max(x1, y1),max(x2, y2)). For binary variables, submodular energy is equivalent to being attractive.\nThe key property for us is that if all pairwise cost functions fij overMi×Mj from (5) are submodular, then the global discretized optimum may be found efficiently using graph cuts (Schlesinger & Flach, 2006).\nTheorem 1 (Submodularity for any discretization of an attractive model, (Weller & Jebara, 2013a) Theorem 8, (Korc et al., 2012)). If a binary pairwise MRF is submodular on an edge (i, j), i.e. Wij > 0, then the multi-label discretized MRF for any mesh M is submodular for that edge. In particular, if the MRF is fully attractive, i.e. Wij > 0 ∀(i, j) ∈ E , then the multi-label discretized MRF is fully submodular for any discretization. Proof in (Weller & Jebara, 2013a) ."}, {"heading": "2.3 Flipping variables", "text": "As in (Weller & Jebara, 2013a) , we use the techniques below for flipping variables, i.e. we can consider a new model with variables {X ′i}, where X ′i = 1 −Xi for some selection of i. Flipping a variable flips the parity of all its incident edges so attractive ↔ repulsive. Flipping both ends of an edge leaves its parity unchanged."}, {"heading": "2.3.1 Flipping all variables", "text": "Consider a new model with variables {X ′i = 1 − Xi, i = 1, . . . , n} and the same edges. Instead of θi and Wij parameters, let those of the new model be θ′i and W ′ ij . Identify values such that the energies of all states are maintained up to a constant4:\nE = − ∑\ni∈V θiXi −\n∑\n(i,j)∈E\nWijXiXj\n= const− ∑ i∈V θ′i(1−Xi)− ∑ (i,j)∈E W ′ij(1 −Xi)(1 −Xj).\nMatching coefficients gives\nW ′ij = Wij , θ ′ i = −θi −\n∑\nj∈N(i)\nWij . (6)\nIf the original model was attractive, so too is the new."}, {"heading": "2.3.2 Flipping some variables", "text": "Sometimes it is helpful to flip only a subset R ⊆ V of the variables. This can be useful, for example, to make the model locally attractive around a variable, which can always be achieved by flipping just those neighbors to which it has a repulsive edge. Let X ′i = 1 − Xi if i ∈ R, else X ′i = Xi for i ∈ S, where S = V \\ R. Let Et = {edges with exactly t ends in R} for t = 0, 1, 2. As in 2.3.1, solving for W ′ij and θ ′ i such that energies are unchanged up to a constant,\nW ′ij =\n{\nWij (i, j) ∈ E0 ∪ E2, −Wij (i, j) ∈ E1\nθ′i =\n{\nθi + ∑ (i,j)∈E1 Wij i ∈ S, −θi − ∑ (i,j)∈E2 Wij i ∈ R. (7)\nLemma 2. Flipping variables changes affected pseudomarginal matrix entries’ locations but not values. F is unchanged up to a constant, hence the locations of stationary points are unaffected. (Proof in (Weller & Jebara, 2013a))\n4Any constant difference will be absorbed into the partition function and leave probabilities unchanged.\n5"}, {"heading": "2.4 Preliminary bounds", "text": "We use the following results from (Weller & Jebara, 2013a).\nLemma 3 ((Weller & Jebara, 2013a) Lemma 2). αij ≥ 0 ⇒ ξij ≥ qiqj , αij ≤ 0 ⇒ ξij ≤ qiqj Theorem 4 ((Weller & Jebara, 2013a) Theorem 4). For general edge types (associative or repulsive), let Wi = ∑\nj∈N(i):Wij>0 Wij , Vi = − ∑\nj∈N(i):Wij<0 Wij . At any stationary point of the Bethe free energy, σ(θi−Vi) ≤ qi ≤ σ(θi +Wi).\nFor the efficiency of our overall approach, it is very desirable to tighten the bounds on locations of minima of F since this both reduces the search space and allows a lower density of discretizing points in our mesh. This may be achieved efficiently by running either of the following two algorithms: Bethe bound propagation (BBP) from (Weller & Jebara, 2013a), or using the approach from (Mooij & Kappen, 2007) which we term MK. Either method can achieve striking results quickly, though MK is our preferred method5 - it considers cavity fields around each variable and determines the range of possible beliefs after iterating LBP, starting from any initial values; since any minimum of F corresponds to a fixed point of LBP (Yedidia et al., 2001), this bounds all minima.\nLet the lower bounds obtained for qi and 1−qi respectively be Ai and Bi so that Ai ≤ qi ≤ 1 − Bi, and let the Bethe box be the orthotope given by ∏\ni∈V [Ai, 1 − Bi]. Define ηi = min(Ai, Bi), i.e. the closest that qi can come to the extreme values of 0 or 1.\nLemma 5 (Upper bound for ξij for an attractive edge, (Weller & Jebara, 2013a) Lemma 6). If αij > 0, then ξij − qiqj ≤ αijm(1−M)1+αij , where m = min(qi, qj) and M = max(qi, qj)."}, {"heading": "2.5 Derivatives of F", "text": "In (Welling & Teh, 2001), first partial derivatives of the Bethe free energy are derived as\n∂F ∂qi = −θi + logQi, (8)\nwhere Qi = (1 − qi)di−1\nqdi−1i\n∏\nj∈N(i)(qi − ξij) ∏\nj∈N(i)(1 + ξij − qi − qj) .\nTheorem 6 (Second derivatives for each edge, (Weller & Jebara, 2013a) Theorem 7). For any edge (i, j), for any αij ,\n∂2fij ∂q2i = 1 Tij qj(1− qj), ∂2fij ∂q2j = 1 Tij qi(1− qi)\n5Both BBP and MK are anytime methods that converge quickly, and can be implemented such that each iteration runs in O(m) time. MK takes a little longer but can yield tighter bounds.\n∂2fij ∂qi∂qj = ∂2fij ∂qj∂qi = 1 Tij (qiqj − ξij),\nwhere Tij = qiqj(1− qi)(1 − qj)− (ξij − qiqj)2 (9) ≥ 0 with equality iff qi or qj ∈ {0, 1}.\nIncorporating all singleton terms gives the following result.\nTheorem 7 (All terms of the Hessian, see (Weller & Jebara, 2013a) §4.3 and Lemma 9). Let H be the Hessian of F for a binary pairwise model, i.e. Hij = ∂\n2F ∂qi∂qj\n, and di be the degree of variable Xi, then\nHii = − di − 1\nqi(1 − qi) +\n∑\nj∈N(i)\nqj(1− qj) Tij ≥ 1 qi(1− qi) ,\nHij =\n{\nqiqj−ξij Tij (i, j) ∈ E 0 (i, j) /∈ E , i 6= j."}, {"heading": "3 NEW APPROACH", "text": "We develop a new approach to constructing a sufficient mesh M by analyzing bounds on the first derivatives of F . This yields several attractive features:\n• For attractive models, we obtain a FPTAS with worst case runtime O(ǫ−3n3m3W 3) and no restriction on topology, as was required in (Weller & Jebara, 2013a).\n• Our sufficient mesh is typically dramatically coarser than the earlier method of (Weller & Jebara, 2013a), leading to a much simpler subsequent MAP problem unless ǫ is very small. Here, the sum of the number of discretizing points in each dimension, N = O (\nnmW ǫ\n)\n. For comparison, the earlier method, even after our improvements in §4, forms a mesh with N = O ( ǫ−1/2n7/4∆3/4 exp [\n1 2 (W (1 + ∆/2) + T )\n])\n. As an example, for the model in the experiments of §6, our new approach with the adaptive minsum method (see §3.1.2), yields a mesh with N that is 8 orders of magnitude smaller than the earlier method.\n• Our approach immediately handles a general model with both attractive and repulsive edges. Hence approximating logZB may be reduced to a discrete multilabel MAP inference problem. This is valuable due to the availability of many MAP techniques. We discuss this in §5, where we consider when the MAP problem is tractable and examine approaches which may be tried in general.\nFirst assume we have a model which is fully attractive around variable Xi, i.e. Wij > 0 ∀j ∈ N(i). From (8) and Lemma 3, we obtain\n∂F ∂qi = −θi + logQi ≤ −θi + log qi 1− qi . (10)\n6 Flip all variables (see §2.3.1). Write ′ for the parameters of the new flipped model, which is also fully attractive, then using (6) and (10),\n∂F ′ ∂q′i ≤ −θ′i + log q′i\n1− q′i ⇔ −θi −Wi + log\nqi 1− qi ≤ ∂F ∂qi .\nCombining this with (10) yields the sandwich result\n−θi −Wi + log qi 1− qi ≤ ∂F ∂qi ≤ −θi + log qi 1− qi .\nNow generalize to consider the case that i has some neighbors R to which it is adjacent by repulsive edges. In this case, flip those nodes R (see §2.3.2) to yield a model, which we denote by ′′, which is fully attractive around i, hence we may apply the above result. By (7) we have θ′′i = θi −Vi, and using W ′′i = Wi +Vi, we obtain that for a general model,\n−θi −Wi + log qi 1− qi ≤ ∂F ∂qi ≤ −θi + Vi + log qi 1− qi .\n(11)\nThis bounds each first derivative ∂F∂qi within a range of width Vi + Wi = ∑\nj∈N(i) |Wij |, which will be sufficient for the main theoretical result to come in (15). We take the opportunity, however, to narrow this range, thereby improving the result in practice, by using just one step of the belief propagation algorithm (BBP) of (Weller & Jebara, 2013a).\nFollowing the derivation of BBP in the Supplement of (Weller & Jebara, 2013a), where better bounds are derived on the qi location of stationary points by taking account of [Aj , 1−Bj ] bounds on neighbors j ∈ N(i), we may refine the result of (11) to yield\nfLi (qi) ≤ ∂F ∂qi ≤ fUi (qi), where\nfLi (qi) = −θi −Wi + logUi + log qi 1− qi fUi (qi) = −θi + Vi − logLi + log\nqi 1− qi . (12)\nLi, Ui are each > 1 with logLi + logUi ≤ Vi +Wi. They are computed as Li = ∏ j∈N(i) Lij , Ui = ∏ j∈N(i) Uij ,\nwith Lij =\n{\n1 + αijAj\n1+αij(1−Bi)(1−Aj) if Wij > 0\n1 + αijBj 1+αij(1−Bi)(1−Bj) if Wij < 0 ,\nUij =\n{\n1 + αijBj\n1+αij(1−Ai)(1−Bj) if Wij > 0\n1 + αijAj 1+αij(1−Ai)(1−Aj) if Wij < 0 .\nSee Figure 1 for an example. We make the following observations:\n• The upper bound is equal to the lower bound plus the constant Di = Vi +Wi − logLi − logUi ≥ 0.\n• The bound curves are monotonically increasing with qi, ranging from −∞ to +∞ as qi ranges from 0 to 1.\n• A necessary condition to be within the Bethe box is that the upper bound is ≥ 0 and the lower bound is ≤ 0. Hence, anywhere within the Bethe box, we must have bounded derivative, | ∂F∂qi | ≤ Di. BBP generates {[Ai, 1−Bi]} bounds by iteratively updating with Li, Ui terms. In general, however, we may have better bounds from any other method, such as MK, which lead to higher Li and Ui parameters and lower Di.\nF is continuous on [0, 1]n and differentiable everywhere in (0, 1)n with partial derivatives satisfying (12). fLi (qi) and fUi (qi) are continuous and integrable. Indeed, using the notation [ φ(x) ]x=b\nx=a = φ(b)− φ(a),\n∫ b\na\nC+log qi\n1− qi dqi =\n[ Cqi+qi log qi+(1−qi) log(1−qi) ]qi=b\nqi=a\n(13) for 0 ≤ a ≤ b ≤ 1, which relates to the binary entropy function H(p) = −p log p− (1 − p) log(1 − p), recall the definition of F . We remark that although ∂F∂qi tends to −∞ or +∞ as qi tends to 0 or 1, the integral converges (taking 0 log 0 = 0).\n7 Hence if q̂ = (q̂1, . . . , q̂n) is the location of a global minimum, then for any q = (q1, . . . , qn) in the Bethe box,\nF(q)−F(q̂) ≤ ∑\ni:q̂i≤qi\n∫ qi\nq̂i\nfUi (qi)dqi+ ∑\ni:qi<q̂i\n∫ q̂i\nqi\n−fLi (qi)dqi.\n(14)\nTo construct a sufficient mesh, a simple initial bound relies on | ∂F∂qi | ≤ Di. If mesh points Mi are chosen s.t. in dimension i there must be a point q∗ within γi of a global minimum (which can be achieved using a mesh width in each dimension of 2γi), then by setting γi = ǫnDi , we obtain F(q∗)−F(q̂) ≤ ∑i Di ǫnDi = ǫ. It is easily seen that Ni ≤ 1 + ⌈ 12γi ⌉, hence the total number of mesh points, N = ∑\ni∈V Ni, satisfies\nN ≤ 2n+ n 2ǫ ∑\ni\nDi ≤ 2n+ n\nǫ\n∑\n(i,j)∈E\n|Wij |\n= O\n\n\nn\nǫ\n∑\n(i,j)∈E\n|Wij |\n\n = O\n(\nnmW\nǫ\n)\n, (15)\nsince Di ≤ Vi + Wi = ∑ j∈N(i) |Wij |. Here W = max(i,j)∈E |Wij | and m = |E| is the number of edges. If the initial model is fully attractive, then by Theorem 1 we obtain a submodular multi-label MAP problem which is solvable using graph cuts with worst case runtime O(N3) = O(ǫ−3n3m3W 3) (Schlesinger & Flach, 2006; Greig et al., 1989; Goldberg & Tarjan, 1988).\nNote from the first expression in (15) that if we have information on individual edge weights then we have a better bound using ∑\n(i,j)∈E |Wij | rather than just mW . For comparison, the earlier second derivative approach of (Weller & Jebara, 2013a) has runtime O(ǫ− 3 2n6Σ 3 4Ω 3 2 ), where, even using the improved method in §4 here, Ω = O(∆eW (1+∆/2)+T ). Unless ǫ is very small, the new first derivative approach is typically dramatically more efficient and more useful in practice. Further, it naturally handles both attractive and repulsive edge weights in the same way."}, {"heading": "3.1 Refinements, adaptive methods", "text": "Since the resulting multi-label MAP inference problem is NP-hard in general (Shimony, 1994), it is helpful to minimize its size. As noted above, setting γi = ǫnDi , which we term the simple method, yields a sufficient mesh, where | ∂F∂qi | ≤ Di = Vi+Wi−logLi−logUi. However, since the bounding curves are monotonic with fUi ≥ 0 and fLi ≤ 0, a better bound for the magnitude of the derivative is often available by setting Di = max{fUi (1−Bi),−fLi (Ai)}."}, {"heading": "3.1.1 The minsum method", "text": "We define Ni = the number of mesh points in dimension i, with sum N = ∑\ni∈V Ni and product Π = ∏ i∈V Ni.\nFor a fully attractive model, the resulting MAP problem may be solved in time O(N3) by graph cuts (Theorem 1, (Schlesinger & Flach, 2006; Greig et al., 1989; Goldberg & Tarjan, 1988)), so it is sensible to minimize N . In other cases, however, it is less clear what to minimize. For example, a brute force search over all points would take time Θ(Π).\nDefine the spread of possible values in dimension i as Si = 1−Bi − Ai and note Ni = 1 + ⌈ Si2γi ⌉ is required to cover the whole range. To minimize N while ensuring the mesh is sufficient, consider the Lagrangian L = ∑i∈V Si2γi − λ(ǫ− ∑\ni∈V γiDi), where Di is set as in the simple method (§3.1). Optimizing gives\nγi = ǫ ∑\nj∈V √ SjDj\n√\nSi Di ,with N≤ 2n+ 1 2ǫ\n(\n∑\ni∈V\n√\nSiDi\n)2\n(16) which we term the minsum method. Note Di ≤ diW where di is the degree of Xi, hence ( ∑ i∈V √ SiDi\n)2 ≤ W ( ∑ i∈V √ di )2 . By Cauchy-Schwartz and the handshake lemma, ( ∑ i∈V √ di )2 ≤ n∑i∈V di = 2mn, with equality iff the di are constant, i.e. the graph is regular.\nIf instead Π is minimized, rather than N , a similar argument shows that the simple method (§3.1) is optimal."}, {"heading": "3.1.2 Adaptive methods", "text": "The previous methods rely on one bound Di for | ∂F∂qi | over the whole range [Ai, 1 − Bi]. However, we may increase efficiency by using local bounds to vary the mesh width across the range. A bound on the maximum magnitude of the derivative over any sub-range may be found by checking just −fLi at the lower end and fUi at the upper end. This may be improved by using the exact integral as in (14). First, constant proportions ki > 0 should be chosen with ∑\ni ki = 1. Next, the first (lowest) mesh point γ i 1 ∈ Mi\nshould be set s.t. ∫ γi1 Ai\nfUi (qi)dqi = kiǫ. This will ensure that γi1 covers all points to its left in the sense that F [qi = γi1] − F [qi ∈ [Ai, γi1]] ≤ kiǫ where all other variables qj , j 6= i, are held constant at any values within the Bethe box. γi1 also covers all points to its right up to what we term its reach, i.e. the point ri1 s.t. ∫ ri1 γi 1\n−fLi (qi)dqi = kiǫ. Next, γi2 is chosen as before, using r i 1 as the left extreme rather than Ai, and so on, until the final mesh point is computed with reach ≥ 1 − Bi. This yields an optimal mesh for the choice of {ki}. If ki = 1n , we achieve an optimized adaptive simple method. If ki = √ SiDi ∑\nj∈V\n√ SjDj , we achieve an adaptive\nminsum method. For many problems, this adaptive minsum method will be the most efficient.\nIntegrals are easily computed using (13). To our knowl-\n8 edge, computing optimal points {γis} is not possible analytically, but each may be found with high accuracy in just a few iterations using a search method, hence total time to compute the mesh is O(N), which is negligible compared to solving the subsequent MAP problem."}, {"heading": "4 REVISITING THE SECOND DERIVATIVE APPROACH", "text": "We review the second derivative approach used in (Weller & Jebara, 2013a) (see §5 there). As here, the possible location of a global minimum q̂ was first bounded in the Bethe box given by ∏\ni∈V [Ai, 1 − Bi]. Next an upper bound Λ was derived on the maximum possible eigenvalue of the Hessian H of F anywhere within the Bethe box, where it was required that all edges be attractive. Then a mesh of constant width in every dimension was introduced s.t. the nearest mesh point q∗ to q̂ was at most γ away in each dimension. Hence the ℓ2 distance δ satisfies δ2 ≤ nγ2 and by Taylor’s theorem, F (q∗) ≤ F (q̂) + 12Λδ2. Λ was computed by bounding the maximum magnitude of any element of H . Considering Theorem 7, this involves separate analysis of diagonal Hii terms, which are positive and were bounded above by the term b; and edge Hij terms, which are negative for attractive edges, whose magnitude was bounded above by a. Then Ω was set as max(a, b), and Σ as the proportion of non-zero entries in H . Finally, Λ ≤ √ tr(HTH) ≤ √ Σn2Ω2 = nΩ √ Σ."}, {"heading": "4.1 Improved bound for an attractive model", "text": "We improve the upper bound for Λ by improving the a bound for attractive edges to derive ã, a better upper bound on −Hij . Essentially, a more careful analysis allows a potentially small term in the numerator and denominator to be canceled before bounding. Writing η̄ = mini∈V ηi(1−ηi), i.e. the closest that any dimension can come to 0 or 1, the result is that\n−Hij ≤ ( αij 1 + αij )\n/\nη̄\n(\n1− ( αij 1 + αij\n)2 )\n(17)\n= O(eW (1+∆/2)+T ).\nThus, ã = O(eW (1+∆/2)+T ) which compares favorably to the earlier bound in (Weller & Jebara, 2013a) , where a = O(eW (1+∆)+2T ). Recall b = O(∆eW (1+∆/2)+T ) and Ω = max(a, b), so using the new ã bound, now Ω = O(∆eW (1+∆/2)+T ). Details and derivation are in the supplement."}, {"heading": "4.2 Extending the second derivative approach to a general (non-attractive) model", "text": "Using flipping arguments from §2.3, we are able to extend the method of (Weller & Jebara, 2013a) to apply to general\nmodels. Interestingly, the theoretical bounds derived for Ω = max(a, b) take exactly the same form as for the purely attractive case, except that now −W ≤ Wij ≤ W , whereas previously it was required that 0 ≤ Wij ≤ W . Since it is a second derivative approach, the mesh size (measured by N , the total number of points summed over the dimensions) grows as O(ǫ−1/2) rather than as O(ǫ−1) in the new first derivative approach. In practice, however, particularly for harder cases where n and W are above small values, unless ǫ is very small, the method of §3 is much more efficient. Details and derivations are in the supplement."}, {"heading": "5 RESULTING MULTI-LABEL MAP", "text": "After computing a sufficient mesh, it remains to solve the multi-label MAP inference problem on a MRF with the same topology as the initial model, where each qi takes values in Mi. In general, this is NP-hard (Shimony, 1994)."}, {"heading": "5.1 Tractable cases", "text": "If it happens that all cost functions are submodular (as is always the case if the initial model is fully attractive by Theorem 1), then as already noted, it may be solved efficiently using graph cut methods, which rely on solving a max flow/min cut problem on a related graph, with worst case runtime O(N3) (Schlesinger & Flach, 2006; Greig et al., 1989; Goldberg & Tarjan, 1988). Using the BoykovKolmogorov algorithm (Boykov & Kolmogorov, 2004), performance is typically much faster, sometimes approaching O(N). This submodular setting is the only known class of problem which is solvable for any topology.\nAlternatively, the topological restriction of bounded treewidth allows tractable inference (Pearl, 1988). Further, under mild assumptions, this was shown to be the only restriction which will allow efficient inference for any cost functions (Chandrasekaran et al., 2008). We note that if the problem has bounded tree-width, then so too does the original binary pairwise model, hence exact inference (to yield the true marginals or the true partition function Z) on the original model is tractable, making our approximation result less interesting for this class. In contrast, although MAP inference is tractable for any attractive binary pairwise model, marginal inference and computing Z are not (Jerrum & Sinclair, 1993).\nA recent approach reducing MAP inference to identifying a maximum weight stable set in a derived weighted graph ((Jebara, 2013), (Weller & Jebara, 2013b)) shows promise, allowing efficient inference if the derived graph is perfect. Further, testing if this graph is perfect can be performed in polynomial time ((Jebara, 2013), (Chudnovsky et al., 2005)).\n9"}, {"heading": "5.2 All other cases", "text": "Many different methods are available, see (Kappes et al., 2013) for a recent survey. Some, such as dual approaches, may provide a helpful bound even if the optimum is not found. Indeed, a LP relaxation will run in polynomial time and return an upper bound on logZB that may be useful. A lower bound may be found from any discrete point, and this may be improved using local search methods. Note also that BBP bounds qi ∈ [Ai, 1 − Bi] apply for all the Bethe box, but for a particular value of qi say, then the BBP approach provides tighter bounds on each of its neighbors j ∈ N(i), which may be helpful for pruning the solution space."}, {"heading": "5.2.1 Persistent partial optimization approaches", "text": "MQPBO (Kohli et al., 2008) and Kovtun’s method (Kovtun, 2003) are examples of this class. Both consider LPrelaxations and run in polynomial time. In our context, the output consists of ranges (which in the best case could be one point) of settings for some subset of the variables. If any such ranges are returned, the strong persistence property ensures that any MAP solution satisfies the ranges. Hence, these may be used to update {Ai, Bi} bounds (padding the discretized range to the full continuous range covered by the end points if needed), compute a new, smaller, sufficient mesh and repeat until no improvement is obtained."}, {"heading": "6 EXPERIMENTS", "text": "As a first step toward applying our algorithm to explore the usefulness of the global optimum of the Bethe approximation, here we consider one setting where LBP fails to converge, yet still we achieve reasonable results.\nWe aim to predict transformer failures in a power network (Rudin et al., 2012). Since the real data is sensitive, our experiments use synthetic data. Let Xi ∈ {0, 1} indicate if transformer i has failed or not. Each transformer has a probability of failure on its own which is represented by a singleton potential θi. However, when connected in a network, a transformer can propagate its failure to nearby nodes (as in viral contagion) since the edges in the network form associative dependencies. We assume that homogeneous attractive pairwise potentials couple all transformers that are connected by an edge, i.e. Wij = W ∀(i, j) ∈ E . The network topology creates a Markov random field specifying the distribution p(X1, . . . , Xn). Our goal is to compute the marginal probability of failure of each transformer within the network (not simply in isolation as in (Rudin et al., 2012)). Since recovering p(Xi) is hard, we estimate Bethe pseudo-marginals qi = q(Xi = 1) through our algorithm, which emerge as the argmin when optimizing the Bethe free energy.\nA simulated sub-network of 55 connected transformers with average degree 2 was generated using a random preferential attachment model. Typical settings of θi = −2 and W = 4 were specified (using the input model specification of §2.1). We attempted to run BP using the libDAI package (Mooij, 2010) but were unable to achieve convergence, even with multiple initial values, using various sequential or parallel settings and with damping. However, running our algorithm with ǫ = 1 achieved reasonable results as shown in Table 1, where true values were obtained with the junction tree algorithm.\nGeneral folklore has suggested that the Bethe approximation is poor when BP fails to converge, thus this initial result suggests further work, which is now feasible using our algorithm."}, {"heading": "7 DISCUSSION & FUTURE WORK", "text": "To our knowledge, we have derived the first ǫapproximation algorithm for logZB for a general binary pairwise model. The approach is useful in practice, and much more efficient than the previous method of (Weller & Jebara, 2013a), though can take a long time to run for large, densely connected problems or when coupling is high. From experiments run, we note that the ǫ bounds appear to be close to tight since we have found models where the optimum returned when run with ǫ = 1 is more than 0.5 different to that for ǫ = 0.1. When applied to attractive models, we guarantee a FPTAS with no degree restriction.\nFuture work includes further improving the efficiency of the mesh, considering how it should be selected to simplify the subsequent discrete optimization problem, and exploring applications. Interesting avenues include using it as a subroutine in a dual decomposition approach to optimize over a tighter relaxation of the marginal polytope, and it provides the opportunity to examine rigorously the performance of other Bethe approaches that typically run more quickly, such as LBP or CCCP (Yuille, 2002), against the true Bethe global optimum."}, {"heading": "Acknowledgments", "text": "We are grateful to Kui Tang for help with coding, and to David Sontag, Kui Tang, Nicholas Ruozzi and Tomaz̆ Slivnik for helpful discussions. This material is based upon work supported by the National Science Foundation under Grant No. 1117631.\n10"}, {"heading": "APPENDIX: SUPPLEMENTARY MATERIAL FOR APPROXIMATING THE BETHE PARTITION FUNCTION", "text": "Here we provide further details and proofs of several of the results in the main paper, using the original numbering."}, {"heading": "4 REVISITING THE SECOND DERIVATIVE APPROACH", "text": ""}, {"heading": "4.1 Improved bound for an attractive model", "text": "In this section, we improve the upper bound for Λ by improving the a bound for attractive edges to derive ã, an improved upper bound on −Hij . Essentially, a more careful analysis allows a potentially small term in the numerator and denominator to be canceled before bounding.\nUsing Theorem 7, equation (9) and Lemma 5,\n−Hij = (ξij − qiqj) 1\nTij\n≤ m(1−M)αij 1 + αij\n1\nm(1−M) [ (1−m)M −m(1−M) (\nαij 1+αij\n)2 ]\n=\n(\nαij 1 + αij\n)\n1\n(1 −m)M −m(1−M) (\nαij 1+αij\n)2 (18)\nwhere m = min(qi, qj),M = max(qi, qj). Now we use the following result.\nLemma 8. For any k ∈ (0, 1), let y = minqi∈[Ai,1−Bi],qj∈[Aj ,1−Bj](1−m)M −m(1−M)k, then\ny =\n\n       \n         BiAj − (1 −Bi)(1 −Aj)k if (1−Bi) ≤ Aj i range ≤ j range (1− k)min{Aj(1 −Aj), Bi(1−Bi)} if Ai ≤ Aj ≤ 1−Bi ≤ 1−Bj ranges overlap, i lower (1− k)min{Aj(1 −Aj), Bj(1−Bj)} if Ai ≤ Aj ≤ 1−Bj ≤ 1−Bi j range ⊆ i range (1− k)min{Ai(1−Ai), Bi(1−Bi)} if Aj ≤ Ai ≤ 1−Bi ≤ 1−Bj i range ⊆ j range (1− k)min{Ai(1−Ai), Bj(1 −Bj)} if Aj ≤ Ai ≤ 1−Bj ≤ 1−Bi ranges overlap, j lower BjAi − (1 −Bj)(1−Ai)k if (1−Bj) ≤ Ai j range ≤ i range.\nProof. The minimum is achieved by minimizing the larger and maximizing the smaller of qi and qj . The result follows for cases where their ranges are disjoint. If ranges overlap, then the minimum is achieved at some qi = qj in the overlap, with value qi(1− qi)(1 − k), which is concave and minimized at an extreme of the overlap range.\nLemma 8 is useful in practice, and should be used to compute ã = max(i,j)∈E of the bound above. To analyze the theoretical worst case, it is straightforward to see the corollary that y ≥ (1 − k)η̄, where η̄ = mini∈V ηi(1 − ηi). This bound can be met, for example, if all ranges coincide. Hence, from (18), and with the reasoning for 1η̄ from (Weller & Jebara, 2013a) §5.3, where it is shown that 1ηi(1−ηi) = O(e T+∆W/2), and using αij = eWij − 1, we obtain\n−Hij ≤ ( αij 1 + αij )\n/\nη̄\n(\n1− ( αij 1 + αij\n)2 )\n= O(eW (1+∆/2)+T ). (19)\nThus, ã = O(eW (1+∆/2)+T ) which compares favorably to the earlier bound in (Weller & Jebara, 2013a) , where a = O(eW (1+∆)+2T ). Recall b = O(∆eW (1+∆/2)+T ) and Ω = max(a, b), so using the new ã bound, now Ω = O(∆eW (1+∆/2)+T ).\n13"}, {"heading": "4.2 Extending the second derivative approach to a general (non-attractive) model", "text": "Here we extend the analysis of (Weller & Jebara, 2013a) by considering repulsive edges to show that for a general binary pairwise model, we can still calculate useful bounds (which turn out to be very similar to the earlier bounds for attractive models) for a sufficient mesh width.\nOur main tool for dealing with a repulsive edge is to flip the variable at one end (see §2.3) to yield an attractive edge, then we can apply earlier results. We denote the flipped model parameters with a ′. For example, if just variable Xj is flipped, then q′j = q(X ′ j = 1) = q(1−Xj = 1) = 1− qj . Since αij = eWij − 1 and here W ′ij = −Wij , the following relationship holds if one end of an edge is flipped,\nα′ij 1 + α′ij = e−Wij − 1 e−Wij = 1− eWij = −αij . (20)\nNote that, for an attractive edge, α′ij\n1+α′ ij ∈ (0, 1), as is −αij for a repulsive edge. Recall that when we flip some set of variables, by construction F ′ = F + constant (see §2.3). The Hessian terms from Theorem 7 still apply. Our goal is to bound the magnitude of each entry Hij for a general binary pairwise model, then the earlier analysis will provide the result. Whereas for a fully attractive model, we assumed a maximum edge weight W with 0 ≤ Wij ≤ W , now we assume |Wij | ≤ W ."}, {"heading": "4.2.1 Edge terms", "text": "First consider Hij for an edge (i, j) ∈ E . If the edge is attractive, then the earlier analysis holds (it makes no difference if other edges are attractive or repulsive). If it is repulsive, then Hij > 0. Consider a model where just Xj is flipped. Hij = ∂2F\n∂qi∂qj = − ∂2F ′∂q′ i ∂q′ j = −H ′ij . Hence using (18) and (20), in practice an upper bound may be computed from Lemma 8 using k = −αij and A′j = Bj , B′j = Aj . The theoretical bound for an attractive edge from (19) becomes Hij ≤ −αijη̄(1−α2 ij ) . As we should expect from the attractive case, the following result holds. Lemma 9. For a repulsive edge, 1 1−α2\nij\n= O(e−Wij ).\nProof. Let u = −Wij , then αij = e−u − 1 and 11−α2 ij = 1(1−αij)(1+αij) = 1 e−u(2−e−u) = O(e u).\nHence, noting that we may flip any neighbors j of i which are adjacent via repulsive edges to obtain 1ηi(1−ηi) = O(eT+∆W/2) as before, where now W = max(i,j)∈E |Wij |, we see that for our new second derivative method, just as in the fully attractive case, ã = O(eW (1+∆/2)+T ).\nFor comparison interest, we also show how the earlier, worse bound for an attractive edge given in (Weller & Jebara, 2013a) may similarly be combined with flipping to provide a worse upper bound for Hij when (i, j) is repulsive. See (Weller & Jebara, 2013a) §5.2: considering the proof of Lemma 10 and using (20) from this paper, we see that for a repulsive edge, the Kij minimum bound for Tij becomes Kij = ηiηj(1 − ηi)(1 − ηj)(1 − α2ij); then from (Weller & Jebara, 2013a) Theorem 11, the equivalent bound is Hij ≤ −αij4Kij which gives a = O(e W (1+∆)+2T ) as it was for the fully attractive case.\nWe provide a further interesting result, deriving a lower bound for ξij for a repulsive edge.\nLemma 10 (Lower bound for ξij for a repulsive edge, analogue of Lemma 5). For any repulsive edge (i, j), qiqj − ξij ≤ −αijpij where pij = min{qiqj , (1− qi)(1− qj)}.\nProof. Consider a model where just variable Xj is flipped, and let all new quantities be designated by the symbol ′. Consider the joint pseudo-marginal (3). In the new model the columns are switched since µ′ij(a, b) = q(X ′ i = a,X ′ j = b) = q(Xi = a,Xj = 1− b) = µij(a, 1− b), hence\nµ′ij =\n( 1 + ξ′ij − q′i − q′j q′j − ξ′ij q′i − ξ′ij ξ′ij ) = ( qj − ξij 1 + ξij − qi − qj ξij qi − ξij ) . (21)\nApplying Lemma 5 to the new model, ξ′ij − q′iq′j ≤ α′ij\n1+α′ ij m′(1−M ′). Substituting in ξ′ij = qi − ξij from (21) and using (20), we have (qi− ξij)− qi(1− qj) ≤ −αijm′(1−M ′). Since m′ = min{qi, 1− qj} and M ′ = max{qi, 1− qj}, noting qi ≤ 1− qj ⇔ qi + qj ≤ 1 ⇔ qiqj ≤ (1− qi)(1− qj), the result follows.\n14\nHence for a repulsive edge (i, j), using (9), we have\nTij = qiqj(1− qi)(1− qj)− (ξij − qiqj)2 ≥ pijPij − α2ijp2ij ,\nwhere Pij = max{qiqj , (1− qi)(1− qj)}."}, {"heading": "4.2.2 Diagonal terms", "text": "Consider the Hii terms from Theorem 7, which is true for a general model. If all neighbors of Xi are adjacent via attractive\nedges, then, as in (Weller & Jebara, 2013a) Theorem 11, Hii ≤ 1ηi(1−ηi)\n(\n1− di + ∑ j∈N(i) 1\n1− ( αij\n1+αij\n)2\n)\n.\nIf any neighbors are connected to Xi by a repulsive edge, then consider a new model where those neighbors are flipped, so now all edges incident to Xi are attractive, and designate the new model parameters with a ′. As before, observe F = F ′ + constant, hence Hii = ∂ 2F ∂q2\ni\n= ∂ 2F ′ ∂q′2\ni\n= H ′ii. Using (20) we obtain that for a general model,\nHii ≤ 1\nηi(1− ηi)\n\n  1− di +\n∑\nj∈N(i):Wij>0\n1\n1− (\nαij 1+αij\n)2 + ∑\nj∈N(i):Wij<0\n1\n1− α2ij\n\n  . (22)\nSimilarly to the analysis in §4.2.1, using Lemma 9 gives that for a general model, b = maxi∈V Hii = O(∆eW (1+∆/2)+T ), just as for a fully attractive model, where now W = max |Wij |."}], "references": [{"title": "Approximating MAPs for belief networks is NP-hard and other theorems", "author": ["A. Abdelbar", "S. Hedetniemi"], "venue": "Artificial Intelligence,", "citeRegEx": "Abdelbar and Hedetniemi,? \\Q1998\\E", "shortCiteRegEx": "Abdelbar and Hedetniemi", "year": 1998}, {"title": "Covering multigraphs by simple circuits", "author": ["N. Alon", "M. Tarsi"], "venue": "SIAM Journal on Algebraic Discrete Methods,", "citeRegEx": "Alon and Tarsi,? \\Q1985\\E", "shortCiteRegEx": "Alon and Tarsi", "year": 1985}, {"title": "Statistical theory of superlattices", "author": ["H. Bethe"], "venue": "Proc. R. Soc. Lond. A,", "citeRegEx": "Bethe,? \\Q1935\\E", "shortCiteRegEx": "Bethe", "year": 1935}, {"title": "An experimental comparison of min-cut/max-flow algorithms for energy minimization in vision", "author": ["Y. Boykov", "V. Kolmogorov"], "venue": "IEEE Trans. Pattern Anal. Mach. Intell.,", "citeRegEx": "Boykov and Kolmogorov,? \\Q2004\\E", "shortCiteRegEx": "Boykov and Kolmogorov", "year": 2004}, {"title": "Counting independent sets using the Bethe approximation", "author": ["V. Chandrasekaran", "M. Chertkov", "D. Gamarnik", "D. Shah", "J. Shin"], "venue": "SIAM J. Discrete Math.,", "citeRegEx": "Chandrasekaran et al\\.,? \\Q2011\\E", "shortCiteRegEx": "Chandrasekaran et al\\.", "year": 2011}, {"title": "Complexity of inference in graphical models", "author": ["V. Chandrasekaran", "N. Srebro", "P. Harsha"], "venue": "UAI (pp", "citeRegEx": "Chandrasekaran et al\\.,? \\Q2008\\E", "shortCiteRegEx": "Chandrasekaran et al\\.", "year": 2008}, {"title": "The computational complexity of probabilistic inference using Bayesian belief networks", "author": ["G. Cooper"], "venue": "Artificial Intelligence,", "citeRegEx": "Cooper,? \\Q1990\\E", "shortCiteRegEx": "Cooper", "year": 1990}, {"title": "Continuous local search", "author": ["C. Daskalakis", "C. Papadimitriou"], "venue": "Proceedings of ACM-SIAM Symposium on Discrete Algorithms (SODA) (pp. 790–804)", "citeRegEx": "Daskalakis and Papadimitriou,? \\Q2011\\E", "shortCiteRegEx": "Daskalakis and Papadimitriou", "year": 2011}, {"title": "A new approach to the maximum flow problem", "author": ["A. Goldberg", "R. Tarjan"], "venue": "Journal of the ACM,", "citeRegEx": "Goldberg and Tarjan,? \\Q1988\\E", "shortCiteRegEx": "Goldberg and Tarjan", "year": 1988}, {"title": "Exact maximum a posteriori estimation for binary images", "author": ["D. Greig", "B. Porteous", "A. Seheult"], "venue": "J. Royal Statistical Soc., Series B,", "citeRegEx": "Greig et al\\.,? \\Q1989\\E", "shortCiteRegEx": "Greig et al\\.", "year": 1989}, {"title": "Unleashing the power of Schrijver’s permanental inequality with the help of the Bethe approximation", "author": ["L. Gurvits"], "venue": "Elec. Coll. Comp. Compl", "citeRegEx": "Gurvits,? \\Q2011\\E", "shortCiteRegEx": "Gurvits", "year": 2011}, {"title": "On the partition function and random maximum a-posteriori perturbations", "author": ["T. Hazan", "T. Jaakkola"], "venue": null, "citeRegEx": "Hazan and Jaakkola,? \\Q2012\\E", "shortCiteRegEx": "Hazan and Jaakkola", "year": 2012}, {"title": "What cannot be learned with Bethe approximations", "author": ["U. Heinemann", "A. Globerson"], "venue": null, "citeRegEx": "Heinemann and Globerson,? \\Q2011\\E", "shortCiteRegEx": "Heinemann and Globerson", "year": 2011}, {"title": "On the uniqueness of loopy belief propagation fixed points", "author": ["T. Heskes"], "venue": "Neural Computation,", "citeRegEx": "Heskes,? \\Q2004\\E", "shortCiteRegEx": "Heskes", "year": 2004}, {"title": "Approximating the permanent with belief propagation (Technical Report)", "author": ["B. Huang", "T. Jebara"], "venue": null, "citeRegEx": "Huang and Jebara,? \\Q2009\\E", "shortCiteRegEx": "Huang and Jebara", "year": 2009}, {"title": "Tractability: Practical approaches to hard problems, chapter Perfect graphs and graphical modeling", "author": ["T. Jebara"], "venue": null, "citeRegEx": "Jebara,? \\Q2013\\E", "shortCiteRegEx": "Jebara", "year": 2013}, {"title": "Polynomial-time approximation algorithms for the Ising model", "author": ["M. Jerrum", "A. Sinclair"], "venue": "SIAM J. Comput.,", "citeRegEx": "Jerrum and Sinclair,? \\Q1993\\E", "shortCiteRegEx": "Jerrum and Sinclair", "year": 1993}, {"title": "A comparative study of modern inference techniques for discrete energy minimization problems", "author": ["J. Kappes", "B. Andres", "F. Hamprecht", "C. Schnörr", "S. Nowozin", "D. Batra", "S. Kim", "B. Kausler", "J. Lellmann", "N. Komodakis", "C. Rother"], "venue": null, "citeRegEx": "Kappes et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Kappes et al\\.", "year": 2013}, {"title": "On partial optimality in multi-label MRFs", "author": ["P. Kohli", "A. Shekhovtsov", "C. Rother", "V. Kolmogorov", "P. Torr"], "venue": "ICML (pp. 480–487)", "citeRegEx": "Kohli et al\\.,? \\Q2008\\E", "shortCiteRegEx": "Kohli et al\\.", "year": 2008}, {"title": "Approximating marginals using discrete energy minimization (Technical Report)", "author": ["F. Korc", "V. Kolmogorov", "C. Lampert"], "venue": null, "citeRegEx": "Korc et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Korc et al\\.", "year": 2012}, {"title": "Partial optimal labeling search for a NPhard subclass of (max, +) problems", "author": ["I. Kovtun"], "venue": null, "citeRegEx": "Kovtun,? \\Q2003\\E", "shortCiteRegEx": "Kovtun", "year": 2003}, {"title": "Turbo decoding as an instance of Pearl’s ”Belief Propagation", "author": ["R. McEliece", "D. MacKay", "J. Cheng"], "venue": "algorithm. IEEE Journal on Selected Areas in Communications,", "citeRegEx": "McEliece et al\\.,? \\Q1998\\E", "shortCiteRegEx": "McEliece et al\\.", "year": 1998}, {"title": "libDAI: A free and open source C++ library for discrete approximate inference in graphical models", "author": ["J. Mooij"], "venue": "Journal of Machine Learning Research,", "citeRegEx": "Mooij,? \\Q2010\\E", "shortCiteRegEx": "Mooij", "year": 2010}, {"title": "Sufficient conditions for convergence of the sum-product algorithm", "author": ["J. Mooij", "H. Kappen"], "venue": "IEEE Transactions on Information Theory,", "citeRegEx": "Mooij and Kappen,? \\Q2007\\E", "shortCiteRegEx": "Mooij and Kappen", "year": 2007}, {"title": "Loopy belief propagation for approximate inference: An empirical study", "author": ["K. Murphy", "Y. Weiss", "M. Jordan"], "venue": "Proceedings of the Fifteenth conference on Uncertainty in artificial intelligence (pp. 467–475)", "citeRegEx": "Murphy et al\\.,? \\Q1999\\E", "shortCiteRegEx": "Murphy et al\\.", "year": 1999}, {"title": "Probabilistic reasoning in intelligent systems: Networks of plausible inference", "author": ["J. Pearl"], "venue": null, "citeRegEx": "Pearl,? \\Q1988\\E", "shortCiteRegEx": "Pearl", "year": 1988}, {"title": "On Ising’s model of ferromagnetism", "author": ["R. Peierls", "M. Born"], "venue": "Proc. Camb. Phil. Soc.,", "citeRegEx": "Peierls and Born,? \\Q1936\\E", "shortCiteRegEx": "Peierls and Born", "year": 1936}, {"title": "Learning low-order models for enforcing high-order statistics", "author": ["P. Pletscher", "P. Kohli"], "venue": "Artificial Intelligence and Statistics", "citeRegEx": "Pletscher and Kohli,? \\Q2012\\E", "shortCiteRegEx": "Pletscher and Kohli", "year": 2012}, {"title": "Machine learning for the New York City power grid", "author": ["C. Rudin", "D. Waltz", "R. Anderson", "A. Boulanger", "A. SallebAouissi", "M. Chow", "H. Dutta", "P. Gross", "B. Huang", "S. Ierome"], "venue": "IEEE Trans. Pattern Anal. Mach. Intell.,", "citeRegEx": "Rudin et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Rudin et al\\.", "year": 2012}, {"title": "The Bethe partition function of logsupermodular graphical models", "author": ["N. Ruozzi"], "venue": "Neural Information Processing Systems", "citeRegEx": "Ruozzi,? \\Q2012\\E", "shortCiteRegEx": "Ruozzi", "year": 2012}, {"title": "Transforming an arbitrary minsum problem into a binary one (Technical Report)", "author": ["D. Schlesinger", "B. Flach"], "venue": "Dresden University of Technology", "citeRegEx": "Schlesinger and Flach,? \\Q2006\\E", "shortCiteRegEx": "Schlesinger and Flach", "year": 2006}, {"title": "Finding MAPs for belief networks is NP-hard", "author": ["S. Shimony"], "venue": "Aritifical Intelligence,", "citeRegEx": "Shimony,? \\Q1994\\E", "shortCiteRegEx": "Shimony", "year": 1994}, {"title": "Complexity of Bethe approximation", "author": ["J. Shin"], "venue": "Artificial Intelligence and Statistics", "citeRegEx": "Shin,? \\Q2012\\E", "shortCiteRegEx": "Shin", "year": 2012}, {"title": "The complexity of approximating a Bethe equilibrium. CoRR, abs/1109.1724", "author": ["J. Shin"], "venue": null, "citeRegEx": "Shin,? \\Q2013\\E", "shortCiteRegEx": "Shin", "year": 2013}, {"title": "The unified propagation and scaling algorithm", "author": ["Y. Teh", "M. Welling"], "venue": "Advances in Neural Information Processing Systems", "citeRegEx": "Teh and Welling,? \\Q2002\\E", "shortCiteRegEx": "Teh and Welling", "year": 2002}, {"title": "The complexity of computing the permanent", "author": ["L. Valiant"], "venue": "Theoretical Computer Science,", "citeRegEx": "Valiant,? \\Q1979\\E", "shortCiteRegEx": "Valiant", "year": 1979}, {"title": "The Bethe permanent of a nonnegative matrix. Communication, Control, and Computing (Allerton), 2010", "author": ["P. Vontobel"], "venue": "48th Annual Allerton Conference on (pp. 341–346)", "citeRegEx": "Vontobel,? \\Q2010\\E", "shortCiteRegEx": "Vontobel", "year": 2010}, {"title": "Graphical models, exponential families and variational inference", "author": ["M. Wainwright", "M. Jordan"], "venue": "Foundations and Trends in Machine Learning,", "citeRegEx": "Wainwright and Jordan,? \\Q2008\\E", "shortCiteRegEx": "Wainwright and Jordan", "year": 2008}, {"title": "Uniqueness of belief propagation on signed graphs", "author": ["Y. Watanabe"], "venue": "Neural Information Processing Systems", "citeRegEx": "Watanabe,? \\Q2011\\E", "shortCiteRegEx": "Watanabe", "year": 2011}, {"title": "Belief propagation and loop calculus for the permanent of a non-negative matrix", "author": ["Y. Watanabe", "M. Chertkov"], "venue": "Journal of Physics A: Mathematical and Theoretical,", "citeRegEx": "Watanabe and Chertkov,? \\Q2010\\E", "shortCiteRegEx": "Watanabe and Chertkov", "year": 2010}, {"title": "Bethe bounds and approximating the global optimum", "author": ["A. Weller", "T. Jebara"], "venue": "Artificial Intelligence and Statistics", "citeRegEx": "Weller and Jebara,? \\Q2013\\E", "shortCiteRegEx": "Weller and Jebara", "year": 2013}, {"title": "On MAP inference by MWSS on perfect graphs", "author": ["A. Weller", "T. Jebara"], "venue": "Twenty Ninth Conference on Uncertainty in Artificial Intelligence (UAI)", "citeRegEx": "Weller and Jebara,? \\Q2013\\E", "shortCiteRegEx": "Weller and Jebara", "year": 2013}, {"title": "Belief optimization for binary networks: A stable alternative to loopy belief propagation", "author": ["M. Welling", "Y. Teh"], "venue": "Uncertainty in Artificial Intelligence", "citeRegEx": "Welling and Teh,? \\Q2001\\E", "shortCiteRegEx": "Welling and Teh", "year": 2001}, {"title": "Understanding belief propagation and its generalizations", "author": ["J. Yedidia", "W. Freeman", "Y. Weiss"], "venue": "International Joint Conference on Artificial Intelligence,", "citeRegEx": "Yedidia et al\\.,? \\Q2001\\E", "shortCiteRegEx": "Yedidia et al\\.", "year": 2001}, {"title": "CCCP algorithms to minimize the Bethe and Kikuchi free energies: Convergent alternatives to belief propagation", "author": ["A. Yuille"], "venue": "Neural Computation,", "citeRegEx": "Yuille,? \\Q2002\\E", "shortCiteRegEx": "Yuille", "year": 2002}], "referenceMentions": [{"referenceID": 35, "context": "Computing Z belongs to the class of counting problems #P (Valiant, 1979).", "startOffset": 57, "endOffset": 72}, {"referenceID": 6, "context": "Further, exact marginal inference is NP-hard (Cooper, 1990).", "startOffset": 45, "endOffset": 59}, {"referenceID": 31, "context": "The MAP problem is typically easier, yet is still NP-hard (Shimony, 1994), even to approximate (Abdelbar & Hedetniemi, 1998).", "startOffset": 58, "endOffset": 73}, {"referenceID": 25, "context": "One popular method is to use a message-passing algorithm called belief propagation (Pearl, 1988), which returns an exact solution in linear time in n, the number of variables, if the topology of the model is a tree.", "startOffset": 83, "endOffset": 96}, {"referenceID": 21, "context": "If this method is applied to general topologies, termed loopy belief propagation (LBP), results are sometimes strikingly good (McEliece et al., 1998; Murphy et al., 1999), though in general it may not converge at all, and if it does, it may not be to a global optimum.", "startOffset": 126, "endOffset": 170}, {"referenceID": 24, "context": "If this method is applied to general topologies, termed loopy belief propagation (LBP), results are sometimes strikingly good (McEliece et al., 1998; Murphy et al., 1999), though in general it may not converge at all, and if it does, it may not be to a global optimum.", "startOffset": 126, "endOffset": 170}, {"referenceID": 43, "context": "(Yedidia et al., 2001) showed a remarkable connection between LBP and an earlier approach from statistical physics (Bethe, 1935; Peierls & Born, 1936), in that any fixed point of LBP corresponds to a stationary point of a function of the system, termed the Bethe free energy F .", "startOffset": 0, "endOffset": 22}, {"referenceID": 2, "context": ", 2001) showed a remarkable connection between LBP and an earlier approach from statistical physics (Bethe, 1935; Peierls & Born, 1936), in that any fixed point of LBP corresponds to a stationary point of a function of the system, termed the Bethe free energy F .", "startOffset": 100, "endOffset": 135}, {"referenceID": 4, "context": "Another interesting example is the demonstration (Chandrasekaran et al., 2011) that the Bethe approximation is very useful to count independent sets of a graph.", "startOffset": 49, "endOffset": 78}, {"referenceID": 13, "context": "Extensive analysis has focused on understanding conditions under which LBP is guaranteed to converge to the global optimum (Heskes, 2004; Mooij & Kappen, 2007; Watanabe, 2011), but outside these restricted settings, until recently, there were no polynomial time methods even to approximate ZB .", "startOffset": 123, "endOffset": 175}, {"referenceID": 38, "context": "Extensive analysis has focused on understanding conditions under which LBP is guaranteed to converge to the global optimum (Heskes, 2004; Mooij & Kappen, 2007; Watanabe, 2011), but outside these restricted settings, until recently, there were no polynomial time methods even to approximate ZB .", "startOffset": 123, "endOffset": 175}, {"referenceID": 43, "context": "Further, it is possible to convert a general MRF into an equivalent binary pairwise model (Yedidia et al., 2001), though potentially with a much enlarged state space.", "startOffset": 90, "endOffset": 112}, {"referenceID": 32, "context": "An algorithm was introduced in (Shin, 2012) guaranteed to return an approximately stationary point of F in polynomial time for such binary pairwise models, though with a bound on the maximum degree, ∆ = O(log n).", "startOffset": 31, "endOffset": 43}, {"referenceID": 29, "context": "Interestingly, (Ruozzi, 2012) recently proved that ZB ≤ Z for attractive models.", "startOffset": 15, "endOffset": 29}, {"referenceID": 36, "context": "Similarly, for graphical models whose partition function is the permanent of a non-negative matrix, ZB is recoverable via convex optimization and, here too, ZB ≤ Z (Huang & Jebara, 2009; Vontobel, 2010; Watanabe & Chertkov, 2010; Gurvits, 2011).", "startOffset": 164, "endOffset": 244}, {"referenceID": 10, "context": "Similarly, for graphical models whose partition function is the permanent of a non-negative matrix, ZB is recoverable via convex optimization and, here too, ZB ≤ Z (Huang & Jebara, 2009; Vontobel, 2010; Watanabe & Chertkov, 2010; Gurvits, 2011).", "startOffset": 164, "endOffset": 244}, {"referenceID": 33, "context": "Computing ZB is at least PPAD or PLS-hard in general since it not only requires a fixed point but also the global minimizer (Shin, 2013; Daskalakis & Papadimitriou, 2011).", "startOffset": 124, "endOffset": 170}, {"referenceID": 44, "context": "Methods such as CCCP (Yuille, 2002) or UPS (Teh & Welling, 2002) are guaranteed to converge to a local minimum of the Bethe free energy, but this may be far from the global optimum.", "startOffset": 21, "endOffset": 35}, {"referenceID": 19, "context": "Theorem 1 (Submodularity for any discretization of an attractive model, (Weller & Jebara, 2013a) Theorem 8, (Korc et al., 2012)).", "startOffset": 108, "endOffset": 127}, {"referenceID": 43, "context": "Either method can achieve striking results quickly, though MK is our preferred method5 - it considers cavity fields around each variable and determines the range of possible beliefs after iterating LBP, starting from any initial values; since any minimum of F corresponds to a fixed point of LBP (Yedidia et al., 2001), this bounds all minima.", "startOffset": 296, "endOffset": 318}, {"referenceID": 9, "context": "If the initial model is fully attractive, then by Theorem 1 we obtain a submodular multi-label MAP problem which is solvable using graph cuts with worst case runtime O(N) = O(ǫ−3n3m3W ) (Schlesinger & Flach, 2006; Greig et al., 1989; Goldberg & Tarjan, 1988).", "startOffset": 186, "endOffset": 258}, {"referenceID": 31, "context": "Since the resulting multi-label MAP inference problem is NP-hard in general (Shimony, 1994), it is helpful to minimize its size.", "startOffset": 76, "endOffset": 91}, {"referenceID": 9, "context": "For a fully attractive model, the resulting MAP problem may be solved in time O(N) by graph cuts (Theorem 1, (Schlesinger & Flach, 2006; Greig et al., 1989; Goldberg & Tarjan, 1988)), so it is sensible to minimize N .", "startOffset": 109, "endOffset": 181}, {"referenceID": 31, "context": "In general, this is NP-hard (Shimony, 1994).", "startOffset": 28, "endOffset": 43}, {"referenceID": 9, "context": "If it happens that all cost functions are submodular (as is always the case if the initial model is fully attractive by Theorem 1), then as already noted, it may be solved efficiently using graph cut methods, which rely on solving a max flow/min cut problem on a related graph, with worst case runtime O(N) (Schlesinger & Flach, 2006; Greig et al., 1989; Goldberg & Tarjan, 1988).", "startOffset": 307, "endOffset": 379}, {"referenceID": 25, "context": "Alternatively, the topological restriction of bounded treewidth allows tractable inference (Pearl, 1988).", "startOffset": 91, "endOffset": 104}, {"referenceID": 5, "context": "Further, under mild assumptions, this was shown to be the only restriction which will allow efficient inference for any cost functions (Chandrasekaran et al., 2008).", "startOffset": 135, "endOffset": 164}, {"referenceID": 15, "context": "A recent approach reducing MAP inference to identifying a maximum weight stable set in a derived weighted graph ((Jebara, 2013), (Weller & Jebara, 2013b)) shows promise, allowing efficient inference if the derived graph is perfect.", "startOffset": 113, "endOffset": 127}, {"referenceID": 15, "context": "Further, testing if this graph is perfect can be performed in polynomial time ((Jebara, 2013), (Chudnovsky et al.", "startOffset": 79, "endOffset": 93}, {"referenceID": 17, "context": "Many different methods are available, see (Kappes et al., 2013) for a recent survey.", "startOffset": 42, "endOffset": 63}, {"referenceID": 18, "context": "MQPBO (Kohli et al., 2008) and Kovtun’s method (Kovtun, 2003) are examples of this class.", "startOffset": 6, "endOffset": 26}, {"referenceID": 20, "context": ", 2008) and Kovtun’s method (Kovtun, 2003) are examples of this class.", "startOffset": 28, "endOffset": 42}, {"referenceID": 28, "context": "We aim to predict transformer failures in a power network (Rudin et al., 2012).", "startOffset": 58, "endOffset": 78}, {"referenceID": 28, "context": "Our goal is to compute the marginal probability of failure of each transformer within the network (not simply in isolation as in (Rudin et al., 2012)).", "startOffset": 129, "endOffset": 149}, {"referenceID": 22, "context": "We attempted to run BP using the libDAI package (Mooij, 2010) but were unable to achieve convergence, even with multiple initial values, using various sequential or parallel settings and with damping.", "startOffset": 48, "endOffset": 61}, {"referenceID": 44, "context": "Interesting avenues include using it as a subroutine in a dual decomposition approach to optimize over a tighter relaxation of the marginal polytope, and it provides the opportunity to examine rigorously the performance of other Bethe approaches that typically run more quickly, such as LBP or CCCP (Yuille, 2002), against the true Bethe global optimum.", "startOffset": 299, "endOffset": 313}], "year": 2014, "abstractText": "When belief propagation (BP) converges, it does so to a stationary point of the Bethe free energy F , and is often strikingly accurate. However, it may converge only to a local optimum or may not converge at all. An algorithm was recently introduced for attractive binary pairwise MRFs which is guaranteed to return an ǫ-approximation to the global minimum of F in polynomial time provided the maximum degree ∆ = O(log n), where n is the number of variables. Here we significantly improve this algorithm and derive several results including a new approach based on analyzing first derivatives of F , which leads to performance that is typically far superior and yields a fully polynomial-time approximation scheme (FPTAS) for attractive models without any degree restriction. Further, the method applies to general (non-attractive) models, though with no polynomial time guarantee in this case, leading to the important result that approximating log of the Bethe partition function, logZB = −minF , for a general model to additive ǫaccuracy may be reduced to a discrete MAP inference problem. We explore an application to predicting equipment failure on an urban power network and demonstrate that the Bethe approximation can perform well even when BP fails to converge.", "creator": "dvips(k) 5.991 Copyright 2011 Radical Eye Software"}}}