{"id": "1406.0893", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "3-Jun-2014", "title": "Query Answering over Contextualized RDF/OWL Knowledge with Forall-Existential Bridge Rules: Attaining Decidability using Acyclicity (full version)", "abstract": "The recent outburst 3,433 of petronia context - dependent mopping-up knowledge on the Semantic Web (stankevicius SW) has 8.22 led to the realization of holley the importance stewards of the hereditary quads infomedia in imbali the wetting SW 33.76 community. katzenberger Quads, which extend ricaurte a standard 2,000-page RDF tailback triple, medically by adding björling a lappland new damask parameter aleijadinho of uams the ` jamoat context ' palash of incredibly an RDF basel-country triple, altamirano thus mirzadeh informs a araujo reasoner commital to westers distinguish cockenzie between temirkanov the knowledge in various swayze contexts. munhall Although brazos this distinction schwarzwald separates mirto the langoliers triples tallas in otec an toroid RDF graph into various 70.13 contexts, iied and malifa allows cik the reasoning to be mtel decoupled across radiolabeled various contexts, 1,211 bridge mukilteo rules need to target be unstudied provided bedposts for inter - operating the knowledge across these pesado contexts. vaisseau We call a set of photton@globe.com quads 38.5 together with 38,250 the spatafora bridge rules, a quad - system. pismo In oenanthe this carnarvonshire paper, zahira we seabiscuit discuss emmerdale the problem mirv of maccabi query destructing answering wohlgemuth over quad - systems with expressive 43.86 forall - existential bridge badertscher rules. 52.04 It konowalchuk turns abish out the rowles query answering 67.45 over quad - scream systems is shead undecidable, prabuty in tie-breaking general. hispana We cadenhead derive fereira a aynsley decidable 12345 class verena of quad - systems, seim namely context - acyclic ahcccs quad - systems, for chikhli which stigmatizing query answering dropbox can andover.net be odoacer done using vipul forward accomplish chaining. Tight 1.017 bounds tallest for wuxing data gabba and brazauskas combined complexity of query harborlights entailment dilcher has danican been wapack established for the chown derived darting class.", "histories": [["v1", "Tue, 3 Jun 2014 22:20:05 GMT  (249kb)", "http://arxiv.org/abs/1406.0893v1", null]], "reviews": [], "SUBJECTS": "cs.LO cs.AI", "authors": ["mathew joseph", "gabriel kuper", "luciano serafini"], "accepted": false, "id": "1406.0893"}, "pdf": {"name": "1406.0893.pdf", "metadata": {"source": "CRF", "title": "Query Answering over Contextualized RDF Knowledge with Forall-Existential Bridge Rules: Attaining Decidability using Acyclicity (full version)", "authors": ["Mathew Joseph", "Gabriel Kuper", "Luciano Serafini"], "emails": ["mathew@fbk.eu,", "serafini@fbk.eu,", "kuper@disi.unitn.it"], "sections": [{"heading": null, "text": "ar X\niv :1\n40 6.\n08 93\nv1 [\ncs .L\nO ]\n3 J\nKeywords: Contextualized RDF/OWL knowledge, Contextualized Query Answering, Quads, Forall-Existential Rules, Semantic Web, Knowledge Representation."}, {"heading": "1 Introduction", "text": "One of the major recent changes in the SW community is the transformation from a triple to a quad as its primary knowledge carrier. As a consequence, more and more triple stores are becoming quad stores. Some of the popular quad-stores are 4store1, Openlink Virtuoso2, and some of the current popular triple stores like Sesame3 internally keep track of the context by storing arrays of four names (c, s, p, o) (further denoted as c : (s, p, o)), where c is an identifier that stands for the context of the triple (s, p, o). Some of the recent initiatives in this direction have also extended existing formats like N-Triples to N-Quads. The latest Billion triples challenge datasets (BTC 2012) have all been released in the N-Quads format.\n1 http://4store.org 2 http://virtuoso.openlinksw.com/rdf-quad-store/ 3 http://www.openrdf.org/\nOne of the main benefits of quads over triples are that they allow users to specify various attributes of meta-knowledge that further qualify knowledge [8], and also allow users to query for this meta knowledge [29]. Examples of these attributes, which are also called context dimensions [12], are provenance, creator, intended user, creation time, validity time, geo-location, and topic. Having defined various contexts in which triples are dispersed, one can declare in another meta-context mc, statements such as mc : (c1, creator, John), mc : (c1, expiryTime, “jun-2013”) that talk about the knowledge in context c1, in this case its creator and expiry time. Another benefit of such a contextualized approach is that it opens possibilities of interesting ways for querying a contextualized knowledge base. For instance, if context c1 contains knowledge about Football World Cup 2014 and context c2 about Football Euro Cup 2012. Then the query “who beat Italy in both Euro Cup 2012 and World Cup 2014” can be formalized as the conjunctive query:\nc1: (x, beat, Italy) ∧ c2: (x, beat, Italy),where x is a variable.\nAs the knowledge can be separated context wise and simultaneously be fed to separate reasoning engines, this approach increases both efficiency and scalability. Besides the above flexibility, bridge rules [4] can be provided for inter-interoperating the knowledge in different contexts. Such rules are primarily of the form:\nc : φ(x) → c′ : φ′(x)\nwhere φ, φ′ are both atomic concept (role) symbols, c, c′ are contexts. The semantics of such a rule is that if, for any a, φ(a) holds in context c, then φ′(a) should hold in context c′, wherea is a unary/binary vector dependending on whether φ, φ′ are concept/role symbols. Although such bridge rules serve the purpose of specifying knowledge interoperability from a source context c to a target context c′, in many practical situations there is the need of interoperating multiple source contexts with multiple target targets, for which the bridge rules of the form (1) is inadequate. Besides, one would also want the ability of creating new values in target contexts for the bridge rules.\nIn this work, we consider forall-existential bridge rules that allows conjunctions and existential quantifiers in them, and hence is more expressive than those, in DDL [4] and McCarthy et al. [27]. A set of quads together with such bridge rules is called a quad-system. The main contributions of this work can be summarized as:\n1. We provide a basic semantics for contextual reasoning over quad-systems, and study contextualized conjunctive query answering over them. For query answering, we use the notion of a distributed chase, which is an extension of a standard chase [22, 1] that is widely used in databases and KR for the same. 2. We show that conjunctive query answering over quad-systems, in general, is undecidable. We derive a class of quad-systems called context acyclic quad-systems, for which query answering is decidable and can be done by forward chaining. We give both data and combined complexity of conjunctive query entailment for the same.\nThe paper is structured as follows: In section 2, we formalize the idea of contextualized quad-systems, giving various definitions and notations for setting the background.\nIn section 3, we formalize the query answering on quad-systems, define notions such as distributed chase that is further used for query answering, and give the undecidability results of query entailment for unrestricted quad-systems. In section 4, we present context acyclic quad-systems and its properties. We give an account of relevant related works in section 5, and conclude in section 6."}, {"heading": "2 Contextualized Quad-Systems", "text": "In this section, we formalize the notion of a quad-system and its semantics. For any vector or sequence x, we denote by ‖x‖ the number of symbols in x, and by {x} the set of symbols in x. For any sets A and B, A → B denotes the set of all functions from set A to set B. Given the set of URIs U, the set of blank nodes B, and the set of literals L, the set C = U ⊎ B ⊎ L are called the set of (RDF) constants. Any (s, p, o) ∈ C × C × C is called a generalized RDF triple (from now on, just triple). A graph is defined as a set of triples. A Quad is a tuple of the form c : (s, p, o), where (s, p, o) is a triple and c is a URI4, called the context identifier that denotes the context of the RDF triple. A quad-graph is defined as a set of quads. For any quad-graphQ and any context identifier c, we denote by graphQ(c) the set {(s, p, o)|c : (s, p, o) ∈ Q}. We denote by QC the quad-graph whose set of context identifiers is C. Let V be the set of variables, any element of the set CV = V∪C is a term. Any (s, p, o) ∈ CV×CV×CV is called a triple pattern, and an expression of the form c : (s, p, o), where (s, p, o) is a triple pattern, c a context identifier, is called a quad pattern. A triple pattern t, whose variables are elements of the vector x or elements of the vector y is written as t(x,y). For any function f : A → B, the restriction of f to a set A′, is the mapping f |A′ from A′∩A to B s.t. f |A′(a) = f(a), for each a ∈ A∩A′. For any triple pattern t = (s, p, o) and a function µ from V to a set A, t[µ] denotes (µ′(s), µ′(p), µ′(o)), where µ′ is an extension of µ to C s.t. µ′|C is the identity function. For any set of triple patterns G, G[µ] denotes ⋃\nt∈G t[µ]. For any vector of constants a = 〈a1, . . . , a‖a‖〉, and vector of variables x of the same length, x/a is the function µ s.t. µ(xi) = ai, for 1 ≤ i ≤ ‖a‖. We use the notation t(a,y) to denote t(x,y)[x/a]. Bridge rules (BRs) Bridge rules (BR) enables knowledge propagation across contexts. Formally, a BR is an expression of the form:\n∀x∀z [c1: t1(x, z) ∧ ... ∧ cn: tn(x, z) → ∃y c′1: t ′ 1(x,y) ∧ ... ∧ c ′ m: t ′ m(x,y)] (1)\nwhere c1, ..., cn, c′1, ..., c ′ m are context identifiers, x,y, z are vectors of variables s.t. {x}, {y}, and {z} are pairwise disjoint. t1(x, z), ..., tn(x, z) are triple patterns which do not contain blank-nodes, and whose set of variables are from x or z. t′1(x, y), ...,t′m(x,y) are triple patterns, whose set of variables are from x or y, and also does not contain blank-nodes. For any BR, r, of the form (1), body(r) is the set of quad patterns {c1: t1(x, z),...,cn: tn(x, z)}, and head(r) is the set of quad patterns {c′1: t ′ 1(x,y), ... c′m: t ′ m(x, y)}.\nDefinition 1 (Quad-System). A quad-system QSC is defined as a pair 〈QC , R〉, where QC is a quad-graph, whose set of context identifiers is C, and R is a set of BRs.\n4 Although, in general a context identifier can be a constant, for the ease of notation, we restrict them to be a URI\nFor any quad-graph QC (BR r), its symbols size ‖QC‖ (‖r‖) is the number of symbols required to print QC (r). Hence, ‖QC‖ ≈ 4∗|QC|, where |QC| denotes the cardinality of the set QC . Note that |QC| equals the number of quads in QC . For a BR r, ‖r‖ ≈ 4 ∗ k, where k is the number of quad-patterns in r. For a set of BRs R, its size ‖R‖ is given as Σr∈R‖r‖. For any quad-system QSC = 〈QC , R〉, its size ‖QSC‖ = ‖QC‖+ ‖R‖.\nSemantics In order to provide a semantics for enabling reasoning over a quad-system, we need to use a local semantics for each context to interpret the knowledge pertaining to it. Since the primary goal of this paper is a decision procedure for query answering over quad-systems based on forward chaining, we consider the following desiderata for the choice of the local semantics:\n– there exists a set of inference rules and an operation lclosure() that computes the deductive closure of a graph w.r.t to the local semantics using the inference rules. – given a finite graph as input, the lclosure() operation, terminates with a finite graph as output in polynomial time whose size is polynomial w.r.t. to the input set.\nSome of the alternatives for the local semantics satisfying the above mentioned criterion are Simple, RDF, RDFS [19], OWL-Horst [20] etc. Assuming that a local semantics has been fixed, for any context c, we denote by Ic = 〈∆c, ·c〉 an interpretation structure for the local semantics, where ∆c is the interpretation domain, ·c the corresponding interpretation function. Also |=local denotes the local satisfaction relation between a local interpretation structure and a graph. Given a quad graphQC , a distributed interpretation structure is an indexed set IC = {Ic}c∈C, where Ic is a local interpretation structure, for each c ∈ C. We define the satisfaction relation |= between a distributed interpretation structure IC and a quad-system QSC as:\nDefinition 2 (Model of a Quad-System). A distributed interpretation structure IC = {Ic}c∈C satisfies a quad-system QSC = 〈QC , R〉, in symbols IC |= QSC, iff all the following conditions are satisfied: 1. Ic |=local graphQC (c), for each c ∈ C; 2. aci = acj , for any a ∈ C, ci, cj ∈ C; 3. for each BR r ∈ R of the form (1) and for each σ ∈ V → ∆C , where ∆C =\n⋃\nc∈C ∆ c, if\nIc1 |=local t1(x, z)[σ], ..., I cn |=local tn(x, z)[σ],\nthen there exists function σ′ ⊇ σ, s.t.\nIc ′ 1 |=local t ′ 1(x,y)[σ ′], ..., Ic ′ m |=local t ′ m(x,y)[σ ′].\nCondition 1 in the above definition ensures that for any model IC of a quad-graph, each Ic ∈ IC is a local model of the set of triples in context c. Condition 2 ensures that any constant c is rigid, i.e. represents the same resource across a quad-graph, irrespective of the context in which it occurs. Condition 3 ensure that any model of a quad-system satisfies each BR in it. Any IC s.t. IC |= QSC is said to be a model of QSC. A quadsystem QSC is said to be consistent if there exists a model IC , s.t. IC |= QSC , and otherwise said to be inconsistent. For any quad-system QSC = 〈QC , R〉, it can be the case that graphQC(c) is locally consistent, for each c ∈ C, whereas QSC is not consistent. This is because the set of BRs R adds more knowledge to the quad-system, and restricts the set of models that satisfy the quad-system.\nDefinition 3 (Quad-system entailment). (a) A quad-system QSC entails a quad c : (s, p, o), in symbols QSC |= c : (s, p, o), iff for any distributed interpretation structure IC , if IC |= QSC then IC |= 〈{c : (s, p, o)}, ∅〉. (b) A quad-system QSC entails a quadgraph Q′C′ , in symbols QSC |= Q ′ C′ iff QSC |= c : (s, p, o) for any c : (s, p, o) ∈ Q ′ C′ . (c) A quad-system QSC entails a BR r iff for any IC , if IC |= QSC then IC |= 〈∅, {r}〉. (d) For a set of BRs R, QSC |= R iff QSC |= r, for every r ∈ R. (e) Finally, a quadsystem QSC entails another quad-system QS′C′ = 〈Q ′ C′ , R\n′〉, in symbols QSC |= QS′C′ iff QSC |= Q′C′ and QSC |= R ′. We call the decision problems (DPs) corresponding to the entailment problems (EPs) in (a), (b), (c), (d), and (e) as quad EP, quad-graph EP, BR EP, BRs EP, and quad-system EP, respectively."}, {"heading": "3 Query Answering on Quad-Systems", "text": "In the realm of quad-systems, the classical conjunctive queries or select-project-join queries are slightly extended to what we call Contextualized Conjunctive Queries (CCQs). A CCQ CQ(x) is an expression of the form:\n∃y q1(x,y) ∧ ... ∧ qp(x,y) (2)\nwhere qi, for i = 1, ..., p are quad patterns over vectors of free variables x and quantified variables y. A CCQ is called a boolean CCQ if it does not have any free variables. For any CCQ CQ(x) and a vector a of constants s.t. ‖x‖ = ‖a‖, CQ(a) is boolean. A vector a is an answer for a CCQ CQ(x) w.r.t. structure IC , in symbols IC |= CQ(a), iff there exists assignment µ : {y} → B s.t. IC |= ⋃\ni=1,...,p qi(a,y)[µ]. A vector a is a certain answer for a CCQ CQ(x) over a quad-system QSC, iff IC |= CQ(a), for every model IC of QSC. Given a quad-system QSC, a CCQ CQ(x), and a vector a, DP of determining whether QSC |= CQ(a) is called the CCQ EP. It can be noted that the other DPs over quad-systems that we have seen are reducible to CCQ EP. Hence, in this paper, we primarily focus on the CCQ EP.\ndChase of a Quad-System In order to do query answering over a quad-system, we employ what has been called in the literature, a chase [22, 1], specifically, we adopt notion of the skolem chase given in Marnette [26] and Cuenca Grau et al [9]. In order to fit the framework of quad-systems, we extend the standard notion of chase to a distributed chase, abbreviated dChase. In the following, we show how the dChase of a quad-system can be constructed.\nFor any BR r of the form (1), the skolemization sk(r) is the result of replacing each yi ∈ {y} with a globally unique Skolem function f ri , s.t. f r i : C\n‖x‖ →Bsk, where Bsk is a fresh set of blank nodes called skolem blank nodes. Intuitively, for every distinct vector a of constants, with ‖a‖ = ‖x‖, f ri (a) is a fresh blank node, whose node id is a hash of a. Let fr = 〈f r1 , ..., f r ‖y‖〉 be a vector of distinct Skolem functions; for any BR r the form (1), with slight abuse (Datalog notation) we write its skolemization sk(r) as follows:\nc1 : t1(x, z), ..., cn : tn(x, z) → c ′ 1 : t ′ 1(x,f r), ..., c′m : t ′ m(x,f r) (3)\nMoreover, a skolemized BR r of the form (3) can be replaced by the following semantically equivalent set of formulas, whose symbol size is worst case quadratic w.r.t ‖r‖:\n{c1 : t1(x, z), ..., cn : tn(x, z) → c ′ 1 : t ′ 1(x,f r), (4)\n...,\nc1 : t1(x, z), ..., cn : tn(x, z) → c ′ m : t ′ m(x,f r)}\nNote that each BR in the above set has exactly one quad pattern with optional function symbols in its head part. Also note that a BR with out function symbols can be replaced with a set of BRs with single quad-pattern heads. Hence, w.l.o.g, we assume that any BR in a skolemized set sk(R) of BRs is of the form (4). For any quad-graph QC and a skolemized BR r of the form (4), application of r on QC , denoted by r(QC), is given as: r(QC) = ⋃\nµ∈V→C\n{\nc′1 : t ′ 1(x,f r)[µ] | c1 : t1(x, z)[µ] ∈ QC , ..., cn : tn(x, z)[µ] ∈ QC }\nFor any set of skolemized BRs R, application of R on QC is given by: R(QC) = ⋃\nr∈R r(QC). For any quad-graph QC, we define:\nlclosure(QC) = ⋃\nc∈C\n{c : (s, p, o) |(s, p, o) ∈ lclosure(graphQC (c))}\nFor any quad-system QSC = 〈QC , R〉, generating BRs RF is the set of BRs in sk(R) with function symbols, and the non-generating BRs is the set RI = sk(R) \\RF . Let dChase0(QSC) = lclosure(QC); for i ∈ N, dChasei+1(QSC) =\nlclosure(dChasei(QSC) ∪RI(dChasei(QSC))), if RI(dChasei(QSC)) 6⊆ dChasei(QSC); lclosure(dChasei(QSC) ∪RF (dChasei(QSC))), otherwise;\nThe dChase of QSC , denoted dChase(QSC), is given as:\ndChase(QSC) = ⋃\ni∈N\ndChasei(QSC)\nIntuitively, dChasei(QSC) can be thought of as the state of dChase(QSC) at the end of iteration i. It can be noted that, if there exists i s.t. dChasei(QSC) = dChasei+1(QSC), then dChase(QSC) = dChasei(QSC). An iteration i, s.t. dChasei(QSC) is computed by the application of the set of (resp. non-)generating BRs RF (resp. RI ), on dChasei−1(QSC) is called a (resp. non-)generating iteration. The dChase dChase(QSC) of a consistent quad-system QSC is a universal model [10] of the quad-system, i.e. it is a model of QSC, and for any model IC of QSC, there is a homomorphism from dChase(QSC) to IC . Hence, for any boolean CCQ CQ(), QSC |= CQ() iff there exists a map µ : V(CQ) → C s.t. {CQ()}[µ] ⊆ dChase(QSC). We call the sequence dChase0(QSC), dChase1(QSC), ..., the dChase sequence of QSC. The following lemma shows that in a dChase sequence of a quad-system, the result of a single generating iteration and a subsequent number of non-generating iterations causes only an exponential blow up in size.\nLemma 1. For a quad-system QSC = 〈QC , R〉, the following holds: (i) if i ∈ N is a generating iteration, then ‖dChasei(QSC)‖ = O(‖dChasei−1(QSC)‖‖R‖), (ii) suppose i ∈ N is a generating iteration, and for any j ≥ 1, i+1, ..., i+j are non-generating iterations, then ‖dChasei+j(QSC)‖ = O(‖dChasei−1(QSC)‖‖R‖), (iii) for any iteration k, dChasek(QSC) can be computed in time O(‖dChasek−1(QSC)‖‖R‖).\nProof (sketch). (i) R can be applied on dChasei−1(QSC) by grounding R to the set of constants in dChasei−1(QSC), the number of such groundings is of the order O( ‖dChasei−1(QSC)‖‖R‖), ‖R(dChasei−1(QSC))‖=O(‖R‖∗‖dChasei−1(QSC)‖‖R‖). Since lclosure only increases the size polynomially,‖dChasei(QSC)‖=O( ‖dChasei−1( QSC)‖‖R‖).\n(ii) From (i) we know that ‖R(dChasei−1(QSC))‖=O(‖dChasei−1(QSC)‖‖R‖). Since, no new constant is introduced in any subsequent non-generating iterations, and since any quad contains only four constants, the set of constants in any subsequent dChase iteration is O(4 ∗ ‖dChasei−1(QSC)‖‖R‖). Since only these many constants can appear in positions c, s, p, o of any quad generated in the subsequent iterations, the size of dChasei+j(QSC) can only increase polynomially, which means that ‖dChasei+j( QSC)‖ = O(‖dChasei−1(QSC)‖‖R‖).\n(iii) Since any dChase iteration k involves the following two operations: (a) lclosure(), and (b) computing R(dChasek−1(QSC)). (a) can be done in PTIME w.r.t to its input. (b) can be done in the following manner: ground R to the set of constants in dChasei−1(QSC); then for each grounding g, if body(g) ⊆ dChasei−1(QSC), then add head(g) to R(dChasek−1(QSC)). Since, the number of such groundings is of the order O(‖dChasek−1(QSC)‖‖R‖), and checking if each grounding is contained in dChasek−1(QSC), can be done in time polynomial in ‖dChasek−1(QSC)‖, the time taken for (b) is O(‖dChasek−1(QSC)‖‖R‖). Hence, any iteration k can be done in time O(‖dChasek−1(QSC)‖‖R‖). ⊓⊔\nAlthough, we now know how to compute the dChase of a quad-system, which can be used for deciding CCQ EP, it turns out that for the class of quad-systems whose BRs are of the form (1), which we call unrestricted quad-systems, the dChase can be infinite. This raises the question if there are other approaches that can be used, for instance similar problem arises in DLs with value creation, due to the presence of existential quantifiers, whereas the approaches like the one in Glim et al. [16] provides an algorithm for CQ entailment based on query rewriting.\nTheorem 1. The CCQ EP over unrestricted quad-systems is undecidable.\nProof (sketch). We show that the well known undecidable problem of non-emptiness of intersection of context-free grammars (CFGs) is reducible to the CCQ entailment problem. Given two CFGs, G1 = 〈V1, T, S1, P1〉 and G2 = 〈V2, T, S2, P2〉, where V1, V2 are the set of variables, T s.t. T ∩ (V1 ∪ V2) = ∅ is the set of terminals. S1 ∈ V1 is the start symbol of G1, and P1 are the set of PRs of the form v → w, where v ∈ V , w is a sequence of the form w1...wn, where wi ∈ V1 ∪ T . Similarly s2, P2 is defined. Deciding whether the language generated by the grammars L(G1) and L(G2) have non-empty intersection is known to be undecidable [18].\nGiven two CFGs G1 = 〈V1, T, S1, P1〉 and G2 = 〈V2, T, S2, P2〉, we encode grammars G1, G2 into a quad-system QSc = 〈Qc, R〉, with only a single context identifier c. Each PR r = v → w ∈ P1 ∪ P2, with w = w1w2w3..wn, is encoded as a BR of the form: c : (x1, w1, x2), c : (x2, w2, x3), ..., c : (xn, wn, xn+1) → c : (x1, v, xn+1), where x1, .., xn+1 are variables. For each terminal symbol ti ∈ T , R contains a BR of the form: c : (x,rdf:type, C) → ∃y c : (x, ti, y), c : (y,rdf:type, C) and Qc is the singleton: {c : (a,rdf:type, C)}. It can be observed that:\nQSc |= ∃y c : (a, S1, y) ∧ c : (a, S2, y) ⇔ L(G1) ∩ L(G2) 6= ∅\nWe refer the reader to Appendix for the complete proof. ⊓⊔"}, {"heading": "4 Context Acyclic Quad-Systems: A decidable class", "text": "In the previous section, we saw that query answering on unrestricted quad-systems is undecidable, in general. We in the following define a class of quad-systems for which query entailment is decidable. The class has the property that algorithms based on forward chaining, for deciding query entailment, can straightforwardly be implemented (by minor extensions) on existing quad stores. It should be noted that the technique we propose is reminiscent of the Weak acyclicity [13, 11] technique used in the realm of Datalog+-.\nConsider a BR r of the form: c1 : t1(x, z), c2 : t2(x, z) → ∃y c3 : t3(x,y), c4 : t4(x, y). Since such a rule triggers propagation of knowledge in a quad-system, specifically triples from the source contexts c1, c2 to the target contexts c3, c4 in a quad-system.\nAs shown in Fig. 1, we can view a BR as a propagation rule across distinct compartments of knowledge, divided as contexts. For any BR of the form (1), each context in the set {c′1, ..., c ′ m} is said to depend on the set of contexts {c1, ..., cn}. In a quadsystem QSC = 〈QC , R〉, for any r ∈ R, of the form (1), any context whose identifier is in the set\n{c | c : (s, p, o) ∈ head(r), s or p or o is an existentially quantified variable}, is called a triple generating context (TGC). One can analyze the set of BRs in a quad-system QSC using a context dependency graph, which is a directed graph, whose nodes are context identifiers in C, s.t. the nodes corresponding to TGCs are marked with a ∗, and whose edges are constructed as follows: for each BR of the form (1), there exists an edge from each ci to c′j , for i = 1, ..., n, j = 1, ...,m. A quad-system is said to be context acyclic, iff its context dependency graph does not contain cycles involving TGCs.\nExample 1. Consider a quad-system, whose set of BRs R are:\nc1 : (x1, x2,U1) → ∃y1 c2 : (x1, x2, y1), c3 : (x2,rdf:type,rdf:Property) (5)\nc2 : (x1, x2, z1) → c1 : (x1, x2,U1) (6)\nc3 : (x1, x2, x3) → c1 : (x1, x2, x3)\nwhere U1 be a URI, whose corresponding dependency graph is shown in Fig. 2. Note that the node corresponding to the triple generating context c2 is marked with a ‘∗’ symbol. Since the cycle (c1, c2, c1) in the quad-system contains c2 which is a TGC, the quad-system is not context acyclic.\nIn a context acyclic quad-system QSC, since there exists no cyclic path through any TGC node in the context dependency graph, there exists a set of TGCs C′ ⊆ C s.t. for any c ∈ C′, there exists no incoming path5 from a TGC to c. We call such TGCs, level-1 TGCs. In other words, a TGC c is a level-1 TGC, if for any c′ ∈ C, there exists an incoming path from c′ to c, implies c′ is not a TGC. For l ≥ 1, a level-l+1 TGC c is a TGC that has an incoming path from a level-l TGC, and for any incoming path from a level-l′ TGC to c, is s.t. l′ ≤ l. Extending the notion of level also to the nonTGCs, we say that any non-TGC that does not have any incoming paths from a TGC\nc1\nc2\n∗\nc3\nFig. 2: Context Dependency graph\nis at level-0; we say that any non-TGC c ∈ C is at level-l, if there exists an incoming path from a level-l TGC to c, and for any incoming path from a level-l′ TGC to c, is s.t. l′ ≤ l. Hence, the set of contexts in a context acyclic quad-system can be partitioned using the above notion of levels.\nDefinition 4. For a quad-system QSC, a context c ∈ C is said to be saturated in an iteration i, iff for any quad of the form c : (s, p, o), c : (s, p, o) ∈ dChase(QSC) implies c : (s, p, o) ∈ dChasei(QSC).\nIntuitively, context c is saturated in the dChase iteration i, if no new quad of the form c : (s, p, o) will be generated in any dChasek(QSC), for any k > i. The following lemma gives the relation between the saturation of a context and the required number of dChase iterations, for a context acyclic quad-system.\nLemma 2. For any context acyclic quad-system, the following holds: (i) any level-0 context is saturated before the first generating iteration, (ii) any level-1 TGC is saturated after the first generating iteration, (iii) any level-k context is saturated before the k + 1th generating iteration.\nProof. Let QSC = 〈QC , R〉 be the quad-system, whose first generating iteration is i. (i) for any level-0 context c, any BR r ∈ R, and any quad-pattern of the form c : (s, p, o), if c : (s, p, o) ∈ head(r), then for any c′ s.t. c′ : (s′, p′, o′) occurs in body(r)\n5 assume that paths have at least one edge\nimplies that c′ is a level-0 context and r is a non-generating BR. Also, since c′ is a level0 context, the same applies to c′. Hence, it turns out that only non-generating BRs can bring triples to any level-0 context. Since at the end of iteration i−1, dChasei−1(QSC) is closed w.r.t. the set of non-generating BRs (otherwise, by construction of dChase, i would not be a generating iteration). This implies that c is saturated before the first generating iteration i.\n(ii) for any level-1 TGC c, any BR r ∈ R, and any quad-pattern c : (s, p, o), if c : (s, p, o) ∈ head(r), then for any c′ s.t. c′ : (s′, p′, o′) occurs in body(r) implies that c′ is a level-0 context (Otherwise level of c would be greater than 1). This means that only contexts from which triples get propagated to c are level-0 contexts. From (i) we know that all the level-0 contexts are saturated before ith iteration, and since during the ith iteration RF is applied followed by the lclosure() operation (RI need not be applied, since dChasei−1(QSC) is closed w.r.t. RI ), c is saturated after iteration i, the 1st generating iteration.\n(iii) can be obtained from generalization of (i) and (ii), and from the fact that any level-k context can only have incoming paths from contexts whose levels are less than or equal to k. ⊓⊔\nExample 2. Consider the dependency graph in Fig. 3a, where .. indicates part of the graph that is not under the scope of our discussion. The TGCs nodes c1 and c3 are marked with a ∗. It can be seen that both c2 and c4 are level-0 contexts, since they do not have any incoming paths from TGCs. Since the only incoming paths to context c1 are from c2 and c4, which are not TGCs, c1 is a level-1 TGC. Context c3 is a level-2 TGC, since it has an incoming path from the level-1 TGC c1, and has no incoming path\nfrom a TGC whose level is greater than 1. Since the level-0 contexts only have incoming paths from level-0 contexts and only appear on the head part of non-generating BRs, before first generating iteration, all the level-0 TGCs becomes saturated, as the set of non-generating BRs RI has been exhaustively applied. This situation is reflected in Fig. 3b, where the saturated nodes are shaded with gray. Note that after the first and second generating iterations c1 and c3 also become saturated, respectively.\nThe following lemma shows that for context acyclic quad-systems, there exists a finite bound on the size and computation time of its dChase.\nLemma 3. For any context acyclic quad-system QSC = 〈QC , R〉, the following holds: (i) the number of dChase iterations is finite, (ii) size of the dChase ‖dChase(QSC)‖ = O(22 ‖QSC‖), (iii) computing dChase(QSC) is in 2EXPTIME, (iv) if R and the set of schema triples in QC is fixed, then ‖dChase(QSC)‖ is a polynomial in ‖QSC‖, and computing dChase(QSC) is in PTIME.\nProof. (i) Since QSC is context-acyclic, all the contexts can be partitioned according to their levels. Also, the number of levels k is s.t. k ≤ |C|. Hence, applying lemma 1, before the k + 1th generating iteration all the contexts becomes saturated, and k + 1th generating iteration do not produce any new quads, terminating the dChase computation process.\n(ii) In the dChase computation process, since by lemma 1, any generating iteration and a sequence of non-generating iterations can only increase the dChase size exponentially in ‖R‖, the size of the dChase before k + 1 th generating iteration is O(‖dChase0(QSC)‖‖R‖ k ), which can be written as O(‖QSC‖‖R‖ k\n) (†). As seen in (i), there can only be |C| generating iterations, and a sequence of non-generating iterations. Hence, applying k = |C| to (†), and taking into account the fact that |C| ≤ ‖QSC‖, the size of the dChase ‖dChase(QSC)‖ = O(22\n‖QSC‖). (iii) Since in any dChase iteration except the final one, atleast one new quad should be produced and the final dChase can have at most O(22 ‖QSC‖) quads (by ii), the total number of iterations are bounded by O(22 ‖QSC‖\n) (†). Since from lemma 1, we know that for any iteration i, computing dChasei(QSC) is of the order O(‖dChasei−1(QSC )‖‖R‖). Since, ‖dChasei−1(QSC)‖ can at most be O(22 ‖QSC‖\n), computing dChasei( QSC) is of the orderO(2‖R‖∗2\n‖QSC‖)). Also since ‖R‖ ≤ ‖QSC‖, any iteration requires O(22\n‖QSC‖) time (‡). From (†) and (‡), we can conclude that the time required for computing dChase is in 2EXPTIME.\n(iv) In (ii) we saw that the size of the dChase before k + 1th generating iteration is given by O(‖QSC‖‖R‖ k\n) (⋄). Since by hypothesis ‖R‖ is a constant and also the size of the dependency graph and the levels in it. Hence, the expression ‖R‖k in (⋄) amounts to a constant z. Hence, ‖dChase(QSC)‖ = O(‖QSC‖z). Hence, the size of dChase(QSC) is a polynomial in ‖QSC‖.\nAlso, since in any dChase iteration except the final one, atleast one quad should be produced and the final dChase can have at most O(‖QSC‖z) quads, the total number of iterations are bounded by O(‖QSC‖z) (†). Also from lemma 1, we know that any dChase iteration i, computing dChasei(QSC) involves two steps: (a) computing R(dChasei−1(QSC)), and (b) computing lclosure(), which can be done in\nPTIME in the size of its input. Since computing R(dChasei−1(QSC)) is of the order O(‖dChasei−1(QSC)‖‖R‖), where |R| is a constant and ‖dChasei−1(QSC)‖ is a polynomial is ‖QSC‖, each iteration can be done in time polynomial in ‖QSC‖ (‡). From (†) and (‡), it can be concluded that dChase can be computed in PTIME. ⊓⊔\nLemma 4. For any context acyclic quad-system, the following holds: (i) data complexity of CCQ entailment is in PTIME (ii) combined complexity of CCQ entailment is in 2EXPTIME.\nProof. For a context acyclic quad-system QSC = 〈QC , R〉, since dChase(QSC) is finite, a boolean CCQ CQ() can naively be evaluated by grounding the set of constants in the chase to the variables in the CQ(), and then checking if any of these groundings are contained in dChase(QSC). The number of such groundings can at most be ‖dChase(QSC)‖‖CQ()‖ (†).\n(i) Since for data complexity, the size of the BRs ‖R‖, the set of schema triples, and ‖CQ()‖ is fixed to constant. From lemma 3 (iv), we know that under the above mentioned settings the dChase can be computed in PTIME and is polynomial in the size of QSC . Since ‖CQ()‖ is fixed to a constant, and from (†), binding the set of constants in dChase(QSC) on CQ() still gives a number of bindings that is worst case polynomial in the size of QSC. Since membership of these bindings can checked in the polynomially sized dChase in PTIME, the time required for CCQ evaluation is in PTIME.\n(ii) Since in this case ‖dChase(QSC)‖ = O(22 ‖QSC‖) (‡), from (†) and (‡), binding\nthe set of constants in ‖dChase(QSC‖ to variables inCQ() amounts to O(2‖CQ()‖∗2 ‖QSC‖) bindings. Since the size of dChase is double exponential in ‖QSC‖, checking the membership of each of these bindings can be done in 2EXPTIME. Hence, the combined complexity is in 2EXPTIME. ⊓⊔\nTheorem 2. For any context acyclic quad-system, the following holds: (i) The data complexity of CCQ entailment is PTIME-complete, (ii) The combined complexity of CCQ entailment is 2EXPTIME-complete.\nFor PTIME-hardness of data complexity, it can be shown that the well known problem of 3HornSat, the satisfiability of propositional Horn formulas with atmost 3 literals, and for 2EXPTIME-hardness for the combined complexity, it can be shown that the word problem of a double exponentially time bounded deterministic turing machine, which is a well known 2EXPTIME-hard problem, is reducible to the CCQ entailment problem (see appendix for detailed proof).\nReconsidering the quad-system in example 1, which is not context acyclic. Suppose that the contexts are enabled with RDFS inferencing, i.e lclosure() = rdfsclosure(). During dChase construction, since any application of rule (5) can only create a triple in c2 in which the skolem blank node is in the object position, where as the application of rule (6), does not propogate constants in object postion to c1. Although at a first look, the dChase might seem to terminate, but since the application of the following RDFS inference rule in c2: (s, p, o) → (o ,rdf:type, rdfs:Resource), derives a quad of the form c2 : ( :b, rdf:type, rdfs:Resource), where :b is the skolem blank-node created by the application of rule (5). Now by application of rule (6) leads\nto c1 : ( :b,rdf:type, U1). Since rule (5) is applicable on c1 : ( :b,rdf:type, U1), which again brings a new skolem blank node to c2, and hence the dChase construction doesn’t terminate. Hence, as seen above the notion of context acyclicity can alarm us about such infinite cases."}, {"heading": "5 Related Work", "text": "Contexts and Distributed Logics The work on contexts began in the 80s when McCarthy [21] proposed context as a solution to the generality problem in AI. After this various studies about logics of contexts mainly in the field of KR was done by Guha [28], Distributed First Order Logics by Ghidini et al. [14] and Local Model Semantics by Giunchiglia et al. [15]. Primarily in these works contexts are formalized as a first order/propositional theories, and bridge rules were provided to inter-operate the various contexts. Some of the initial works on contexts relevant to semantic web were the ones like Distributed Description Logics [4] by Borgida et al., E-connections [25] by Kutz et al., Context-OWL [5] by Bouqet et al., and the work of CKR [30, 23] by Serafini et al. These were mainly logics based on DLs, which formalized contexts as OWL KBs, whose semantics is given using a distributed interpretation structure with additional semantic conditions that suits varying requirements. Compared to these works, the bridge rules we consider are much more expressive with conjunctions and existential variables that supports value/blank-node creation.\n∀∃ rules, TGDs, Datalog+- rules Query answering over rules with universal existential quantifiers in the context of databases/KR, where these rules are called tuple generating dependencies (TGDs)/Datalog+- rules, was done by Beeri and Vardi [3] even in the early 80s, where the authors show that the query entailment problem in general is undecidable. However, recently many classes of such rules have been identified for which query answering is decidable. These includes (a) fragments s.t. the resulting models have bounded tree widths, called bounded treewidth sets (BTS), such as Weakly guarded rules [7], Frontier guarded rules [2], (b) fragments called finite unification sets (FUS), such as ‘sticky’ rules [6, 17], and (c) fragments called finite extension sets (FES), where sufficient conditions are enforced to ensure finiteness of the chase and its termination. The approach used for query answering in FUS is to rewrite the input query w.r.t. to the TGDs to another query that can be evaluated directly on the set of instances, s.t. the answers for the former query and latter query coincides. The approach is called the query rewriting approach. FES classes uses certain termination guarantying tests that check whether certain sufficient conditions are satisfied by the structure of TGDs. A large number of classes in FES are based on tests that detects ‘acyclicity conditions’ by analyzing the information flow between the TGD rules. Weak acyclicity [13, 11], was one of the first such notions, and was extended to joint acyclicity [24], super weak acyclicity [26], and model faithful acyclicity [9]. The most similar approach to ours is the weak acyclicity technique, where the structure of the rules is analyzed using a dependency graph that models the propagation of constants across various predicates positions, and restricting the dependency graph to be acyclic. Although this technique can be used in our scenario by translating a quad-system to a set of TGDs; if the obtained translation is weakly acyclic, then one could use existing algorithms for\nchase computation for the TGDs to compute the chase, the query entailment check can be done by querying the obtained chase. However, our approach has the advantage of straightforward implementability on existing quad-stores."}, {"heading": "6 Summary and Conclusion", "text": "In this paper, we study the problem of query answering over contextualized RDF knowledge. We show that the problem in general is undecidable, and present a decidable class called context acyclic quad-systems. Table 1 summarizes the main results obtained. We can show that the notion of context acyclicity, introduced in section 4 can be used to extend the currently established tools for contextual reasoning to give support for expressive BRs with conjuction and existentials with decidability guarantees. We view the results obtained in this paper as a general foundation for contextual reasoning and query answering over contextualized RDF knowledge formats such as Quads, and can straightforwardly be used to extend existing Quad stores to encorporate for-all existential BRs of the form (1)."}, {"heading": "A Proofs of Section 3", "text": "Proof (Theorem 1). We show that CCQ entailment is undecidable for unrestricted quadsystems, by showing that the well known undecidable problem of “non-emptiness of intersection of context-free grammars” is reducible to the CCQ entailment problem.\nGiven an alphabet Σ, string w is a sequence of symbols from Σ. A language L is a subset of Σ∗, where Σ∗ is the set of all strings that can be constructed from the alphabet Σ, and also includes the empty string ǫ. Grammars are machineries that generate a particular language. A grammar G is a quadruple 〈V, T, S, P 〉, where V is the set of variables, T , the set of terminals, S ∈ V is the start symbol, and P is a set of production rules (PR), in which each PR r ∈ P , is of the form:\nw → w′\nwhere w,w′ ∈ {T ∪ V }∗. Intuitively application of a PR r of the form above on a string w1, replaces every occurrence of the sequence w in w1 with w′. PRs are applied starting from the start symbol S until it results in a string w, with w ∈ Σ∗ or no more production rules can be applied on w. In the former case, we say that w ∈ L(G), the language generated by grammar G. For a detailed review of grammars, we refer the reader to Harrison et al. [18]. A context-free grammar (CFG) is a grammar, whose set of PRs P , have the following property:\nProperty 1. For a CFG, every PR is of the form v → w, where v ∈ V , w ∈ {T ∪ V }∗.\nGiven two CFGs, G1 = 〈V1, T, S1, P1〉 and G2 = 〈V2, T, S2, P2〉, where V1, V2 are the set of variables, T s.t. T ∩ (V1 ∪ V2) = ∅ is the set of terminals. S1 ∈ V1 is the start symbol of G1, and P1 are the set of PRs of the form v → w, where v ∈ V , w is a sequence of the form w1...wn, where wi ∈ V1∪T . Similarly s2, P2 is defined. Deciding whether the language generated by the grammars L(G1) and L(G2) have non-empty intersection is known to be undecidable [18].\nGiven two CFGs, G1 = 〈V1, T, S1, P1〉 andG2 = 〈V2, T, S2, P2〉, we encode grammars G1, G2 into a quad-system of the form QSc = 〈Qc, R〉, with a single context identifier c. Each PR r = v → w ∈ P1 ∪ P2, with w = w1w2w3..wn, is encoded as a BR of the form:\nc : (x1, w1, x2), c : (x2, w2, x3), ..., c : (xn, wn, xn+1) → c : (x1, v, xn+1) (7)\nwhere x1, .., xn+1 are variables. W.l.o.g. we assume that the set of terminal symbols T is equal to the set of terminal symbols occurring in P1 ∪ P2. For each terminal symbol ti ∈ T , R contains a BR of the form:\nc : (x,rdf:type, C) → ∃y c : (x, ti, y), c : (y,rdf:type, C) (8)\nand Qc contains only the triple:\nc : (a,rdf:type, C)\nWe in the following show that:\nQSc |= ∃y c : (a, S1, y) ∧ c : (a, S2, y) ⇔ L(G1) ∩ L(G2) 6= ∅\nClaim. (1) For anyw = t1, ..., tp ∈ T ∗, there exists b1, ...bp, s.t. c : (a, t1, b1), c : (b1, t2, b2), ..., c : (bp−1, tp, bp), c : (bp,rdf:type, C) ∈ dChase( QSc).\nwe proceed by induction on the ‖w‖.\nbase case suppose if ‖w‖ = 1, then w = ti, for some ti ∈ T . But Since by construction c : (a, rdf:type, C) ∈ dChase0(QSc), on which rules of the form (8) is applicable. Hence, there exists an i s.t. dChasei(QSc) contains c : (a, ti, bi), c : (bi,rdf:type, C), for each ti ∈ T . Hence, the base case. hypothesis for anyw = t1...tp, if ‖w‖ ≤ p′, then there exists b1, ..., bp, s.t. c : (a, t1, b1), c : (b1, t2, b2), ..., c : (bp−1, tp, bp), c : (bp, rdf:type, C) ∈ dChase(QSc). inductive step suppose w = t1...tp+1, with ‖w‖ ≤ p′ + 1. Since w can be written as w′tp+1, where w′ = t1...tp, and by hypothesis, there exists b1, ..., bp such that c : (a, t1, b1), c : (b1, t2, b2), ..., c : (bp−1, tp, bp), c : (bp,rdf:type, C) ∈ dChase(QSc). Also since rules of the form (8) are applicable on c : (bp, rdf:type, C), and hence produces triples of the form c : (bp, ti, bip+1), c : (b i p+1), rdf:type,\nC), for each ti ∈ T . Since tp+1 ∈ T , the claim follows.\nFor a grammar G = 〈V, T, S, P 〉, whose start symbol is S, and for any w ∈ {V ∪ T }∗, for some Vj ∈ V , we denote by Vj →i w, the fact that w was derived from Vj by i production steps, i.e. there exists steps Vj → r1, ..., ri → w, which lead to the production of w. For any w, w ∈ L(G), iff there exists an i s.t. S →i w. For any Vj ∈ V , we use Vj →∗ w to denote the fact that there exists an arbitrary i, s.t. Vj →i w.\nClaim. (2) For any w = t1...tp ∈ {V ∪ T }∗, and for any Vj ∈ V , if Vj →∗ w and there exists b1, ..., bp+1, with c : (b1, t1, b2), ..., c : (bp, tp, bp+1) ∈ dChase(QSc), then c : (b1, Vj , bp+1) ∈ dChase(QSc).\nWe prove this by induction on the size of w.\nbase case Suppose ‖w‖ = 1, then w = tk, for some tk ∈ T . If there exists b1, b2 s.t. c : (b1, tk, b2). But since there exists a PR Vj → tk, by transformation given in (7), there exists a BR c : (x1, tk, x2) → c : (x1, Vj , x2) ∈ R, which is applicable on c : (b1, tk, b2) and hence the quad c : (b1, Vj , b2) ∈ dChase(QSc). hypothesis For any w = t1...tp, with ‖w‖ ≤ p′, and for any Vj ∈ V , if Vj →∗ w and there exists b1, ...bp, bp+1, s.t. c : (b1, t1, b2), ..., c : (bp, tp, bp+1) ∈ dChase(QSc), then c : (b1, Vj , bp+1) ∈ dChase(QSc). inductive step Suppose if w = t1...tp+1, with ‖w‖ ≤ p′ +1, and Vj →i w, and there exists b1, ...bp+1, bp+2, s.t. c : (b1, t1, b2), ..., c : (bp+1, tp+1, bp+2) ∈ dChase(Qc). Also, one of the following holds (i) i = 1, or (ii) i > 1. Suppose (i) is the case, then it is trivially the case that c : (b1, Vj , bp+2) ∈ dChase(QSc). Suppose if (ii) is the case, one of the two sub cases holds (a) Vj →i−1 Vk, for some Vk ∈ V and Vk →1 w or (b) there exist a Vk ∈ V , s.t. Vk →∗ tq+1...tq+l, with 2 ≤ l ≤ p, where Vj →∗ t1...tqVktp−l+1...tp+1. If (a) is the case, trivially then c : (b1, Vk, bq+2) ∈ dChase(QSc), and since by construction there exists c : (x0, Vk, x1) → c : (x0, Vk+1, x1), ..., c : (x0, Vk+i, x1) → c : (x0, Vj , x1) ∈ R, c : (b1, Vj , bq+2) ∈ dChase(QSc). If (b) is the case, then since ‖tq+1...tq+l‖ ≥ 2, ‖t1...tqV2tp−l+1...tp+1‖ ≤ p′. This implies that c : (b1, Vj , bp+2) ∈ dChase(QSc).\nSimilarly, by construction of dChase(QSc), the following claim can straightforwardly be shown to hold:\nClaim. (3) For any w = t1...tp ∈ {V ∪ T }∗, and for any Vj ∈ V , if there exists b1, ..., bp, bp+1, with c : (b1, t1, b2), ..., c : (bp, tp, bp+1) ∈ dChase(QSc) and c : (b1, Vj , bp+1) ∈ dChase(QSc), then Vj →∗ w.\n(a) For any w = t1...tp ∈ T ∗, if w ∈ L(G1) ∩ L(G2), then by claim 1, since there exists b1, ..., bp, s.t. c : (a, t1, b1), ..., c : (bp−1, tp, bp) ∈ dChase(QSc). But since w ∈ L(G1) andw ∈ L(G2), S1 → w and S2 → w. Hence by claim 2, c : (a, S1, bp), c : (a, S2, bp) ∈ dChase(QSc), which implies that dChase(QSc) |= ∃y c : (a, s1, y) ∧ c : (a, s2, y). Hence, QSc |= ∃y c : (a, s1, y) ∧ c : (a, s2, y). (b) Suppose if QSc |= ∃y c : (a, S1, y) ∧ c : (a, S2, y), then this implies that there exists bp s.t. c : (a, S1, bp), c : (a, S2, bp) ∈ dChase(QSC). Then it is the case that there exists w = t1...tp ∈ T ∗, and b1, ..., bp s.t. c : (a, t1, b1), ..., c : (bp−1, tp, bp), c : (a, S1, bp), c : (a, S2, bp) ∈ dChase(QSc). Then by claim 3, S1 →∗ w, S2 →∗ w. Hence, w ∈ L(G1) ∩ L(G2).\nBy (a),(b) it follows that there exists w ∈ L(G1)∩L(G2) iffQSc |= ∃y c : (a, s1, y)∧ c : (a, s2, y). As we have shown that the intersection of CFGs, which is an undecidable problem, is reducible to the problem of query entailment on unrestricted quad-system, the latter is undecidable."}, {"heading": "B Proofs of Section 4", "text": "Proof (Theorem 2). (i) (Membership) See lemma 4 for the membership in PTIME. (Hardness) In order to prove P-hardness, we reduce a well known P-complete problem, 3HornSat, i.e. the satisfiability of propositional Horn formulas with at most 3 literals. Note that a (propositional) Horn formula is formula of the form:\nP1 ∧ . . . ∧ Pn → Pn+1 (9)\nwhere Pi, for 1 ≤ i ≤ n + 1, are either propositional variables or constants t, f , that represents true and false, respectively. Note that for any propositional variable P , the fact that “P holds” is represented by the formula t → P , and “P does not hold” is represented by the formula P → f . A 3Horn formula is a formula of the form (9), where 1 ≤ n ≤ 2. Note that any (set of) Horn formula(s) Φ can be transformed in polynomial time to a polynomially sized set Φ′ of 3Horn formulas, by introducing auxiliary propositional variables s.t. Φ is satisfiable iff Φ′ is satisfiable. A pure 3Horn formula is 3Horn formula of the form 9, where n = 2. Any 3Horn formula φ that is not pure can be trivially converted to equivalent pure form by appending a ∧ t on the head part of φ. For instance, P → Q, can be converted to P ∧ t → Q. Hence, w.l.o.g. we assume that any set of 3Horn formulas is pure, and is of the form:\nP1 ∧ P2 → P3 (10)\nWe, in the following, reduce the satisfiability problem of pure 3Horn formulas to CCQ entailment problem over a quad-system whose set of schema triples, the set of BRs, and the CCQ CQ are all fixed.\nFor any set of pure Horn formulasΦ, we construct the quad-systemQSC = 〈QC , R〉, where C = {ct, cf}. For any formula φ ∈ Φ of the form (10), QC contains a quad cf : (P1, P2, P3). In addition QC contains a quad ct : (t, rdf:type, T ). R is the singleton that contains only the following fixed BR:\nct : (x1,rdf:type, T ), ct : (x2,rdf:type, T ), cf : (x1, x2, x3) → ct : (x3,\nrdf:type, T )\nLet the CQ be the fixed query ct(f,rdf:type, T ). Now, it is easy to see that QSC |= CQ, iff Φ is not satisfiable. (ii) (Membership) See lemma 4. (Hardness) See following heading. ⊓⊔\n2EXPTIME-Hardness of CCQ Entailment In this subsection, we show that the combined complexity of the decision problem of CCQ entailment for context acyclic quadsystems is 2EXPTIME-hard. We show this by reduction of the word-problem of a 2EXPTIME deterministic turing machine (DTM) to the CCQ entailment problem. A DTM M is a tuple M = 〈Q,Σ,∆, q0, qA〉, where\n– Q is a set of states, – Σ is a finite alphabet that includes the blank symbol , – ∆ : (Q ×Σ) → (Q×Σ × {+1,−1}) is the transition function, – q0 ∈ Q is the initial state. – qA ∈ Q is the accepting state.\nW.l.o.g. we assume that there exists exactly one accepting state, which is also a halting state. A configuration is a word α ∈ Σ∗QΣ∗. A configuration α2 is a successor of the configuration α1, iff one of the following holds:\n1. α1 = wlqσσrwr and α2 = wlσ′q′σrwr, if ∆(q, σ) = (q′, σ′, R), or 2. α1 = wlqσ and α2 = wlσ′q′ , if ∆(q, σ) = (q′, σ′, R), or 3. α1 = wlσlqσwr and α2 = wlq′σlσ′wr, if ∆(q, σ) = (q′, σ′, L).\nwhere q, q′ ∈ Q, σ, σ′, σl, σr ∈ Σ, and wl,wr ∈ Σ∗. Since number of configurations can at most be doubly exponential in the size of the input string, the number of tape cells traversed by the DTM tape head is also bounded double exponentially. A configuration c = wlqwr is an accepting configuration iff q = qA. A language L ⊆ Σ∗ is accepted by a 2EXPTIME bounded DTM M , iff for every w ∈ L, M accepts w in time O(22 ‖w‖ ).\nSimulating DTMs using Context Acyclic Quad-Systems Consider a DTM M = 〈Q,Σ,∆, q0, qA〉, and a string w, with ‖w‖ = n. Since the number of storage cells is double exponentially bounded, we first construct a quad-system QSMC = 〈Q M C , R〉,\nwhere C = {c1, ..., cn}, with n = ‖w‖. We follow the technique in works such as [6, 24] to iteratively generate a doubly exponential number of objects that represent the cells of the tape of the DTM. Let QMC be initialized with the following quads:\nc0 : (k0,rdf:type, R), c0 : (k1,rdf:type, R),\nc0 : (k0,rdf:type,min0), c0 : (k1,rdf:type,max0), c0 : (k0, succ0, k1)\nNow for each pair of elements of type R in ci, a skolem blank-node is generated in ci+1, and hence follows the recurrence relation r(m + 1) = [r(m)]2, with seed r(1) = 2, which after n iterations yields 22 n\n. In this way, a doubly exponential long chain of elements is created in cn using the following set of rules:\nci : (x0,rdf:type, R), ci : (x1,rdf:type, R) →\n∃y ci+1 : (x0, x1, y), ci+1 : (y,rdf:type, R)\nThe combination of minimal element with the minimal element (elements of typemini) in ci create the minimal element in ci+1, and similarly the combination of maximal element with the maximal element (elements of type maxi) in ci create the maximal element of ci+1\nci+1 : (x0, x0, x1), ci : (x0,rdf:type,mini) → ci+1 : (x1,rdf:type,mini+1)\nci+1 : (x0, x0, x1), ci : (x0,rdf:type,maxi) → ci+1 : (x1,rdf:type,maxi+1)\nSuccessor relation succi+1 is created in ci+1 using the following set of rules, using the well-known, integer counting technique:\nci : (x1, succi, x2), ci+1 : (x0, x1, x3), ci+1 : (x0, x2, x4) → ci+1 : (x3, succi+1, x4)\nci : (x1, succi, x2), ci+1 : (x1, x3, x5), ci+1 : (x2, x4, x6), ci : (x3,rdf:type,maxi),\nci : (x4,rdf:type,mini) → ci+1 : (x5, succi+1, x6)\nEach of the above set rules are instantiated for 0 ≤ i < n, and in this way after n generating dChase iterations, cn has doubly exponential number of elements of type R, that are ordered linearly using the relation succn. By virtue of the first rule below, each of the objects representing the cells of the DTM are linearly ordered by the relation succ. Also the transitive closure of succ is defined as the relation relation succt\ncn : (x0, succn, x1) → cn : (x0, succ, x1)\ncn : (x0, succ, x1) → cn : (x0, succt, x1)\ncn : (x0, succt, x1), cn : (x1, succt, x2) → cn : (x0, succt, x2)\nAlso using a similar construction, we could create a linearly ordered chain of double exponential number of objects in cn that represents configurations of M , whose minimal element is of type conInit, and the linear order relation being conSucc.\nVarious triple patterns that are used to encode the possible configurations, runs and their relations in M are:\n(x0, head, x1) denotes the fact that in configuration x0, the head of the DTM is at cell x1. (x0, state, x1) denotes the fact that in configuration x0, the DTM is in state x1. (x0, σ, x1) where σ ∈ Σ, denotes the fact that in configuration x0, the cell x1 contains\nσ. (x0, succ, x1) denotes the linear order between cells of the tape. (x0, succt, x1) denotes the transitive closure of succ. (x0, conSucc, x1) to denote the fact that x1 is a successor configuration of x0. (x0,rdf:type, Accept) denotes the fact that the configuration x0 is an accepting\nconfiguration.\nSince in our construction, each σ ∈ Σ is represented as relation, we could constrain that no two alphabets σ 6= σ′ are on the same cell using the following axiom:\ncn : (z1, σ, z2), cn : (z1, σ ′, z2) →\nfor each σ 6= σ′ ∈ Σ. Note that the above BR has an empty head, is equivalent to asserting the negation of its body.\nInitialization Suppose the initial configuration is q0w , where w = σ0...σn−1, then we enforce this using the following BRs in our quad-system QSMC as:\ncn : (x0,rdf:type, conInit), cn : (x1,rdf:type,minn) → cn : (x0, head, x1),\ncn : (x0, state, q0)\ncn : (x0,rdf:type,minn) ∧ n−1 ∧\ni=0\ncn : (xi, succ, xi+1) ∧ cn : (xj ,rdf:type,\nconInit) → n−1 ∧\ni=0\ncn : (xj , σi, xi) ∧ cn : (xj , , xn)\ncn : (xj ,rdf:type, conInit), cn : (xj , , x0), cn : (x0, succt, x1) → cn : (xj , , x1)\nThe last BR copies the to every succeeding cell in the initial configuration.\nTransitions For every left transition ∆(q, σ) = (qj , σ′,−1), the following BR:\ncn : (x0, head, xi), cn : (x0, σ, xi), cn : (x0, state, q), cn : (xj , succ, xi), cn : (x0, conSucc, x1) → cn : (x1, head, xj), cn : (x1, σ ′, xi), cn : (x1, state, qj)\nFor every right transition ∆(q, σ) = (qj , σ′,+1), the following BR:\ncn : (x0, head, xi), cn : (x0, σ, xi), cn : (x0, state, q), cn : (xi, succ, xj), cn : (x0, conSucc, x1),→ cn : (x1, head, xj), cn : (x1, σ ′, xi), cn : (x1, state, qj)\nInertia If in any configuration the head is at cell i of the tape, then in every successor configuration, elements in preceding and following cells of i in the tape are retained. The following two BRs ensures this:\ncn : (x0, head, xi), cn : (x0, conSucc, x1), cn : (xj , succt, xi), cn : (x0, σ, xj)\n→ cn : (x1, σ, xj)\ncn : (x0, head, xi), cn : (x0, conSucc, x1), cn : (xi, succt, xj), cn : (x0, σ, xj)\n→ cn : (x1, σ, xj)\nThe rules above are instantiated for every σ ∈ Σ.\nAcceptance An configuration whose state is qA is accepting:\ncn : (x0, state, qA) → cn : (x0,rdf:type, Accept)\nIf a configuration of accepting type is reached, then it can be back propagated to the initial configuration, using the following BR:\ncn : (x0, conSucc, x1), cn : (x1,rdf:type, Accept) → cn : (x0,rdf:type, Accept)\nFinally since M accepts w iff the initial configuration is an accepting configuration, i.e. QSMC |= ∃y cn : (y,rdf:type, conInit), cn : (y,rdf:type, Accept). Since there is no edge from any cj to ci, for each 1 ≤ i < j ≤ n, the context dependency graph for QSMC is acyclic, and hence QS M C is context acyclic. Since we reduced the word problem of 2EXPTIME DTM, which is a 2EXPTIME-hard problem, to CCQ entailment problem over context acyclic quad-systems, it immediately follows that CCQ entailment problem over context acyclic quad-systems is 2EXPTIME-hard. ⊓⊔"}], "references": [{"title": "Foundations of Databases", "author": ["S. Abiteboul", "R. Hull", "V. Vianu"], "venue": "Addison-Wesley", "citeRegEx": "1", "shortCiteRegEx": null, "year": 1995}, {"title": "Walking the Complexity Lines for Generalized Guarded Existential Rules", "author": ["J. Baget", "M. Mugnier", "S. Rudolph", "M. Thomazo"], "venue": "IJCAI. pp. 712–717", "citeRegEx": "2", "shortCiteRegEx": null, "year": 2011}, {"title": "The Implication Problem for Data Dependencies", "author": ["C. Beeri", "M.Y. Vardi"], "venue": "ICALP. pp. 73–85", "citeRegEx": "3", "shortCiteRegEx": null, "year": 1981}, {"title": "Distributed Description Logics: Assimilating Information from Peer Sources", "author": ["A. Borgida", "L. Serafini"], "venue": "J. Data Semantics 1, 153–184", "citeRegEx": "4", "shortCiteRegEx": null, "year": 2003}, {"title": "C-OWL: Contextualizing Ontologies", "author": ["P. Bouquet", "F. Giunchiglia", "F. van Harmelen", "L. Serafini", "H. Stuckenschmidt"], "venue": "ISWC. pp. 164–179", "citeRegEx": "5", "shortCiteRegEx": null, "year": 2003}, {"title": "Query Answering under Non-guarded Rules in Datalog+/", "author": ["A. Calı̀", "G. Gottlob", "A. Pieris"], "venue": "Hitzler, P., Lukasiewicz, T. (eds.) RR. Lecture Notes in Computer Science, vol. 6333, pp. 1–17. Springer", "citeRegEx": "6", "shortCiteRegEx": null, "year": 2010}, {"title": "Datalog+/-: A Family of Logical Knowledge Representation and Query Languages for New Applications", "author": ["A. Cali", "G. Gottlob", "T. Lukasiewicz", "B. Marnette", "A. Pieris"], "venue": "Logic in Computer Science (LICS), 2010 25th Annual IEEE Symposium on. pp. 228 –242", "citeRegEx": "7", "shortCiteRegEx": null, "year": 2010}, {"title": "Named graphs, provenance and trust", "author": ["J. Carroll", "C. Bizer", "P. Hayes", "P. Stickler"], "venue": "Proc. of the 14th int.l. conf. on WWW. pp. 613–622. ACM, New York, NY, USA", "citeRegEx": "8", "shortCiteRegEx": null, "year": 2005}, {"title": "Acyclicity Conditions and their Application to Query Answering in Description Logics", "author": ["B. Cuenca Grau", "I. Horrocks", "M. Krötzsch", "C. Kupke", "D. Magka", "B. Motik", "Z. Wang"], "venue": "Proceedings of the 13th International Conference on Principles of Knowledge Representation and Reasoning (KR’12). pp. 243–253. AAAI Press", "citeRegEx": "9", "shortCiteRegEx": null, "year": 2012}, {"title": "The chase revisited", "author": ["A. Deutsch", "A. Nash", "J. Remmel"], "venue": "Proceedings of the twentyseventh ACM SIGMOD-SIGACT-SIGART symposium on Principles of database systems. pp. 149–158. PODS ’08", "citeRegEx": "10", "shortCiteRegEx": null, "year": 2008}, {"title": "Reformulation of XML Queries and Constraints", "author": ["A. Deutsch", "V. Tannen"], "venue": "In ICDT. pp. 225–241", "citeRegEx": "11", "shortCiteRegEx": null, "year": 2003}, {"title": "Data Exchange: Semantics and Query Answering", "author": ["R. Fagin", "P.G. Kolaitis", "R.J. Miller", "L. Popa"], "venue": "Theoretical Computer Science. pp. 28(1):89–124", "citeRegEx": "13", "shortCiteRegEx": null, "year": 2005}, {"title": "Distributed first order logics", "author": ["C. Ghidini", "L. Serafini"], "venue": "Frontiers Of Combining Systems 2, Studies in Logic and Computation. pp. 121–140. Research Studies Press", "citeRegEx": "14", "shortCiteRegEx": null, "year": 1998}, {"title": "Local models semantics, or contextual reasoning = locality + compatibility", "author": ["F. Giunchiglia", "C. Ghidini"], "venue": "Artificial Intelligence 127", "citeRegEx": "15", "shortCiteRegEx": null, "year": 2001}, {"title": "Answering conjunctive queries in the SHIQ description logic", "author": ["B. Glimm", "C. Lutz", "I. Horrocks", "U. Sattler"], "venue": "Proceedings of the IJCAI’07. pp. 299–404. AAAI Press", "citeRegEx": "16", "shortCiteRegEx": null, "year": 2007}, {"title": "Polynomial Combined Rewritings for Existential Rules", "author": ["G. Gottlob", "M. Manna", "A. Pieris"], "venue": "KR’14: International Conference on Principles of Knowledge Representation and Reasoning", "citeRegEx": "17", "shortCiteRegEx": null, "year": 2014}, {"title": "Introduction to Formal Language Theory", "author": ["M.A. Harrison"], "venue": "Addison-Wesley Longman Publishing Company, Inc., Boston, MA, USA, 1st edn.", "citeRegEx": "18", "shortCiteRegEx": null, "year": 1978}, {"title": "Completeness, decidability and complexity of entailment for RDF Schema and a semantic extension involving the OWL vocabulary", "author": ["H.J. ter Horst"], "venue": "Web Semantics: Science, Services and Agents on the WWW 3(2-3), 79–115", "citeRegEx": "20", "shortCiteRegEx": null, "year": 2005}, {"title": "Generality in AI", "author": ["J.McCarthy"], "venue": "Comm. of the ACM 30(12), 1029–1035", "citeRegEx": "21", "shortCiteRegEx": null, "year": 1987}, {"title": "Testing containment of conjunctive queries under functional and inclusion dependencies", "author": ["D.S. Johnson", "A.C. Klug"], "venue": "Computer and System Sciences 28, 167–189", "citeRegEx": "22", "shortCiteRegEx": null, "year": 1984}, {"title": "Simple reasoning for contextualized RDF knowledge", "author": ["M. Joseph", "L. Serafini"], "venue": "Proc. of Workshop on Modular Ontologies (WOMO-2011)", "citeRegEx": "23", "shortCiteRegEx": null, "year": 2011}, {"title": "Extending decidable existential rules by joining acyclicity and guardedness", "author": ["M. Krötzsch", "S. Rudolph"], "venue": "Walsh, T. (ed.) Proceedings of the 22nd International Joint Conference on Artificial Intelligence (IJCAI’11). pp. 963–968. AAAI Press/IJCAI", "citeRegEx": "24", "shortCiteRegEx": null, "year": 2011}, {"title": "E-Connections of Abstract Description Systems", "author": ["O. Kutz", "C. Lutz", "F. Wolter", "M. Zakharyaschev"], "venue": "Artificial Intelligence 156(1), 1–73", "citeRegEx": "25", "shortCiteRegEx": null, "year": 2004}, {"title": "Generalized schema-mappings: from termination to tractability", "author": ["B. Marnette"], "venue": "Proceedings of the twenty-eighth ACM SIGMOD-SIGACT-SIGART symposium on Principles of database systems. pp. 13–22. PODS ’09, ACM, New York, NY, USA", "citeRegEx": "26", "shortCiteRegEx": null, "year": 2009}, {"title": "Formalizing Context (Expanded Notes", "author": ["J. McCarthy", "S. Buvac", "T. Costello", "R. Fikes", "M. Genesereth", "F. Giunchiglia"], "venue": null, "citeRegEx": "27", "shortCiteRegEx": "27", "year": 1995}, {"title": "Contexts: a Formalization and some Applications", "author": ["R.Guha"], "venue": "Ph.D. thesis, Stanford", "citeRegEx": "28", "shortCiteRegEx": null, "year": 1992}, {"title": "Contextualized knowledge repositories for the semantic web", "author": ["L. Serafini", "M. Homola"], "venue": "Web Semantics: Science, Services and Agents on the World Wide Web", "citeRegEx": "30", "shortCiteRegEx": null, "year": 2012}], "referenceMentions": [{"referenceID": 7, "context": "One of the main benefits of quads over triples are that they allow users to specify various attributes of meta-knowledge that further qualify knowledge [8], and also allow users to query for this meta knowledge [29].", "startOffset": 152, "endOffset": 155}, {"referenceID": 3, "context": "Besides the above flexibility, bridge rules [4] can be provided for inter-interoperating the knowledge in different contexts.", "startOffset": 44, "endOffset": 47}, {"referenceID": 3, "context": "In this work, we consider forall-existential bridge rules that allows conjunctions and existential quantifiers in them, and hence is more expressive than those, in DDL [4] and McCarthy et al.", "startOffset": 168, "endOffset": 171}, {"referenceID": 24, "context": "[27].", "startOffset": 0, "endOffset": 4}, {"referenceID": 19, "context": "For query answering, we use the notion of a distributed chase, which is an extension of a standard chase [22, 1] that is widely used in databases and KR for the same.", "startOffset": 105, "endOffset": 112}, {"referenceID": 0, "context": "For query answering, we use the notion of a distributed chase, which is an extension of a standard chase [22, 1] that is widely used in databases and KR for the same.", "startOffset": 105, "endOffset": 112}, {"referenceID": 17, "context": "Some of the alternatives for the local semantics satisfying the above mentioned criterion are Simple, RDF, RDFS [19], OWL-Horst [20] etc.", "startOffset": 128, "endOffset": 132}, {"referenceID": 19, "context": "dChase of a Quad-System In order to do query answering over a quad-system, we employ what has been called in the literature, a chase [22, 1], specifically, we adopt notion of the skolem chase given in Marnette [26] and Cuenca Grau et al [9].", "startOffset": 133, "endOffset": 140}, {"referenceID": 0, "context": "dChase of a Quad-System In order to do query answering over a quad-system, we employ what has been called in the literature, a chase [22, 1], specifically, we adopt notion of the skolem chase given in Marnette [26] and Cuenca Grau et al [9].", "startOffset": 133, "endOffset": 140}, {"referenceID": 23, "context": "dChase of a Quad-System In order to do query answering over a quad-system, we employ what has been called in the literature, a chase [22, 1], specifically, we adopt notion of the skolem chase given in Marnette [26] and Cuenca Grau et al [9].", "startOffset": 210, "endOffset": 214}, {"referenceID": 8, "context": "dChase of a Quad-System In order to do query answering over a quad-system, we employ what has been called in the literature, a chase [22, 1], specifically, we adopt notion of the skolem chase given in Marnette [26] and Cuenca Grau et al [9].", "startOffset": 237, "endOffset": 240}, {"referenceID": 9, "context": "The dChase dChase(QSC) of a consistent quad-system QSC is a universal model [10] of the quad-system, i.", "startOffset": 76, "endOffset": 80}, {"referenceID": 14, "context": "[16] provides an algorithm for CQ entailment based on query rewriting.", "startOffset": 0, "endOffset": 4}, {"referenceID": 16, "context": "Deciding whether the language generated by the grammars L(G1) and L(G2) have non-empty intersection is known to be undecidable [18].", "startOffset": 127, "endOffset": 131}, {"referenceID": 11, "context": "It should be noted that the technique we propose is reminiscent of the Weak acyclicity [13, 11] technique used in the realm of Datalog+-.", "startOffset": 87, "endOffset": 95}, {"referenceID": 10, "context": "It should be noted that the technique we propose is reminiscent of the Weak acyclicity [13, 11] technique used in the realm of Datalog+-.", "startOffset": 87, "endOffset": 95}, {"referenceID": 18, "context": "Contexts and Distributed Logics The work on contexts began in the 80s when McCarthy [21] proposed context as a solution to the generality problem in AI.", "startOffset": 84, "endOffset": 88}, {"referenceID": 25, "context": "After this various studies about logics of contexts mainly in the field of KR was done by Guha [28], Distributed First Order Logics by Ghidini et al.", "startOffset": 95, "endOffset": 99}, {"referenceID": 12, "context": "[14] and Local Model Semantics by Giunchiglia et al.", "startOffset": 0, "endOffset": 4}, {"referenceID": 13, "context": "[15].", "startOffset": 0, "endOffset": 4}, {"referenceID": 3, "context": "Some of the initial works on contexts relevant to semantic web were the ones like Distributed Description Logics [4] by Borgida et al.", "startOffset": 113, "endOffset": 116}, {"referenceID": 22, "context": ", E-connections [25] by Kutz et al.", "startOffset": 16, "endOffset": 20}, {"referenceID": 4, "context": ", Context-OWL [5] by Bouqet et al.", "startOffset": 14, "endOffset": 17}, {"referenceID": 26, "context": ", and the work of CKR [30, 23] by Serafini et al.", "startOffset": 22, "endOffset": 30}, {"referenceID": 20, "context": ", and the work of CKR [30, 23] by Serafini et al.", "startOffset": 22, "endOffset": 30}, {"referenceID": 2, "context": "∀∃ rules, TGDs, Datalog+- rules Query answering over rules with universal existential quantifiers in the context of databases/KR, where these rules are called tuple generating dependencies (TGDs)/Datalog+- rules, was done by Beeri and Vardi [3] even in the early 80s, where the authors show that the query entailment problem in general is undecidable.", "startOffset": 241, "endOffset": 244}, {"referenceID": 6, "context": "the resulting models have bounded tree widths, called bounded treewidth sets (BTS), such as Weakly guarded rules [7], Frontier guarded rules [2], (b) fragments called finite unification sets (FUS), such as ‘sticky’ rules [6, 17], and (c) fragments called finite extension sets (FES), where sufficient conditions are enforced to ensure finiteness of the chase and its termination.", "startOffset": 113, "endOffset": 116}, {"referenceID": 1, "context": "the resulting models have bounded tree widths, called bounded treewidth sets (BTS), such as Weakly guarded rules [7], Frontier guarded rules [2], (b) fragments called finite unification sets (FUS), such as ‘sticky’ rules [6, 17], and (c) fragments called finite extension sets (FES), where sufficient conditions are enforced to ensure finiteness of the chase and its termination.", "startOffset": 141, "endOffset": 144}, {"referenceID": 5, "context": "the resulting models have bounded tree widths, called bounded treewidth sets (BTS), such as Weakly guarded rules [7], Frontier guarded rules [2], (b) fragments called finite unification sets (FUS), such as ‘sticky’ rules [6, 17], and (c) fragments called finite extension sets (FES), where sufficient conditions are enforced to ensure finiteness of the chase and its termination.", "startOffset": 221, "endOffset": 228}, {"referenceID": 15, "context": "the resulting models have bounded tree widths, called bounded treewidth sets (BTS), such as Weakly guarded rules [7], Frontier guarded rules [2], (b) fragments called finite unification sets (FUS), such as ‘sticky’ rules [6, 17], and (c) fragments called finite extension sets (FES), where sufficient conditions are enforced to ensure finiteness of the chase and its termination.", "startOffset": 221, "endOffset": 228}, {"referenceID": 11, "context": "Weak acyclicity [13, 11], was one of the first such notions, and was extended to joint acyclicity [24], super weak acyclicity [26], and model faithful acyclicity [9].", "startOffset": 16, "endOffset": 24}, {"referenceID": 10, "context": "Weak acyclicity [13, 11], was one of the first such notions, and was extended to joint acyclicity [24], super weak acyclicity [26], and model faithful acyclicity [9].", "startOffset": 16, "endOffset": 24}, {"referenceID": 21, "context": "Weak acyclicity [13, 11], was one of the first such notions, and was extended to joint acyclicity [24], super weak acyclicity [26], and model faithful acyclicity [9].", "startOffset": 98, "endOffset": 102}, {"referenceID": 23, "context": "Weak acyclicity [13, 11], was one of the first such notions, and was extended to joint acyclicity [24], super weak acyclicity [26], and model faithful acyclicity [9].", "startOffset": 126, "endOffset": 130}, {"referenceID": 8, "context": "Weak acyclicity [13, 11], was one of the first such notions, and was extended to joint acyclicity [24], super weak acyclicity [26], and model faithful acyclicity [9].", "startOffset": 162, "endOffset": 165}], "year": 2014, "abstractText": "The recent outburst of context-dependent knowledge on the Semantic Web (SW) has led to the realization of the importance of the quads in the SW community. Quads, which extend a standard RDF triple, by adding a new parameter of the ‘context’ of an RDF triple, thus informs a reasoner to distinguish between the knowledge in various contexts. Although this distinction separates the triples in an RDF graph into various contexts, and allows the reasoning to be decoupled across various contexts, bridge rules need to be provided for inter-operating the knowledge across these contexts. We call a set of quads together with the bridge rules, a quad-system. In this paper, we discuss the problem of query answering over quad-systems with expressive forall-existential bridge rules. It turns out the query answering over quad-systems is undecidable, in general. We derive a decidable class of quad-systems, namely context-acyclic quadsystems, for which query answering can be done using forward chaining. Tight bounds for data and combined complexity of query entailment has been established for the derived class.", "creator": "dvips(k) 5.991 Copyright 2011 Radical Eye Software"}}}