{"id": "1409.7985", "review": {"conference": "AAAI", "VERSION": "v1", "DATE_OF_SUBMISSION": "29-Sep-2014", "title": "The Utility of Text: The Case of Amicus Briefs and the Supreme Court", "abstract": "We jeannette explore the idea that authoring dehydrates a 39,063 piece of text twin-engine is wodder an adé act of ji-won maximizing one ' tuffah s expected utility. maitres To make this idea undisguised concrete, slavophile we consider the cookstoves societally palatal important decisions 1.5475 of 6,230 the hi-8 Supreme Court of the 740il United superelit States. Extensive past löwenheim work in sarang quantitative flag-captain political science blatt provides hartwell a framework sapar for whitebeam empirically suyo modeling byne the thirdly decisions of huberty justices polson and how they relate to text. nguyên We meyerson incorporate into such cages a model 1,551 texts authored by mumble amici curiae (\" cauchi friends amphibious of immunocompetent the court \" mayport separate dabar from the jasman litigants) sharana who 1.225 seek to 129-run weigh in astv on 816-822-1444 the napoleonville decision, milder then elzahabi explicitly model their goals sourthern in 681,000 a duaij random curial utility valledupar model. fernando We hens demonstrate the benefits of this pianka approach edwardians in blueback improved vote dhirubhai prediction 3,326 and the mielziner ability to goads perform wauters counterfactual analysis.", "histories": [["v1", "Mon, 29 Sep 2014 03:04:26 GMT  (1409kb,D)", "https://arxiv.org/abs/1409.7985v1", "Working draft"], ["v2", "Tue, 30 Sep 2014 14:54:53 GMT  (1409kb,D)", "http://arxiv.org/abs/1409.7985v2", "Working draft"], ["v3", "Tue, 7 Oct 2014 18:47:43 GMT  (1409kb,D)", "http://arxiv.org/abs/1409.7985v3", "Working draft"], ["v4", "Fri, 10 Oct 2014 00:20:33 GMT  (1409kb,D)", "http://arxiv.org/abs/1409.7985v4", "Working draft"], ["v5", "Tue, 25 Nov 2014 21:29:15 GMT  (2424kb,D)", "http://arxiv.org/abs/1409.7985v5", "Working draft"]], "COMMENTS": "Working draft", "reviews": [], "SUBJECTS": "cs.CL cs.AI cs.GT cs.LG", "authors": ["yanchuan sim", "bryan r routledge", "noah a smith"], "accepted": true, "id": "1409.7985"}, "pdf": {"name": "1409.7985.pdf", "metadata": {"source": "META", "title": "The Utility of Text: The Case of Amicus Briefs and the Supreme Court", "authors": ["Yanchuan Sim", "Bryan R. Routledge", "Noah A. Smith"], "emails": ["ysim@cs.cmu.edu", "routledge@cmu.edu", "nasmith@cs.cmu.edu"], "sections": [{"heading": "1 Introduction", "text": "Some pieces of text are written with clear goals in mind. Economists and game theorists use the word utility for the concept of satisfying a need or desire, and a huge array of theories and models are available for analyzing how utilityseeking agents behave. This paper takes the first steps in incorporating text into these models.\nThe Supreme Court of the United States (SCOTUS) is the highest court in the American judicial system; its decisions have far-reaching effects. While the ideological tendencies of SCOTUS’ nine justices are widely discussed by press and public, there is a formal mechanism by which organized interest groups can lobby the court on a given case. These groups are known as amici curiae (Latin for “friends of the court,” hereafter “amici,” singular “amicus”), and the textual artifacts they author—known as amicus briefs—reveal explicit attempts to sway justices one way or the other. Taken alongside voting records and other textual artifacts that characterize a case, amicus briefs provide a fascinating setting for empirical study of influence through language.\nWe build on well-established methodology from political science known as ideal points for analyzing votes. Specifically, Lauderdale and Clark (2014) combined descriptive text and ideal points in a probabilistic topic model. Although the influence of amici has been studied extensively by legal scholars (Collins 2008), we are the first to incorporate them into ideal points analysis (§2). Drawing on decision theory, Copyright c© 2015, Association for the Advancement of Artificial Intelligence (www.aaai.org). All rights reserved.\nwe then posit amici as rational agents seeking to maximize their expected utility by framing their arguments to influence justices toward a favorable outcome (§3). We derive appropriate inference and parameter estimation procedures (§4).\nOur experiments (§5) show that the new approach offers substantial gains in vote prediction accuracy. More importantly, we show how the model can be used to answer questions such as: How effective were amici on each side of a case? What would have happened if some or all amicus briefs were not filed? How might an amicus have changed her brief to obtain a better outcome? Since our approach characterizes the amicus brief as a (probabilistic) function of the case parameters, our approach could also be used to ask how the amici would have altered their briefs given different merits facts or a different panel of justices. Although we focus on SCOTUS, our model is applicable to any setting where textual evidence for competing goals is available alongside behavioral response.\nSCOTUS Terminology. SCOTUS reviews the decisions of lower courts and (less commonly) resolves disputes between states.1 In a typical case, the petitioner writes a brief putting forward her legal argument; the respondent (the other party) then files a brief. These, together with a round of responses to each other’s initial briefs, are collectively known as merits briefs. Amicus briefs—further arguments and recommendations on either side—may be filed by groups with an interest (but not a direct stake) in the outcome, with the Court’s permission. After oral arguments (not necessarily allotted for every case) conclude, the justices vote and author one or more opinions. In this paper, we relate the votes of justices to merits and amicus briefs."}, {"heading": "2 Ideal Point Models", "text": "Ideal point (IP) models are a mainstay in quantitative political science, often applied to voting records to place voters (lawmakers, justices, etc.) in a continuous space. A justice’s “ideal point” is a latent variable positioning her in this space.\nUnidimensional Ideal Points The simplest model for judicial votes is a unidimensional IP model (Martin and Quinn\n1Details about the procedures and rules of the SCOTUS can be found at http://www.uscourts.gov.\nar X\niv :1\n40 9.\n79 85\nv5 [\ncs .C\nL ]\n2 5\nN ov\n2 01\n4\n2002), which posits an IP ψj ∈ R for each justice j.2 Often the ψj values are interpreted as positions along a liberal-conservative ideological spectrum. Each case i is represented by popularity (ai) and polarity (bi) parameters.3 A probabilistic view of the unidimensional IP model is that justice j votes in favor of case i’s petitioner with probability\np(vi,j = petitioner | ψj , ai, bi) = σ (ai + ψjbi)\nwhere σ(x) = exp(x)1+exp(x) is the logistic function. When the popularity parameter ai is high enough, every justice is more likely to favor the petitioner. The polarity bi captures the importance of the justice’s ideology ψj : more polarizing cases (i.e., |bi| 0) push justice j more strongly to the side of the petitioner (if bi has the same sign as ψj) or the respondent (otherwise). While they recover dimensions that maximize statistical fit, IP models conflate many substantive dimensions of opinion and policy, making it difficult to interpret additional dimensions.4 Indeed, such embeddings are ignorant of the issues at stake, or any content of the case, and they cannot generalize to new cases.\nIssues and Ideal Points Lauderdale and Clark (2014) incorporate text as evidence and infer dimensions of IP that are grounded in “topical” space. They build on latent Dirichlet allocation (LDA; see Blei, Ng, and Jordan 2003), a popular model of latent topics or themes in text corpora. In their model, each case i is embedded as θi in a D-dimensional simplex; the dth dimension θi,d corresponds to the proportion of case i that is about issue (or, in LDA terminology, topic) d. The probability of justice j’s vote is given by\np(vi,j = petitioner | ψj ,θi, ai, bi) = σ ( ai +ψ > j (biθi) ) where ψj,d is an issue-specific position for justice j. Therefore, the relative degree that each dimension predicts the vote outcome is determined by the text’s mixture proportions, resulting in the issue-specific IP ψ>j θi. In their work, they inferred the mixture proportions from justices’ opinions, although one can similarly use merits briefs, appeals court opinions, or any other texts that serve as evidence for inferring the issues of a case.\nLauderdale and Clark (2014) found that incorporating textual data in this manner5 addresses the labeling problem for multidimensional models, and is especially useful for small voting bodies (e.g., SCOTUS), where estimating multidimensional models is difficult due to few observations and variation of preferences across issues.\n2Martin and Quinn (2002) describe a dynamic unidimensional IP model where justice IPs vary over time. In this work, we assume each justice’s IP is fixed over time, for simplicity.\n3This model is also known as a two parameter logistic model in item response theory literature (Fox 2010), where ai is “difficulty” and bi is “discrimination.”\n4A seminal finding of Poole and Rosenthal (1985) is that two dimensions, corresponding to left-right ideology and geographical latitude, explain most of the variance in U.S. Congressional votes.\n5Of course, LDA is not the only way to “embed” a case in a simplex. One can take advantage of expert categorization of case issues. For example, Gerrish and Blei (2012) used bill labels as supervision to infer the proportions of issues.\nAmici and Ideal Points The merits briefs describe the issues and facts of the case. It is our hypothesis that amicus briefs serve to “frame” the facts and, potentially, influence the case outcome. Collins (2008) argued that these organized interest groups play a significant role in shaping justices’ choices. Public interest groups, such as the ACLU and Citizens United, frequently advocate their positions on any case that impinges on their goals. These briefs can provide valuable assistance to the Court in its deliberation; for example, they can present an argument not found in the merits.6\nWhen filing amicus briefs, amici are required to identify the side they are supporting (or if neither). However, it is not trivial to automatically tell which side the amici are on as these intentions are not expressed consistently. We solve this by training a classifier on hand-labeled data (§4).\nWe propose that amici represent an attempt to shift the position of the case by emphasizing some issues more strongly or framing the case distinctly from the perspectives given in the merits briefs. The effective position of a case, previously biθi, is in our model biθi+c p i∆ p i+c r i∆ r i, where c p i and c r i are the amicus polarities for briefs on the side of the petitioner and respondent. ∆pi and ∆ r i are the mean issue proportions of the amicus briefs on the side of the petitioner and respondent, respectively. Our amici-augmented IP model is:\np(vi,j = petitioner | ψj ,θi,∆i, ai, bi, ci) = σ ( ai +ψ > j ( biθi + c p i∆ p i + c r i∆ r i )) (1)\nIn this model, the vote-specific IP is influenced by two forms of text: legal arguments put forth by the parties involved (merits briefs, embedded in θi), and by the amici curiae (amicus briefs, embedded in ∆{p,r}i ), both of which are rescaled independently by the case discrimination parameters to generate the vote probability. When either |cpi | or |cri| is large (relative to ai and bi), the vote is determined by the contents of the amicus briefs. Hereafter, we let κi = 〈ai, bi, cpi , cri〉.\nBy letting ∆si be the average mixture proportions inferred from text of briefs supporting side s, we implicitly assume that briefs supporting the same side share a single parameter, and individual briefs on one side influence the vote-specific IP equally. While Lynch (2004) and others have argued that some amici are more effective (i.e., influence on justices’ votes varies across amicus authors), our model captures the collective effect of amicus briefs and is simple."}, {"heading": "3 Amici as Agents", "text": "In the previous section, the IP models focus on justices’ positions embedded in a continuous space. However, we want to account for the fact that amici are purposeful decision makers who write briefs hoping to sway votes on a case. Suppose we have an amicus curiae supporting side s (e.g., petitioner), which is presided by a set of justices, J. The amicus is interested in getting votes in favor of her side, that is, vj = s. Thus, we assume that she has a simple evaluation\n6On occasion, SCOTUS may adopt a position not advanced by either side, but instead urged solely by an amicus brief. Some notable cases are: Mapp v. Ohio, 367 U.S. 643, 646 (1961) and more recently, Turner v. Rogers, 131 S. Ct. 2507 (2011).\nfunction over the outcome of votes v1, . . . , v9, u(v1, v2, . . . , v9) = ∑ j∈J I(vj = s), (2)\nwhere I is the indicator function. This is her utility.\nCost of writing. In addition to the policy objectives of an amicus, we need to characterize her “technology” (or “budget”) set. We do this by specifying a cost function, C, that is increasing in difference between ∆ and the “facts” in θ:\nC(∆,θ) = ξ2‖∆− θ‖ 2 2\nwhere ξ > 0 is a hyperparameter controlling the cost (relative to the vote evaluation). The function captures the notion that amicus briefs cannot be arbitrary text; there is disutility or effort required to carefully frame a case, or the monetary cost of hiring legal counsel. The key assumption here is that framing is costly, while simply matching the merits is easy (and presumably unnecessary). Note the role of the cost function is analogous to regularization in other contexts.\nExpected utility. The outcome of the case is uncertain, so the amicus’ objective will consider her expected utility:7\nmax ∆\nE∆[u(v1, . . . , v9)]− ξ2‖∆− θ‖ 2 2\nWhen an amicus writes her brief, we assume that she has knowledge of the justices’ IPs, case parameters, and contents of the merits briefs, but ignores other amici.8 As such, taking linearity of expectations, we can compute the expected utility for an amicus on side s using Eq. 1:9\nmax ∆\n∑ j∈J σ ( a+ψ>j (bθ + c s∆) ) − ξ2‖∆− θ‖ 2 2\nRandom utility models. There are several conceivable ways to incorporate amici’s optimization into our estimation of justices’ IP. We could maximize the likelihood and impose a constraint that ∆ solve our expected utility optimization (either directly or by checking the first order conditions).10 Or, we can view such (soft) constraints as imposing a prior on ∆:\nputil(∆) ∝ E∆[u(v1, . . . )] + ξ(1− 12‖∆− θ‖ 2 2) (3)\n7We use an evaluation function that is linear in votes for simplicity. The scale of the function is unimportant (expected utility is invariant to affine transformations). However, we leave for future work other specifications of the evaluation function; for example a function that places more emphasis on the majority vote outcome.\n8Capturing strategic amici agents (a petitioner amicus choosing brief topics considering a respondent amicus’ brief) would require a complicated game theoretical model and, we conjecture, would require a much richer representation of policy and goals.\n9The first-order conditions for amicus’ purposeful maximization with respect to ∆ lead to interesting brief writing trade offs, which can be found in supplementary §A.\n10This is reminiscent of learning frameworks where constraints are placed on the posterior distributions (Chang, Ratinov, and Roth 2007; Ganchev et al. 2010; McCallum, Mann, and Druck 2007). However, the nonlinear nature of our expectations makes it difficult to optimize and characterize the constrained distribution.\nwhere the constant is added so that putil is non-negative. Note, were the utility negative, the amici would have chosen not to write a the brief. This approach is known as a random utility model in the econometrics discrete-choice literature (McFadden 1974). Random utility models relax the precision of the optimization by assuming that agent preferences also contain an idiosyncratic random component. Hence, the behavior we observe (i.e., the amicus’ topic mixture proportions) has a likelihood that is proportional to expected utility. Considering all the amici, we estimate the full likelihood\nL(w,v,ψ,θ,∆,κ)× [∏ k∈A putil(∆k) ]η\n(4)\nwhere L(·) is the likelihood of our amici IP model (Eq. 1), and η is a hyperparameter that controls influence of utility on parameter estimation.\nEq. 4 resembles product of experts model (Hinton 2002). For the likelihood of votes in a case to be maximized, it is necessary that no individual component—generative story for votes, amicus briefs—assigns a low probability. Accordingly, this results in a principled manner for us to incorporate our assumptions about amici as rational decision makers, each of whom is an “expert” with the goal of nudging latent variables to maximize her own expected utility."}, {"heading": "4 Learning and Inference", "text": "Model priors. The models we described above combine ideal points, topic models, and random utility; they can be estimated within a Bayesian framework. Following Lauderdale and Clark (2014), we place Gaussian priors on the justice and case parameters: ρ ∼ U(0, 1), ψj ∼ N(0, λI + ρ1) for each justice j, and κi ∼ N(0,σ) for each case i. The positive off-diagonal elements of the covariance matrix for justice IPs orient the issue-specific dimensions in the same direction (i.e., with conservatives at the same end) and provide shrinkage of IP in each dimension to their common mean across dimensions. Fig. 1 presents the plate diagram for the IP models (§2) on the left and the random utility model (§3) on the right.\nFor the non-utility IP models involving text (§2), LDA is used to infer the latent topic mixtures of text associated with the case and amicus briefs, thus θi and ∆k are both drawn from a symmetric Dirichlet distribution with hyperparameter α and tokens in both sets of texts are drawn from shared topic-word distributions.11\nOur random utility model can be described through a similar generative story. Instead of drawing amicus briefs (∆) from a Dirichlet, they are drawn from the expected utility distribution (Eq. 3). The right side of Fig. 1 shows the corresponding plate diagram. Importantly, note that ∆ here serves as direct evidence for the justice and case parameters, rather than influencing them through v-structures.\nParameter estimation. We decoupled the estimation of the topic mixture parameters as a stage separate from the IP parameters. This approach follows Lauderdale and Clark (2014), who argued for its conceptual simplicity: the text data define the rotation of a multidimensional preference space, while the second stage estimates the locations in that space. We found in preliminary experiments that similar issue dimensions result from joint vs. stage-wise inference, but that the latter is much more computationally efficient.\nUsing LDA,12 θ (and, where relevant, ∆) are estimated, then fixed to their posterior means while solving for justice parameters ψ and case parameters κ. For the second stage, we used Metropolis within Gibbs (Tierney 1994), a hybrid MCMC algorithm, to sample the latent parameters from their posterior distributions. We sampled κi for each case and ψj for each justice blockwise from a multivariate Gaussian proposal distribution, tuning the diagonal covariance matrix to a target acceptance rate of 15–45%. Likewise, ρ is sampled from a univariate Gaussian proposal, with its variance tuned similarly. For our random utility model, we used the same MCMC approach in sampling the latent IRT variables, but include the expected utility term for each brief in the likelihood function (eq. 4). Details of our sampler and hyperparameter settings can be found in the supplementary materials (§B), while topics and justices’ IPs estimated by our model are found in §D and §E, respectively.\nData. We focused on 23 terms of the Court from 1990– 2012 (Spaeth et al. 2013),13 using texts from LexisNexis.14 We concatenate each of the 2,074 cases’ merits briefs from both parties to form a single document, where the text is used to infer the representation of the case in topical space (θ; i.e., merits briefs are treated as “facts of the case”). We did not make use of case opinions as did Lauderdale and Clark (2014) because opinions are written after votes are\n11We omit details of LDA, as it is widely known. 12We used the C++ implementation of LDA by Liu et al. (2011). 13The unit of analysis is the case citation, and we select cases where the type of decision equals 1 (orally argued cases with signed opinions), 5 (cases with equally divided vote), 6 (orally argued per curiam cases), or 7 (judgements of the Court). In addition, we dropped cases where the winning side was not clear (i.e., coded as “favorable disposition for petitioning party unclear”).\n14http://www.lexisnexis.com\ncast, tainting the data for predictive modeling. Each amicus brief is treated as a single document.\nAs the amicus briefs in our dataset were not explicitly labeled with the side that they support, and manually labeling each brief would be a tedious endeavor, we built a classifier to automatically label the briefs with the side the amici are supporting, taking advantage of cues in the brief content that strongly signal the side that the amici is supporting (e.g., “in support of petitioner” and “affirm the judgement”).\nAdditionally, we find that using only phrases (instead of standard bag-of-words) gave us more interpretable topics (Sim et al. 2013). Details of our phrase extraction, data preprocessing steps, and brief “side” classification are in the supplementary materials (§C)."}, {"heading": "5 Experiments and Analysis", "text": ""}, {"heading": "5.1 Vote Prediction", "text": "We evaluate each model’s ability to predict how justices would vote on a case out of the training sample. To compute the probability of justices’ votes, we first infer the topic mixture proportions for the case’s merits briefs (θ), and amicus briefs (∆). Given all the justice’s IPs ψj , we find the most likely vote outcome for the case by integrating over the case parameters κ:\narg max v\n∫ κ p(κ | σ) ∏ j∈J p(vj | ψj ,θ,∆,κ)\n× ∏ k∈A putil(∆k | ψ,θ,∆,κ, sk)\nwhere sk is the side brief k supports, and the multiplier is the expected utility term (Eq. 3) which is ignored for the non-utility based models.\nDue to the specification of IP models, the probability of a vote is a logistic function of the vote-specific IP, which is a symmetric function implying that justice j’s probability of voting towards the petitioner will be the same as if she voted for the respondent when we negate the vote-specific IP. Thus, we would not be able to distinguish the actual side that the justice will favor, but we can identify the most likely partitioning of the justices into two groups.15 We can then evaluate, for each case, an average pairwise accuracy score,(\n9 2 )−1∑ j,j′∈J:j 6=j′ I[I[v̂j = v̂j′ ] = I[v∗j = v∗j′ ]]\nwhere v̂ (v∗) are predicted (actual) votes. We performed 5-fold cross validation, and present the vote partition accuracy in Table 1. We have two naı̈ve baselines, (i) where all justices vote unanimously, and (ii) where\n15Given the partitioning of justices, domain experts should be able to identify the side each group of justices would favor.\nwe trained an `1-regularized logistic regression classifier for each justice using the concatenated topic proportions of θ and ∆ as features for each case. The baselines exhibit similar accuracies, and perform better than when adjusting for issues and/or amici. This suggests that justices’ votes do not always align with their IPs, and that topic models alone may be inadequate for representing IPs. Furthermore, we believe there may be insufficient information to learn the amicus polarity case parameters (cs) in the amici IP model (which is slightly better than the issues IP model). However, in the random utility model, amici-agents-experts weigh in, providing additional signals for estimating these parameters, achieving significantly (paired samples t-test, p < 0.001) better predictive accuracy than the baseline.\nAs an additional qualitative validation of our approach, we compared the log-likelihoods between models that consider vs. ignore amicus briefs. We found correlations with anecdotal evidence of how justices view the influence of amicus briefs (see §F for details)."}, {"heading": "5.2 Post Hoc Analysis of Votes", "text": "On a case level, we can tease apart the relative contribution each textual component to a justice’s decision by analyzing the case parameters learnt by our random utility model. By zeroing out various case parameters, and plotting them, we can visualize the different impact that each type of text has on a justice’s vote-specific IP. For example, Fig. 2 shows the vote-specific IP estimates of justices for the 2011 term death penalty case Maples v. Thomas (132 S. Ct. 912). The issues-\nonly IPs are computed by zeroing out both the amicus polarity parameters (cp and cr). On the other hand, the IP due to amicus briefs supporting Maples (Thomas) is computed by zeroing out only cr (cp). We observe that the issues-only IPs are aligned with each justice’s (widely known) ideological stance on the issue of capital punishment. For instance, the issues-only IPs of Thomas, Scalia, Alito, and Roberts, the strong conservative bloc, favor the respondents (that Maples should not be awarded relief); so did Kennedy, who is widely recognized as the swing justice. When effects of all amicus briefs are taken into account, the justices’ IPs shift toward Maples with varying magnitudes, with the result reflecting the actual ruling (7–2 with Thomas and Scalia dissenting)."}, {"heading": "5.3 Counterfactual Analysis", "text": "Following Pearl (2000), we can query the model and perform counterfactual analyses using the vote prediction algorithm (§5.1). As an illustration, we consider National Federation of Independent Business (NFIB) v. Sebelius (HHS) (132 S. Ct. 2566), a landmark 2011 case in which the Court upheld Congress’s power to enact most provisions of the Affordable Care Act (ACA; “Obamacare”).16\nIn the merits briefs, the topics discussed revolve around interstate commerce and the individual mandate, while there is an interesting disparity in topics between briefs supporting NFIB and HHS.17 Notably, amici supporting NFIB are found, on average, to use language concerning individual mandate, while amici supporting HHS tend to focus more on topics related to interstate commerce. This is commensurate with the main arguments put forth by the litigants, where NFIB was concerned about the overreach of the government in imposing an individual mandate, while HHS argued that healthcare regulation by Congress falls under the Commerce Clause. Our model was most uncertain about Roberts and Kennedy, and wrong about both (Fig. 3 top).\nChoosing sides. The first type of counterfactual analysis that we introduce is, “What if no (or only one side’s) amicus briefs were submitted in the ACA case?” To answer it, we hold the case out of the training set and attempt to predict the votes under the hypothetical circumstances with the random utility model. Fig. 3 (top) shows the resulting IP of hypothetical situations where no amicus briefs were filed, or when only briefs supporting one side are filed. If no amici filed briefs, the model expects that all but Kagan and Sotomayor would favor NFIB, but with uncertainty. With the inclusion of the amicus briefs supporting NFIB, the model becomes more confident that the conservative bloc of the court would vote in favor of NFIB (except for Alito). Interestingly, the model anticipates that the same briefs will turn the liberals away. In contrast, the briefs on HHS’ side have more success in swaying the case in their favor, especially the crucial swing vote of Kennedy (although it turned out that Kennedy sided with the conservative bloc, and Roberts emerged as the deciding vote in HHS favor). Consequently, the model can provide insights about judicial decisions, while postulating different hypothetical situations.\nChoosing what to write. Another counterfactual analysis we can perform, more useful from the viewpoint of the amicus, is, “how should an amicus frame arguments to best achieve her goals?” In the context of our model, such an amicus would like to choose the topic mixture ∆ to maximize her expected utility (Eq. 3). Ideally, one would com-\n16The case attracted much attention, including a record 136 amicus briefs, of which 76 of these briefs are used in our dataset. 58 (of the 76) were automatically classified as supporting NFIB.\n17The merits briefs were estimated at 41% and 20% on the interstate commerce and the individual mandate topics, respectively. NFIB amicus briefs were 15% on interstate commerce and 41% on individual mandate; these figures switch to 36% and 22% for HHS amicus briefs.\npute such a topic mixture by maximizing over both ∆ and vote outcome v, while integrating over the case parameters. We resort to a cheaper approximation: analyzing the filer’s expected utility curve over two particular topic dimensions: the individual mandate and interstate commerce topics. That is, we compute the expected utility curve (see supplementary §G) faced by a single amicus as we vary the topic proportions of individual mandate and interstate commerce topics over multiples of 0.1.\nConsequently, the amicus who supports NFIB can expect to maximize their expected utility (5.2 votes at a cost of 0.21) by “spending” about 70% of their text on individual mandate. On the other hand, the best that an amicus supporting HHS can do is to write a brief that is 80% about interstate commerce, and garner 4.7 votes at a cost of 0.31. We plot the justices’ predicted IPs in Fig. 3 (bottom) using these “best” proportions. The “best” proportions IPs are different (sometimes worse) from that in Fig. 3 (top) because in the latter, there are multiple amici influencing the case parameters (through their utility functions) and other topics are present which will sway the justices. From the perspective of an amicus supporting HHS, the two closest swing votes in the case are Roberts and Kennedy; we know a posteriori that Roberts sided with HHS."}, {"heading": "5.4 Discussion", "text": "Our model makes several simplifying assumptions: (i) it ignores the effects of other amici on a single amicus’ writing; (ii) amici are treated modularly, with a multiplicative effect and no consideration of diminishing returns, temporal ordering, or reputation; (iii) the cost function does not capture the intricacies of legal writing style (i.e., choice of citations, artful language, etc.); (iv) the utility function does\nnot fully capture the agenda of each individual amicus; (v) each amicus brief is treated independently (i.e., no sharing across briefs with the same author), as we do not have access to clean author metadata. Despite these simplifications, the model is a useful tool for quantitative analysis and hypothesis generation in support of substantive research on the judiciary."}, {"heading": "6 Related Work", "text": "Poole and Rosenthal (1985) introduced the IP model, using roll call data to infer latent positions of lawmakers. Since then, many varieties of IP models have been proposed for different voting scenarios: IP models for SCOTUS (Martin and Quinn 2002), multidimensional IP models for Congressional voting (Heckman and Snyder 1996; Clinton, Jackman, and Rivers 2004), grounding multidimensional IP models using topics learned from text of Congressional bills (Gerrish and Blei 2012) and SCOTUS opinions (Lauderdale and Clark 2014).\nAmici have been studied extensively, especially their influence on SCOTUS (Caldeira and Wright 1988; Kearney and Merrill 2000; Collins 2008; Corley, Collins, and Hamner 2013). Collins (2007) found that justices can be influenced by persuasive argumentation presented by organized interests. These studies focus on ideology metadata (liberal/conservative slant of amici, justices, decisions, etc.), disregarding the rich signals encoded in the text of these briefs, whereas we use text as evidence of utility maximizing behavior to study the influence of amicus curiae.\nOur model is also related to Gentzkow and Shapiro (2010) who model the purposeful “slant” of profit-maximizing newspapers looking to gain circulation from consumers with a preference for such slant. More generally, extensive literature in econometrics estimates structural utility-based decisions (Berry, Levinsohn, and Pakes 1995, inter alia).\nIn addition to work on IP models, researchers have used court opinions for authorship (Li et al. 2013) and historical analysis, while oral argument transcripts have been used to study power relationships (Danescu-Niculescu-Mizil et al. 2012; Prabhakaran, John, and Seligmann 2013) and pragmatics (Goldwasser and Daumé III 2014)."}, {"heading": "7 Conclusion", "text": "We have introduced a random utility model for persuasive text; it is similar to a classical generative model and can be estimated using familiar algorithms. The key distinction is that persuasive text is modeled as a function of the addressee and the particulars of the matter about which she is being convinced; authors are agents seeking to maximize their expected utility in a given scenario. In the domain of SCOTUS, this leads to improved vote prediction performance, as the model captures the structure of amicus briefs better than simpler treatments of the text. Secondly, and more importantly, our model is able to address interesting counterfactual questions. Were some amicus briefs not filed, or had they been written differently, or had the facts of the case been presented differently, or had different justices presided, our approach can estimate the resulting outcomes."}, {"heading": "Acknowledgements", "text": "This research was supported in part by an A*STAR fellowship to Y. Sim, NSF grant IIS-1211277, a Google research award, and by computing resources from the Pittsburgh Supercomputing Center.\nAppendices"}, {"heading": "A Brief writing trade offs", "text": "Consider the first-order (or KKT) condition for the purposeful amicus’ maximization w.r.t. the dth issue:18∑\nj∈J σ ′ψj,dc s − ξ(∆d − θd) = ∑ j∈J σ ′ψj,1c s − ξ(∆1 − θ1) if 0 < ∆d < 1\nwhere σ′ is the first order derivative of the vote probability sigmoid function. Optimality drives all topics (with positive weight) to have equal marginal values.19 The marginal value highlights the tradeoffs an amicus faces, in four components: (i) the cost of deviating from the merits, i.e., a large difference between ∆d and θd, is ξ; (ii) a justice whose σ′ is large, i.e., whose vote is uncertain, receives greater attention, in particular (iii) on issues she cares about, i.e., ψj,d is large, with (iv) cs controlling the strength of correspondence to issues justices care about."}, {"heading": "B Likelihood of Random Utility Ideal Point Model", "text": "The likelihood of our amici model with random utility is given below,\np(v, ρ,ψ,a, b, cp, r | λ,θ,∆, s) ∝ ∏ j∈J p(ψj | λ, ρ) ∏ i∈C p(ai, bi, c p, r i | σ)\n× ∏ i∈C ∏ j∈J Vi,j ∏ k∈Ai E[Ui,k]η\nwhere\nVi,j = p(vi,j | ψj ,θi,∆i, ai, bi, cp, ri ) = σ [(1− vi,j)ai\n+(1− vi,j)ψ>j (biθi + c p i∆ p i + c r i∆ r i) ] ,\nσ(x) = exp(x)1+exp(x) is the logistic function, and\nE[Ui,k] = ∑ j∈J σ ( ai +ψ > j (biθi + c si,k i ∆i,k) ) + ξ ( 1− 1\n2 ‖∆i,k − θi‖22 ) 18We consider inner points for clarity; if ∆d = 1, equality is replaced with ≥ (respectively, 0 and ≤). 19Comparing each topic’s proportion to topic 1 is arbitrary. In a D-topic model, the amicus has only D − 1 choices.\nWe add a constant to the expected utility term so that it will always be ≥ 0. During each iteration of Gibbs sampling, we sampled each latent variable ρ,ψj and [ai, bi, c p, r i ] blockwise from the likelihood in turn using the MetropolisHastings algorithm. In each Metropolis-Hastings random walk, we took 500 steps, ignoring the first 250 for burn-in and keeping every 10th step to compute the mean, which we use as our Gibbs update. In total, we performed 2,000 Gibbs iterations over the training data.\nHyperparameters. We fixed the number of topics in our model to 30. For LDA, the symmetric Dirichlet parameter for document-topic and topic-word distributions are 0.1 and 0.001, respectively. For priors on the IP latent variables, we follow the same settings used by Lauderdale and Clark (2014), setting priors on case parameters, σ, to 4.0, and justice IPs component-wise variance, λ to 1.0. In the random utility model, we set both hyperparameters η and ξ to 1."}, {"heading": "C Data", "text": "We tokenized all the texts and tagged the tokens with the Stanford part of speech tagger (Toutanova et al. 2003). We extract n-grams with tags that follow the simple (but effective) pattern (Adjective|Cardinal|Noun)+ Noun (Justeson and Katz 1995), representing each document as a “bag of phrases”, and filtering phrases that appear in less than 25 or more than 3,000 documents obtaining a vocabulary of 55,113 phrase types. Table 2 summarizes details of our corpus.\nWe manually labeled 1,241 randomly selected amicus briefs with its side (petitioner, respondent, neither), and trained a logistic regression classifier20 using lexical and formatting features. We identified 5 sections which are common across almost all briefs and used them as features. The feature templates for our classifier are: 〈w〉, 〈title,w〉, 〈counsel,w〉, 〈introduction,w〉, 〈statement,w〉, 〈conclusion,w〉, where w can be any unigram, bigram, or trigram.\nWe evaluated the performance of our classifier using 5 random splits, with 50% of our data for training, 30% for testing, and 20% for the development set. We tuned the `1-regularization weights on our dev set over the range of\n20We used a C++ implementation of logistic regression classifier available at https://github.com/redpony/creg.\ncoefficients {0.5, 1, 2, 4, 8, 16}. The average accuracy of our classifier is 79.1%. Limiting our evaluation to instances whose posterior probability after classification is greater than 0.8, we obtain 90.0% accuracy and recall of 52.1%. Thus, we used 7,258 (out of 13,162) briefs that were classified as supporting neither side or whose posterior probability is ≤ 0.8 (higher precision at the expense of recall)."}, {"heading": "D Topic Distribution", "text": "Table 3 lists the topics and top phrases estimated from our dataset using LDA."}, {"heading": "E Justices’ Ideal Points", "text": "The ideal points of justices vary depending on the issues. We present the justices’ ideal points for each of the 30 topics in\nFig. 4."}, {"heading": "F Amici Influence on Justices", "text": "Various justices have expressed opinions on the value of amicus briefs. Some justices, such as Scalia, are known to be dubious of amicus briefs, preferring to leave the task of reading these briefs to their law clerks, who will pick out any notable briefs for them.21 In contrast, recent surveys of amicus citation rates in justice opinions have often ranked Sotomayor and Ginsburg among justices who most often cite amici in their opinions (Franze and Anderson 2011; Walsh 2013).\nFor each justice, we compute the difference in vote loglikelihood between the issues IP and random utility IP models, as a (noisy) measure of amici influence. A larger difference in suggests that more of a justice’s decision-making can be explained by the presence of amicus briefs. Table 4 presents these differences, and the rankings are consistent with extant hypotheses noted above. We take this consistency as encouraging, in the spirit of the “preregistered” hypotheses of Sim et al. (2013), but caution that it does not imply a conclusion about causation."}, {"heading": "G Expected utility curve for hypothetical amicus in Obamacare case", "text": "21See Roper v. Simmons, 543 U.S. 551, 617-18 (2005) (Scalia J., dissenting); also, “Dont re-plow the ground that you expect the parties to plow unless you expect the parties to plow with a particularly dull plow” (attributed to Scalia on the California Appellate Law Blog, http://bit.ly/1wOmlRE).\nFig. 5 illustrates the expected utility curve faced by a single amicus as we vary the topic proportions of the individual mandate and interstate commerce topics. The model expects an amicus on NFIB’s side to get more votes and hence, higher utility, as the model expects justices to be in favor of NFIB prior to amici influence.\nWe note that interior solutions for the expected utility optimization only exist when proportions are ∈ (0, 1). During our experiment, we set the proportions of inactive topics to 10−8 instead of 0."}], "references": [], "referenceMentions": [], "year": 2014, "abstractText": "We explore the idea that authoring a piece of text is an act of maximizing one’s expected utility. To make this idea concrete, we consider the societally important decisions of the Supreme Court of the United States. Extensive past work in quantitative political science provides a framework for empirically modeling the decisions of justices and how they relate to text. We incorporate into such a model texts authored by amici curiae (“friends of the court” separate from the litigants) who seek to weigh in on the decision, then explicitly model their goals in a random utility model. We demonstrate the benefits of this approach in improved vote prediction and the ability to perform counterfactual analysis.", "creator": "TeX"}}}