{"id": "1409.1458", "review": {"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "4-Sep-2014", "title": "Communication-Efficient Distributed Dual Coordinate Ascent", "abstract": "modulations Communication remains the most significant bottleneck rolexes in rearwards the performance tuguegarao of heineken distributed kage optimization cardamine algorithms unlikable for large - scale gorham machine božo learning. In 150-day this paper, late-model we propose sse a cgt communication - champasak efficient framework, landreaux CoCoA, denouncing that omak uses crescent local computation in dl&w a primal - dual setting to dauth dramatically reduce the panionios amount uab of necessary wolzien communication. We provide 5.05 a strong convergence rate analysis commisison for this carols class of soejima algorithms, as ofterschwang well crotched as experiments stories on damanhour real - ct2 world harbottle distributed sub-fields datasets with holtzbrinck implementations 9:56 in c-5s Spark. In our moc experiments, zilla we find that shawm as cucchi compared ferrite to voltaire state - of - cognomina the - art mini - oxenbridge batch versions bohne of selina SGD factually and abv SDCA algorithms, dehydrogenation CoCoA khomeyni converges buttresses to canners the rendsburg same. 001 - terengganu accurate solution peafowls quality execrable on börse average awhile 25x spent as lippes quickly.", "histories": [["v1", "Thu, 4 Sep 2014 14:59:35 GMT  (552kb)", "http://arxiv.org/abs/1409.1458v1", null], ["v2", "Mon, 29 Sep 2014 16:07:32 GMT  (187kb)", "http://arxiv.org/abs/1409.1458v2", "NIPS 2014 version, including proofs. Published in Advances in Neural Information Processing Systems 27 (NIPS 2014)"]], "reviews": [], "SUBJECTS": "cs.LG math.OC stat.ML", "authors": ["martin jaggi", "virginia smith", "martin takác", "jonathan terhorst", "sanjay krishnan", "thomas hofmann", "michael i jordan"], "accepted": true, "id": "1409.1458"}, "pdf": {"name": "1409.1458.pdf", "metadata": {"source": "META", "title": "Communication-Efficient Distributed Dual Coordinate Ascent", "authors": ["Martin Jaggi"], "emails": [], "sections": [{"heading": null, "text": "ar X\niv :1\n40 9.\n14 58\nv1 [\ncs .L\nG ]\n4 S"}, {"heading": "1 Introduction", "text": "With the immense growth of available data, developing distributed algorithms for machine learning is increasingly important, and yet remains a challenging topic both theoretically and in practice. On typical real-world systems, communicating data between machines is vastly more expensive than reading data from main memory, e.g. by a factor of several orders of magnitude when leveraging commodity hardware.1 Yet, despite this reality, most existing distributed optimization methods for machine learning require significant communication between workers, often equalling the amount of local computation (or reading of local data). This includes for example popular mini-batch versions of online methods, such as stochastic subgradient (SGD) and coordinate descent (SDCA).\nIn this work, we target this bottleneck. We propose a distributed optimization framework that allows one to freely steer the trade-off between communication and local computation. In doing so, the framework can be easily adapted to the diverse spectrum of available large-scale computing systems, ranging from high-latency commodity clusters to low-latency communication supercomputers or the multi-core setting.\nOur new framework, called COCOA (Communication-efficient distributed dual Coordinate Ascent), supports objectives for linear reguarlized loss minimization, encompassing a broad class of machine learning models. By leveraging the primal-dual structure of these optimization problems, COCOA can effectively combine partial results from local computation while avoiding conflict with updates simultaneously computed on other machines. In each round, COCOA employs steps of an arbitrary dual optimization method on the local data on each machine, in parallel. After that, a single update vector is communicated to the master node. For example, when choosing to perform H iterations (usually order of the data size n) of an online optimization method locally per round, our scheme\n∗Both authors contributed equally. 1On typical computers, the latency for accessing data in main memory is in the order of 100 nanoseconds.\nIn contrast, the latency for sending data over a standard network connection is around 250,000 nanoseconds.\nsaves a factor of H in terms of communication compared to the corresponding naive distributed update scheme (i.e., updating a single point before communication). When processing the same number of datapoints, this is clearly a dramatic savings.\nOur theoretical analysis in Section 4 shows that this significant reduction in communication cost comes with only a very moderate increase in the amount of total computation, in order to reach the same optimization accuracy. The theory shows in general that the distributed COCOA framework will inherit the convergence rate of the internally-used local optimization method. When using SDCA (randomized dual coordinate ascent) as the local optimizer and assuming smooth losses, this convergence rate is geometric.\nIn practice, our experiments with the method implemented on the fault-tolerant Spark platform2 [ZCD+12] confirm both the clock time performance and huge communication savings of the proposed method on a variety distributed datasets. Our experiments consistently show order of magnitude gains over traditional mini-batch methods of both SGD and SDCA, and significant gains over the faster but theoretically less justified local SGD methods.\nRelated Work. As we discuss below (Section 5), our approach is distinguished from recent work on parallel and distributed optimization [Yan13, YZJL13, TBRS13, NRRW11, ZWSL10, BKBG11, MRT14, NC13] in that we provide a general framework for improving the communication efficiency of any dual optimization method. Further, to the best of our knowledge, our work is the first to analyze the convergence rate for an algorithm with this level of communication efficiency, without making data-dependent assumptions. The presented analysis covers the case of smooth losses, but should also be extendable to the non-smooth case. Existing methods using mini-batches [TBRS13, Yan13, TRS14] are closely related, though our algorithm makes significant improvements by immediately applying all updates locally while they are processed, a scheme that is not considered in the classic mini-batch setting. This intuitive modification results in dramatically improved empirical results and also strengthens our theoretical convergence rate. More precisely, the convergence rate shown here only degrades with the number of workers K , instead of with the significantly larger mini-batch-size (typically order n) in the case of mini-batch methods.\nOur method builds on a closely related recent line of work of [Yan13, YZJL13, YHCL10, YHCL12]. We generalize the algorithm of [Yan13, YZJL13] by allowing the use of arbitrary (dual) optimization methods as the local subroutine within our framework. In the special case of using coordinate ascent as the local optimizer, the resulting algorithm is very similar, though with a different computation of the coordinate updates. Moreover, we provide the first theoretical convergence rate analysis for such methods, without making strong assumptions on the data.\nThe proposed COCOA framework in its basic variant is entirely free of tuning parameters or learning rates, in contrast to SGD-based methods. The only choice to make is the selection of the internal local optimization procedure, steering the desired trade-off between communication and computation. When choosing a primal-dual optimizer as the internal procedure, the duality gap readily provides a fair stopping criterion and efficient accuracy certificates during optimization.\nPaper Outline. The rest of the paper is organized as follows. In Section 2 we describe the problem setting of interest. Section 3 outlines the proposed framework, COCOA, and the convergence analysis of this method is presented in Section 4. We discuss related work in Section 5, and compare against several other state-of-the-art methods empirically in Section 6."}, {"heading": "2 Setup", "text": "A large class of methods in machine learning and signal processing can be posed as the minimization of a convex loss function of linear predictors with a convex regularization term:\nmin w∈Rd\n[\nP (w) := λ\n2 ‖w‖2 +\n1\nn\nn∑\ni=1\nℓi(w T xi)\n]\n, (1)\n2 We plan to release our code to be used with the open-source machine-learning library of Spark, MLlib.\nHere the data training examples are real-valued vectors xi ∈ Rd; the loss functions ℓi, i = 1, . . . , n are convex and depend possibly on labels yi ∈ R; and λ > 0 is the regularization parameter. Using the setup of [SSZ13], we assume the regularizer is the ℓ2-norm for convenience. Examples of this class of problems include support vector machines, as well as regularized linear and logistic regression, ordinal regression, and others.\nThe most popular method to solve problems of the form (1) is the stochastic subgradient method (SGD) [RM51, Bot10, SSSSC10]. In this setting, SGD becomes an online method where every iteration only requires access to a single data example (xi, yi), and the convergence rate is wellunderstood.\nThe associated conjugate dual problem of (1) takes the following form, and is defined over one dual variable per each example in the training set.\nmax α∈Rn\n[\nD(α) := − λ\n2 ‖Aα‖2 −\n1\nn\nn∑\ni=1\nℓ∗i (−αi) ] , (2)\nwhere ℓ∗i is the conjugate (Fenchel dual) of the loss function ℓi, and the data matrix A ∈ R d×n collects the (normalized) data examples Ai := 1λnxi in its columns. The duality comes with the convenient mapping from dual to primal variables w(α) := Aα as given by the optimality conditions [SSZ13]. For any configuration of the dual variables α, we have the duality gap defined as P (w(α))−D(α). This gap is a computable certificate of the approximation quality to the unknown true optimum P (w∗) = D(α∗), and therefore serves as a useful stopping criteria for algorithms.\nFor problems of the form (2), coordinate descent methods have proven to be very efficient, and come with several benefits over primal methods. In randomized dual coordinate ascent (SDCA), updates are made to the dual objective (2) by solving for one coordinate completely while keeping all others fixed. This algorithm has been implemented in a number of software packages (e.g. LibLinear [HCL+08]), and has proven very suitable for use in large-scale problems, while giving stronger convergence results than the primal-only methods (such as SGD), at the same iteration cost [SSZ13]. In addition to superior performance, this method also benefits from requiring no stepsize, and having a well-defined stopping criterion given by the duality gap."}, {"heading": "3 Method Description", "text": "The COCOA framework, as presented in Algorithm 1, assumes that the data {(xi, yi)}ni=1 for a regularized loss minimization problem of the form (1) is distributed over K worker machines. We associate with the datapoints their corresponding dual variables {αi}ni=1, being partitioned between the workers in the same way. The core idea is to use the dual variables to efficiently merge the parallel updates from the different workers without much conflict, by exploiting the fact that they all work on disjoint sets of dual variables.\nAlgorithm 1: COCOA: Communication-Efficient Distributed Dual Coordinate Ascent Input: T ≥ 1, scaling parameter 1 ≤ βK ≤ K (default: βK := 1). Data: {(xi, yi)}ni=1 distributed over K machines Initialize: α(0)[k] ← 0 for all machines k, and w (0) ← 0 for t = 1, 2, . . . , T for all machines k = 1, 2, . . . ,K in parallel\n(∆α[k],∆wk) ← LOCALDUALMETHOD(α (t−1) [k] ,w (t−1)) α (t) [k] ← α (t−1) [k] + βK K\n∆α[k] end reduce w(t) ← w(t−1) + βK\nK ∑K k=1 ∆wk\nend\nIn each round, the K workers in parallel perform some steps of an arbitrary optimization method, applied to their local data. This internal procedure tries to maximize the dual formulation (2), only with respect to their own local dual variables. We call this local procedure LOCALDUALMETHOD,\nas specified in the template Procedure A. Our core observation is that the necessary information each worker requires about the state of the other dual variables can be very compactly represented by a single primal vector w ∈ Rd, without ever sending around data or dual variables between the machines.\nProcedure A: LOCALDUALMETHOD: Dual algorithm for prob. (2) on a single coordinate block k\nInput: Local α[k] ∈ Rnk , and w ∈ Rd consistent with other coordinate blocks of α s.t. w = Aα Data: Local {(xi, yi)} nk i=1 Output: ∆α[k] and ∆w := A[k]∆α[k]\nProcedure B: LOCALSDCA: SDCA iterations for problem (2) on a single coordinate block k\nInput: H ≥ 1, α[k] ∈ Rnk , and w ∈ Rd consistent with other coordinate blocks of α s.t. w = Aα Data: Local {(xi, yi)} nk i=1 Initialize: w(0) ← w, ∆α[k] ← 0 ∈ Rnk for h = 1, 2, . . . , H choose i ∈ {1, 2, . . . , nk} uniformly at random\nfind ∆α maximizing −λn2 ‖w (h−1) + 1 λn ∆αxi‖ 2 − ℓ∗i ( − (α (h−1) i +∆α) ) α (h) i ← α (h−1) i +∆α (∆α[k])i ← (∆α[k])i +∆α w (h) ← w(h−1) + 1\nλn ∆αxi\nend Output: ∆α[k] and ∆w := A[k]∆α[k]\nAllowing the subroutine to process more than one local data example per round dramatically reduces the amount of communication between the workers. By definition, COCOA in each outer iteration only requires communication of a single vector for each worker, that is ∆wk ∈ Rd. Further, as we will show in Section 4, COCOA inherits the convergence guarantee of any algorithm run locally on each node in the inner loop of Algorithm 1. We suggest to use randomized dual coordinate ascent (SDCA) [SSZ13] as the internal optimizer in practice, as implemented in Procedure B, and also used in our experiments.\nNotation. In the same way the data is partitioned across the K worker machines, we write the dual variable vector as α = (α[1], . . . ,α[K]) ∈ Rn with the corresponding coordinate blocksα[k] ∈ Rnk such that ∑\nk nk = n. The submatrix A[k] collects the columns of A (i.e. rescaled data examples) which are available locally on the k-th worker. The parameter T determines the number of outer iterations of the algorithm, while when using an online internal method such as LOCALSDCA, then the number of inner iterations H determines the computation-communication trade-off factor."}, {"heading": "4 Convergence Analysis", "text": "Considering the dual problem (2), we define the local suboptimality on each coordinate block as:\nεD,k(α) := max α̂[k]∈R n k D((α[1], . . . , α̂[k], . . . ,α[K]))−D((α[1], . . . ,α[k], . . . ,α[K])), (3)\nthat is how far we are from the optimum on block k with all other blocks fixed. Note that this differs from the global suboptimality maxα̂ D(α̂)−D((α[1], . . . ,α[K])).\nAssumption 1 (Local Geometric Improvement of LOCALDUALMETHOD). We assume that there exists Θ ∈ [0, 1) such that for any given α, LOCALDUALMETHOD when run on block k alone returns a (possibly random) update ∆α[k] such that\nE[ǫD,k((α[1], . . . ,α[k−1],α[k] +∆α[k],α[k+1], . . . ,α[K]))] ≤ Θ · ǫD,k(α). (4)\nNote that this assumption is satisfied for several available implementations of the inner procedure LOCALDUALMETHOD, in particular for LOCALSDCA, as shown in the following Proposition.\nFrom here on, we assume that the input data is scaled such that ‖xi‖ ≤ 1 for all datapoints.\nProposition 1. Assume the loss functions ℓi are (1/γ)-smooth. Then for using LOCALSDCA, Assumption 1 holds with\nΘ =\n(\n1− λnγ\n1 + λnγ\n1\nñ\n)H\n. (5)\nwhere ñ := maxk nk is the size of the largest block of coordinates.\nTheorem 2. Assume that Algorithm 1 is run for T outer iterations on K worker machines, with the procedure LOCALDUALMETHOD having local geometric improvement Θ, and let βK := 1. Further, assume the loss functions ℓi are (1/γ)-smooth. Then the following geometric convergence rate holds for the global (dual) objective:\nE[D(α∗)−D(α(T ))] ≤\n(\n1− (1−Θ) 1\nK\nλnγ\nσ + λnγ\n)T (\nD(α∗)−D(α(0)) ) . (6)\nHere σ is any real number satisfying\nσ ≥ σmin := max α∈Rn\nλ2n2 ∑K k=1‖A[k]α[k]‖ 2 − ‖Aα‖2\n‖α‖2 ≥ 0. (7)\nLemma 3. If K = 1 then σmin = 0. For any K ≥ 1, when assuming ‖xi‖ ≤ 1 ∀i, we have\n0 ≤ σmin ≤ ñ.\nMoreover, if datapoints between different workers are orthogonal, i.e. (ATA)i,j = 0 ∀i, j such that i and j do not belong to the same part, then σmin = 0.\nIf we choose K = 1 then, Theorem 2 together with Lemma 3 implies that\nE[D(α∗)−D(α(T ))] ≤ ΘT ( D(α∗)−D(α(0)) ) ,\nas expected, showing that the analysis is tight in the special case K = 1. More interestingly, we observe that for any K , in the extreme case when the subproblems are solved to optimality (i.e. letting H → ∞ in LOCALSDCA), then the algorithm as well as the convergence rate match that of serial/parallel block-coordinate descent [RT14, RT12].\nNote: If choosing the starting point as α(0) := 0 as in the main algorithm, then it is known that D(α∗)−D(α(0)) ≤ 1 (see e.g. Lemma 20 in [SSZ13])."}, {"heading": "5 Related Work", "text": "Distributed Primal-Dual Methods. Our approach is most closely related to recent work by [Yan13, YZJL13], which generalizes the distributed optimization method for linear SVMs as in [YHCL10] to the primal-dual setting considered here (which was introduced by [SSZ13]). The difference between our approach and the ‘practical’ method of [Yan13] is that our internal steps directly correspond to coordinate descent iterations on the global dual objective (2), for coordinates in the current block, while in [YZJL13, Equation 8] and [Yan13], the inner iterations apply to a slightly different notion of the sub-dual problem defined on the local data. In terms of convergence results, the analysis of [Yan13] only addresses the mini-batch case without local updates, while the more recent paper [YZJL13] shows a convergence rate for a variant of COCOA with inner coordinate steps, but under the unrealistic assumption that the data is orthogonal between the different workers. In this case, the optimization problems become independent, so that an even simpler single-round communication scheme summing the individual resulting models w would give an exact solution. Instead, we show a linear convergence rate for the full problem class of smooth losses, without any assumptions on the data, in the same generality as the non-distributed setting of [SSZ13].\nWhile the experimental results in all papers [YHCL10, Yan13, YZJL13] are encouraging for this type of method, they do not yet provide a quantitative comparison of the gains in communication efficiency, or compare to the analogous SGD schemes that use the same distribution and communication patterns, which is the main goal or our experiments in Section 6. For the special case of linear\nSVMs, the first paper to propose the same algorithmic idea was [YHCL10], which used LibLinear in the inner iterations. However, the proposed algorithm [YHCL10] processes the blocks sequentially (not in the parallel or distributed setting). Also, it is assumed that the subproblems are solved to near optimality on each block before selecting the next, making the method essentially standard block-coordinate descent. While no convergence rate was given, the empirical results in the journal paper [YHCL12] suggest that running LibLinear for just one pass through the local data performs well in practice. Here, we prove this, quantify the communication efficiency, and show that fewer local steps can improve the overall performance. For the LASSO case, [BKBG11] has proposed a parallel coordinate descent method converging to the true optimum, which could potentially also be interpreted in our framework here.\nMini-Batches. Another closely related avenue of research includes methods that use mini-batches to distribute updates. In these methods, a mini-batch, or sample, of the data examples is selected for processing at each iteration. All updates within the mini-batch are computed based on the same fixed parameter vector w, and then these updates are either added or averaged in a reduce step and communicated back to the worker machines. This concept has been studied for both SGD and SDCA, see e.g. [TBRS13, TRS14] for the SVM case. The so called naive variant of [Yan13] is also identical to mini-batch coordinate descent, with a slight scaling difference.\nAs is shown in [Yan13] and below in Section 6, the performance of these algorithms suffers when processing large batch sizes, as they do not take local updates immediately into account. Furthermore, they are very sensitive to the choice of the parameter βb, which controls the magnitude of all updates between βb := 1 for (conservatively) averaging, and βb := b for (aggressively) adding the updates (here we denote b as the size of the selected mini-batch, which can be of size up to n). This instability is illustrated by the fact that even the change of βb := 2 instead of βb := 1 can lead to divergence of coordinate descent (SDCA) in the simple case of just two coordinates [RT13]. In practice it can be very difficult to choose the correct data-dependent parameter βb especially for large mini-batch sizes b ≈ n, as the parameter range spans many orders of magnitude, and directly controls the step size of the resulting algorithm, and therefore the convergence rate [RT13, FQR14]. For sparse data, the work of [RT13, FQR14] gives some data dependent choices of βb which are safe. Known convergence rates for the mini-batch methods degrade with larger batch size b ≈ Θ(n). More precisely, the improvement in objective function per example processed degrades with a factor of βb in [TBRS13, RT13, FQR14]. In contrast, our convergence rate as shown in Theorem 2 only degrades with the much smaller number of worker machines K , which can be a several order of magnitudes smaller than the mini-batch size b.\nSingle Round of Communication. One extreme is to consider methods with only a single round of communication (e.g. one map-reduce operation), as in [ZDW13, ZWSL10, MMM+09]. The output of these methods is the average of K individual models, trained only on the local data from each machine. In [ZDW13], the authors give conditions on the data and computing environment under which these type of one-communication algorithms may be sufficient. In general, however, the true optimum of the original problem (1) is not the average of these K models, no matter how accurately the subproblems are solved [SSZ14].\nNaive Distributed Online Methods, Delayed Gradients, and Multi-Core. On the other extreme, a natural way to distribute updates is to let every machine send updates to the master node (sometimes called the “parameter server”) as soon as they are performed. This is what we call the naive distributed SGD / CD in our experiments. The amount of communication for such naive distributed online methods is the same as the number of data examples processed. In contrast to this, the number of communicated vectors in our method is divided by H , that is the number of inner local steps performed per outer iteration, which can be Θ(n).\nThe early work of [TBA86] introduced the nice framework of gradient updates where the gradients come with some delays, i.e. are based on outdated iterates, and shows some robust convergence rates. In the machine learning setting, [DGBSX12] and the later work of [AD11] have provided more insights into these type of methods. However, these papers study the case of smooth objective functions of a sum structure, and so do not directly apply to general case we consider here. In the same spirit, [NRRW11] implements SGD with communication-intense updates after each example processed, allowing asynchronous updates again within some delay. For coordinate descent, the\nanalogous approach was studied in [LWR+14]. Both methods [NRRW11, LWR+14] are H times less efficient in terms of communication when compared to COCOA, and are designed for multicore shared memory machines (where communication is as fast as memory access). They require the same communication cost as naive distributed SGD / CD, which we include in our experiments in Section 6, and a slightly larger number of iterations due to the asynchronicity. The 1/t convergence rate shown in [NRRW11] only holds under strong sparsity assumptions on the data. A more recent paper [DJM13] deepens the understanding of such methods, but still only applies to very sparse data. For general data, [BBFM12] theoretically shows that 1/ε2 communications rounds of single vectors are enough to obtain ε-quality for linear classifiers, with the rate also growing with K2 in the number of workers. Our new analysis here makes the dependence on 1/ε logarithmic."}, {"heading": "6 Experiments", "text": "In this section, we compare COCOA to traditional mini-batch versions of stochastic dual coordinate ascent and stochastic gradient descent, as well as the locally-updating version of stochastic gradient descent. We implement mini-batch SDCA (denoted mini-batch-CD) as described in [TBRS13, Yan13]. The SGD-based methods are mini-batch and locally-updating versions of Pegasos [SSSSC10], differing only in whether the primal vector is updated locally on each inner iteration or not, and whether the resulting combination/communication of the updates is by an average over the total size KH of the mini-batch (mini-batch-SGD) or just over the number of machines K (local-SGD). For each algorithm, we additionally study the effect of scaling the average by a parameter βK , as first described in [TBRS13], while noting that it is a benefit to avoid having to tune this data-dependent parameter.\nWe apply these algorithms to standard hinge loss ℓ2-regularized support vector machines, using implementations written in Spark on m1.large Amazon EC2 instances [ZCD+12]. Though this nonsmooth case is not yet covered in our theoretical analysis, we still see remarkable empirical performance. Our results indicate that COCOA is able to converge to .001-accurate solutions nearly 25× as fast compared the other algorithms, when all use βK = 1. The datasets used in these analyses are summarized in Table 1, and were distributed among K = 4, 8, and 32 nodes, respectively. We use the same regularization parameters as specified in [SSSSC10, HCL+08].\nIn comparing each algorithm and dataset, we analyze the progress in primal objective value as a function of both time (Figure 1) and communication (Figure 2). For all competing methods, we present the result for the batch size (H) that yields the best performance in terms of reduction in objective value over time. For the locally-updating methods (COCOA and local-SGD), these tend to be larger batch sizes corresponding to processing almost all of the local data at each outer step. For the non-locally updating mini-batch methods, (mini-batch SDCA [TBRS13] and mini-batch SGD [SSSSC10]), these typically correspond to smaller values of H , as averaging the solutions to guarantee safe convergence becomes less of an impediment for smaller batch sizes.\nFirst, we note that there is a clear correlation between the wall-time spent processing each dataset and the number of vectors communicated, indicating that communication has a significant effect on convergence speed. We see clearly that COCOA is able to converge to a more accurate solution in all datasets much faster than the other methods. On average, COCOA reaches a .001-accurate solution for these datasets 25x faster than the best competitor. This is a testament to the algorithm’s ability to avoid communication while still making significant global progress by efficiently combining the local updates of each iteration. The improvements are robust for both regimes n ≫ d and n ≪ d.\nIn Figure 3 we explore the effect of H , the computation-communication trade-off factor, on the convergence of COCOA for the cov dataset on a cluster of 4 nodes. As described above, increasing H decreases communication but also affects the convergence properties of the algorithm. In Figure 4,\nwe attempt to scale the averaging step of each algorithm by using various βK values, for two different batch sizes on the Cov dataset (H = 1e5 and H = 100). We see that though βK has a larger impact on the smaller batch size, it is still not enough to improve the mini-batch algorithms beyond what is achieved by COCOA and local-SGD.\n−6\n10 −4\n10 −2\n10 0\n10 2\nTime (s)\nCOCOA (β k =1) mini−batch−CD (β k =10) local−SGD (β k =1) mini−batch−sgd (β k =10)"}, {"heading": "7 Conclusion", "text": "We have presented a communication-efficient framework for distributed dual coordinate ascent algorithms that can be used to solve large-scale regularized loss minimization problems. This is crucial in settings where datasets must be distributed across multiple machines, and where communication amongst nodes is costly. We have shown that the proposed algorithm performs competitively on real-world, large-scale distributed datasets, and have presented the first theoretical analysis of this algorithm that achieves competitive convergence rates without making additional assumptions on the data itself.\nIt remains open to obtain improved convergence rates for more aggressive updates corresponding to βK > 1, which might be suitable for using the ‘safe’ updates techniques of [TBRS13] and the related expected separable over-approximations of [RT14, RT12], here applied to K instead of n blocks. Furthermore, it remains open to show convergence rates for local SGD in the same communication efficient setting as described here.\nAcknowledgments. We particularly want to thank Sanjay Krishnan for his help, as well as Shivaram Venkataraman, Ameet Talwalkar, and Peter Richtárik for fruitful discussions. MJ acknowledges support by the Simons Institute for the Theory of Computing."}, {"heading": "A Proof of Theorem 2", "text": "In the following, for a given vector α[k] ∈ Rnk , we write α〈[k]〉 ∈ Rn for its zero-padded version which coincides with α[k] on the k-th coordinate block, and is zero everywhere else.\nTheorem’ 2. Assume that Algorithm 1 is run for T outer iterations on K worker machines, with the procedure LOCALDUALMETHOD having local geometric improvement Θ, and let βK := 1. Further, assume the loss functions ℓi are (1/γ)-smooth. Then the following geometric convergence rate holds for the global (dual) objective:\nE[D(α∗)−D(α(T ))] ≤\n(\n1− (1−Θ) 1\nK\nλnγ\nσ + λnγ\n)T (\nD(α∗)−D(α(0)) ) .\nHere σ is any real number satisfying\nσ ≥ σmin := max α∈Rn\nλ2n2 ∑K k=1‖A[k]α[k]‖ 2 − ‖Aα‖2\n‖α‖2 ≥ 0.\nProof. From the definition of the update performed by Algorithm 1 (for the setting of βK := 1), we have α(t+1) = α(t) + 1\nK ∑K k=1 ∆α〈[k]〉. Let us estimate the change of objective function after one\nouter iteration. Then using concavity of D we have\nD(α(t+1)) = D ( α (t) + 1\nK ∑K k=1∆α〈[k]〉\n) = D (\n1 K ∑K k=1(α (t)) + ∆α〈[k]〉\n)\n≥ 1 K ∑K k=1D(α (t)) + ∆α〈[k]〉).\nSubtracting D(α(t)) from both sides and denoting by α̂∗[k] the local maximizer as in (3) we obtain\nD(α(t+1))−D(α(t)) ≥ 1 K ∑K k=1 [ D(α(t) +∆α〈[k]〉)−D(α (t)) ]\n= 1 K ∑K k=1\n[\nD(α(t) +∆α〈[k]〉)−D((α (1) [t] , . . . , α̂ ∗ [k], . . . ,α (K) [t] ))\n+D((α (1) [t] , . . . , α̂ ∗ [k], . . . ,α (K) [t] ))−D(α\n(t)) ]\n(3) = 1\nK ∑K k=1 [ εD,k(α (t))− εD,k(α (t) +∆α〈[k]〉) ] .\nConsidering the expectation of this quantity, we are now ready to use Assumption 1 on the local geometric improvement of the inner procedure. We have\nE[D(α(t+1))−D(α(t)) |α(t)] ≥ 1 K ∑K k=1 E[εD,k(α (t))− εD,k(α (t) +∆α〈[k]〉) |α (t)]\n(4) ≥ 1\nK (1−Θ) ∑K k=1εD,k(α (t)).\nIt remains to bound ∑K\nk=1εD,k(α (t)).\n∑K k=1εD,k(α (t)) (3) = max\nα̂∈Rn\n{ ∑K\nk=1\n[ D((α[1], . . . , α̂[k], . . . ,α[K]))−D((α[1], . . . ,α[k], . . . ,α[K]))\n]}\n(2) = max\nα̂∈Rn\n{ 1 n ∑n i=1(−ℓ ∗ i (−α̂i) + ℓ ∗ i (−α (t) i ))\n+λ2 ∑K k=1\n[\n−‖Aα(t) + A[k](α̂[k] −α (t) [k])‖\n2 + ‖Aα(t)‖2 ]}\n= max α̂∈Rn\n{\nD(α̂)−D(α(t)) + λ2 ‖Aα̂‖ 2 − λ2 ‖Aα (t)‖2\n+λ2 ∑K k=1\n[\n−‖Aα(t) + A[k](α̂[k] −α (t) [k])‖\n2 + ‖Aα(t)‖2 ]}\n= max α̂∈Rn\n{\nD(α̂)−D(α(t)) + λ2\n[ ‖Aα̂‖2 − ‖Aα(t)‖2 ]\n+λ2\n[\n−2(Aα(t))TA(α̂ −α(t))− ∑K k=1‖A[k](α̂[k] −α (t) [k])‖\n2 ]}\n= max α̂∈Rn\n{\nD(α̂)−D(α(t)) + λ2\n[ ‖Aα̂‖2 + ‖Aα(t)‖2 − 2(Aα(t))TAα̂ ]\n+λ2\n[\n− ∑K k=1‖A[k](α̂[k] −α (t) [k])‖\n2 ]}\n= max α̂∈Rn\n{\nD(α̂)−D(α(t)) + λ2\n[ ‖A(α(t) − α̂)‖2 ]\n+λ2\n[\n− ∑K k=1‖A[k](α̂[k] −α (t) [k])‖\n2 ]}\n≥ max α̂∈Rn\n{\nD(α̂)−D(α(t))− σ2λn2 ‖α̂−α (t)‖2\n}\n,\nby the definition (7) of the complexity parameter σ. Now, we can conclude the bound as follows: ∑K\nk=1εD,k(α (t)) ≥ max\nα̂∈Rn\n{\nD(α̂)−D(α(t))− σ2λn2 ‖α̂−α (t)‖2\n}\n≥ max η∈[0,1]\n{\nD(ηα∗ + (1− η)α(t))−D(α(t))− 1\n2\nση2 λn2 ‖α∗ −α(t)‖2\n}\n≥ max η∈[0,1]\n{\nηD(α∗) + (1− η)D(α(t))−D(α(t))\n+ γη(1− η)\n2n ‖α∗ −α(t)‖2 −\n1\n2\nση2 λn2 ‖α∗ −α(t)‖2 }\n≥ max η∈[0,1]\n{\nη(D(α∗)−D(α(t))) + η\n2n\n(\nγ(1− η)− ση\nλn\n) ‖α∗ −α(t)‖2 } .\nChoosing η∗ := λnγ σ+λnγ ∈ [0, 1] gives\n∑K k=1εD,k(α (t)) ≥ λnγ σ+λnγ (D(α ∗)−D(α(t))).\nTherefore, we have\nE[D(α(t+1))−D(α∗) +D(α∗)−D(α(t)) |α(t)] ≥ (1−Θ) 1\nK\nλnγ\nσ + λnγ (D(α∗)−D(α(t))),\nE[D(α∗)−D(α(t+1)) |α(t)] ≤\n[\n1− (1 −Θ) 1\nK\nλnγ\nσ + λnγ\n]\n(D(α∗)−D(α(t))).\nThis implies the claim (6) of the theorem."}, {"heading": "B Proof of Proposition 1", "text": "B.1 Decomposition of the Duality Structure over the Blocks of Coordinates\nThe core concept in our new analysis technique is the following primal-dual structure on each local coordinate block. Using this, we will show below that all steps of LOCALDUALMETHOD can be interpreted as performing coordinate ascent steps on the global dual objective function D(α), with the coordinates changes restricted to the k-th block, as follows.\nFor concise notation, we write {Ik}Kk=1 for the partition of data indices {1, 2, . . . , n} between the workers, such that |Ik| = nk. In other words, each set Ik consists of the indices of the k-th block of coordinates (those with the dual variables α[k] and datapoints A[k], as available on the k-th worker).\nLet us define the local dual problem as\nmax α[k]∈R n k\n[\nDk(α[k];w) := − λ\n2 ‖w +A[k]α[k]‖\n2 − 1\nn\n∑\ni∈Ik\nℓ∗i (−αi) + λ\n2 ‖w‖2\n]\n. (8)\nThe definition is valid for any fixed vector w. Here the reader should think of w as representing the status of those dual variables αi which are not part of the active block k. The idea is the following: For the choice of w := ∑\nk′ 6=k A[k′]α (0) [k′], it turns out that the local dual objective, as a function of\nthe local variables α[k], is identical the global (dual) objective, up to a constant independent of α[k], or formally\nDk(α[k];w) = D ( α (0) [1] , . . . ,α[k], . . . ,α (0) [K] ) + C′ ∀ α[k] ∈ R nk .\nThe following proposition observes that the defined local problem has a very similar duality structure as the original problem (1) with its dual (2).\nProposition 4. For w ∈ Rd, let us define the “local” primal problem on the k-th block as\nmin wk∈Rd\n[\nPk(wk;w) := 1\nn\n∑\ni∈Ik\nℓi((w +wk) T xi) +\nλ 2 ‖wk‖\n2 ]\n. (9)\nThen the dual of this formulation (with respect to the variable wk) is given by the local dual problem (8) for the k-th coordinate block.\nProof. The dual of this problem is derived by plugging in the definition of the conjugate function ℓi((w +wk) T xi) = maxαi −αi(w +wk) T xi − ℓ ∗ i (−αi), which gives\nmin wk∈Rd\n1\nn\n∑\ni∈Ik\nmax αi\n( − αi(w +wk) T xi − ℓ ∗ i (−αi) ) + λ\n2 ‖wk‖\n2\n= 1\nn\n∑\ni∈Ik\nmax αi −ℓ∗i (−αi) + min wk∈Rd\n[\n−αi(w +wk) T xi +\nλ 2 ‖wk‖ 2\n]\n= max α∈Rnk\n1\nn\n∑\ni∈Ik\n−ℓ∗i (−αi) + min wk∈Rd\n[\n− 1\nn\n∑\ni∈Ik\nαi(w +wk) T xi +\nλ 2 ‖wk‖ 2\n]\n.\nThe first-order optimality condition forwk, by setting its derivative to zero in the inner minimization, can be written as\nw ∗ k =\n1\nλn\n∑\ni∈Ik\nαixi = A[k]α[k]\nplugging this back in, we have that the inner minimization becomes\n− λ 1\nλn\n∑\ni∈Ik\nαi(w +w ∗ k) T xi +\nλ 2 ‖w∗k‖ 2\n=− λ(w +w∗k) T w ∗ k +\nλ 2 ‖w∗k‖ 2\nWriting the resulting full problem, we obtain precisely the local dual problem (8) for the k-th coordinate block.\nUsing these local subproblems, we have the following nice structure of local and global duality gaps:\ngk(α) := Pk(wk;w)−Dk(α[k];w) and g(α) := P (w(α))−D(α)\nHere the contributions of all blocks except the active one are collected in w := w−wk. Recall that we defined wk := A[k]α[k] and w := Aα, so that w = ∑K k=1 wk.\nB.2 Local Convergence of LOCALSDCA\nThis section is just a small modification of results obtained in [SSZ13].\nObserve that the coordinate step performed by an iteration of LOCALSDCA can equivalently be written as\n∆α∗i = ∆α ∗ i\n( α\n(h−1) [k] ,w\n) := argmax\n∆αi\n(\nDk(α (h−1) [k] + ei∆αi;w)\n)\n. (10)\nFor a vector w ∈ Rd. In other words, the step will optimize one of the local coordinates with respect to the local dual objective, which is identical to the global dual objective when the coordinates of the other blocks are kept fixed, as we have seen in the previous subsection.\nLemma 5. Assume that ℓ∗i is γ-strongly convex (where γ ≥ 0). Then for all iterations h of LOCALSDCA and any s ∈ [0, 1] we have\nE[Dk(α (h) [k] ;w)−Dk(α (h−1) [k] ;w)] ≥\ns\nnk\n( Pk(w (h−1) k ;w)−Dk(α (h−1) [k] ;w) ) −\ns2\n2λn2 G(h), (11)\nwhere G(h) := 1 nk\n∑\ni∈Ik\n(\n‖xi‖ 2 − λnγ(1−s)\ns\n)\n(u (h) i −α (h−1) i ) 2, −u (h−1) i ∈ ∂ℓi(x T i w (h−1)) and\nw (h−1) = w +A[k]α (h−1) [k] .\nProof.\nn [\nDk(α (h) [k] ;w)−Dk(α (h−1) [k] ;w)\n]\n=−ℓ∗i (−α (h) i )−\nλn\n2 ‖w(h)‖2\n︸ ︷︷ ︸\nA\n−\n(\n−ℓ∗i (−α (h−1) i )−\nλn\n2 ‖w(h−1)‖2\n)\n︸ ︷︷ ︸\nB\n.\nBy the definition of the update (10) we have for all s ∈ [0, 1] that\nA = max ∆αi\n−ℓ∗i (−α (h−1) i −∆αi)−\nλn\n2 ‖w(h−1) +\n1\nλn ∆αixi‖\n2\n≥ −ℓ∗i (−α (h−1) i − s(u (h) i − α (h−1) i ))−\nλn\n2 ‖w(h−1) +\n1\nλn s(u\n(h) i − α (h−1) i )xi‖ 2.\nFrom strong convexity we have\nℓ∗i\n(\n−α (h−1) i − s(u (h) i − α (h−1) i )\n)\n≤ sℓ∗i (−u (h) i ) + (1− s)ℓ ∗ i (−α (h−1) i )−\nγ 2 s(1− s)(u (h) i − α (h−1) i ) 2. (12)\nHence\nA (12) ≥ −sℓ∗i (−u (h) i )− (1 − s)ℓ ∗ i (−α (h−1) i ) + γ\n2 s(1− s)(u\n(h) i − α (h−1) i ) 2\n− λn\n2 ‖w(h−1) +\n1\nλn s(u\n(h) i − α (h−1) i )xi‖ 2\n= −s(ℓ∗i (−u (h) i ) + u (h) i x T i w (h−1)) ︸ ︷︷ ︸\nsℓ(xT i w (h−1))\n+(−ℓ∗i (−α (h−1) i )−\nλn\n2 ‖w(h−1)‖2)\n︸ ︷︷ ︸\nB\n+ s\n2\n(\nγ(1− s)− 1\nλn s‖xi‖\n2\n)\n(u (h) i − α (h−1) i ) 2 + s(ℓ∗i (−α (h−1) i ) + α (h−1) i x T i w (h−1).\nTherefore\nA−B ≥ s [\nℓ(xTi w (h−1)) + ℓ∗i (−α (h−1) i ) + α (h−1) i x T i w (h−1)\n+ 1\n2\n(\nγ(1− s)− 1\nλn s‖xi‖\n2\n)\n(u (h) i − α (h−1) i )\n2 ]\n. (13)\nRecall that our above definition of the local pair of primal and dual problems gives\nPk(wk;w)−Dk(α[k];w) = 1\nn\n∑\ni∈Ik\n( ℓi((w +wk) T xi) + ℓ ∗ i (−αi) + αi(w +wk) T xi ) .\nwhere wk := A[k]α[k].\nIf we take the expectation of (13) we obtain\n1 s E[A−B] ≥ n\nnk\n1\nn\n∑\ni∈Ik\n[\nℓ(xTi w (h−1)) + ℓ∗i (−α (h−1) i ) + α (h−1) i x T i w\n(h−1) ]\n︸ ︷︷ ︸\nPk(w (h−1) k ;w)−Dk(α (h−1) [k] ;w)\n− s\n2λn\n1\nnk\n∑\ni∈Ik\n(\n‖xi‖ 2 −\nλnγ(1− s)\ns\n)\n(u (h) i − α (h−1) i ) 2\n︸ ︷︷ ︸\nG(h)\n.\nTherefore, we have obtained the claimed improvement bound\nn s E[Dk(α (h) [k] ;w)−Dk(α (h−1) [k] ;w)] ≥ n nk (Pk(w (h−1) k ;w)−Dk(α (h−1) [k] ;w))− s 2λn G(h).\nProposition’ 1. Assume the loss functions ℓi are (1/γ)-smooth. Then for using LOCALSDCA, Assumption 1 holds with\nΘ =\n(\n1− λnγ\n1 + λnγ\n1\nñ\n)H\n. (14)\nwhere ñ := maxk nk is the size of the largest block of coordinates.\nLemma 6 (Local Convergence on the Subproblem). For any α(0)[k] ∈ R nk and w ∈ Rd let us define\nα (∗) [k] := argmax\nα[k]∈R n k\nDk(α[k];w). (15)\nIf LOCALSDCA is used for H iterations on block k, then\nE [ Dk(α (∗) [k] ;w)−Dk(α (H) [k] ;w) ] ≤\n(\n1− s\nnk\n)H (\nDk(α (∗) [k] ;w)−Dk(α (0) [k] ;w)\n)\n. (16)\nProof. We will use Lemma 5 with s := λnγ1+λnγ ∈ [0, 1]. Because ‖xi‖ ≤ 1, we have G (h) ≤ 0. Therefore\nE [ Dk(α (h) [k] ;w)−Dk(α (h−1) [k] ;w) ] ≥ s\nnk\n(\nPk(w (h−1) k ;w)−Dk(α (h−1) [k] ;w)\n)\n. (17)\nFollowing the proof of Theorem 5 in [SSZ13] we obtain the claimed bound.\nNow, to prove Proposition 1 it is enough to observe that for fixed k and any α = (α[1], . . . ,α[K]) ∈ R n, assuming we define w = ∑\nk′ 6=k A[k′]α[k′], it holds that\nεD,k(α) (3) = max\nα̂[k]∈R n k\nD((α[1], . . . , α̂[k], . . . ,α[K]))−D((α[1], . . . ,α[k], . . . ,α[K]))\n= D((α[1], . . . ,α (∗) [k] , . . . ,α[K]))−D((α[1], . . . ,α[k], . . . ,α[K]))\n= Dk(α (∗) [k] ;w)−Dk(α[k];w),\nwhere α(∗)[k] is defined by (15)."}, {"heading": "C Proof of Lemma 3", "text": "Lemma’ 3. If K = 1 then σmin = 0. For any K ≥ 1, when assuming ‖xi‖ ≤ 1 ∀i, we have\n0 ≤ σmin ≤ ñ.\nMoreover, if datapoints between different workers are orthogonal, i.e. (ATA)i,j = 0 ∀i, j such that i and j do not belong to the same part, then σmin = 0.\nProof. If K = 1 then α[K] ≡ α and hence σmin = 0. For a non-trivial case, when K > 1 we have\nσmin (7) = max\nα∈Rn λ2n2\n∑K k=1‖A[k]α[k]‖ 2 − ‖Aα‖2\n‖α‖2\n= max α∈Rn\n∑K k=1‖X[k]α[k]‖ 2 − ‖Xα‖2\n‖α‖2\n≤ max α∈Rn\n∑K k=1‖X[k]α[k]‖ 2\n∑K k=1 ‖α[k]‖\n2 ≤ max α∈Rn\n∑K k=1ñ‖α[k]‖ 2\n∑K k=1 ‖α[k]‖\n2 ≤ ñ,\nwhere we have used the definition of the rescaled data matrix A = 1 λn X . The last inequality follows from the fact that since the datapoints have bounded norm ‖xi‖ ≤ 1, so that for all parts k ∈ {1, . . . ,K} we have\nmaxα[k]∈Rnk ‖X[k]α[k]‖\n2\n‖α[k]‖2 = ‖X[k]‖\n2 op ≤ ‖X[k]‖ 2 frob ≤ nk ≤ ñ, where ñ := maxk nk.\nThe case when ATA is block-diagonal (with respect to the partition) is trivial."}], "references": [{"title": "Distributed Delayed Stochastic Optimization", "author": ["Alekh Agarwal", "John C Duchi"], "venue": "In NIPS,", "citeRegEx": "Agarwal and Duchi.,? \\Q2011\\E", "shortCiteRegEx": "Agarwal and Duchi.", "year": 2011}, {"title": "Distributed Learning, Communication Complexity and Privacy", "author": ["Maria-Florina Balcan", "Avrim Blum", "Shai Fine", "Yishay Mansour"], "venue": null, "citeRegEx": "Balcan et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Balcan et al\\.", "year": 2012}, {"title": "Parallel Coordinate Descent for L1-Regularized Loss Minimization", "author": ["Joseph K Bradley", "Aapo Kyrola", "Danny Bickson", "Carlos Guestrin"], "venue": "In ICML,", "citeRegEx": "Bradley et al\\.,? \\Q2011\\E", "shortCiteRegEx": "Bradley et al\\.", "year": 2011}, {"title": "Large-Scale Machine Learning with Stochastic Gradient Descent", "author": ["Léon Bottou"], "venue": "editors, COMPSTAT’2010 - Proceedings of the 19th International Conference on Computational Statistics,", "citeRegEx": "Bottou.,? \\Q2010\\E", "shortCiteRegEx": "Bottou.", "year": 2010}, {"title": "Optimal Distributed Online Prediction", "author": ["Ofer Dekel", "Ran Gilad-Bachrach", "Ohad Shamir", "Lin Xiao"], "venue": "Using Mini-Batches. JMLR,", "citeRegEx": "Dekel et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Dekel et al\\.", "year": 2012}, {"title": "Estimation, Optimization, and Parallelism when Data is Sparse", "author": ["John C Duchi", "Michael I Jordan", "H Brendan Mcmahan"], "venue": "In NIPS,", "citeRegEx": "Duchi et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Duchi et al\\.", "year": 2013}, {"title": "Fast Distributed Coordinate Descent for NonStrongly Convex Losses", "author": ["Olivier Fercoq", "Zheng Qu", "Peter Richtárik"], "venue": null, "citeRegEx": "Fercoq et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Fercoq et al\\.", "year": 2014}, {"title": "A Dual Coordinate Descent Method for Large-scale Linear SVM", "author": ["Cho-Jui Hsieh", "Kai-Wei Chang", "Chih-Jen Lin", "S Sathiya Keerthi", "S Sundararajan"], "venue": "In the 25th International Conference on Machine Learning,", "citeRegEx": "Hsieh et al\\.,? \\Q2008\\E", "shortCiteRegEx": "Hsieh et al\\.", "year": 2008}, {"title": "An Asynchronous Parallel Stochastic Coordinate Descent Algorithm", "author": ["Ji Liu", "Stephen J Wright", "Christopher Ré", "Victor Bittorf", "Srikrishna Sridhar"], "venue": "In ICML,", "citeRegEx": "Liu et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Liu et al\\.", "year": 2014}, {"title": "Efficient Large-Scale Distributed Training of Conditional Maximum Entropy Models", "author": ["Gideon Mann", "Ryan McDonald", "Mehryar Mohri", "Nathan Silberman", "Daniel D Walker"], "venue": null, "citeRegEx": "Mann et al\\.,? \\Q2009\\E", "shortCiteRegEx": "Mann et al\\.", "year": 2009}, {"title": "Distributed Block Coordinate Descent for Minimizing Partially Separable Functions", "author": ["Jakub Marecek", "Peter Richtárik", "Martin Takáč"], "venue": null, "citeRegEx": "Marecek et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Marecek et al\\.", "year": 2014}, {"title": "Efficient parallel coordinate descent algorithm for convex optimization problems with separable constraints: Application to distributed MPC", "author": ["Ion Necoara", "Dragos Clipici"], "venue": "Journal of Process Control,", "citeRegEx": "Necoara and Clipici.,? \\Q2013\\E", "shortCiteRegEx": "Necoara and Clipici.", "year": 2013}, {"title": "Hogwild!: A Lock-Free Approach to Parallelizing Stochastic Gradient Descent", "author": ["Feng Niu", "Benjamin Recht", "Christopher Ré", "Stephen J Wright"], "venue": "In NIPS,", "citeRegEx": "Niu et al\\.,? \\Q2011\\E", "shortCiteRegEx": "Niu et al\\.", "year": 2011}, {"title": "A Stochastic Approximation Method", "author": ["Herbert Robbins", "Sutton Monro"], "venue": "The Annals of Mathematical Statistics,", "citeRegEx": "Robbins and Monro.,? \\Q1951\\E", "shortCiteRegEx": "Robbins and Monro.", "year": 1951}, {"title": "Parallel Coordinate Descent Methods for Big Data Optimization", "author": ["Peter Richtárik", "Martin Takáč"], "venue": null, "citeRegEx": "Richtárik and Takáč.,? \\Q2012\\E", "shortCiteRegEx": "Richtárik and Takáč.", "year": 2012}, {"title": "Distributed Coordinate Descent Method for Learning with Big Data", "author": ["Peter Richtárik", "Martin Takáč"], "venue": "maths.ed.ac.uk,", "citeRegEx": "Richtárik and Takáč.,? \\Q2013\\E", "shortCiteRegEx": "Richtárik and Takáč.", "year": 2013}, {"title": "Iteration complexity of randomized block-coordinate descent methods for minimizing a composite function", "author": ["Peter Richtárik", "Martin Takáč"], "venue": "Mathematical Programming,", "citeRegEx": "Richtárik and Takáč.,? \\Q2014\\E", "shortCiteRegEx": "Richtárik and Takáč.", "year": 2014}, {"title": "Pegasos: Primal Estimated Sub-Gradient Solver for SVM", "author": ["Shai Shalev-Shwartz", "Yoram Singer", "Nathan Srebro", "Andrew Cotter"], "venue": "Mathematical Programming,", "citeRegEx": "Shalev.Shwartz et al\\.,? \\Q2010\\E", "shortCiteRegEx": "Shalev.Shwartz et al\\.", "year": 2010}, {"title": "Stochastic Dual Coordinate Ascent Methods for Regularized Loss Minimization", "author": ["Shai Shalev-Shwartz", "Tong Zhang"], "venue": null, "citeRegEx": "Shalev.Shwartz and Zhang.,? \\Q2013\\E", "shortCiteRegEx": "Shalev.Shwartz and Zhang.", "year": 2013}, {"title": "Communication-Efficient Distributed Optimization using an Approximate Newton-type Method", "author": ["Ohad Shamir", "Nathan Srebro", "Tong Zhang"], "venue": null, "citeRegEx": "Shamir et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Shamir et al\\.", "year": 2014}, {"title": "Distributed asynchronous deterministic and stochastic gradient optimization algorithms", "author": ["J Tsitsiklis", "D Bertsekas", "M Athans"], "venue": "IEEE Transactions on Automatic Control,", "citeRegEx": "Tsitsiklis et al\\.,? \\Q1986\\E", "shortCiteRegEx": "Tsitsiklis et al\\.", "year": 1986}, {"title": "Mini-Batch Primal and Dual Methods for SVMs", "author": ["Martin Takáč", "Avleen Bijral", "Peter Richtárik", "Nathan Srebro"], "venue": "In ICML,", "citeRegEx": "Takáč et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Takáč et al\\.", "year": 2013}, {"title": "Primal-Dual Parallel Coordinate Descent for Machine Learning Optimization", "author": ["Martin Takáč", "Peter Richtárik", "Nathan Srebro"], "venue": null, "citeRegEx": "Takáč et al\\.,? \\Q2014\\E", "shortCiteRegEx": "Takáč et al\\.", "year": 2014}, {"title": "Trading Computation for Communication: Distributed Stochastic Dual Coordinate Ascent", "author": ["Tianbao Yang"], "venue": "In NIPS,", "citeRegEx": "Yang.,? \\Q2013\\E", "shortCiteRegEx": "Yang.", "year": 2013}, {"title": "Large linear classification when data cannot fit in memory", "author": ["Hsiang-Fu Yu", "Cho-Jui Hsieh", "Kai-Wei Chang", "Chih-Jen Lin"], "venue": "In the 16th ACM SIGKDD international conference,", "citeRegEx": "Yu et al\\.,? \\Q2010\\E", "shortCiteRegEx": "Yu et al\\.", "year": 2010}, {"title": "Large Linear Classification When Data Cannot Fit in Memory", "author": ["Hsiang-Fu Yu", "Cho-Jui Hsieh", "Kai-Wei Chang", "Chih-Jen Lin"], "venue": "ACM Transactions on Knowledge Discovery from Data,", "citeRegEx": "Yu et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Yu et al\\.", "year": 2012}, {"title": "On Theoretical Analysis of Distributed Stochastic Dual Coordinate Ascent", "author": ["Tianbao Yang", "Shenghuo Zhu", "Rong Jin", "Yuanqing Lin"], "venue": null, "citeRegEx": "Yang et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Yang et al\\.", "year": 2013}, {"title": "Resilient Distributed Datasets: A Fault-Tolerant Abstraction for In-Memory Cluster Computing", "author": ["Matei Zaharia", "Mosharaf Chowdhury", "Tathagata Das", "Ankur Dave", "Murphy McCauley", "Michael J Franklin", "Scott Shenker", "Ion Stoica"], "venue": null, "citeRegEx": "Zaharia et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Zaharia et al\\.", "year": 2012}, {"title": "Communication-Efficient Algorithms for Statistical Optimization", "author": ["Yuchen Zhang", "John C Duchi", "Martin J Wainwright"], "venue": null, "citeRegEx": "Zhang et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Zhang et al\\.", "year": 2013}, {"title": "Parallelized Stochastic Gradient Descent", "author": ["Martin A Zinkevich", "Markus Weimer", "Alex J Smola", "Lihong Li"], "venue": "NIPS 2010: Advances in Neural Information Processing Systems", "citeRegEx": "Zinkevich et al\\.,? \\Q2010\\E", "shortCiteRegEx": "Zinkevich et al\\.", "year": 2010}], "referenceMentions": [], "year": 2017, "abstractText": "Communication remains the most significant bottleneck in the performance of distributed optimization algorithms for large-scale machine learning. In this paper, we propose a communication-efficient framework, COCOA, that uses local computation in a primal-dual setting to dramatically reduce the amount of necessary communication. We provide a strong convergence rate analysis for this class of algorithms, as well as experiments on real-world distributed datasets with implementations in Spark. In our experiments, we find that as compared to stateof-the-art mini-batch versions of SGD and SDCA algorithms, COCOA converges to the same .001-accurate solution quality on average 25× as quickly.", "creator": "LaTeX with hyperref package"}}}