{"id": "1501.03191", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "13-Jan-2015", "title": "Annotating Cognates and Etymological Origin in Turkic Languages", "abstract": "Turkic kiszewa languages esiliiga exhibit extensive frazer and diverse 47-42 etymological relationships among borey lexical blanda items. honored These relationships tuleh make the Turkic gedung languages promising for exploring waaf automated cammell translation lexicon microhelp induction by polities leveraging babygrande cognate gouges and other etymological horta information. radakovich However, speedvision due chaptalization to ghini the extent one-click and diversity of menier the 43.1 types of riskless relationships karamzin between hofmann words, it aduana is osteitis not longhaired clear how 63.8 to 2.775 annotate such transitions information. In this paper, seders we 15-12 present wolff a thrillseekers methodology for annotating yichang cognates and barile etymological origin possessed in rikishi Turkic languages. Our chagres method tentacular strives to dressmakers balance tapton the amount of research bejesus effort the 888-346-9867 annotator bodgit expends with the upper-surface utility of sayce the headmaster annotations for supporting research on dziady improving octoberfest automated corythosaurus translation lexicon induction.", "histories": [["v1", "Tue, 13 Jan 2015 22:14:57 GMT  (13kb,D)", "http://arxiv.org/abs/1501.03191v1", "5 pages, 8 tables; appeared in Proceedings of the First Workshop on Language Resources and Technologies for Turkic Languages at the Eighth International Conference on Language Resources and Evaluation (LREC'12), pages 47-51, Istanbul, Turkey, May 2012. European Language Resources Association"]], "COMMENTS": "5 pages, 8 tables; appeared in Proceedings of the First Workshop on Language Resources and Technologies for Turkic Languages at the Eighth International Conference on Language Resources and Evaluation (LREC'12), pages 47-51, Istanbul, Turkey, May 2012. European Language Resources Association", "reviews": [], "SUBJECTS": "cs.CL", "authors": ["benjamin s mericli", "michael bloodgood"], "accepted": false, "id": "1501.03191"}, "pdf": {"name": "1501.03191.pdf", "metadata": {"source": "CRF", "title": "Annotating Cognates and Etymological Origin in Turkic Languages", "authors": ["Benjamin S. Mericli", "Michael Bloodgood"], "emails": ["bmericli@umd.edu", "meb@umd.edu"], "sections": [{"heading": "1. Introduction", "text": "Automated translation lexicon induction has been investigated in the literature and shown to be feasible for various language families and subgroups, such as the Romance languages and the Slavic languages (Mann and Yarowsky, 2001; Schafer and Yarowsky, 2002). Although there have been some studies investigating using Swadesh lists of words to identify Turkic language groups and loanword candidates (van der Ark et al., 2007), we are not aware of any work yet on automated translation lexicon induction for the Turkic languages. However, the Turkic languages are well suited to exploring such technology since they exhibit many diverse lexical relationships both within family and to languages outside of the family through loanwords. For the Turkic languages, it is prudent to leverage both cognate information and other etymological information when automating translation lexicon induction. However, we are not aware of any corpora for the Turkic languages that have been annotated for this information in a suitable way to support automatic translation lexicon induction. Moreover, performing the annotation is not straightforward because of the range of relationships that exist. In this paper, we lay out a methodology for performing this annotation that is intended to balance the amount of effort expended by the annotators with the utility of the annotations for supporting computational linguistics research."}, {"heading": "2. Main Annotation System", "text": "We obtained the dictionary of the Turkic languages (Öztopçu et al., 1996). One section of this dictionary contains 1996 English glosses and for each English gloss a corresponding translation in the following eight Turkic languages: Azerbaijani, Kazakh, Kyrgyz, Tatar, Turkish, Turkmen, Uyghur, and Uzbek. Table 1 shows an example for the English gloss ‘alive.’ When a language has an official Latin script, that script is used. Otherwise, the dictionary’s transliteration is shown in parentheses. Our annotation system is to annotate each Turkic word with a two-character code. The first character will be a number indicating which words are cognate with each other and the second character will indicate etymological information. Subsection 2.1.\ndiscusses how to define and annotate cognates and subsection 2.2. discusses how to define and annotate etymological information."}, {"heading": "2.1. Cognates", "text": "According to the Oxford English Dictionary Online1 accessed on February 2, 2012, ‘cognate’ is defined as: “...Of words: Coming naturally from the same root, or representing the same original word, with differences due to subsequent separate phonetic development; thus, English five, Latin quinque, Greek πεντε, are cognate words, representing a primitive *penke.” As this definition shows, shared genetic origin is key to the notion of cognateness. A word is only considered cognate with another if both words proceed from the same ancestor. Nonetheless, in line with the conventions of previous research in computational linguistics, we set a broader definition. We use the word ‘cognate’ to denote, as in (Kondrak, 2001): “...words in different languages that are similar in form and meaning, without making a distinction between borrowed and genetically related words; for example, English ‘sprint’ and the Japanese borrowing ‘supurinto’ are considered cognate, even though these two languages are unrelated.” These broader criteria are motivated by the ways scientists develop and use cognate identification algorithms in natural language processing (NLP) systems. For cross-lingual applications, the advantage of such technology is the ability to identify words for which similarity in meaning can be accurately inferred from similarity in form; it does not matter if the similarity in form is from strict genetic relationship or later borrowing. However, not every pair of apparently similar words will be annotated as cognate. For them to be considered cognates, the differences in form between them must meet a threshold of consistency within the data. We will explain the definitions and rules for the annotators to follow in order to establish such a threshold. First, we elaborate on how our notion of cognate differs from that of strict genetic relation. At a high level, there are two cases to consider: A) where the words involved are native Turkic words, and B) where the words involved are\n1http://www.oed.com/view/Entry/35870?redirectedFrom=cognate\nThis paper was published in Proceedings of the First Workshop on Language Resources and Technologies for Turkic Languages at LREC 2012. Required Publisher Statement: Published with the permission of ELRA. This paper was published within the proceedings of the LREC 2012 Conference. c©1998-2012 ELRA - European Language Resources Association. All rights reserved.\nar X\niv :1\n50 1.\n03 19\n1v 1\n[ cs\n.C L\n] 1\n3 Ja\nn 20\n15\nshared loanwords from non-Turkic languages. Within case A, there are two cases to consider: (A1) genetic cognates; and (A2) intra-family loans. Table 2 shows an example of case A1. This example shows the English gloss ‘one’ for all eight Turkic languages, descended from the same postulated form, *bir, in Proto-Turkic (Róna-Tas, 2006). Case A1 is the strict definition of ‘cognate,’ and these are to be annotated as cognate. Case A2 is for intra-family loans, i.e., a word of ultimately Turkic origin borrowed by one Turkic language from another Turkic language. These cases, contrary to the strict definition, are to be marked as cognate in our system. An example is the modern Turkish neologism almaş ‘alternation, permutation’, incorporated from the Kyrgyz (almaş) ‘change’ (Türk Dil Kurumu, 1942). While rare, it is used today in Turkish scholarly literature to describe concepts in areas such as mathematics and botany. Processing genetic cognates (case A1) and intra-family loans (case A2) differently would have little impact on the success of a crossdictionary lookup system. In fact, accounting for the difference might limit the efficacy of such a system. Also, the time depth of intra-Turkic borrowings may be centuries or mere decades. The more distant the borrowing the more difficult it will be for annotators to distinguish between cases A1 and A2. Hence, instances of case A2 are to be annotated as cognate in our system.2\nCase B is for situations of shared loanwords, where the source of the words is ultimately non-Turkic. There are three subcases: (B1) loanwords borrowed from the same non-Turkic language; (B2) loanwords borrowed from different non-Turkic languages, but of the same ultimate origin; and (B3) loanwords of non-Turkic origin borrowed via another Turkic language. Table 3 shows an example of case B1, the word ‘book,’ borrowed from Arabic in all eight Turkic languages. Table 4 shows an example of case B2, the word ‘ballet,’ borrowed from Russian in all cases except Turkish, where it was borrowed directly from the French. Table 5 shows an example of case B3: the word ‘benefit’ in Kyrgyz was borrowed most likely through Uzbek or Chaghatay (Kirchner, 2006), but the Uzbek word was borrowed from Persian, and ultimately from Arabic. It is difficult and time-consuming for annotators to make these fine-grained distinctions. And again, for computational processing, such distinctions are not expected to be helpful. Hence, all of cases B1, B2, and B3 are to be annotated as cognate in our system. Recall that all our annotations are two-character codes; the first character is a number from one to eight indicating what words are cognate with each other. Table 6 shows the first character of the annotations for the example from Table 1. The words marked with 1 are cognate with each other and the words marked 2 are cognate with each other.\n2For similar reasons, false cognates may be annotated as cognate if the annotator does not have readily available knowledge indicating that they are false cognates. Although this is a potential limitation of our system, it is not clear how to distinguish false cognates from true cognates without significant additional annotation expense."}, {"heading": "2.2. Etymology", "text": "The second character in a word’s annotation indicates a conjecture about etymological origin, e.g., T for Turkic. The decision to annotate word origin is motivated by its value for facilitating the development of technology for cross-language lookup of unknown forms. We therefore take a practical approach, balancing the value of the annotation for this purpose with the amount of effort required to perform the annotation. We have created the following code for annotating etymology:\nT Turkic origin. This includes compound forms and affixed forms whose constituents are all Turkic. For example, the Turkmen for ‘manager’, ýolbaşçy, is marked T because its compound base, ýol with baş, and affix -çy are all Turkic in origin.\nA Arabic origin, to include words borrowed indirectly through another language such as Persian. For example, the word in every Turkic language for ‘book’ is marked A for all eight Turkic languages. Because variations on the Arabic form /kita:b/ exist in every Turkic language, in Persian, and in other languages of the Islamic world, it is difficult to tease out the word’s trajectory into a language such as Kyrgyz. The burden of researching these fine distinctions is not placed on the annotator, as explained below.\nP Persian origin, not including Arabic words possibly borrowed through Persian. An example is the word for ‘color’ in many Turkic languages, from the Persian /ræng/.\nR borrowed from Russian, including words that are ultimately of French origin.\nF French origin, not including ultimately French words borrowed from Russian. Direct French loans occur almost exclusively in Turkish. An example is the word for ‘station’ in Turkish, istasyon.\nE English origin. For example the word for ‘basketball’ in every language.\nI Italian origin. Usually of importance only to specific domains in Turkish.\nG Greek origin. For example, the word in Azerbaijani, Turkish, Turkmen, Uyghur, and Uzbek for ‘box’ comes from the Greek κoυτı.\nC Chinese origin, usually Mandarin and usually of importance only to Uyghur. An example is the word for ‘mushroom’ in Uyghur, (mogu).\nQ unknown or inconclusive origin.\nThe careful reader will have noticed that there is an inconsistency in that words of ultimately Arabic origin borrowed through Persian are marked as A, but words of ultimately French origin borrowed through Russian are marked as R. There are two reasons for this. The first is annotator efficiency. Making the judgment that a word is ultimately of Arabic origin is much easier than having to figure out\nwhether it was borrowed from Arabic or indirectly from Persian. For the Russian/French situation, the distinction is much easier to make. To begin with, the Russian loanwords occur almost exclusively in former USSR languages and the French loanwords occur almost exclusively in Turkish. Also, the orthography often gives clear cues for making this distinction, as Russian loanwords consistently retain characteristically Russian letters."}, {"heading": "2.2.1. Multi-Language Exceptions", "text": "We also define other codes that categorize certain complex words that do not fall into any of the categories described in subsection 2.2.. Other etymological annotation studies, such as the Loanword Typology project and its World Loanword Database (Haspelmath and Tadmor, 2009), have instructed linguists to pass over such complex words and optionally flag them as “contains a borrowed base,” etc. Our annotation system requires that these words, which are very common in Turkic languages, be annotated according to more fine grained categories. The following are our multi-language exception codes:\nX Compound words where the constituents are from different origins. For example, the Tatar word for ‘truck’, (yök mashinası), is to be marked X since it contains Russian-origin (mashina), ’machine, vehicle’ in compound with Tatar (yök), ‘baggage,cargo.’ In contrast, the Turkish compound word for thunder, gök gürlemesi, will be marked T because all of its constituents are Turkish.\nV A verb formed by combining a non-Turkic base with a Turkic auxiliary verb or denominal affix. For example, the verb ‘to repeat’ in Azerbaijani, Tatar, and Turkish, because it consists of a noun borrowed from the Arabic /takra:r/ plus a Turkic auxiliary verb et- or it-.\nN A nominal consisting of a non-Turkic base bearing one or more Turkic affixes, in cases where removing the affixes results in a form that can plausibly be found elsewhere in the data or in a loan language dictionary. For example, the Kazakh word for ‘baker,’ (nawbayshı), is composed of a Persian-origin base, from /na:nva:/, ‘baker’, and a suffix that indicates a person associated with a profession, (-shı). The Turkmen word for ‘baker,’ (çörekçi), on the other hand, will be marked T, because both its base (çörek) and affix (-çi) are Turkic.\nTable 7 shows an example of an entry that has been fully annotated for both cognates and etymology."}, {"heading": "3. Inter-Annotator Agreement", "text": "We pilot-tested our annotation system with two annotators on 400 etymology annotations.3 Both annotators have studied linguistics. Also, both are native English speakers with experience studying or speaking multiple Turkic languages, Persian, and Arabic. Training consisted of studying the authors’ annotation manual and asking any follow-up questions. Both annotators made approximately 240 annotations per hour.\n3Table 8 has 392 entries because the annotators claimed eight entries had multiple translations for the same English gloss.\nTable 8 shows the contingency matrix for annotating the 400 entries.4 From Table 8 it is immediate that agreement is substantial, and when there is disagreement it is largely for the difficult cases of inconclusive origin and the multilanguage exceptions: Q, X, V, and N. We measured interannotator agreement using Cohen’s Kappa (Cohen, 1960) and found Kappa = 0.5927 (95% CI = 0.5192 to 0.6662). If we restrict attention to only the instances where neither of the annotators marked an inconclusive origin or multilanguage exception, then Kappa is 0.9216, generally considered high agreement. This shows that our annotation system is feasible for use and also shows that to improve the system we might focus efforts on finding ways to increase agreement on the annotation of the exceptional cases (Q, X, V, and N)."}, {"heading": "4. Conclusions and Future Work", "text": "The Turkic languages are a promising candidate family of languages to benefit from automated translation lexicon induction. A necessary step in that direction is the creation of annotated data for cognates and etymology. However, this annotation is not straightforward, as the Turkic languages exhibit extensive and diverse etymological relationships among words. Some distinctions are difficult for annotators to make and some are easier. Also, some distinctions are expected to be more useful than others for automating cross-lingual applications among the Turkic languages. We presented an annotation methodology that balances the research effort required of the annotator with the expected value of the annotations. We surveyed and explained the wide range of the most important relationships observed in the Turkic languages and how to annotate them. When we finish the annotations, we would like to make the annotated data available as long as it is legal under copyright laws for us to do so. Finally, we hope that our annotation system and the associated discussion can be useful for other teams that are annotating Turkic resources, and perhaps parts of it can be useful for annotating resources for other language families as well.\n4We left out columns for English, Greek, Italian, and Chinese, which were not relevant for the 50 entries (according to unanimous agreement of our annotators)."}, {"heading": "5. References", "text": "J. Cohen. 1960. A coefficient of agreement for nominal\nscales. Educational and Psychological Measurement, 20:37–46. Martin Haspelmath and Uri Tadmor. 2009. The Loanword Typology project and the World Loanword Database. In Martin Haspelmath and Uri Tadmor, editors, Loanwords in the World’s Languages: A Comparative Handbook, pages 1–34, Berlin. Walter de Gruyter. Mark Kirchner. 2006. Kirghiz. In Lars Johanson and Éva Á. Csató, editors, The Turkic Languages, pages 344–356, New York. Routledge. Grzegorz Kondrak. 2001. Identifying cognates by phonetic and semantic similarity. In Proceedings of the second meeting of the North American Chapter of the Association for Computational Linguistics on Language technologies, NAACL ’01, pages 1–8, Stroudsburg, PA, USA. Association for Computational Linguistics. Gideon S. Mann and David Yarowsky. 2001. Multipath translation lexicon induction via bridge languages. In Proceedings of the second meeting of the North American Chapter of the Association for Computational Linguistics on Language technologies, NAACL ’01, pages 1–8, Stroudsburg, PA, USA. Association for Computational Linguistics. Kurtuluş Öztopçu, Zhoumagaly Abuov, Nasir Kambarov, and Youssef Azemoun. 1996. Dictionary of the Turkic Languages. Routledge, New York. András Róna-Tas. 2006. The reconstruction of ProtoTurkic and the genetic question. In Lars Johanson and Éva Á. Csató, editors, The Turkic Languages, pages 67– 80, New York. Routledge. Charles Schafer and David Yarowsky. 2002. Inducing translation lexicons via diverse similarity measures and bridge languages. In proceedings of the 6th conference on Natural language learning - Volume 20, COLING02, pages 1–7, Stroudsburg, PA, USA. Association for Computational Linguistics. Türk Dil Kurumu. 1942. Felsefe ve Gramer Terimleri. Cumhuriyet Basımevi, Istanbul. René van der Ark, Philippe Mennecier, John Nerbonne, and Franz Manni. 2007. Preliminary identification of language groups and loan words in Central Asia. In Proceedings of the RANLP Workshop on Computational Phonology, pages 12–20, Borovetz, Bulgaria."}], "references": [{"title": "A coefficient of agreement for nominal scales", "author": ["J. Cohen."], "venue": "Educational and Psychological Measurement, 20:37–46.", "citeRegEx": "Cohen.,? 1960", "shortCiteRegEx": "Cohen.", "year": 1960}, {"title": "The Loanword Typology project and the World Loanword Database", "author": ["Martin Haspelmath", "Uri Tadmor."], "venue": "Martin Haspelmath and Uri Tadmor, editors, Loanwords in the World’s Languages: A Comparative Handbook, pages 1–34, Berlin. Walter de Gruyter.", "citeRegEx": "Haspelmath and Tadmor.,? 2009", "shortCiteRegEx": "Haspelmath and Tadmor.", "year": 2009}, {"title": "Kirghiz", "author": ["Mark Kirchner."], "venue": "Lars Johanson and Éva Á. Csató, editors, The Turkic Languages, pages 344–356, New York. Routledge.", "citeRegEx": "Kirchner.,? 2006", "shortCiteRegEx": "Kirchner.", "year": 2006}, {"title": "Identifying cognates by phonetic and semantic similarity", "author": ["Grzegorz Kondrak."], "venue": "Proceedings of the second meeting of the North American Chapter of the Association for Computational Linguistics on Language technologies, NAACL ’01, pages 1–8, Stroudsburg, PA,", "citeRegEx": "Kondrak.,? 2001", "shortCiteRegEx": "Kondrak.", "year": 2001}, {"title": "Multipath translation lexicon induction via bridge languages", "author": ["Gideon S. Mann", "David Yarowsky."], "venue": "Proceedings of the second meeting of the North American Chapter of the Association for Computational Linguistics on Language technologies, NAACL ’01, pages", "citeRegEx": "Mann and Yarowsky.,? 2001", "shortCiteRegEx": "Mann and Yarowsky.", "year": 2001}, {"title": "Dictionary of the Turkic Languages", "author": ["Kurtuluş Öztopçu", "Zhoumagaly Abuov", "Nasir Kambarov", "Youssef Azemoun."], "venue": "Routledge, New York.", "citeRegEx": "Öztopçu et al\\.,? 1996", "shortCiteRegEx": "Öztopçu et al\\.", "year": 1996}, {"title": "The reconstruction of ProtoTurkic and the genetic question", "author": ["András Róna-Tas."], "venue": "Lars Johanson and Éva Á. Csató, editors, The Turkic Languages, pages 67– 80, New York. Routledge.", "citeRegEx": "Róna.Tas.,? 2006", "shortCiteRegEx": "Róna.Tas.", "year": 2006}, {"title": "Inducing translation lexicons via diverse similarity measures and bridge languages", "author": ["Charles Schafer", "David Yarowsky."], "venue": "proceedings of the 6th conference on Natural language learning - Volume 20, COLING02, pages 1–7, Stroudsburg, PA, USA. Association for", "citeRegEx": "Schafer and Yarowsky.,? 2002", "shortCiteRegEx": "Schafer and Yarowsky.", "year": 2002}, {"title": "Felsefe ve Gramer Terimleri", "author": ["Türk Dil Kurumu."], "venue": "Cumhuriyet Basımevi, Istanbul.", "citeRegEx": "Kurumu.,? 1942", "shortCiteRegEx": "Kurumu.", "year": 1942}, {"title": "Preliminary identification of language groups and loan words in Central Asia", "author": ["René van der Ark", "Philippe Mennecier", "John Nerbonne", "Franz Manni."], "venue": "Proceedings of the RANLP Workshop on Computational Phonology, pages 12–20, Borovetz, Bulgaria.", "citeRegEx": "Ark et al\\.,? 2007", "shortCiteRegEx": "Ark et al\\.", "year": 2007}], "referenceMentions": [{"referenceID": 4, "context": "Automated translation lexicon induction has been investigated in the literature and shown to be feasible for various language families and subgroups, such as the Romance languages and the Slavic languages (Mann and Yarowsky, 2001; Schafer and Yarowsky, 2002).", "startOffset": 205, "endOffset": 258}, {"referenceID": 7, "context": "Automated translation lexicon induction has been investigated in the literature and shown to be feasible for various language families and subgroups, such as the Romance languages and the Slavic languages (Mann and Yarowsky, 2001; Schafer and Yarowsky, 2002).", "startOffset": 205, "endOffset": 258}, {"referenceID": 5, "context": "We obtained the dictionary of the Turkic languages (Öztopçu et al., 1996).", "startOffset": 51, "endOffset": 73}, {"referenceID": 3, "context": "We use the word ‘cognate’ to denote, as in (Kondrak, 2001): “.", "startOffset": 43, "endOffset": 58}, {"referenceID": 6, "context": "This example shows the English gloss ‘one’ for all eight Turkic languages, descended from the same postulated form, *bir, in Proto-Turkic (Róna-Tas, 2006).", "startOffset": 138, "endOffset": 154}, {"referenceID": 2, "context": "Table 5 shows an example of case B3: the word ‘benefit’ in Kyrgyz was borrowed most likely through Uzbek or Chaghatay (Kirchner, 2006), but the Uzbek word was borrowed from Persian, and ultimately from Arabic.", "startOffset": 118, "endOffset": 134}, {"referenceID": 1, "context": "Other etymological annotation studies, such as the Loanword Typology project and its World Loanword Database (Haspelmath and Tadmor, 2009), have instructed linguists to pass over such complex words and optionally flag them as “contains a borrowed base,” etc.", "startOffset": 109, "endOffset": 138}, {"referenceID": 0, "context": "We measured interannotator agreement using Cohen’s Kappa (Cohen, 1960) and found Kappa = 0.", "startOffset": 57, "endOffset": 70}], "year": 2015, "abstractText": "Turkic languages exhibit extensive and diverse etymological relationships among lexical items. These relationships make the Turkic languages promising for exploring automated translation lexicon induction by leveraging cognate and other etymological information. However, due to the extent and diversity of the types of relationships between words, it is not clear how to annotate such information. In this paper, we present a methodology for annotating cognates and etymological origin in Turkic languages. Our method strives to balance the amount of research effort the annotator expends with the utility of the annotations for supporting research on improving automated translation lexicon induction.", "creator": "LaTeX with hyperref package"}}}