{"id": "1503.06169", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "20-Mar-2015", "title": "Networked Stochastic Multi-Armed Bandits with Combinatorial Strategies", "abstract": "In abarema this paper, 3.4-billion we hibernated investigate a chrome-plated largely myositis extended thorsten version conserver of komtar classical manville MAB kutir problem, kolkatta called betteridge networked cincinnatians combinatorial bandit reticulatum problems. In endometriosis particular, we coeruleus consider the pickett setting of a rosebank decision maker over empiricism a networked bandits phips as follows: 326.7 each goostrey time jorginho a combinatorial sina-1 strategy, beres e. g. , 1772-1945 2 0.82993 -0.68783 -1.3246 -0.50882 0.39304 -0.53409 0.67345 0.32066 -0.073885 -0.76871 0.75713 -0.087604 -1.58 0.13979 0.24736 1.1105 0.054053 0.052679 0.78005 1.7752 -0.17977 -0.37445 1.1616 -1.3771 -0.23966 -0.19785 -1.5824 1.0829 0.85604 0.51759 0.17718 0.33685 -0.3677 0.38581 0.00071188 -0.61799 1.0323 -1.4076 -0.2779 0.062811 -0.34447 1.4799 -0.68798 -0.6023 1.8026 -1.2605 -2.227 -1.8394 1.107 a yesler group of arms, cavils is chosen, and gyang the 0735 decision camp-dependent maker j-7 receives a reward resulting non-mainstream from rohland her discounting strategy fossum and also combustion receives braca a side thiol bonus redway resulting from non-human that self-defense strategy for each arm ' macpaint s 32.75 neighbor. ofce This supiadin is cardholders motivated yixiang by many real heavy-metal applications such miyano as presage on - thermodynamic line social networks 221.4 where wcf friends hesse-nassau can provide rossiyskaya their lashings feedback tomtom on changquan shared content, therefore if gelles we promote annelise a product to chauzy a sayer user, we klesken can stodart also collect 31.71 feedback sidelocks from her pruden friends on boardercross that zoospores product. To ridala this end, synapsids we 63.88 consider georg two demain types of tusk side bonus in kirkintilloch this study: kasperczak side observation and side neigboring reward. fagg Upon the number conde of 281.3 arms pulled at multicasting each 71.84 time slot, we anderstorp study unsalable two xàtiva cases: single - camile play and combinatorial - date play. permissive Consequently, this leaves employer us summercamp four histiocytosis scenarios to 47.44 investigate noix in the 18:08 presence olander of zinie side euro534 bonus: numismatic Single - bertoli play sonoita with Side decatur Observation, advocation Combinatorial - okeyo play fire-tube with mits Side patail Observation, Single - shareholders play kuzma with Side Reward, and monomachos Combinatorial - play sale with 139th Side Reward. bassets For suti each oedipus case, we present schneebaum and analyze a series marija of \\ powwow emph {zero retching regret} polices aloys where syriacus the expect mears of searcher regret rachele over time bavarii approaches zna zero as time rictor goes to bayrou infinity. Extensive simulations asterius validate estell the effectiveness of merchiston our results.", "histories": [["v1", "Fri, 20 Mar 2015 17:21:12 GMT  (2194kb)", "http://arxiv.org/abs/1503.06169v1", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["shaojie tang", "yaqin zhou"], "accepted": false, "id": "1503.06169"}, "pdf": {"name": "1503.06169.pdf", "metadata": {"source": "CRF", "title": "Networked Stochastic Multi-Armed Bandits with Combinatorial Strategies", "authors": ["Shaojie Tang", "Yaqin Zhou"], "emails": [], "sections": [{"heading": null, "text": "ar X\niv :1\n50 3.\n06 16\n9v 1\n[ cs\n.L G\n] 2\n0 M\nar 2\n01 5\nI. INTRODUCTION\nA multi-armed bandits problem (MAB) problem is a basic sequential decision making problem defined by a set of strategies. At each decision epoch, a decision maker selects a strategy that involves a combination of random bandits or variables, and then obtains an observable reward. The decision maker learns to maximize the total reward obtained in a sequence of decisions through history observation. MAB problems naturally capture the fundamental tradeoff between exploration and exploitation in sequential experiments. That is, the decision maker must exploit strategies that did well in the past on one hand, and explore strategies that might have higher gain on the other hand. MAB problems now play an important role in online computation under unknown environment, such as pricing and bidding in electronic commerce [?], [?], Ad placement on web pages [?], source routing in dynamic networks [?], and opportunistic channel accessing in cognitive radio networks [?], [?]. In this paper, we investigate a largely extended version of classical MAB problem, called networked combinatorial bandit problems. In particular, we consider the setting of a decision maker over a networked bandits as follows: each time a combinatorial strategy, e.g., a group of arms, is chosen, and the decision maker receives a direct reward resulting from her strategy and also receives a\nside bonus (either observation or reward) resulting from that strategy for each arm’s neighbors.\nIn this study, we take as input a relation graph G that represents the correlation among K arms. In the standard setting, pulling an arm i gets reward and observation Xi,t, while in the networked combinatorial bandit problem with side bonus, one also gets side observation or even reward due to the similarity or potential influence among neighboring arms. We consider two types of side bonus in this work: (1) Side-observation: by pulling arm i at time t one gains the direct reward associated with i and also observes the reward of her neighboring arms. Such side-observation [?] is made possible in settings of on-line social networks where friends can provide their feedback on shared content, therefore if we promote a product to a user, we can also collect feedback from her friends on that product; (2) Side-reward: in many practical applications such as recommendation in social networks, pulling an arm i not only yields side observation on neighbors, but also receives extra rewards. That is by pulling arm i one gains the reward associated with i together with her neighboring arms directly. This setting is motivated by the observation that users are usually influenced by her friends when making purchasing decisions. [?].\nDespite of many existing results on MAB problems against unknown stochastic environment [?], [?], [?], [?], [?], their adopted formulations do not fit those applications that involve either side bonus or exponentially large number of candidate strategies. There are several challenges facing our new study. First of all, under combinatorial setting, the number of candidate strategies could be exponentially large, if one simply treats each strategy as an arm, the resulting regret bound is exponential in the number of variables or arms. Traditional MAB assumes that all the arms are independent, which is inappropriate in our setting. In the presence of side bonus, how to appropriately leverage additional information in order to gain higher rewards is another challenge. To this end, we explore a more general formulation for networked combinatorial bandit problems under four scenarios, namely, single/combinatorial play with side observation, single/combinatorial play with side reward. The objective is to minimize the upper bound of regret (or maximize the total reward) over time.\nThe contributions of this paper are listed as follows: • For Single-play with Side Observation case, we present\nthe first distribution-free learning (DFL) policy, whose\ntime and space complexity are bounded by O(K). Our policy achieves zero regret that does not depend on ∆min, the minimum distance between the best static strategy and any other strategy. • For Combinatorial-play with Side Observation case, we present a learning policy with zero regret. Compared with traditional MAB problem without side bonus, we reduce the regret bound significantly. • For Single-play with Side Rewards case, we develop a distribution-free zero regret learning policy. We theoretically show that this scheme converges faster than any existing method. • For Combinatorial-play with Side Rewards case, by assuming that the combinatorial problem at each decision point can be solved optimally, we present the first distribution-free zero regret policy.\nWe evaluate our proposed learning policy through extensive simulations and simulation results validate the effectiveness of our schemes.\nThe remainder of this paper is organized as follows. We first give a formal description of networked combinatorial multiarmed bandits problem in Section II. We study Single-play with Side Observation case in Section III. In Section IV, we study Combinatorial-play with Side Observation case. Singleplay with Side Rewards case has been discussed in Section V. In Section VI, we study Combinatorial-play with Side Rewards case. We evaluate our policies via extensive simulations in Section VII. We review related works in Section VIII. We conclude this paper, and discuss limitations as well as future works in Section IX. Most notations used in this paper are summarized in Table I."}, {"heading": "II. MODELS AND PROBLEM FORMULATION", "text": "In the standard MAB problem, a K-armed bandit problem is defined by K distributions P1, . . . ,PK , each arm with respective means µ1, . . . , µK . When the decision maker pulls arm i at time t, she receives a reward Xi,t. We assume all rewards {Xi,t, i ∈ [1,K], t ≥ 1} are independent, and all {Pi} have support in [0, 1]. Let i = 1 denote the optimal arm, and ∆i = µ1 −µi be the difference between the best arm and arm i.\nThe relation graph G = (V,E) over the K arms describes the correlations among them, where an undirected link e(i, j) ∈ E indicates the correlation between two neighboring arms i and j. In the standard setting, pulling an arm i gets reward and observation Xi,t, while in the networked combinatorial bandit problem with side bonus, one also gets side observation or even reward from neighboring arms due to the similarity or potential influence among them. Let N(i) denote the set of neighboring arms of arm i and Ni = {i}∪N(i). In this work, we consider two types of side bonus:\n• Side observation: by pulling arm i at time t one gains the reward Xi,t associated with i and also observes the reward Xj,t of i’s neighboring arm j ∈ Ni. This is motivated by many real applications, for example, in today’s online social network, friends can provide their\nfeedback on shared content, therefore if we promote a product to one user, we can also collect feedback from her friends on that product; • Side reward: by pulling an arm i not only yields side observation on neighbors, but also receives rewards from them, i.e., the total rewards would be\n∑ j∈Ni Xj,t. This\nsetting is motivated by the observation that in many practical applications such as recommendation in social networks, users are usually influenced by her friends when making purchasing decisions.\nUpon the number of arms pulled at each time slot, we will study single-play case and combinatorial-play case.\n• In the single-play case, the decision maker selects one arm at each time slot, e.g., traditional MAB problem belongs to this category; • In the combinatorial-play case, the decision maker requires to select a combination of M(M ≤ K) arms that satisfies given constraints. One such example is online advertising, assume an advertiser can only place up to m advertisements on his website, he repeatedly selects a set of m advertisements, observes the click-through-rate, with the goal of maximizing the average click-throughrate. This problem can be formulated as a combinatorial MAB problem where each arm represents one advertisement, subject to the constraint that one can play at most m arms at each time slot. In the combinatorial case, at each time slot t, an M -dimensional strategy vector sx is selected under some policy from the feasible strategy set F . By feasible we mean that each strategy satisfies the underlying constraints imposed to F . We use x = 1, . . . , |F | to index strategies of feasible set F in the decreasing order of average reward λx, e.g., s1 has the largest average reward. Note that a strategy may consist of less than M random variables, as long as it satisfies the given constraints. We then set i = 0 for any empty entry i.\nIn either case, the objective is to minimize long-term regret after n time slots, defined by cumulative difference between the received reward and the optimal reward.\nConsequently, this leaves us four scenarios to investigate: Single-play with Side Observation, Combinatorial-play with Side Observation, Single-play with Side Reward, and Combinatorial-play with Side Reward. We then describe the problem formulation for each case. We use It to denote index of selected arm (resp. strategy) by the decision maker at time slot t, and subscript 1 to denote the optimal arm (resp. strategy) in the four cases. We evaluate policies using regret, Rn, which is defined as the difference in the total expected reward (over n rounds) between always playing the optimal strategy and playing arms according to the policy. We say a policy achieves zero regret if the expected average regret over time approaches zero as time goes to infinity, i.e., Rn/n → 0 as n → ∞.\n1) Single-play with Side Observation (SSO). In this case, the decision maker pulls an arm i, observes all Xj,t, j ∈ Ni, and gets a reward Xi,t. The regret by time slot n is written\n4) Combinatorial-play Side Rewards (CSR). Different from combinatorial-play with side observation, the decision maker directly obtains the rewards from all neighboring arms. That is, the totally received reward includes direct reward by strategy x and side reward by its neighbors. Let Yx = ∪i∈sxNi be the set of neighboring arms for strategy x, and σx = ∑ i∈Yx µi be the expected reward\nof sx. The combinatorial reward at time slot t is written as CBIt,t = ∑ i∈YIt Xi,t. We define the regret as\nRn =\nn∑\nt=1\nσ1 − n∑\nt=1\nCBIt,t. (4)"}, {"heading": "III. SINGLE-PLAY WITH SIDE OBSERVATION", "text": "We start with the case of Single-play with Side Observation. In this case, the decision maker learns to select an arm (resp. strategy) with maximum reward, meanwhile observes side information of its neighbors defined in relation graph. Our proposed policy, which is the first distribution free learning policy for SSO reffered to as DFL-SSO, is shown in Algorithm 1. As shown in Line 2-5, the decision maker updates all neighbors’ side information, i.e., number of observation up to current time, and time-averaged reward. The key idea behind the algorithm is that side-observation potentially reduces the regret as the decision maker can explore more without pain, thus gain more history information to exploit.\nTo theoretically analyze the benefit of side observation, we novelly leverage the technique of graph partition and clique cover. The basic idea in standard analysis of regret bound with side observation in distribution-dependent case is to use clique cover of relation graph, and use the arm with maximum ∆i inside each cilque to represent the clique for analysis. While standard proof of distribution-free regret bound is to divide the arms into two sets via a threshold ∆c0 on ∆i, and then respectively analyze the bounds of the two sets of arms. Therefore, to obtain a distribution-free result, we cannot directly use the arm with maximum ∆i inside a clique for representation to prove distribution-free regret bound, as the arms with ∆i smaller than ∆c0 are distributed inside cliques. To address this issue, we first partition the relation graph G using the predefined threshold, and then mainly analyze the benefit of side observation in one vertex-induced subgraph H for arms having ∆i above ∆c0 . In the subgraph H , it is then possible to analyze the distribution-free regret bound using the technique of clique cover.\nTheorem 1 quantifies the benefit brought about by it, where it shows that the more side observation (e.g., smaller clique number) is, the smaller the upper bound of regret is.\nTheorem 1: The expected regret of Algorithm 1 after n time slots is bounded by\nRn ≤ 15.94 √ nK + 0.74C √ n/K, (6)\nwhere C is clique cover of vertex-induced subgraph H with arms of ∆i above threshold δ0 in relation graph G.\nProof: The proof is based on our novel combination of graph partition and clique cover. We first partition relation\nAlgorithm 1 Distribution-Free Learning policy for single-play with side observation (DFL-SSO)\n1: For each time slot t = 0, 1, . . . , n Select an arm i by maximizing\nXi,t +\n√ log (t/(KOi,t))\nOi,t (5)\nto pull 2: for k ∈ Ni do 3: Ok,t+1 ← Ok,t + 1 4: Xk,t+1 ← Xk,t/Ok,t + (1− 1/Ok,t)Xk,t 5: end for 6: end for\ngraph to rewrite regret in terms of cliques, and then mainly tighten the upper bound by analyzing regret of cliques.\n1. Partition relation graph and rewrite regret of subgraph H in terms of cliques.\nWe order the arms in an increasing order of ∆i. We use ∆c0 ≤ δ0 = α √ K/n ≤ ∆c0+1 to split the K arms into two disjoint sets, one set K1 with ∆x ≤ ∆c0 and the other set K2 with ∆x > ∆c0 (We will set the value of α in later analysis). Let c0 be the smallest index of arm satisfying ∆k ≤ ∆c0 . We remove all arms in K1 from the relation graph G, as well as adjacent edges to nodes in K1. In this way, we get a subgraph H of G, over arms in K2. The regret satisfies,\nR(n) ≤ n∆c0 +RH(n), (7)\nwhere RH(n) is regret generated by selecting suboptimal arms in K2.\nConsider a clique covering C of H , i.e., a set of cliques such that each c ∈ C is a clique and V = ∪c∈Cc. We define the clique regret Rc(n) for any c ∈ C by\nRc(n) = ∑\nt<n\n∑ i∈c ∆i1{It = i}. (8)\nSince the set of cliques covers the whole graph H , we have\nRH(n) ≤ ∑\nc∈C Rc(n). (9)\nWe give an illustration of the partition process in Fig. 1, where the relation graph G contains one small set of blue nodes representing K1 with ∆i below ∆c0 , and the other large set of white nodes denoting K2 with ∆i above ∆c0 . The\nvertex-induced subgraph H of K2 is covered by a minimum of 3 cliques, respectively marked by black, gray and dash lines.\n2. Regret analysis for regret of subgraph H In the rest part, we focus on proving upper bound of regret\nRH(n). Let ∆c = maxi∈c ∆i, and Tc(t) = ∑\ni∈c Ti(t) denote the number of times (any arm in) clique c has been played up to time t, where Ti(t) is the number of times arm i has been selected up to time t. Similarly, we suppose that cliques are ordered in the increasing order of ∆c. Let vj = µ1 − ∆j2 for cliques in K2, c0 ≤ j ≤ K , and vc0 = µ1 − ∆c0 2 . Let zc0 = +∞ and ∆K+1 = +∞. For better description, we use c0 to denote the case of c = 0.\nAs every arms in a clique c must be observed for the same number of times, then for each clique and l0 ≥ 0, we have\nRc = ∑\ni∈c ∆iTi(n) ≤ l0 max i∈c ∆i +\n∑\ni∈C\n∞∑\nl=l0\n1{It = i, t ≥ l0} (10)\nMeanwhile,\nRH(n) = ∑\nc∈K Rc =\n∑ c∈C l0∆c + K∑ i=1 ∆iT ′ i (n), (11)\nWhere T ′i (n) denotes the number of arm i played after t = l0, and we refer to the second term as R′H\nDefine\nW = min 1≤t≤n W1,t, (12)\nand\nUj,i = 1W∈[vj+1,vj)∆iT ′ i (n). (13)\nWe have the following for R′H(n),\nR ′ H(n) =\nK∑\ni=c0\n∆iT ′ i (n) (14)\n= K∑\nj=c0\nj∑\ni=1\nUj,i + K∑\nj=c0\nC∑\ni=j+1\nUj,i. (15)\nFor the first term of Equation (15), we have:\nK∑\nj=c0\nj∑\ni=1\nUj,i ≤ K∑\nj=c0\n1W∈[vj+1,vj)n∆j (16)\n= n∆c0 + n\nC∑\nc=1\n1W≤vc(∆c −∆c−1).(17)\nWe have the first equation as ∆j ≥ ∆i and Ti ≤ n. To bound the second term of Equation (15), we record\nτi = {min t : Wi,t < vi} (18)\nafter l0. To pull a suboptimal arm i at t, one must have Wi,t > W1,t ≥ W . By Algorithm 1, we have {W ≥ vi} ⊂ {T ′i (n) ≤ τi}, since once we have pulled τi times arm i its index will always be lower than the index of arm 1.\nTherefore, we have\nR(n) ≤ 2n∆c0 + ∑\nc∈C l0∆c +\nK∑\ni=1\n∆iE(τi|t > l0)\n+n\nC∑\nc=1\n1W<vc(∆c −∆c−1). (19)\nFor any l0 > 0,\n∆iE(τi|τi > l0) (20)\n≤ +∞∑\nl=l0\nP(τi ≥ l)\n= +∞∑\nl=l0\nP(∀t ≤ l,Wi,t > vi)\n≤ +∞∑\nl=l0\nP ( Xi,l − µi ≥\n∆i 2\n− √ log+(n/Kl)\nl\n)\n(21)\nLet l0 = 8 log ( nK∆ 2 i )/∆ 2 i . For l ≥ l0, we have\nlog+(t/(Kl)) ≤ log+(n/(Kl0)) ≤ ( n K × ∆\n2 i\n8 ) (22)\n≤ l0∆ 2 i 8 ≤ l∆ 2 i 8 . (23)\nTherefor, we have\n∆i 2\n− √ log+(n/Kl)\nl ≥ ∆i 2 − ∆i√ 8 = a∆i (24)\nwith a = 12 − 1√8 ,\n∆cl0 ≤ 8 log ( n\nK ∆2i )/∆i ≤\n2\ne\n√ n/K (25)\nTo bound (21) using Hoeffding Bound, i.e.,\nE{τi|t > l0} ≤ +∞∑\nl=l0\nP(X i,l − µi ≥ a∆i) (26)\n≤ +∞∑\nl=l0\nexp (−2l(a∆i)2) (27)\n=\n+∞∑\nl=l0\n1− 2l0(a∆i)2 1− exp(−2(a∆i)2)\n(28)\n≤ 1 1− exp(−2(a∆i)2)\n(29)\n≤ 1 (2a∆i)2 − (−2(a∆i)2)\n(30)\n= 1\n2a∆2i (1− a2) . (31)\nThen we have\n∆iE{τi|t > l0} ≤ 8 log ( n\nK ∆2i )/∆i +\n1\n2a∆i(1− a2)\n≤ 2 e\n√ n/K +\nα−1 2a(1− a2) √ n/K. (32)\nNow we prove to bound n ∑C\nc=0 P(W ≤ vc)(∆c −∆c−1). Recall that ∆c0 ≤ δ0 ≤ ∆c0+1, and let δc0 be ∆c=0. Taking P(W ≤ µ1 − ∆c2 ) as an nonincreasing function of ∆c, we have\nC∑\nc=1\nP(W ≤ vc)(∆c −∆c−1)\n≤ δ0 −∆c0 + ∫\nδ0\n1P(W ≤ µ1 − u\n2 )du. (33)\nFor a fixed u ∈ [δ0, 1] and f(u) = 8 log( √\nn/Ku)/u2, we have\nP(W ≤ µ1 − u\n2 )\n= P ( ∃1 ≤ l ≤ n : X1,l + √ log (n/(Kl))\nl < µ1 −\nu\n2\n)\n≤ P ( ∃1 ≤ l ≤ f(u) : µ1 −X1,l > √ log (n/(Kl))\nl\n)\n+P ( ∃1 ≤ l ≤ f(u) : µ1 −X1,l > u\n2\n) (34)\nLet P1 denote the first term of (34), using the form of 1 2m+1 f(u) ≤ l ≤ 12m f(u), we have\nP1 ≤ ∞∑\nm=1\nP ( ∃ 1 2m+1 f(u) ≤ l ≤ 1 2m f(u) :\nl(µ1 −Xm,l) > √ f(u)\n2m+1 log(\nn2m\nKf(u) )\n)\n≤ ∞∑\nm=1\nexp ( −2 f(u)2−(m+1) log( n2 m Cf(u))\nf(u)2−m\n)\n= 2 Kf(u)\nn (35)\nLet P2 denote the first term of (34), using the form of 2mf(u) ≤ l ≤ 2m+1f(u), we have similarly,\nP2 ≤ ∞∑\nm=1\nP ( ∃2mf(u) ≤ l ≤ 2m+1f(u) :\nl(µ1 −Xm,l) > lu\n2\n)\n≤ ∞∑\nm=0\nexp ( −2(2 m−1f(u)u)2\nf(u)2m+1\n)\n≤ 1 exp(f(u)u2/4)− 1\n≤ 1 nu2/K − 1 (36)\nThe last inequality comes from f(u) is upper bounded by 4n/(eK).\nBy taking integrity on P1 and P2, we respectively have\nn\n∫ 1\nδ0\nP1du ≤ n 2K\nn\n∫ 1\nδ0\nf(u)du (37)\n= n 2K\nn\n[ 8 log(e √ n/Ku)\nu\n]δ0\n1\n≤ 8 log(eα) α\n√ nK, (38)\nand\nn\n∫ 1\nδ0\nP2du ≤ 1\n2 log\n( α+ 1\nα− 1\n)√ nK. (39)\nInstantly we have\nn\nC∑\nc=0\nP(W ≤ vc)(∆c −∆c−1)\n≤ n(δ0 −∆c0) + ( 8 log(eα)\nα +\n1 2 log\n( α+ 1\nα− 1\n))√ nK\nFinally, we get the regret bounded by\nRn ≤ ∑\nc∈C\n2\ne\n√ n/K + ( 3α+ 8 log(eα)\nα +\n1 2 log\n( α+ 1\nα− 1\n) +\nα−1\n2a(1− a2)\n)√ nK (40)\nLet α = e, and we already have a = 12 − 1√8 , then\nRn ≤ 15.94 √ nK + 0.74C √ n/K. (41)"}, {"heading": "IV. COMBINATORIAL-PLAY WITH SIDE OBSERVATION", "text": "In this section, we consider combinatorial-play with side observation. In this case, an intuitively extension is to take each strategy as an arm ( we name it com-arm), and then apply the algorithm for SSO to solve the problem. However, the key question is how to utilize the side-observation on arms defined in relation graph to gain more observation on comarms, that is, how to define neighboring com-arms. To this end, we introduce the concept of strategy relation graph to model the correlation among com-arms, by which we convert the problem of CSO to SSO.\nThe construction process for strategy relation graph is as follows. We define strategy relation graph SG(F,L) for strategies in F , where F is vertex set, and L is edge set. Each strategy sx is denoted by a vertex, and a link l = (sx, sy) in L connects two distinct vertexes sx and sy if sy ∈ Yx and vice versa. The neighbor definition for strategies is natural as once a strategy is played, the union of neighbors of arms in this strategy could be observed according to neighbor definition for arms in G, which surely reward of any strategy composed by these observed arms is also observed. We give an example in Fig. 2. There are 4 arms in relation graph G, indexed by i = 1, 2, 3, 4. The combinatorial MAB problem is to select a maximum weighted independent set of arms where unknown\nbandit is weight. As shown in Fig. 2, the feasible strategy set for this problem consists of 7 feasible strategies, i.e., independent sets of arms in G:\ns1 = {1},∪i∈s1Ni = {1, 2} s2 = {2},∪i∈s2Ni = {1, 2, 3} s3 = {3},∪i∈s3Ni = {2, 3, 4} s4 = {4},∪i∈s4Ni = {3, 4} s5 = {1, 3},∪i∈s5Ni = {1, 2, 3, 4} s6 = {1, 4},∪i∈s6Ni = {1, 2, 3, 4} s7 = {2, 4},∪i∈s7Ni = {1, 2, 3, 4}\nTaking s2 and s5 for illustration, the component arms of s2, i.e., {2}, is a subset of ∪i∈s5Ni = {1, 2, 3, 4}, and the component arms of s5, i.e., {1, 3} is also a subset of ∪i∈s2Ni = {1, 2, 3}. Therefore, the two strategies are connected in the relation graph SG.\nConsequently, we can convert the combinatorial-play MAB with side observation to a single-MAB with side observation. More specifically, taking each strategy as an arm, SG(F,L) is exactly a relation graph for com-arms in F . The problem turns into a single-play MAB problem where at each time slot the decision maker selects one com-arm from |F | ones to maximize her long-term reward.\nThe algorithm is shown in Algorithm 2, and we derive the regret bound below directly.\nTheorem 2: The expected regret of Algorithm 2 after n time slots is bounded by\nRn ≤ 15.94 √ n|F |+ 0.74C √ n/|F |. (43)\nIn the traditional distribution-free MAB by taking each comarm as an unknown variable [?], the regret bound would be 49 √ n|F |. Our theoretical result significantly reduces the regret and tightens the bound.\nAlgorithm 2 Distribution-Free Learning policy for combinatorial-play with side observation (DFL-CSO)\n1: For each time slot t = 0, 1, . . . , n Select a com-arm sx by maximizing\nRx,t +\n√ log (t/(KOx,t))\nOx,t (42)\nto pull 2: UPDATE: for y ∈ Nx do 3: Oy,t+1 ← Oy,t + 1 4: Ry,t+1 ← Ry,t/Oy,t + (1 − 1/Oy,t)Ry,t 5: end for 6: end for"}, {"heading": "V. SINGLE-PLAY WITH SIDE REWARDS", "text": "Though the single-play MAB with side reward have the same observation as the single-play MAB with side observation, the distinction on reward function makes the problem different. In the case of SSR, the reward function is side reward of the selected arm It, instead of its direct reward. Here we treat the side reward of each arm as a new unknown random variable, i.e., we require to learn Bi,t that is a combination of all direct rewards in Ni. As direct rewards of arms in Ni are observed asynchronously, we cannot update the observation on Bi,t as the way in SSO where observation is symmetric between two neighboring nodes. The trick is updating the number of observation on Bi,t only when direct rewards of all arm in Ni are renewed. We use Obi,t to denote this quantity to differ from Oi,t which denotes the number of direct reward is observed. Therefore, whenever an arm is played or its neighbor is played, the number of observation on side reward Obi,t can be updated only when the least frequently observed arm in Ni is updated. That is,\nObi,t =\n{ Obi,t−1 + 1 if minj∈Ni Oj,t is updated\nObi,t Otherwise. (44)\nThe algorithm for single-play MAB with side reward is summarized in Algorithm 3 where we directly use side reward Bi,t as observation, and update Obi,t according to (44). The regret bound of our proposed algorithm is presented in Theorem 3.\nTheorem 3: The expected regret of Algorithm 3 after n time slots is bounded by\nRn ≤ 49K √ nK (46)\nProof: In this case, Bi,t ∈ [0,K], which indicates that the range of received reward is scaled by K at most. We normalize Bi,t ∈ [0, 1]. Using the same techniques in proof of MOSS algorithm [?], we get the normalized regret bound, and then the regret bound in (46) by scaling the normalized regret bound by K . In Algorithm 3, the number of observation times on side reward should be no less than the scenario without side observation. Therefore, Algorithm 3 would convergence to the optimality faster than the MOSS algorithm without side observation.\nAlgorithm 3 Distribution-Free Learning policy for single-play with side reward (DFL-SSR)\n1: For each time slot t = 0, 1, . . . , n Select an arm i by maximizing\nBi,t +\n√ log (t/(KObi,t))\nObi,t (45)\nto pull 2: for k ∈ Ni do 3: Ok,t+1 ← Ok,t + 1 4: if minj∈Nk Oj,t is updated 5: Obk,t+1 = O b k,t + 1 6: Bk,t+1 = Bk,t/O b k,t + (1− 1/Obk,t)Bk,t 7: end if 8: end for 9: end for"}, {"heading": "VI. COMBINATORIAL-PLAY WITH SIDE REWARDS", "text": "Now we consider the combinatorial-play case with side reward. Recall that in this scenario, it requires to select a comarm sx with maximum side reward, where the side reward is the sum of observed rewards of all arms neighboring to arms in sx. The case is more complicated than previous three cases, due to: 1) Asymmetric observations on side reward for neighboring nodes in one clique; 2) Probably exponential number of strategies caused arbitrary constraint. Therefore, it is complicated to analyze the regret bound if adopting the same techniques of combinatory-play with side observation. Instead of learning side reward of strategies directly, we learn the direct reward of arms that compose com-arms.\nAlgorithm 4 Distribution-Free Learning policy for combinatorial-play with side reward (DFL-CSR)\n1: For each time slot t = 0, 1, . . . , n Select a com-arm sx by maximizing\n∑\ni∈Yx\n( X i,t +\n√√√√max (ln t2/3 KOi,t , 0)\nOi,t\n) (47)\nto pull 2: for k ∈ Yx do 3: Ok,t+1 ← Ok,t + 1 4: Xk,t+1 = Xk,t/O b k,t + (1− 1/Obk,t)Xk,t 5: end for 6: end for\nTheorem 4: The expected regret of Algorithm 4 after n time slots is bounded by\nR(n) ≤ NK + (√ eK + 8(1 +N)N3 ) n 2 3\n+(1 + 4 √ KN2\ne )N2Kn 5 6 . (48)\nwhere N ≤ K is the maximum of |Yx|, x = 1 . . . |F |. Proof: See Appendix."}, {"heading": "VII. SIMULATION", "text": "In this section, we evaluate the performance of the proposed 4 algorithms in simulations. We mainly analyze the regret generated by each algorithm after a long time slot n = 10000.\nWe first evaluate regret generated by DFL-SSO, and compare with MOSS learning policy. The experiment setting is as follows. We randomly generate a relation graph with 100 arms, each following an i.i.d random process over time with mean between [0, 1]. We then plot the accumulated regret and expected regret over time, as shown in Fig. 3(a). Though the expected regret over time by MOSS converges to a value around 0 that coincides with its theoretical bound in Fig. 3(a), it shows that its accumulated regret grows dramatically. It is oblivious the proposed algorithm with side information performs much better than MOSS, e.g., the accumulated regret and expected regret of our proposed algorithm (DFL-SSO) both converge to 0.\nFor other 3 algorithms, as we first study the 3 variants of MAB problem, there are no candidate algorithms to compare. We show the trend of expected regret over time for each case. In evaluation of Algorithm 2, we note that the regret bound contains the terms: number of com-arms and number of cliques. The upper bound becomes huge if the number of com-arms is voluminous, and a small clique number can significantly reduce the bound. In order to investigate the impact experimentally, we then test for regret both under sparse relation graph and dense relation graph. In Fig. 4(a), where the arms are uniformly and randomly connected with a low probability of 0.3, it shows that the expected regret slowly increases beyond 0. While in Fig. 4(b), where the arms are uniformly and randomly connected with a higher probability\n0 1000 2000 3000 4000 5000 6000 7000 8000 9000 10000 0\n0.2\n0.4\n0.6\n0.8\n1\nTime slot\nE x\np e\nc te\nd r\ne g\nre t\nFig. 5. Expected regret of DFL-SSR\n0 1000 2000 3000 4000 5000 6000 7000 8000 9000 10000 −0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\nTime slot\nE xp e ct e d r e g re t\nFig. 6. Expected regret of DFL-CSR\nof 0.6, it shows that the expected regret gradually approaches 0. It implicates that the side observation indeed helps to reduce regret if one can observe more, even for the case that previous literature show that it will introduce exponential regret by learning each individual com-arm of a huge feasible strategy set [?]. The simulation results for Algorithm 3 and 4 are shown in Fig. 5 and 6, where the expected regret in both figures converges to 0 dramatically."}, {"heading": "VIII. RELATED WORKS", "text": "The classical multi-armed bandit problem does not assume that existence of side bonus. More recently, [?] and [?] considered the networked bandit problem in the presence of side observations. They study single play case and propose several policies whose regret bound depends on ∆min, e.g., an arbitrarily small ∆min will invalidate the zero-regret result. In this work, we present the first distribution free policy for single play with side observation case.\nFor the variant with combinatorial play without side bonus, Anantharam et al. [?] firstly consider the problem that exactly N arms are selected simultaneously without constraint among arms. Gai et al. recently extend this version to a more general problem with arbitrary constraints [?]. The model is also relaxed to a linear combination of no more than N arms. However, the results presented in [?] are distributiondependent. To this end, we are the first to study combinatorial play case in the presence of side bonus. In particular, for the combinatorial play with side observation case, we develop a distribution-free zero regret learning policy. We theoretically show that this scheme converges faster than existing method. And for the combinatorial play with side reward case, we propose the first distribution-free learning policy that has zeroregret."}, {"heading": "IX. CONCLUSION", "text": "In this paper, we investigate networked combinatorial bandit problems under four cases. This is motivated by the existence of potential correlation or influence among neighboring arms. We present and analyze a series of zero regret polices for each case. In the future, we are interested in investigating some heuristics to improve the received regret in practice. For example, at each time slot, instead of playing the selected arm/strategy with maximum index value (Equation (5), (42)), we will play the arm/strategy that has maximum experimental average observation among the neighbors of It. Therefore, we ensure that the received reward is better than the one with maximum index value."}, {"heading": "X. APPENDIX", "text": ""}, {"heading": "A. Proof of Theorem 4", "text": "To prove the theorem, we will use Chernoff-Hoeffding bound and the maximal inequality by Hoeffding [?].\nLemma 1: (Chernoff-Hoeffding Bound [?]) ξ1, . . . , ξn are random variables within range [0, 1], and E[ξt|ξ1, ..., ξt−1] = µ, ∀1 ≤ t ≤ n. Let Sn = ∑ ξi, then for all a > 0\nP(Sn ≥ nµ+ a) ≤ exp (−2a2/n), P(Sn ≤ nµ− a) ≤ exp (−2a2/n). (49)\nLemma 2: (Maximal inequality) [?] ξ1, . . . , ξn are i.i.d random variables with expect µ, then for any y > 0 and n > 0,\nP ( ∃τ ∈ 1, . . . , n, τ∑\nt=1\n(µ− ξt) > y ) < exp(−2y 2\nn ). (50)\nEach com-arm sx and its neighboring arm set Yx actually compose a new com-arm, which could be denoted by Yx as\nsx ⊂ Yx. Each new com-arm Yx corresponds to a unknown bonus CBx,t with mean σx. Recall that we have assumed σ1 ≥ · · · ≥ σ|F |. As com-arm Y1 is the optimal com-arm, we have ∆x = σ1 − σx, and let Zx = σ1 − ∆x2 . We further define W1 = min1≤t≤n W1,t. We may assume the first time slot z = argmin1≤t≤n W1,t.\n1. Rewrite regret in terms of arms Separating the strategies in two sets by ∆x0 of some com-\narm sx0(we will define x0 later in the proof), we have\nRn =\nx0∑\nx=1\n∆xE[Tx,n] +\n|F |∑\nx=x0+1\n∆xE[Tx,n]\n≤ ∆x0n+ |F |∑\nx=x0+1\n∆xE[Tx,n]. (51)\nWe then analyze the second term of (51). As there may be exponential number of strategies, counting Tx,n of each comarm by the classic upper-confidence-bound analysis yields regret growing linearly with the number of strategies. Note that each com-arm consists of N arms at most, we can rewrite the regret in terms of arms instead of strategies. We then introduce a set of counters {T̃x,n|k = 1, . . . ,K}. At each time slot, either 1) a com-arm with ∆x ≤ ∆x0 or 2) a comarm with ∆x > ∆x0 is played. In the first case, no T̃x,n will get updated. In the second case, we increase T̃x,n by 1 for any arm k = argminj∈Yx{Oj,t}. Thus whenever a com-arm with ∆x > ∆x0 is chosen, exactly one element in {T̃x,n} increases by 1. This implies that the total number that strategies of ∆x > ∆x0 have been played is equal to sum of all counters in {T̃x,n}, i.e., ∑|F | x=x0+1 E[Tx,n] = ∑K\nk=1 T̃x,n. Thus, we can rewrite the second term of (51) as\n|F |∑\nx=x0+1\n∆xE[Tx,n] ≤ ∆X |F |∑\nx=x0+1\nE[Tx,n]≤∆X K∑\nk=1\nE[T̃x,n].\n(52)\nLet Ik,t be the indicator function that equals 1 if T̃x,n is updated at time slot t. Define the indicator function 1{y} = 1 if the event y happens and 0 otherwise. When Ik,t = 1, a com-arm Yx with x > x0 has been played for which Ok,t = min{Oj,t : ∀j ∈ Yx}. Then\nT̃x,n = n∑\nt=1\n1{Ik,t = 1} (53)\n≤ n∑\nt=1\n1{W1,t ≤ Wx,t} (54)\n≤ n∑\nt=1\n1{W1 ≤ Wx,t} (55)\n≤ n∑\nt=1\n1{W1 ≤ Wx,t,W1 ≥ Zx} (56)\n+\nn∑\nt=1\n1{W1 ≤ Wx,t,W1 < Zx} (57)\n= T̃ 1k,n + T̃ 2 k,n. (58)\nWe use T̃ 1k,n and T̃ 2 k,n to respectively denote Equation (56) and (57) for short. Next we show that both of the terms are bounded.\n2. Bounding T̃ 1k,n Here we note the event {W1 ≥ Zx} and {Wx,t > W1} implies event {Wx,t > Zx}. Let ln+(y) = max(ln(y), 0). For any positive integer l0, we then have,\nT̃ 1k,n ≤ n∑\nt=1\n1{Wx,t ≥ Zx} (59)\n≤ l0 + n∑\nt=l0\n1{Wx,t ≥ Zx, T̃ 1k,t > l0} (60)\n= l0 +\nn∑\nt=l0\nP{Wx,t ≥ Zx, T̃ 1k,t > l0} (61)\n= l0 + n∑\nt=l0\nP\n{∑\nj∈Yx\n( Xj,t +\n√√√√ ln+( t 2/3\nKOj,t ) l0\n)\n≥ ∑\nj∈Yx\nµj + ∆x 2 , T̃ 1k,t > l0\n} . (62)\nThe event {∑ j∈Yx ( Xj,t+ √ ln+(t2/3/KOj,t) Oj,t ) ≥ ∑j∈Yx µj+\n∆x 2\n} indicates that the following must be true,\n∃j ∈ Yx, Xj,t + √ ln+(t2/3/KOj,t)\nOj,t ≥ µj + ∆x 2N . (63)\nUsing union bound one directly obtains:\nT̃ 1k,n ≤ l0 + n∑\nt=l0\n∑ j∈Yx P\n{ Xj,t + √ ln+(t2/3/KOj,t)\nOj,t\n≥ µj + ∆x 2N\n} (64)\n≤ l0 + n∑\nt=l0\n∑ j∈Yx P\n{ Xj,t − µj\n≥ ∆x 2N\n− √ ln+(t2/3/KOj,t)\nOj,t\n} . (65)\nNow we let l0 = 16N2⌈ln(n 3/4 K ∆ 2 x)/∆ 2 x)⌉ with ⌈y⌉ the smallest integer larger than y. We further set δ0 = e1/2 √ K/n2/3 and set x0 such that ∆x0 ≤ δ0 < ∆x0+1. As Oj,t ≥ l0,\nln+\n( t3/4\nKOj,t\n) ≤ ln+ ( n3/4\nKOj,t\n) ≤ ln+(n3/4/Kl0)\n≤ ln+( n3/4 K × ∆ 2 x 16N2 ) ≤ l0∆ 2 x 16N2 ≤ Oj,t∆ 2 x 16N2 . (66)\nHence we have,\n∆x 2N\n− √ ln+(t3/4/KOj,t)\nOj,t ≥ ∆x 2N − ∆x√ 16N2 = c∆x (67)\nwith c = 12N − 1√16N2 = 1 4N . Therefor, using Hoeffding’s inequality and Equation (65),\nand then plugging into the value of l0, we get,\nT̃ 1k,n ≤ l0 + n∑\nt=l0\n∑ j∈Yx P\n{ Xj,t − µj ≥ c∆x }\n≤ l0 + n∑\nt=l0\n∑ j∈Yx exp(−2Oj,t(c∆x)2)\n≤ l0 +K · n · exp(−2l0(c∆x)2)\n= 1 + 16N2 ln(n\n3/4 K ∆ 2 x)\n∆2x +K · n · exp(−2 ln(n 112 e)).\n(68)\nAs δ0 = e1/2 √ K/n 2 3 and ∆x > δ0, the second term in\n(68) is bounded by\n16N2(1 + lnn1/12)\nKe · n2/3 < 16N\n2(n2/3 + n3/4)\nKe\nThe last term of (68) is bounded by\nK · n · exp(−2 ln(n 112 e)) ≤ K e2 · n 56\nFinally we get\nT̃ 1k,n = 1 + 16N2(n2/3 + n3/4)\nKe +\nK e2 · n 56 . (69)\n3. Bounding T̃ 2k,n\nT̃ 2k,n = n∑\nt=1\n1{W1 ≤ Wx,t,W1 < Zx}\n≤ n∑\nt=1\nP{W1 < Zx} ≤ nP{W1 < Zx}. (70)\nRemember that at time slot z, we have W1 = minW1,t. For the probability {W1 < Zx} of fixed x, we have\nP{W1 < σ1 − ∆x 2 } (71)\n= P\n{ N∑\nj∈N1,j=1\nwj,z < σ1 − ∆x 2\n} (72)\n≤ ∑\nj∈N1\nP { wj,z < µj − ∆x\n2N\n} . (73)\nWe define function f(u) = e ln( √ n1/3\nK u)/u 3 for u ∈\n[δ0, N ]. Then we have,\nP { wj,z < µj −\n∆x 2N\n}\n= P { ∃1 ≤ l ≤ n : l∑\nτ=1\n( Xj,τ +\n√ ln+( τ2/3\nKl )\nl\n) < lµj − l∆x\n2N\n}\n≤ P { ∃1 ≤ l ≤ n : l∑\nτ=1\n(µj −Xj,τ ) > √ l ln+( τ 2/3\nKl ) + l∆x 2N\n}\n≤ P { ∃1 ≤ l ≤ f(∆x) : l∑\nτ=1\n(µj −Xj,τ ) > √ l ln+( τ 2/3\nKl )\n}\n+P { ∃f(∆x) < l ≤ n : l∑\nτ=1\n(µj −Xj,τ ) > l∆x 2N\n} . (74)\nFor the first term we use a peeling argument with a geometric grid of the form 12g+1 f(∆x) ≤ l ≤ 12g f(∆x):\nP { ∃1 ≤ l ≤ f(∆x) : l∑\nτ=1\n(µj −Xj,τ )\n> √ l ln+( τ 2/3\nKl )\n}\n≤ ∞∑\ng=0\nP { ∃ 1 2g+1 f(∆x) ≤ l ≤ 1 2g f(∆x) : l∑\nτ=1\n(µj −Xj,τ )\n>\n√ f(∆x)\n2g+1 ln+(\nτ 2/32g\nKf(∆x) )\n}\n≤ ∞∑\ng=0\nexp ( −2 f(∆x) 1 2g+1 ln+( τ2/32g Kf(∆x) )\nf(∆x) 1 2g\n)\n≤ ∞∑\ng=0\n[ Kf(∆x)\nn2/3 1 2g\n] ≤ 2Kf(∆x)\nn2/3 (75)\nwhere in the second inequality we use Lemma 2. As the special design of function f(u), we have f(u) takes\nmaximum of n 1/2\n3K3/2 when u = e1/3\n√ K/n1/3. For ∆x >\ne1/3 √ K/n1/3 , we have\n2Kf(∆x) n2/3 ≤ 2 3 √ K n−1/6. (76)\nFor the second term we also use a peeling argument but with a geometric grid of the form 2gf(∆x) ≤ l < 2g+1f(∆x):\nP { ∃f(∆x) < l ≤ n : l∑\nτ=1\n(µj −Xj,τ ) > l∆x 2N\n}\n≤ ∞∑\ng=0\nP { ∃2gf(∆x) ≤ l ≤ 2g+1f(∆x) : l∑\nτ=1\n(µj −Xj,τ )\n> 2g−1f(∆x)∆x\nN\n}\n≤ ∞∑\ng=0\nexp\n( −2gf(∆x)∆2x\n4N2\n)\n≤ ∞∑\ng=0\nexp ( −(g + 1)f(∆x)∆2x/4N2 )\n= 1\nexp(f(∆x)∆2x/4N2)− 1 . (77)\nWe note that f(u)u2 has a minimum of e√ K n1/6 when u =\nx0. Thus for (77), we further have,\n1\nexp( f(∆x)∆2x 4N2 )− 1 ≤ 1 exp ( en1/6\n4 √ KN2\n) −1\n≤ 4 √ KN2n− 1 6\ne .\n(78)\nCombining (73) and (70), we then have\nT̃ 2k,n ≤ 2Nn5/6\n3 √ K\n+ 4 √ KN3n5/6\ne ≤ (1 + 4\n√ KN2\ne )Nn\n5 6 . (79)\n4. Results without dependency on ∆min\nSumming T̃ 1k,n and T̃ 2 k,n, we have\nT̃x,n ≤ T̃ 1k,n + T̃ 2k,n\n= 1 + 16N2\nKe (1 +\n8N\n15 )n\n2 3 + (1 +\n4 √ KN2\ne )Nn\n5 6\nand using ∆X ≤ N and ∆x ≤ δ0 for x ≤ x0, we have\nR(n) ≤ √ Ken 2 3 +NK [ 1 + 16N2\nKe (1 +\n8N\n15 )n\n2 3\n+(1 + 4 √ KN2\ne )Nn\n5 6\n]\n≤ NK + (√ eK + 8(1 +N)N3 ) n 2 3\n+(1 + 4 √ KN2\ne )N2Kn 5 6 ."}], "references": [], "referenceMentions": [], "year": 2015, "abstractText": "In this paper, we investigate a largely extended version of classical MAB problem, called networked combinatorial bandit problems. In particular, we consider the setting of a decision maker over a networked bandits as follows: each time a combinatorial strategy, e.g., a group of arms, is chosen, and the decision maker receives a reward resulting from her strategy and also receives a side bonus resulting from that strategy for each arm’s neighbor. This is motivated by many real applications such as on-line social networks where friends can provide their feedback on shared content, therefore if we promote a product to a user, we can also collect feedback from her friends on that product. To this end, we consider two types of side bonus in this study: side observation and side reward. Upon the number of arms pulled at each time slot, we study two cases: single-play and combinatorial-play. Consequently, this leaves us four scenarios to investigate in the presence of side bonus: Single-play with Side Observation, Combinatorial-play with Side Observation, Single-play with Side Reward, and Combinatorial-play with Side Reward. For each case, we present and analyze a series of zero regret polices where the expect of regret over time approaches zero as time goes to infinity. Extensive simulations validate the effectiveness of our results.", "creator": "LaTeX with hyperref package"}}}