{"id": "1505.04677", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "18-May-2015", "title": "On sets of graded attribute implications with witnessed non-redundancy", "abstract": "We 42.21 study maj.-gen properties anomeric of norteno particular non - wentworthville redundant debler sets of falling-out if - mononym then rules describing custom-built dependencies between graded refinishing attributes. We introduce cléirigh notions 43-316 of saturation gusti and witnessed rlc non - redundancy 4-47 of sets of beilenson graded ifsc attribute bergessio implications dibaj are show avocet that bases kolathiri of demona graded attribute implications 9.0 given by systems of grasslike pseudo - rottweilers intents geryon correspond to non - upbraid redundant shafto sets boiro of graded moyola attribute implications rathfarnham with saturated consequents where the non - redundancy is witnessed hren by antecedents of godson the contained 3-fold graded natatorium attribute implications. vaio We introduce nro an isetan algorithm reconstituted which cannibalized transforms gastro-intestinal any amiss complete florence set of graded altadis attribute boreholes implications chengbo parameterized northwards by tô globalization into a knierim base given komsic by keshavan pseudo - 141.00 intents. Experimental 3gpp evaluation sharav is provided rotherfield to compare the 60.3 method 1980-91 of 180.50 obtaining anzai bases for 30secs general gemstar parameterizations low-light by hedges lingsheng with earlier graph - mescaleros based approaches.", "histories": [["v1", "Mon, 18 May 2015 15:15:53 GMT  (24kb)", "http://arxiv.org/abs/1505.04677v1", null]], "reviews": [], "SUBJECTS": "cs.AI", "authors": ["vilem vychodil"], "accepted": false, "id": "1505.04677"}, "pdf": {"name": "1505.04677.pdf", "metadata": {"source": "CRF", "title": "On sets of graded attribute implications with witnessed non-redundancy", "authors": ["Vilem Vychodil"], "emails": ["vychodil@binghamton.edu,"], "sections": [{"heading": null, "text": "ar X\niv :1\n50 5.\n04 67\n7v 1\n[ cs\n.A I]\nWe study properties of particular non-redundant sets of if-then rules describing dependencies between graded attributes. We introduce notions of saturation and witnessed non-redundancy of sets of graded attribute implications are show that bases of graded attribute implications given by systems of pseudo-intents correspond to non-redundant sets of graded attribute implications with saturated consequents where the nonredundancy is witnessed by antecedents of the contained graded attribute implications. We introduce an algorithm which transforms any complete set of graded attribute implications parameterized by globalization into a base given by pseudo-intents. Experimental evaluation is provided to compare the method of obtaining bases for general parameterizations by hedges with earlier graph-based approaches."}, {"heading": "1 Introduction", "text": "In this paper, we introduce the notion of a witnessed non-redundancy of sets of graded attribute implications, study its properties and its relationship to the notion of a general system of pseudo-intents which has been introduced earlier [5]. The graded attribute implications (also known as fuzzy attribute implications)\n∗e-mail: vychodil@binghamton.edu, phone: +420 585 634 705, fax: +420 585 411 643\nare if-then rules which generalize the ordinary attribute implications which appear in formal concept analysis [30]. The graded attribute implications are more general formulas than the classic attribute implications in that they allow to express attribute dependencies to degrees. For instance, a rule\n{0.9/good neighborhood , 1/large} ⇒ {0.98/expensive} (1)\nsaying that if an object (e.g., a house for sale) is located in a good neighborhood and is large, then it is expensive, may be seen as a typical example of a graded attribute implication. In this example, the values 0.9, 1, and 0.98 (taken from the real unit interval) express lower bounds (or thresholds) of truth degrees to which we consider the attributes valid in data. Therefore, a finer reading of the rule is: “if a house is located in a good neighborhood at least to degree 0.9 and is large at least to degree 1, then it is expensive at least to degree 0.98”. In formal concept analysis (FCA) of graded object-attribute data and in particular in the approach to FCA with linguistic hedges [17], graded attribute implications play an analogous role as the classic attribute implications in the ordinary FCA.\nIn FCA, one typically wants to find a small representative set of attribute implications which conveys the information about all attribute implications which hold is a given formal context. Equivalently, one wishes to find a small set of attribute implications whose models are exactly all concept intents of the data. Guigues-Duquenne bases [34] which are determined by pseudo-intents of formal concepts are examples of such sets which are in addition minimal in terms of the number of contained formulas, cf. also [29]. In FCA with graded attributes, a general notion of a system of pseudo-intents has been proposed and studied, see [18] for a survey. Unlike the classic case, general systems of pseudo-intents are not unique and may not ensure minimality of the corresponding base. Also, such systems may not exist when the structure of degrees is infinite and their existence for general finite scales is an open problem. From the computational point of view, graph-theoretic methods for obtaining general systems of pseudointents are proposed but they are limited only to small data sets. Therefore, further investigation is needed and this paper makes a contribution to this area.\nIn this paper, we show that bases of graded attribute implications given by general systems of pseudo-intents correspond to non-redundant sets of graded attribute implications with saturated consequents where the non-redundancy of each formula in the set is witnessed by its own antecedent. Both the notions of saturation and witnessed non-redundancy are introduced in Section 4. Furthermore, we introduce a constructive method for transformation of any set of graded attribute implications (which is complete in a given data) to a non-redundant base with witnessed non-redundancy from which a system of pseudo-intents can be derived. In practice, this means that we can avoid the graph-based method and compute systems of pseudo-intents by an alternative and much faster approach. We prove that the proposed procedure works if we consider globalization [51] as a parameter of the interpretation of graded attribute implications. For linguistic hedges [17, 26, 37] other than the globalization, which serve as parameters of the interpretation of graded attribute implications, the procedure may not produce the desired base but as our experimental observations show, it seems to have a high success rate.\nThe results contained in our paper fall in the category of results on bases of if-then rules generated from data [3, 19, 43] which develop ideas of the seminal paper [34]. Although we work with graded if-then rules with semantics defined using complete residuated lattices as structures of degrees and parameterized by linguistic hedges, our approach is general and we anticipate it can be adopted in recently developed approaches such as [40, 45].\nOur paper is organized as follows. In Section 2, we present the basic notions of residuated structures of truth degrees and graded attribute implications. In Section 3, we present a background and a survey of existing results on nonredundant bases of graded attribute implications and give further motivation for our work. Section 4 contains the new results. Finally, Section 5 shows experimental observations on efficiency on computing sets of graded attribute implications with witnessed non-redundancy and presents open problems."}, {"heading": "2 Preliminaries", "text": "In this section, we present the basic notions of structures of truth degrees and graded attribute implications. Whenever possible, we keep the same notation as in [4] for general residuated structures and [18] for graded attribute implications.\nWe utilize complete residuated lattices as structures of truth degrees. For our development, these structures represent a reasonable generalization of the most common structures of degrees defined on the real unit interval using leftcontinuous triangular norms [25, 38]. Recall that a complete residuated lattice [4, 28] is an algebra L = 〈L,∧,∨,⊗,→, 0, 1〉 where 〈L,∧,∨, 0, 1〉 is a complete lattice (i.e., a lattice where infima and suprema exist for arbitrary subsets of L), 〈L,⊗, 1〉 is a commutative monoid (i.e., ⊗ is commutative, associative, and 1 is neutral with respect to ⊗), and ⊗ and → satisfy the so-called adjointness property: for all a, b, c ∈ L, we have that a ⊗ b ≤ c iff a ≤ b → c, where ≤ is the (complete lattice) order induced by L (i.e., a ≤ b iff a = a ∧ b iff a ∨ b = b iff a → b = 1). We interpret ⊗ and → as it is usual in mathematical fuzzy logics [20, 32, 33, 36] and their applications [39]: ⊗ is a truth function of “fuzzy conjunction” and → is a truth function of “fuzzy implication”, cf. also [21, 22] for surveys of results on fuzzy logics in the narrow sense.\nIn the paper, we use illustrative examples based on finite (and thus complete) residuated lattices defined on equidistant subchains of the real unit interval. That is, we consider L = {\n0, 1n , 2 n , . . . , 1\n}\nfor some natural n and use the\nnatural ordering of rational numbers, i.e., ∧ and ∨ coincide with the operations of minimum and maximum, respectively. If ⊗ coincides with ∧, we call the resulting L a finite Gödel chain in which case we have a → b = 1 iff a ≤ b and a → b = b otherwise. If ⊗ and → are given by\ni n ⊗ j n = max\n{\n0, in + j n − 1\n}\n, (2)\ni n → j n = min\n{\n1, 1− in + j n\n}\n, (3)\nwe call the resulting L a finite Lukasiewicz chain. More general finite residuated lattices on equidistant subchains of the real unit interval may be considered but\nin our examples we utilize only these two basic structures, cf. [23, 38].\nIn addition to ⊗ and → which may be seen as generalizations of truth function of the classic logical connectives “conjunction” and “implication”, we make use of linguistic hedges [55, 56, 57, 58] which do not have nontrivial counterparts in classic logics. In particular, we utilize idempotent truth-stressing (i.e., truth intensifying) linguistic hedges (shortly, hedges), which are considered as maps ∗ : L → L such that 1∗ = 1, a∗ ≤ a, (a → b)∗ ≤ a∗ → b∗, and a∗ ≤ a∗∗ for all a, b ∈ L. Using similar arguments as in [37], such maps may be seen as truth functions of logical connectives “very true”, cf. also [26] and [22] for recent results on hedges. Two basic hedges can be introduced on any complete residuated lattice. Namely, (i) the identity (i.e., a∗ = a for all a ∈ L), and (ii) the so-called globalization [51]:\na∗ =\n \n\n1, if a = 1, 0, otherwise, (4)\nfor all a ∈ L. Note that on linear residuated lattices, the globalization coincides with the truth function of the Baaz ∆ connective [2].\nFor a fixed complete residuated lattice L and a non-empty universe set Y , an L-set A in Y (or an L-fuzzy set [31]) is any map A : Y → L. As usual, A(y) is interpreted as the degree to which y belongs to A. The collection of all L-sets in Y is denoted by LY . In a similar fashion, we introduce binary L-relations: for non-empty universe sets X and Y , a (binary) L-relation between X and Y (or an L-fuzzy relation between X and Y ) is any map R : X × Y → L with R(x, y) understood as the degree to which x and y are R-related (or related by R). It is convenient to treat binary L-relations between X and Y as L-set in X×Y . We write L-sets and L-relation on finite universes in the usual way, i.e., {a1/y1, . . . , an/yn} denotes an L-set A in Y = {y1, . . . , yn} such that A(yi) = ai for all i = 1, . . . , n. Optionally, we omit ai/yi whenever ai = 0 and write just yi instead of ai/yi whenever ai = 1. In particular, {} denotes the empty L-set in Y , i.e., {}(y) = 0 for all y ∈ Y . The basic operations with L-sets are defined componentwise using operations in L. For instance, if A and B are L-sets in\nY , then A∩B denotes the L-set in Y (called the intersection of A and B) such that (A ∩B)(y) = A(y) ∧B(y) for each y ∈ Y and analogously for ∪ and ∨.\nWe utilize the notion of a graded subsethood [31, 32] (graded inclusion) which generalizes the ordinary set inclusion. For any A,B ∈ LY , we define a degree S(A,B) of subsethood of A in B by\nS(A,B) = ∧\ny∈Y\n( A(y) → B(y) ) . (5)\nClearly, S(A,B) is a general degree in L. If S(A,B) = 1, we denote the fact by A ⊆ B and say that A is (fully) included in B. Notice that in this case, we have A(y) ≤ B(y) for all y ∈ Y (this is owing to the fact that a → b = 1 iff a ≤ b).\nNow, graded attribute implications and their interpretation [18] may be introduced as follows. Let Y be a finite non-empty set of (symbolic names of) attributes. A graded attribute implication in Y is an expression A ⇒ B where A,B ∈ LY ; A is called the antecedent of A ⇒ B, B is called the consequent of A ⇒ B. Alternatively, graded attribute implications are called fuzzy attribute implication [10] and for brevity we refer to the formulas as FAIs. For A,B,M ∈ LY , we define the degree ||A ⇒ B||M to which A ⇒ B is true in M by\n||A ⇒ B||M = S(A,M) ∗ → S(B,M). (6)\nRecall that in (6), S stands for graded subsethood (5), and ∗ is a hedge on L. Furthermore, if M ⊆ LY , then we put\n||A ⇒ B||M = ∧ M∈M ||A ⇒ B||M (7)\nand call ||A ⇒ B||M the degree to which A ⇒ B is true in M.\nRemark 1. According to its definition, the degree to which A ⇒ B is true in M depends not only on the operations in L (namely, ∧ and →) but also on the hedge ∗. The hedge in (6) may be seen as a parameter of the interpretation of A ⇒ B in M and will play an important role in our paper, see also [18] for detailed comments on the role of hedges. Also note that if M is regarded as an L-set of attributes of an object (i.e., M(y) is a degree to which an object\nhas the attribute y), then ||A ⇒ B||M is a degree to which it is true that “If the object has all the attributes from A, then it has all the attributes from B”. This naturally generalizes the ordinary attribute implications and their semantics, see [30].\nConsider fixed Y and let Σ be a set of FAIs. An L-set M ∈ LY is called a model of Σ whenever ||A ⇒ B||M = 1 for all A ⇒ B ∈ Σ. The set of all models of Σ is denoted by Mod(Σ). The degree ||A ⇒ B||Σ to which A ⇒ B is semantically entailed by Σ is defined by\n||A ⇒ B||Σ = ∧ M∈Mod(Σ) ||A ⇒ B||M . (8)\nTherefore, the degree to which a FAI (semantically) follows from Σ is defined as the infimum of all degrees to which it is true in all models of Σ. This is consistent with the abstract logic framework proposed by Pavelka [46, 47, 48] which was inspired by the influential paper [32] by Goguen. Note that since Mod(Σ) ⊆ LY , we may write ||A ⇒ B||Σ = ||A ⇒ B||Mod(Σ) on account of (7).\nIn our paper, we exploit a characterization of the semantic entailment which is based on least models. The system Mod(Σ) of all models of any Σ is known to form a particular closure system (called an L∗-closure system [7]), see [16]. Therefore, we may introduce the least model [M ]Σ of Σ which contains M :\n[M ]Σ = ⋂ {N ∈ Mod(Σ); M ⊆ N}. (9)\nThe following proposition establishes a characterization of the semantic entailment by least models and graded subsethood, see [18, Theorem 3.11].\nProposition 1. For any Σ and A,B ∈ LY: ||A ⇒ B||Σ = S(B, [A]Σ).\nIn particular, Proposition 1 yields that ||A ⇒ B||Σ = 1 iff S(B, [A]Σ) = 1 which is true iff B is fully contained in [A]Σ, i.e., B ⊆ [A]Σ. As a further consequence, for given A, [A]Σ is the greatest L-set among all B ∈ LY such that ||A ⇒ B||Σ = 1.\nLet Σ and Γ be sets of FAIs in Y . We call Σ and Γ equivalent whenever ||A ⇒ B||Σ = ||A ⇒ B||Γ for all A,B ∈ LY . In words, Σ and Γ are equivalent\nwhenever they entail each FAI to the same degree. The following proposition shows that the condition can be restated in several equivalent ways, see [10, 18].\nProposition 2. For any Σ and Γ, the following conditions are equivalent:\n(i) Σ and Γ are equivalent,\n(ii) for all A,B ∈ LY : ||A ⇒ B||Σ = 1 iff ||A ⇒ B||Γ = 1,\n(iii) for all A ⇒ B ∈ Σ: ||A ⇒ B||Γ = 1 and\nfor all C ⇒ D ∈ Γ: ||C ⇒ D||Σ = 1,\n(iv) Mod(Σ) = Mod(Γ).\nWe conclude the preliminaries by the following remark on alternative seman-\ntics and axiomatizations of the semantic entailment of FAIs.\nRemark 2. (a) The notion of a degree of semantic entailment used in this paper is defined in a way which generalizes the classic propositional semantics of attribute implications. That is, for M ∈ Mod(Σ), the degree M(y) is interpreted as the degree to which y is present in M . Thus, if attributes are considered as propositional variables, M may be seen as their evaluation prescribing degrees to which the propositional variables are true. Since the classic attribute implications have an alternative database semantics [24, 27, 50] which yields the same notion of semantic entailment, it may be tempting to look for an analogous alternative semantics in the graded setting. In [12], it is shown that such an alternative semantics exists and that FAIs may alternatively be seen as formulas prescribing similarity-based dependencies in relational databases [44].\n(b) The semantic entailment introduced in this paper has (several) interesting Armstrong-style [1] axiomatizations. An inference system which is complete over arbitrary L is presented in [13]. Note that the inference system presented therein contains an infinitary rule which may be disregarded in some important cases [18, 54], cf. also [41] for an alternative axiomatization with an infinitary rule. An alternative inference systems based on the rules of simplification in presented in [6]. A graph-based inference system for FAIs is presented in [52]."}, {"heading": "3 Non-Redundant Bases: Overview and Related Work", "text": "In this section, we present an overview of existing results regarding bases of FAIs. The existing approaches are concerned with describing bases of objectattribute data with graded attributes which are formalized as formal L-contexts: For non-empty finite sets X (set of objects) and Y (set of attributes), and a binary L-relation I : X × Y → L, the triplet I = 〈X,Y, I〉 is called a formal L-context [4]. A formal L-context I induces a couple of operators ↑ : LX → LY and ↓ : LY → LX defined by\nA↑(y) = ∧\nx∈X\n( A(x)∗ → I(x, y) ) , (10)\nB↓(x) = ∧\ny∈Y\n( B(y) → I(x, y) ) , (11)\nfor all A ∈ LX , B ∈ LY , x ∈ X , and y ∈ Y . The operators ↓, ↑ form a so-called Galois connection with hedge [17] and their composition ↓↑ is an L∗-closure operator [7]. Given I = 〈X,Y, I〉, which represents input data, we define the degree ||A ⇒ B||I to which A ⇒ B (A,B ∈ L Y ) is true in I, see [5], as follows:\n||A ⇒ B||I = ∧ x∈X ||A ⇒ B||{1/x}↑ . (12)\nHence, ||A ⇒ B||I may be understood as a generalization of the ordinary notion of an attribute implication valid in a formal context: ||A ⇒ B||I is the degree to which the following condition is true: “For each object x ∈ X , if the object has all the attributes from A, then it has all the attributes from B”.\nNow, the basic problem regarding FAIs and formal L-contexts is the follow-\ning: Given I = 〈X,Y, I〉, find Σ such that\n||A ⇒ B||Σ = ||A ⇒ B||I (13)\nfor all A,B ∈ LY . Such a Σ is called complete in I. In addition, if Σ is nonredundant (or minimal), then it is called a non-redundant (or minimal) base of I. The notion of non-redundancy is considered the usual way: A ⇒ B ∈ Σ is redundant in Σ whenever ||A ⇒ B||Σ\\{A⇒B} = 1; Σ is non-redundant whenever there is no A ⇒ B ∈ Σ which is redundant in Σ. Analogously, Σ being minimal means that there is no Γ which is equivalent to Σ such that |Γ| < |Σ|.\nThe investigation of complete sets and bases in the graded setting started with [49] where the author generalizes the ordinary notion of a pseudo-intent [34], see also [29, 30]. In this setting, the hedges were not involved as parameters of the semantics of FAIs as in (6) which may be viewed in our general setting so that ∗ is taken as the identity. In [49], P ∈ LY is called a pseudo-intent (of I) whenever P 6= P ↓↑ (i.e., P ⊂ P ↓↑) and\nfor each pseudo-intent Q ⊂ P , we have Q↓↑ ⊆ P. (14)\nTherefore, the definition of the notion of a pseudo-intent copies the classic definition except for ↓↑ is given by (10) and (11). If L is finite, pseudo-intents exist and are uniquely given (recall that in our paper, we consider Y always finite). Furthermore, [49] observes that\nΣ = {P ⇒ P ↓↑; P is a pseudo-intent} (15)\nis complete in I but in general, Σ is redundant. Clearly, for L being the twoelement Boolean algebra, the notion of a pseudo-intent coincides with the classic one [34].\nIn [5], the authors propose a different notion of pseudo-intents in the graded setting. Namely, the approach in [5] started with using general hedges as parameters of the interpretation of FAIs in formal L-contexts (similar approach to parameterizations of if-then rules appeared in [14, 15]). In addition to that, the paper introduces a general concept of a system of pseudo-intents: Put\nU = {P ∈ LY ; P 6= P ↓↑} (16)\nand call P ⊆ U a system of pseudo-intents whenever for each P ∈ U , we have\nP ∈ P iff ||Q ⇒ Q↓↑||P = 1 for any Q ∈ P such that Q 6= P. (17)\nThe results in [5, 9] show that if ∗ is globalization, then provided that L is finite, I admits a unique system of pseudo-intents which determines a minimal base\nΣ = {P ⇒ P ↓↑; P ∈ P} (18)\nof I analogously as in the classic case. In fact, for ∗ being the globalization, (17) translates into (14). In [53], a criterion for minimality of a general set of FAIs for ∗ being the globalization is described.\nThe analysis in [9] further showed that for general hedges, the systems of pseudo-intents are not given uniquely and may have different sizes and, in case of infinite L, may not even exist, cf. [18, Example 5.13]. On the other hand, if there is a system P of pseudo-intents of I, then (18) always determines a non-redundant base.\nIn order to compute general systems of pseudo-intents considering general hedges, a graph-based method has been announced in [8] and further described in [11]. The method is based on an observation that systems of pseudo-intents coincide with particular maximal independent sets in graphs induced by I. Namely, we can introduce\nE = {〈P,Q〉∈ U × U ; P 6= Q and ||Q ⇒ Q↓↑||P 6= 1} (19)\nIf U (defined as before) is non-empty, then G = 〈U , E ∪ E−1〉 is a graph. Furthermore, for any P ⊆ U , [11] defines the following subsets of U :\nPred(P) = ⋃\nQ∈P{P ∈ U ; 〈P,Q〉 ∈ E}. (20)\nThe main observations of [11] which allow to determine systems of pseudointents as particular maximal independent sets are the following:\n(i) P is a system of pseudo-intents iff U \\ P = Pred(P);\n(ii) If U \\ P = Pred(P), then P is a maximal independent set in G.\nThe implications of [11] are more or less just theoretical because in practice one is unable to use such a graph-based procedure to find a system of pseudo-intents— because of the enormous size of G, enumerating of all maximal independent sets satisfying the additional condition (i) is intractable. Furthermore, the description does not answer the question if for any finite L and arbitrary hedge ∗ there exists at least one system of pseudo-intents. This remains an open problem [42]."}, {"heading": "4 Results", "text": "The first observation we present in this section involves sets of FAIs in a special form. From the model-theoretic point of view, we show that for each set of FAIs, one can find an equivalent set where the consequents of all the FAIs contained in the set are models. This property is introduced in the following definition.\nDefinition 3. Let Σ be a set of FAIs. We say that the FAIs in Σ have saturated consequents whenever for every A ⇒ B ∈ Σ, we have [A]Σ ⊆ B.\nObviously, whether a given A ⇒ B has a saturated consequent depends on Σ from which it is taken. Applying Proposition 1, it follows that FAIs in Σ have saturated consequents iff for every A ⇒ B ∈ Σ, we have B = [A]Σ. Therefore, if FAIs in Σ have saturated consequents, then all FAIs in Σ are of the form A ⇒ [A]Σ. The following assertion shows that each set of FAIs admits an equivalent set of FAIs with saturated consequents.\nLemma 4. Let Γ be a set of FAIs and let\nΣ = {A ⇒ [A]Γ; A ⇒ B ∈ Γ}. (21)\nThen, Σ and Γ are equivalent. In addition, if Γ is minimal then so is Σ.\nProof. In order to prove the first part of the claim, according to Proposition 2 it suffices to check that Γ and Σ given by (21) have the same models. This can be checked using Proposition 1 as follows.\nLet M ∈ Mod(Γ). In order to prove that M ∈ Mod(Σ), it suffices to prove ||A ⇒ [A]Γ||M = 1 for each A ⇒ [A]Γ ∈ Σ which is indeed true: Using Proposition 1, we get ||A ⇒ [A]Γ||Γ = 1 on the account of [A]Γ ⊆ [A]Γ. Since M ∈ Mod(Γ), we therefore have ||A ⇒ [A]Γ||M = 1.\nConversely, let M ∈ Mod(Σ) and take any A ⇒ B ∈ Γ. Observe that ||A ⇒ B||Γ = 1 and thus B ⊆ [A]Γ owing to Proposition 1. Since A ⇒ [A]Γ ∈ Σ, it follows that S(A,M)∗ ≤ S([A]Γ,M) which further gives\nS(A,M)∗ ≤ S([A]Γ,M) ≤ S(B,M)\nbecause B ⊆ [A]Γ and the graded subsethood is antitone in the first argument, i.e., S(B1,M) ≤ S(B2,M) whenever B2 ⊆ B1. Hence, S(A,M)∗ ≤ S(B,M) gives ||A ⇒ B||M = 1.\nThe second claim is an easy consequence of the first one: Suppose that Γ is minimal. Since Σ and Γ are equivalent, we then have |Γ| ≤ |Σ|. Directly from (21), it follows that |Σ| ≤ |Γ| and thus |Γ| = |Σ| which shows that Σ is minimal as well.\nSince Γ and Σ given by (21) are equivalent, it is easy to see that each FAI in Σ is of the form A ⇒ [A]Σ, i.e., the consequents on FAIs in Σ are saturated. Also note that if the FAIs in Γ already have saturated consequents, then Σ = Γ for Σ given by (21).\nExample 1. (a) Let us note that Σ given by (21) may be strictly smaller than Γ in terms of the number of formulas. This is true even in the case when L is the two-element Boolean algebra. Indeed, for Γ given by\nΓ = {{p} ⇒ {q}, {p} ⇒ {r}},\nwe obviously have [{p}]Γ = {q, r} and thus the corresponding Σ given by (21) is of the form\nΣ = {{p} ⇒ {q, r}}.\n(b) Notice that in the previous case, both Σ and Γ are non-redundant. In general, given a non-redundant Γ, it may happen that the corresponding Σ given by (21) is redundant. For instance, consider Γ as follows:\nΓ = {{} ⇒ {p}, {p} ⇒ {q}}.\nSince [{}]Γ = [{p}]Γ = {p, q}, Σ given by (21) is of the form\nΣ = {{} ⇒ {p, q}, {p} ⇒ {p, q}}.\nNow, observe that Γ is non-redundant while Σ is redundant because {p} ⇒ {p, q} is redundant in Σ. Therefore, unlike in the case of minimality, see Lemma 4, nonredundancy is not preserved by saturating the consequents of FAIs as in (21).\nLemma 4 allows us to restrict our considerations on bases only to sets of FAIs with saturated consequents. Thus, for brevity, for any Γ consisting of FAIs over Y , we let\nTh(Γ, Y ) = {A ⇒ [A]Γ; A ∈ L Y and A 6= [A]Γ}. (22)\nTrivially, Γ and Th(Γ, Y ) are equivalent and the consequents in all FAIs in Th(Γ, Y ) are obviously saturated. For subsets Σ ⊆ Th(Γ, Y ), we have the following if-and-only-if condition for Σ and Γ being equivalent.\nTheorem 5. For any Σ ⊆ Th(Γ, Y ), the following conditions are equivalent:\n(i) Σ and Γ are equivalent as sets of FAIs.\n(ii) For every A ∈ LY such that A 6= [A]Γ :\nif A ∈ Mod(Σ \\ {A ⇒ [A]Γ}), then A ⇒ [A]Γ ∈ Σ.\nProof. Let Σ and Γ be equivalent. Take any A ∈ LY such that A 6= [A]Γ. Moreover, let us assume that A ⇒ [A]Γ 6∈ Σ. Obviously, Σ \\ {A ⇒ [A]Γ} = Σ, i.e., in order to prove (ii), it suffices to show that\nA 6∈ Mod(Σ \\ {A ⇒ [A]Γ}) = Mod(Σ)\nbut this is indeed the case: A 6= [A]Γ means A 6∈ Mod(Γ) and so Proposition 2 gives A 6∈ Mod(Σ) because Σ and Γ are equivalent.\nConversely, assume that (ii) is satisfied. Since Σ ⊆ Th(Γ, Y ) and in addition\nΓ and Th(Γ, Y ) are equivalent, Proposition 2 yields\nMod(Γ) = Mod(Th(Γ, Y )) ⊆ Mod(Σ).\nTherefore, in order to prove the equivalence of Γ and Σ, it suffices to check the converse inclusion. By contradiction, let us assume that Mod(Σ) * Mod(Γ). Using this assumption, there is A ∈ Mod(Σ) such that A 6∈ Mod(Γ). Utilizing the fact A 6∈ Mod(Γ), it directly follows that A 6= [A]Γ. In addition, A ∈ Mod(Σ) gives A ∈ Mod(Σ\\{A ⇒ [A]Γ}). Hence, using (ii), we get A ⇒ [A]Γ ∈ Σ. Using the fact A ∈ Mod(Σ) again, ||A ⇒ [A]Γ||A = 1, i.e., S(A,A) ∗ ≤ S([A]Γ, A). The\nlast inequality gives\n1 = 1∗ = S(A,A)∗ ≤ S([A]Γ, A),\nwhich in fact shows that [A]Γ ⊆ A which together with the extensivity A ⊆ [A]Γ of [· · ·]Γ contradicts A 6= [A]Γ. Therefore, Mod(Σ) ⊆ Mod(Γ), i.e., Σ and Γ are equivalent owing to Proposition 2.\nThe following lemma shows that the converse implication to that in Theo-\nrem 5 (ii) constitutes a sufficient condition of non-redundancy.\nLemma 6. Let Σ ⊆ Th(Γ, Y ) be a set of FAIs satisfying the following condition: For every A ⇒ [A]Γ ∈ Σ, we have A ∈ Mod(Σ \\ {A ⇒ [A]Γ}). Then, Σ is nonredundant.\nProof. Clearly, for any A ⇒ [A]Γ ∈ Σ, using the fact that A ⇒ [A]Γ ∈ Th(Γ, Y ), i.e., A 6= [A]Γ, it follows that ||A ⇒ [A]Γ||A < 1 and thus A 6∈ Mod(Σ). Hence, A ∈ Mod(Σ \\ {A ⇒ [A]Γ}) gives that A ⇒ [A]Γ is not redundant in Σ because the theories Σ \\ {A ⇒ [A]Γ} and Σ are not equivalent.\nExample 2. The converse implication to that in Lemma 6 does not hold in general. For instance, let L be a three-element Lukasiewicz chain and let ∗ be the identity on L = {0, 0.5, 1}. Furthermore, consider Σ such as\nΣ = {{p} ⇒ {p, q}, {} ⇒ {0.5/q}}.\nObserve that Σ is non-redundant. Indeed, we have that {} 6∈ Mod(Σ) because ||{} ⇒ {0.5/q}||{} = 0.5 < 1 and ||{p} ⇒ {p, q}||{} = 1, i.e., {} ⇒ { 0.5/q} is not redundant in Σ. Furthermore,\n||{p} ⇒ {p, q}||{p,0.5/q} = 1 → S({p, q}, {p, 0.5/q}) = 1 → 0.5 = 0.5 < 1,\ni.e., {p, 0.5/q} 6∈ Mod(Σ). On the other hand, we clearly have\n||{} ⇒ {0.5/q}||{p,0.5/q} = 1 → S({ 0.5/q}, {p, 0.5/q}) = 1 → 1 = 1.\nAltogether, {p} ⇒ {p, q} is not redundant in Σ. Also note that both FAIs in Σ have saturated consequents since [{p}]Σ = {p, q} and [{}]Σ = {0.5/q}. Now, observe that for {p} ⇒ {p, q} ∈ Σ, we have\n||{} ⇒ {0.5/q}||{p} = 1 → S({ 0.5/q}, {p})\n= 1 → ((0 → 1) ∧ (0.5 → 0))\n= 1 → (1 ∧ 0.5) = 1 → 0.5 = 0.5 < 1,\nwhich shows that {p} 6∈ Mod(Σ \\ {{p} ⇒ {p, q}}), i.e., the converse implication to that in Lemma 6 does not hold for general L. Let us note that an analogous observation can also be made for ∗ being (4) or for L being the two-element Boolean algebra in which case at least three distinct attributes must be used to find a counterexample.\nIn the rest of this section, we pay attention to a condition which is derived from the assumption in Lemma 6. As we have shown, the condition in Lemma 6 is sufficient for non-redundancy but not necessary in general. Indeed, Example 2 shows a non-redundant Σ ⊆ Th(Γ, Y ) and a particular A ⇒ [A]Γ ∈ Σ such that A 6∈ Mod(Σ \\ {A ⇒ [A]Γ}). In general, if A ∈ Mod(Σ \\ {A ⇒ [A]Γ}) for A ⇒ [A]Γ ∈ Σ, we may say that A acts as a “witness” of the non-redundancy of A ⇒ [A]Γ in Σ because A is a model of Σ \\ {A ⇒ [A]Γ} but it is not a model of Σ, see Proposition 2. If A 6∈ Mod(Σ \\ {A ⇒ [A]Γ}), A does not act as such a witness because A 6∈ Mod(Σ) and A 6∈ Mod(Σ \\ {A ⇒ [A]Γ}). Therefore, for a non-redundant Σ ⊆ Th(Γ, Y ) we may consider whether its non-redundancy is witnessed by antecedents of FAIs in Σ which is, in fact, a stronger requirement on non-redundancy. We introduce the key notion as follows.\nDefinition 7. Let Σ be a non-redundant set of FAIs. We say that the nonredundancy of Σ is witnessed (by the antecedents of FAIs in Σ) whenever for every A ⇒ B ∈ Σ, we have that A ∈ Mod(Σ \\ {A ⇒ B}).\nRemark 3. Let us note that the general property A ∈ Mod(Σ\\{A ⇒ B}) whenever A ⇒ B ∈ Σ may also be possessed by sets of FAIs which are redundant. For instance, one can consider Σ = {{} ⇒ {}} which trivially has this property.\nIn order to prove the existence of sets of FAIs which witnessed non-redundancy\nfor a particular setting of structures of degrees and hedges, we utilize the following technical observation which ensures the existence of a total strict order on antecedents of FAIs in a given set of FAIs.\nLemma 8. Let L be a complete residuated lattice with globalization, Γ be a\nfinite non-redundant set of FAIs with saturated consequents, and\nX = { A ∈ LY ; A ⇒ [A]Γ ∈ Γ } . (23)\nThen, there exists a strict total order relation ⊳ on X such that\n[B]Γ\\{B⇒[B]Γ} = [B]{A⇒[A]Γ∈Γ;A⊳B} (24)\nfor all B ∈ X .\nProof. It is immediate that the claim holds trivially for Γ = ∅. We inspect the situation for Γ 6= ∅. The finiteness of Γ gives that X is finite as well. We proceed by induction and assume that we have already found A1, . . . , An ∈ X (n ≥ 0) such that A1 ⊳ · · · ⊳ An and we put\nΨ = {A1 ⇒ [A1]Γ, . . . , An ⇒ [An]Γ}.\nIn order to prove the assertion, we check that if Γ \\ Ψ is non-empty, then it contains some B ⇒ [B]Γ such that\n[B]Γ\\{B⇒[B]Γ} = [B]Ψ\nfrom which we immediately get that A1 ⊳ · · · ⊳ An can be extended by An ⊳ B, see (24). By contradiction, let us assume that Γ \\ Ψ is non-empty and no such B ⇒ [B]Γ ∈ Γ \\Ψ exists. Thus, we assume that for each B ⇒ [B]Γ ∈ Γ \\ Ψ we have [B]Ψ ⊂ [B]Γ\\{B⇒[B]Γ} because Ψ ⊆ Γ \\ {B ⇒ [B]Γ}.\nObserve that for each B0 ⇒ [B0]Γ ∈ Γ \\Ψ, there is Ψ1 6= ∅ which is minimal\nin the number of contained FAIs such that Ψ ∪Ψ1 ⊆ Γ \\ {B0 ⇒ [B0]Γ} and\n[B0]Ψ∪Ψ1 = [B0]Γ\\{B0⇒[B0]Γ}.\nTherefore, using the fact that ∗ is globalization together with the last equality and the fact that [B0]Ψ ⊂ [B0]Γ\\{B0⇒[B0]Γ}, it follows that there must be some B1 ⇒ [B1]Γ ∈ Ψ1 \\ Ψ with B1 6= B0 such that the following conditions are satisfied:\n• B1 ⊆ [B0]Ψ,\n• [B1]Γ ⊆ [B0]Γ\\{B0⇒[B0]Γ}, and thus\n• [B1]Γ ⊆ [B0]Γ.\nNow, the same observation can be made for B1 ⇒ [B1]Γ. That is, there is some B2 ⇒ [B2]Γ ∈ Γ \\Ψ such that the following conditions are satisfied:\n• B2 ⊆ [B1]Ψ,\n• [B2]Γ ⊆ [B1]Γ\\{B1⇒[B1]Γ}, and\n• [B2]Γ ⊆ [B1]Γ.\nTherefore, we may repeat the idea over and over again to form a sufficiently long sequence B0, B1, B2, . . . in which, owing to the finiteness of Γ, there must be two indices i < j such that Bi = Bj . As a consequence of the above-listed properties of the elements in the sequence, we obtain [Bi]Ψ = · · · = [Bj ]Ψ as well as [Bi]Γ = · · · = [Bj ]Γ. Now, observe that using Bi 6= Bi+1, we trivially get\n||Bi+1 ⇒ [Bi+1]Γ||Γ\\{Bi⇒[Bi]Γ} = 1\nbecause Bi+1 ⇒ [Bi+1]Γ ∈ Γ. Moreover, the fact that [Bi]Γ = [Bi+1]Γ yields\n||Bi+1 ⇒ [Bi]Γ||Γ\\{Bi⇒[Bi]Γ} = 1. (25)\nFinally, using Bi+1 ⊆ [Bi+1]Ψ = [Bi]Ψ and Proposition 1, we get that\n1 = ||Bi ⇒ Bi+1||Ψ ≤ ||Bi ⇒ Bi+1||Γ\\{Bi⇒[Bi]Γ} (26)\non the account of Ψ ⊆ Γ \\ {Bi ⇒ [Bi]Γ}. Since the semantic entailment of FAIs is transitive, from (25) and (26) we further get\n||Bi ⇒ [Bi]Γ||Γ\\{Bi⇒[Bi]Γ} = 1\nwhich contradicts the non-redundancy of Γ. As a result, A1 ⊳ · · · ⊳ An can always be extended by some B ∈ X satisfying (24) provided that Γ \\ Ψ is non-empty. Since Γ is finite, this ultimately defines a strict total order on X satisfying (24).\nExample 3. Let us note that in general the existence of the strict total order described in Lemma 8 is not ensured if ∗ is other than the globalization. For illustration, let us consider the same structure of truth degrees as in Example 2 with ∗ being the identity. Furthermore, consider Γ such as\nΓ = {{0.5/r} ⇒ {p, 0.5/q, 0.5/r}, {} ⇒ {p}}.\nIn this case, we clearly have\n[{0.5/r}]Γ\\{{0.5/r}⇒{p,0.5/q,0.5/r}} = [{ 0.5/r}]{{}⇒{p}} = {p, 0.5/r},\nwhich means that for ⊳ satisfying (24) we must have {} ⊳ {0.5/r}. On the other hand, we also have\n[{}]Γ\\{{}⇒{p}} = [{}]{{0.5/r}⇒{p,0.5/q,0.5/r}} = { 0.5/p},\ni.e., {0.5/r} ⊳ {}. Hence, ⊳ cannot be a strict total order. Analogous counterexamples may also be found using other structures of degrees, including the three-element Gödel chain with ∗ being the identity.\nTheorem 9. Let L be a complete residuated lattice with globalization. Then,\nfor each finite non-redundant set of FAIs with saturated consequents there is an equivalent non-redundant set of FAIs with witnessed non-redundancy.\nProof. Let Γ be a non-redundant set of FAIs with saturated consequents. Recall that in this case, each A ⇒ B ∈ Γ is in fact in the form A ⇒ [A]Γ. In addition, since Γ is non-redundant, we have A 6= [A]Γ whenever A ⇒ [A]Γ ∈ Γ, i.e., it follows that Γ ⊆ Th(Γ, Y ). Now, put\nΣ = { [A]Γ\\{A⇒[A]Γ} ⇒ [A]Γ; A ⇒ [A]Γ ∈ Γ } . (27)\nFirst, we prove that Σ and Γ are equivalent. According to Proposition 2, it means showing that Mod(Γ) = Mod(Σ). Clearly, if M ∈ Mod(Γ) and for A ⇒ [A]Γ ∈ Γ we have [A]Γ\\{A⇒[A]Γ} ⊆ M , then A ⊆ M because of the extensivity of [· · ·]Γ\\{A⇒[A]Γ} which directly gives [A]Γ ⊆ M on account of M ∈ Mod(Γ). As a consequence, we have Mod(Γ) ⊆ Mod(Σ). Thus, it remains to prove the converse inclusion.\nTake any M ∈ Mod(Σ). Applying Lemma 8, we assume that ⊳ is the strict total order satisfying (24). Furthermore, for a given A ⇒ [A]Γ ∈ Γ, we assume that ||B ⇒ [B]Γ||M = 1 holds for all B ⊳ A. Using Lemma 8 and the fact that ∗ is globalization [16], we may write\n[A]Γ\\{A⇒[A]Γ} = A ∪ [B1]Γ ∪ · · · ∪ [Bn]Γ (28)\nfor B1 ⊳ · · · ⊳ Bn ⊳ A so that for the elements in the sequence, we have B1 ⊆ A, B2 ⊆ A ∪ [B1]Γ, B3 ⊆ A ∪ [B1]Γ ∪ [B2]Γ, . . . , i.e., in general\nBi ⊆ A ∪ ⋃ {[Bk]Γ; k < i}\nfor all i = 1, . . . , n. Now, suppose that A ⊆ M . It is easy to see that by induction over i = 1, . . . , n, it follows that\nBi ⊆ A ∪ ⋃ {[Bk]Γ; k < i} ⊆ M\nfor all i = 1, . . . , n. Since for each Bi ⇒ [Bi]Γ ∈ Γ we have Bi ⊳ A and for such a formula we have assumed ||Bi ⇒ [Bi]Γ||M = 1, the previous inclusion gives [Bi]Γ ⊆ M for all i = 1, . . . , n. Therefore, from (28) it follows that\n[A]Γ\\{A⇒[A]Γ} ⊆ M.\nFurthermore, (27) and M ∈ Mod(Σ) together with the previous inclusion yield [A]Γ ⊆ M which proves ||A ⇒ [A]Γ||M = 1. Since A ⇒ [A]Γ was taken as an arbitrary formula in Γ, we get M ∈ Mod(Γ). Hence, Γ and Σ are equivalent.\nWe now show that Σ is non-redundant and its non-redundancy is witnessed. In order to see that, we check the condition in Lemma 6. Thus, take an arbitrary [A]Γ\\{A⇒[A]Γ} ⇒ [A]Γ ∈ Σ. Notice that [A]Γ\\{A⇒[A]Γ} is not a\nmodel of Γ because [A]Γ\\{A⇒[A]Γ} ⊆ [A]Γ and the non-redundancy of Γ yields ||A ⇒ [A]Γ||Γ\\{A⇒[A]Γ} < 1, i.e., [A]Γ * [A]Γ\\{A⇒[A]Γ} and therefore we get that [A]Γ\\{A⇒[A]Γ} ⊂ [A]Γ, i.e., Σ ⊆ Th(Γ, Y ). Now, suppose that\n[B]Γ\\{B⇒[B]Γ} ⊆ [A]Γ\\{A⇒[A]Γ}\nfor any [B]Γ\\{B⇒[B]Γ} ⇒ [B]Γ ∈ Σ such that B 6= A. As an immediate consequence of the extensivity of [· · ·]Γ\\{B⇒[B]Γ}, we get\nB ⊆ [A]Γ\\{A⇒[A]Γ}.\nMoreover, B ⇒ [B]Γ ∈ Γ and since A 6= B, [A]Γ\\{A⇒[A]Γ} is a model of all FAIs in Γ with the exception of A ⇒ [A]Γ, i.e., including B ⇒ [B]Γ ∈ Γ. Therefore, it follows that\n[B]Γ ⊆ [A]Γ\\{A⇒[A]Γ}.\nAs a consequence, [A]Γ\\{A⇒[A]Γ} is a model of\nΣ \\ {[A]Γ\\{A⇒[A]Γ} ⇒ [A]Γ}.\nNow, apply Lemma 6.\nExample 4. The construction in Theorem 9 cannot be extended to any L with arbitrary ∗. For instance, let L be the three-element Gödel chain with ∗ being the identity. Furthermore, let\nΓ = {{0.5/p} ⇒ {0.5/p, 0.5/q, r}, {p} ⇒ {p, q, r}}.\nThen, the corresponding Σ given by (27) is\nΣ = {{0.5/p, 0.5/q, 0.5/r} ⇒ {0.5/p, 0.5/q, r}, {p, 0.5/q, r} ⇒ {p, q, r}}\nbecause, using the fact that ⊗ is ∧, we have\n[{0.5/p}]{{p}⇒{p,q,r}} = { 0.5/p, 0.5/q, 0.5/r},\n[{p}]{{0.5/p}⇒{0.5/p,0.5/q,r}} = {p, 0.5/q, r}.\nTrivially, {0.5/p} ∈ Mod(Σ) because\n||{0.5/p, 0.5/q, 0.5/r} ⇒ {0.5/p, 0.5/q, r}||{0.5/p} = 0 → 0 = 1,\n||{p, 0.5/q, r} ⇒ {p, q, r}}||{0.5/p} = 0 → 0 = 1.\nIn contrast, {0.5/p} 6∈ Mod(Γ) since\n||{0.5/p} ⇒ {0.5/p, 0.5/q, r}||{0.5/p} = 1 → 0 = 0.\nHence, using Proposition 2, Γ and Σ are not equivalent.\nThe following assertion gives a connection between sets of FAIs with witnessed non-redundancy and systems of pseudo-intents, see (17). As a consequence, under the assumption of ∗ being the globalization, we establish a procedure for getting a non-redundant base given by pseudo-intents from any non-redundant base of a given L-context.\nTheorem 10. Let I = 〈X,Y, I〉 be a formal L-context, Σ be a non-redundant base of I. Then, the following conditions are equivalent:\n(i) Σ ⊆ Th(Σ, Y ) and the non-redundancy of Σ is witnessed.\n(ii) There is a system P of pseudo-intents of I such that Σ is given by (18).\nProof. Clearly, if Σ is given by (18) for some system P of pseudo-intents of I, then Σ ⊆ Th(Σ, Y ). Furthermore, since Σ is complete in I, we haveM↓↑ = [M ]Σ for all M ∈ LY , see [18, Theorem 5.3]. Now, assume that (i) holds. Since Σ is complete in I, Theorem 5 yields that for each P 6= P ↓↑, we have P ⇒ P ↓↑ ∈ Σ provided that P ∈ Mod(Σ \\ {P ⇒ P ↓↑}). In addition to that, the fact that the non-redundancy of Σ is witnessed gives that for each P 6= P ↓↑, we have P ∈ Mod(Σ \\ {P ⇒ P ↓↑}) provided that P ⇒ P ↓↑ ∈ Σ. Altogether, for each P 6= P ↓↑, we have"}, {"heading": "P ⇒ P ↓↑ ∈ Σ iff P ∈ Mod(Σ \\ {P ⇒ P ↓↑}).", "text": "Thus, for P = {P ∈ LY ; P ⇒ P ↓↑ ∈ Σ}, it follows that for each P 6= P ↓↑:\nP ∈ P iff P ∈ Mod(Σ \\ {P ⇒ P ↓↑}).\nNow, observe that P ∈ Mod(Σ \\ {P ⇒ P ↓↑}) is true iff for each Q ⇒ Q↓↑ ∈ Σ such that Q 6= P , we have ||Q ⇒ Q↓↑||P = 1 Hence, for each P 6= P ↓↑:\nP ∈ P iff ||Q ⇒ Q↓↑||P = 1 for any Q ∈ P such that Q 6= P.\nAltogether, P is a system of pseudo-intents and Σ is of the form (18) which proves (ii). Conversely, (i) is a direct consequence of (ii).\nCorollary 11. Let I = 〈X,Y, I〉 be a formal L-context and let Γ be a nonredundant base of I which consists of FAIs with saturated consequents. If L is finite and ∗ is globalization, then Σ given by (27) is a minimal base of I and\nP = {A ∈ LY; A ⇒ B ∈ Σ} (29)\nis a system of pseudo-intents of I.\nProof. Apply Theorem 9 and Theorem 10. The minimality of Σ then follows by [18, Theorem 5.20], cf. also [9].\nRemark 4. Corollary 11 allows us to find a non-redundant base of I given by a system of pseudo-intents in an alternative way. The method is restricted to ∗ being globalization but as we shall see in Section 5, the procedure may produce the desired base even in case of general hedges and our experiments indicate that this happens frequently. Compared to the graph-based method discussed in Section 3, such an approach is considerably faster."}, {"heading": "5 Experimental Observations and Comments", "text": "In this section, we present an additional experimental insight into the problem of computing sets of FAIs with witnessed non-redundancy based on the observation in the proof of Theorem 9 and Corollary 11. Recall that the assertions presuppose that the utilized hedge is a globalization and Example 4 shows that the procedure cannot be extended for arbitrary hedges in general. That is, if Γ is finite and non-redundant set of FAIs with saturated consequents, it can happen that Σ given by (27) is not equivalent to Γ. A question is whether such\nsituations are frequent or rare. The first series of our experiments focuses on this phenomenon.\nWe have performed experiments with randomly generated non-redundant sets of FAIs with saturated consequents using structures of truth degrees defined on 11-element equidistant subchains of the real unit interval. The utilized structures of degrees were all BL-algebras [35, 36] which can be defined on such chains. It is a well-known fact that such BL-algebras result as ordinal sums [35] of finite linear Lukasiewicz algebras and are given solely by the elements which are idempotent with respect to ⊗, see [38, 23]. The hedge was always considered as the identity. Recall that in this setting, Σ given by (27) is not equivalent to the input Γ in general. Nevertheless, our experimental observations show that with growing number of idempotents in the structure, the ratio of successful transformations of Γ to an equivalent Σ given by (27) is decreasing. Figure 1 shows the mean percentages of successful transformations depending on the number of idempotents in linear 11-element BL-algebras with ∗ being the identity. The graph was generated using more than 106 randomly generated sets of\nFAIs consisting of 20 formulas using up to 10 distinct attributes. Interestingly, in case of the 11-element Lukasiewicz chain (the case of only 2 idempotents), the transformation was always successful. Therefore, we hypothesize that at least on finite Lukasiewicz chains, Theorem 9 can be extended to ∗ being the identity. To prove this hypothesis is an interesting open problem. Note that due to Example 3, one cannot use the proof technique of Theorem 9 because the utilized strict total order described in Lemma 8 may not exist. Also note that even in the worst case which seems to be the 11-element Gödel chain (all elements idempotent), the percentage of successes is relatively high (above 87%), i.e., we can say that even if Theorem 9 does not hold for general hedges, the chance of obtaining a desired equivalent set of FAIs with witnessed non-redundancy is relatively high.\nOur next experiment shows the comparison of running times needed to determine a non-redundant base given by systems of pseudo-intents using the graph-based method outlined in Section 3 and the alternative method based on removing redundant FAIs from a complete set consisting of FAIs with saturated consequents and then applying Theorem 9. Figure 2 shows the alter-\nnative method is (as expected) faster by an order of several magnitudes. The graph was generated based on observing the running time of the algorithms for 105 randomly generated contexts with 50 objects and (only) 4 attributes using a three-element Lukasiewicz chain. For higher numbers of attributes and/or higher numbers of truth degrees, the graph-based method is practically not applicable. The graph in Figure 2 shows the dependency of the mean running time on the density of input data sets which is for I = 〈X,Y, I〉 introduced as\n∑\nx∈X\n∑\ny∈Y I(x, y)\n|X | · |Y | · 100. (30)\nNotice that Figure 2 shows that the tendency of the graph-based algorithm is that for sparse datasets (i.e., datasets where the value of (30) is small) the running time is higher than for more dense datasets. This is caused by the fact that in such cases, the graphs associated to input data are usually more complex. On the contrary, Figure 3 and Figure 4 show that in the case of the alternative algorithm, the running time more or less copies the size of the computed bases (in terms of the number of formulas contained in the bases). This behavior may be considered more natural. For both, we have used the same parameters: L with 5 truth degrees and 104 randomly generated datasets with 10 objects and 10 attributes.\nTo sum up, the experiments presented in this section indicate that (i) the method of computing bases with witnessed non-redundancy presented in this paper can be applied even if ∗ is not a globalization and its success rate is relatively high, and (ii) the method significantly outperforms the graph-based method. As we have mentioned in the section, further investigation regarding the existence of systems of pseudo-intents for general hedges and possible generalizations of Theorem 9 are needed and we consider these important open problems."}, {"heading": "Acknowledgment", "text": "Supported by grant no. P202/14-11585S of the Czech Science Foundation."}], "references": [{"title": "Dependency structures of data base relationships, Information Processing", "author": ["William Ward Armstrong"], "venue": "Proceedings of IFIP Congress (Amsterdam)", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1974}, {"title": "Infinite-valued Gödel logics with 0-1 projections and relativizations, GÖDEL ’96, Logical Foundations of Mathematics, Computer Sciences and Physics (Berlin/Heidelberg)", "author": ["Mathias Baaz"], "venue": "Lecture Notes in Logic,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 1996}, {"title": "Optimizations in computing the duquenneguigues basis of implications", "author": ["Konstantin Bazhanov", "Sergei Obiedkov"], "venue": "Annals of Mathematics and Artificial Intelligence", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 2014}, {"title": "Fuzzy Relational Systems: Foundations and Principles", "author": ["Radim Belohlavek"], "venue": null, "citeRegEx": "4", "shortCiteRegEx": "4", "year": 2002}, {"title": "Implications from data with fuzzy attributes", "author": ["Radim Belohlavek", "Martina Chlupova", "Vilem Vychodil"], "venue": "IEEE International Conference on Advances in Intelligent Systems—Theory and Applications, University of Canberra, Centre de Recherche Public Henri Tudor,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 2004}, {"title": "An efficient reasoning method for dependencies over similarity and ordinal data, Modeling Decisions for Artificial Intelligence", "author": ["Radim Belohlavek", "Pablo Cordero", "Manuel Enciso", "Angel Mora", "Vilem Vychodil"], "venue": "Lecture Notes in Computer Science,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2012}, {"title": "Fuzzy closure operators with truth stressers", "author": ["Radim Belohlavek", "Tatana Funiokova", "Vilem Vychodil"], "venue": "Logic Journal of IGPL", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2005}, {"title": "Fuzzy attribute implications: Computing nonredundant bases using maximal independent sets, AI 2005: Advances in Artificial Intelligence (Shichao Zhang and Ray Jarvis, eds.)", "author": ["Radim Belohlavek", "Vilem Vychodil"], "venue": "Lecture Notes in Computer Science,", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 2005}, {"title": "Attribute implications in a fuzzy setting, Formal Concept Analysis (Rokia Missaoui and Jürg", "author": ["Radim Belohlavek", "Vilem Vychodil"], "venue": "Lecture Notes in Computer Science,", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 2006}, {"title": "Computing non-redundant bases of if-then rules from data tables with graded attributes", "author": ["Radim Belohlavek", "Vilem Vychodil"], "venue": "IEEE International Conference on Granular Computing, GrC 2006,", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2006}, {"title": "Data tables with similarity relations: Functional dependencies, complete rules and non-redundant bases, Database Systems for Advanced Applications", "author": ["Radim Belohlavek", "Vilem Vychodil"], "venue": "Lecture Notes in Computer Science,", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2006}, {"title": "The multiple facets of the canonical direct unit implicational basis", "author": ["Karell Bertet", "Bernard Monjardet"], "venue": "Theoretical Computer Science", "citeRegEx": "19", "shortCiteRegEx": "19", "year": 2010}, {"title": "Triangular norm based predicate fuzzy logics", "author": ["Petr Cintula", "Petr Hájek"], "venue": "Fuzzy Sets and Systems", "citeRegEx": "20", "shortCiteRegEx": "20", "year": 2010}, {"title": "Triangular norms on product lattices", "author": ["Bernard De Baets", "Radko Mesiar"], "venue": "Fuzzy Sets Syst", "citeRegEx": "23", "shortCiteRegEx": "23", "year": 1999}, {"title": "Decomposition of a data base and the theory of boolean switching functions, IBM", "author": ["Claude Delobel", "Richard G. Casey"], "venue": "Journal of Research and Development", "citeRegEx": "24", "shortCiteRegEx": "24", "year": 1973}, {"title": "Monoidal t-norm based logic: Towards a logic for leftcontinuous t-norms", "author": ["Francesc Esteva", "Llúıs Godo"], "venue": "Fuzzy Sets and Systems", "citeRegEx": "25", "shortCiteRegEx": "25", "year": 2001}, {"title": "A logical approach to fuzzy truth hedges", "author": ["Francesc Esteva", "Llúıs Godo", "Carles Noguera"], "venue": "Information Sciences", "citeRegEx": "26", "shortCiteRegEx": "26", "year": 2013}, {"title": "Functional dependencies in a relational database and propositional logic, IBM", "author": ["Ronald Fagin"], "venue": "Journal of Research and Development", "citeRegEx": "27", "shortCiteRegEx": "27", "year": 1977}, {"title": "Residuated Lattices: An Algebraic Glimpse at Substructural Logics, Volume", "author": ["Nikolaos Galatos", "Peter Jipsen", "Tomacz Kowalski", "Hiroakira Ono"], "venue": null, "citeRegEx": "28", "shortCiteRegEx": "28", "year": 2007}, {"title": "Two basic algorithms in concept analysis", "author": ["Bernhard Ganter"], "venue": "Proceedings of the 8th International Conference on Formal Concept Analysis (Berlin, Heidelberg),", "citeRegEx": "29", "shortCiteRegEx": "29", "year": 2010}, {"title": "Formal concept analysis: Mathematical foundations", "author": ["Bernhard Ganter", "Rudolf Wille"], "venue": null, "citeRegEx": "30", "shortCiteRegEx": "30", "year": 1997}, {"title": "Mathematical fuzzy logics", "author": ["Siegfried Gottwald"], "venue": "Bulletin of Symbolic Logic", "citeRegEx": "33", "shortCiteRegEx": "33", "year": 2008}, {"title": "Familles minimales d’implications informatives resultant d’un tableau de données", "author": ["Jean-Louis Guigues", "Vincent Duquenne"], "venue": "binaires, Math. Sci. Humaines", "citeRegEx": "34", "shortCiteRegEx": "34", "year": 1986}, {"title": "Basic fuzzy logic and BL-algebras", "author": ["Petr Hájek"], "venue": "Soft Computing", "citeRegEx": "35", "shortCiteRegEx": "35", "year": 1998}, {"title": "Fuzzy Sets and Fuzzy Logic: Theory and Applications, Prentice-Hall, Inc", "author": ["George J. Klir", "Bo Yuan"], "venue": "Upper Saddle River, NJ,", "citeRegEx": "39", "shortCiteRegEx": "39", "year": 1995}, {"title": "Multi-adjoint concept lattices with heterogeneous conjunctors and hedges", "author": ["Jan Konecny", "Jesús Medina", "Manuel Ojeda-Aciego"], "venue": "Annals of Mathematics and Artificial Intelligence", "citeRegEx": "40", "shortCiteRegEx": "40", "year": 2014}, {"title": "Fuzzy logic programming reduced to reasoning with attribute implications", "author": ["Tomas Kuhr", "Vilem Vychodil"], "venue": "Fuzzy Sets and Systems", "citeRegEx": "41", "shortCiteRegEx": "41", "year": 2015}, {"title": "Some open problems in formal concept analysis, ICFCA 2006, http://www.upriss.org.uk/fca/problems06.pdf", "author": ["Léonard Kwuida"], "venue": null, "citeRegEx": "42", "shortCiteRegEx": "42", "year": 2006}, {"title": "The direct-optimal basis via reductions", "author": ["Estrella Rodŕıguez Lorenzo", "Karell Bertet", "Pablo Cordero", "Manuel Enciso", "Angel Mora"], "venue": "Proceedings of the Eleventh International Conference on Concept Lattices and Their Applications, Košice, Slovakia, October", "citeRegEx": "43", "shortCiteRegEx": "43", "year": 2014}, {"title": "Dual multi-adjoint concept lattices", "author": ["Jesús Medina", "Manuel Ojeda-Aciego"], "venue": "Information Sciences", "citeRegEx": "45", "shortCiteRegEx": "45", "year": 2013}, {"title": "On fuzzy logic I: Many-valued rules of inference", "author": ["Jan Pavelka"], "venue": "Mathematical Logic Quarterly", "citeRegEx": "46", "shortCiteRegEx": "46", "year": 1979}, {"title": "An equivalence between relational database dependencies and a fragment of propositional logic", "author": ["Yehoshua Sagiv", "Claude Delobel", "D. Scott Parker", "Jr.", "Ronald Fagin"], "venue": "J. ACM", "citeRegEx": "50", "shortCiteRegEx": "50", "year": 1981}, {"title": "Globalization of intuitionistic set theory", "author": ["Gaisi Takeuti", "Satoko Titani"], "venue": "Annals of Pure and Applied Logic", "citeRegEx": "51", "shortCiteRegEx": "51", "year": 1987}, {"title": "Derivation digraphs for dependencies in ordinal and similarity-based data, Information Sciences", "author": ["Lucie Urbanova", "Vilem Vychodil"], "venue": null, "citeRegEx": "52", "shortCiteRegEx": "52", "year": 2014}, {"title": "On minimal sets of graded attribute implications", "author": ["Vilem Vychodil"], "venue": "Information Sciences", "citeRegEx": "53", "shortCiteRegEx": "53", "year": 2015}, {"title": "A fuzzy-set-theoretic interpretation of linguistic hedges", "author": ["Lotfi A. Zadeh"], "venue": "Journal of Cybernetics", "citeRegEx": "55", "shortCiteRegEx": "55", "year": 1972}], "referenceMentions": [{"referenceID": 4, "context": "In this paper, we introduce the notion of a witnessed non-redundancy of sets of graded attribute implications, study its properties and its relationship to the notion of a general system of pseudo-intents which has been introduced earlier [5].", "startOffset": 239, "endOffset": 242}, {"referenceID": 20, "context": "are if-then rules which generalize the ordinary attribute implications which appear in formal concept analysis [30].", "startOffset": 111, "endOffset": 115}, {"referenceID": 22, "context": "Guigues-Duquenne bases [34] which are determined by pseudo-intents of formal concepts are examples of such sets which are in addition minimal in terms of the number of contained formulas, cf.", "startOffset": 23, "endOffset": 27}, {"referenceID": 19, "context": "also [29].", "startOffset": 5, "endOffset": 9}, {"referenceID": 32, "context": "We prove that the proposed procedure works if we consider globalization [51] as a parameter of the interpretation of graded attribute implications.", "startOffset": 72, "endOffset": 76}, {"referenceID": 16, "context": "For linguistic hedges [17, 26, 37] other than the globalization, which serve as parameters of the interpretation of graded attribute implications, the procedure may not produce the desired base but as our experimental observations show, it seems to have a high success rate.", "startOffset": 22, "endOffset": 34}, {"referenceID": 2, "context": "The results contained in our paper fall in the category of results on bases of if-then rules generated from data [3, 19, 43] which develop ideas of the seminal paper [34].", "startOffset": 113, "endOffset": 124}, {"referenceID": 11, "context": "The results contained in our paper fall in the category of results on bases of if-then rules generated from data [3, 19, 43] which develop ideas of the seminal paper [34].", "startOffset": 113, "endOffset": 124}, {"referenceID": 28, "context": "The results contained in our paper fall in the category of results on bases of if-then rules generated from data [3, 19, 43] which develop ideas of the seminal paper [34].", "startOffset": 113, "endOffset": 124}, {"referenceID": 22, "context": "The results contained in our paper fall in the category of results on bases of if-then rules generated from data [3, 19, 43] which develop ideas of the seminal paper [34].", "startOffset": 166, "endOffset": 170}, {"referenceID": 25, "context": "Although we work with graded if-then rules with semantics defined using complete residuated lattices as structures of degrees and parameterized by linguistic hedges, our approach is general and we anticipate it can be adopted in recently developed approaches such as [40, 45].", "startOffset": 267, "endOffset": 275}, {"referenceID": 29, "context": "Although we work with graded if-then rules with semantics defined using complete residuated lattices as structures of degrees and parameterized by linguistic hedges, our approach is general and we anticipate it can be adopted in recently developed approaches such as [40, 45].", "startOffset": 267, "endOffset": 275}, {"referenceID": 3, "context": "Whenever possible, we keep the same notation as in [4] for general residuated structures and [18] for graded attribute implications.", "startOffset": 51, "endOffset": 54}, {"referenceID": 15, "context": "For our development, these structures represent a reasonable generalization of the most common structures of degrees defined on the real unit interval using leftcontinuous triangular norms [25, 38].", "startOffset": 189, "endOffset": 197}, {"referenceID": 3, "context": "Recall that a complete residuated lattice [4, 28] is an algebra L = 〈L,∧,∨,⊗,→, 0, 1〉 where 〈L,∧,∨, 0, 1〉 is a complete lattice (i.", "startOffset": 42, "endOffset": 49}, {"referenceID": 18, "context": "Recall that a complete residuated lattice [4, 28] is an algebra L = 〈L,∧,∨,⊗,→, 0, 1〉 where 〈L,∧,∨, 0, 1〉 is a complete lattice (i.", "startOffset": 42, "endOffset": 49}, {"referenceID": 12, "context": "We interpret ⊗ and → as it is usual in mathematical fuzzy logics [20, 32, 33, 36] and their applications [39]: ⊗ is a truth function of “fuzzy conjunction” and → is a truth function of “fuzzy implication”, cf.", "startOffset": 65, "endOffset": 81}, {"referenceID": 21, "context": "We interpret ⊗ and → as it is usual in mathematical fuzzy logics [20, 32, 33, 36] and their applications [39]: ⊗ is a truth function of “fuzzy conjunction” and → is a truth function of “fuzzy implication”, cf.", "startOffset": 65, "endOffset": 81}, {"referenceID": 24, "context": "We interpret ⊗ and → as it is usual in mathematical fuzzy logics [20, 32, 33, 36] and their applications [39]: ⊗ is a truth function of “fuzzy conjunction” and → is a truth function of “fuzzy implication”, cf.", "startOffset": 105, "endOffset": 109}, {"referenceID": 13, "context": "[23, 38].", "startOffset": 0, "endOffset": 8}, {"referenceID": 35, "context": "In addition to ⊗ and → which may be seen as generalizations of truth function of the classic logical connectives “conjunction” and “implication”, we make use of linguistic hedges [55, 56, 57, 58] which do not have nontrivial counterparts in classic logics.", "startOffset": 179, "endOffset": 195}, {"referenceID": 16, "context": "also [26] and [22] for recent results on hedges.", "startOffset": 5, "endOffset": 9}, {"referenceID": 32, "context": ", a = a for all a ∈ L), and (ii) the so-called globalization [51]:", "startOffset": 61, "endOffset": 65}, {"referenceID": 1, "context": "Note that on linear residuated lattices, the globalization coincides with the truth function of the Baaz ∆ connective [2].", "startOffset": 118, "endOffset": 121}, {"referenceID": 8, "context": "Alternatively, graded attribute implications are called fuzzy attribute implication [10] and for brevity we refer to the formulas as FAIs.", "startOffset": 84, "endOffset": 88}, {"referenceID": 20, "context": "This naturally generalizes the ordinary attribute implications and their semantics, see [30].", "startOffset": 88, "endOffset": 92}, {"referenceID": 30, "context": "This is consistent with the abstract logic framework proposed by Pavelka [46, 47, 48] which was inspired by the influential paper [32] by Goguen.", "startOffset": 73, "endOffset": 85}, {"referenceID": 6, "context": "The system Mod(Σ) of all models of any Σ is known to form a particular closure system (called an L-closure system [7]), see [16].", "startOffset": 114, "endOffset": 117}, {"referenceID": 8, "context": "The following proposition shows that the condition can be restated in several equivalent ways, see [10, 18].", "startOffset": 99, "endOffset": 107}, {"referenceID": 14, "context": "Since the classic attribute implications have an alternative database semantics [24, 27, 50] which yields the same notion of semantic entailment, it may be tempting to look for an analogous alternative semantics in the graded setting.", "startOffset": 80, "endOffset": 92}, {"referenceID": 17, "context": "Since the classic attribute implications have an alternative database semantics [24, 27, 50] which yields the same notion of semantic entailment, it may be tempting to look for an analogous alternative semantics in the graded setting.", "startOffset": 80, "endOffset": 92}, {"referenceID": 31, "context": "Since the classic attribute implications have an alternative database semantics [24, 27, 50] which yields the same notion of semantic entailment, it may be tempting to look for an analogous alternative semantics in the graded setting.", "startOffset": 80, "endOffset": 92}, {"referenceID": 10, "context": "In [12], it is shown that such an alternative semantics exists and that FAIs may alternatively be seen as formulas prescribing similarity-based dependencies in relational databases [44].", "startOffset": 3, "endOffset": 7}, {"referenceID": 0, "context": "(b) The semantic entailment introduced in this paper has (several) interesting Armstrong-style [1] axiomatizations.", "startOffset": 95, "endOffset": 98}, {"referenceID": 26, "context": "also [41] for an alternative axiomatization with an infinitary rule.", "startOffset": 5, "endOffset": 9}, {"referenceID": 5, "context": "An alternative inference systems based on the rules of simplification in presented in [6].", "startOffset": 86, "endOffset": 89}, {"referenceID": 33, "context": "A graph-based inference system for FAIs is presented in [52].", "startOffset": 56, "endOffset": 60}, {"referenceID": 3, "context": "The existing approaches are concerned with describing bases of objectattribute data with graded attributes which are formalized as formal L-contexts: For non-empty finite sets X (set of objects) and Y (set of attributes), and a binary L-relation I : X × Y → L, the triplet I = 〈X,Y, I〉 is called a formal L-context [4].", "startOffset": 315, "endOffset": 318}, {"referenceID": 6, "context": "The operators , ↑ form a so-called Galois connection with hedge [17] and their composition ↓↑ is an L-closure operator [7].", "startOffset": 119, "endOffset": 122}, {"referenceID": 4, "context": "Given I = 〈X,Y, I〉, which represents input data, we define the degree ||A ⇒ B||I to which A ⇒ B (A,B ∈ L Y ) is true in I, see [5], as follows: ||A ⇒ B||I = ∧", "startOffset": 127, "endOffset": 130}, {"referenceID": 22, "context": "The investigation of complete sets and bases in the graded setting started with [49] where the author generalizes the ordinary notion of a pseudo-intent [34], see also [29, 30].", "startOffset": 153, "endOffset": 157}, {"referenceID": 19, "context": "The investigation of complete sets and bases in the graded setting started with [49] where the author generalizes the ordinary notion of a pseudo-intent [34], see also [29, 30].", "startOffset": 168, "endOffset": 176}, {"referenceID": 20, "context": "The investigation of complete sets and bases in the graded setting started with [49] where the author generalizes the ordinary notion of a pseudo-intent [34], see also [29, 30].", "startOffset": 168, "endOffset": 176}, {"referenceID": 22, "context": "Clearly, for L being the twoelement Boolean algebra, the notion of a pseudo-intent coincides with the classic one [34].", "startOffset": 114, "endOffset": 118}, {"referenceID": 4, "context": "In [5], the authors propose a different notion of pseudo-intents in the graded setting.", "startOffset": 3, "endOffset": 6}, {"referenceID": 4, "context": "Namely, the approach in [5] started with using general hedges as parameters of the interpretation of FAIs in formal L-contexts (similar approach to parameterizations of if-then rules appeared in [14, 15]).", "startOffset": 24, "endOffset": 27}, {"referenceID": 4, "context": "(17) The results in [5, 9] show that if ∗ is globalization, then provided that L is finite, I admits a unique system of pseudo-intents which determines a minimal base", "startOffset": 20, "endOffset": 26}, {"referenceID": 34, "context": "In [53], a criterion for minimality of a general set of FAIs for ∗ being the globalization is described.", "startOffset": 3, "endOffset": 7}, {"referenceID": 7, "context": "In order to compute general systems of pseudo-intents considering general hedges, a graph-based method has been announced in [8] and further described in [11].", "startOffset": 125, "endOffset": 128}, {"referenceID": 9, "context": "In order to compute general systems of pseudo-intents considering general hedges, a graph-based method has been announced in [8] and further described in [11].", "startOffset": 154, "endOffset": 158}, {"referenceID": 9, "context": "Furthermore, for any P ⊆ U , [11] defines the following subsets of U :", "startOffset": 29, "endOffset": 33}, {"referenceID": 9, "context": "The main observations of [11] which allow to determine systems of pseudointents as particular maximal independent sets are the following:", "startOffset": 25, "endOffset": 29}, {"referenceID": 9, "context": "The implications of [11] are more or less just theoretical because in practice one is unable to use such a graph-based procedure to find a system of pseudo-intents— because of the enormous size of G, enumerating of all maximal independent sets satisfying the additional condition (i) is intractable.", "startOffset": 20, "endOffset": 24}, {"referenceID": 27, "context": "This remains an open problem [42].", "startOffset": 29, "endOffset": 33}, {"referenceID": 23, "context": "The utilized structures of degrees were all BL-algebras [35, 36] which can be defined on such chains.", "startOffset": 56, "endOffset": 64}, {"referenceID": 23, "context": "It is a well-known fact that such BL-algebras result as ordinal sums [35] of finite linear Lukasiewicz algebras and are given solely by the elements which are idempotent with respect to ⊗, see [38, 23].", "startOffset": 69, "endOffset": 73}, {"referenceID": 13, "context": "It is a well-known fact that such BL-algebras result as ordinal sums [35] of finite linear Lukasiewicz algebras and are given solely by the elements which are idempotent with respect to ⊗, see [38, 23].", "startOffset": 193, "endOffset": 201}], "year": 2015, "abstractText": "We study properties of particular non-redundant sets of if-then rules describing dependencies between graded attributes. We introduce notions of saturation and witnessed non-redundancy of sets of graded attribute implications are show that bases of graded attribute implications given by systems of pseudo-intents correspond to non-redundant sets of graded attribute implications with saturated consequents where the nonredundancy is witnessed by antecedents of the contained graded attribute implications. We introduce an algorithm which transforms any complete set of graded attribute implications parameterized by globalization into a base given by pseudo-intents. Experimental evaluation is provided to compare the method of obtaining bases for general parameterizations by hedges with earlier graph-based approaches.", "creator": "LaTeX with hyperref package"}}}