{"id": "1506.04359", "review": {"conference": "NIPS", "VERSION": "v1", "DATE_OF_SUBMISSION": "14-Jun-2015", "title": "Multi-class SVMs: From Tighter Data-Dependent Generalization Bounds to Novel Algorithms", "abstract": "68.95 This paper sefirot studies the fundus generalization performance 9x19mm of breakwell multi - anti-obesity class cuddling classification algorithms, 56.63 for which heedlessly we obtain, catucci for the maurito first +7.00 time, beeches a dabash data - brignoles dependent generalization mallige error cbot bound marrazzo with caballé a sahoo logarithmic dependence saramacca on the marquesan class size, substantially scholar-official improving the 80-73 state - gambala of - kamoga the - art linear dependence amirian in phototrophic the existing motels data - ottery dependent jehan generalization analysis. non-sex The theoretical southie analysis dority motivates ahlenius us to 64.42 introduce a lro new chungcheongbuk-do multi - class downshifts classification machine zellweger based bajeux on $ \\ jaywalker ell_p $ - trimet norm nitty regularization, where przegląd the parameter $ nayinzira p $ nabet controls argot the complexity 4,346 of aeropuerto the długie corresponding mprs bounds. zülle We derive an shf efficient optimization r.s. algorithm jadavpur based on saddlebag Fenchel duality theory. arrivistes Benchmarks iodization on driedger several real - world datasets show huw that re-issued the eurotrip proposed gottscheerish algorithm can elemer achieve significant accuracy gains over the perspicacity state pintado of the art.", "histories": [["v1", "Sun, 14 Jun 2015 08:07:23 GMT  (23kb)", "http://arxiv.org/abs/1506.04359v1", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["yunwen lei", "ürün dogan", "alexander binder", "marius kloft"], "accepted": true, "id": "1506.04359"}, "pdf": {"name": "1506.04359.pdf", "metadata": {"source": "CRF", "title": "Multi-class SVMs: From Tighter Data-Dependent Generalization Bounds to Novel Algorithms", "authors": ["Yunwen Lei", "Ürün Dogan", "Alexander Binder"], "emails": ["yunwen.lei@hotmail.com", "urundogan@gmail.com", "alexander.binder@tu-berlin.de", "kloft@hu-berlin.de"], "sections": [{"heading": null, "text": "ar X\niv :1\n50 6.\n04 35\n9v 1\n[ cs\n.L G\n] 1"}, {"heading": "1 Introduction", "text": "Typical multi-class application domains such as natural language processing [1], information retrieval [2], image annotation [3] and web advertising [4] involve tens or hundreds of thousands of classes, and yet these datasets are still growing [5]. To handle such learning tasks, it is essential to build algorithms that scale favorably with respect to the number of classes. Over the past years, much progress in this respect has been achieved on the algorithmic side [4–7], including efficient stochastic gradient optimization strategies [8].\nAlthough also theoretical properties such as consistency [9–11] and finite-sample behavior [1, 12– 15] have been studied, there still is a discrepancy between algorithms and theory in the sense that the corresponding theoretical bounds do often not scale well with respect to the number of classes. This discrepancy occurs the most strongly in research on data-dependent generalization bounds, that is, bounds that can measure generalization performance of prediction models purely from the training samples, and which thus are very appealing in model selection [16]. A crucial advantage of these bounds is that they can better capture the properties of the distribution that has generated the data, which can lead to tighter estimates [17] than conservative data-independent bounds.\nTo our best knowledge, for multi-class classification, the first data-dependent error bounds were given by [14]. These bounds exhibit a quadratic dependence on the class size and were used by [12] and [18] to derive bounds for kernel-based multi-class classification and multiple kernel learning\n∗yunwen.lei@hotmail.com †urundogan@gmail.com ‡alexander.binder@tu-berlin.de §kloft@hu-berlin.de\nproblems, respectively. More recently, [13] improve the quadratic dependence to a linear dependence by introducing a novel surrogate for the multi-class margin that is independent on the true realization of the class label.\nHowever, a heavy dependence on the class size, such as linear or quadratic, implies a poor generalization guarantee for large-scale multi-class classification problems with a massive number of classes. In this paper, we show data-dependent generalization bounds for multi-class classification problems that—for the first time—exhibit a sublinear dependence on the number of classes. Choosing appropriate regularization, this dependence can be as mild as logarithmic. We achieve these improved bounds via the use of Gaussian complexities, while previous bounds are based on a well-known structural result on Rademacher complexities for classes induced by the maximum operator. The proposed proof technique based on Gaussian complexities exploits potential coupling among different components of the multi-class classifier, while this fact is ignored by previous analyses.\nThe result shows that the generalization ability is strongly impacted by the employed regularization. Which motivates us to propose a new learning machine performing block-norm regularization over the multi-class components. As a natural choice we investigate here the application of the proven ℓp norm [19]. This results in a novel ℓp-norm multi-class support vector machine (SVM), which contains the classical model by Crammer & Singer [20] as a special case for p = 2. The bounds indicate that the parameter p crucially controls the complexity of the resulting prediction models.\nWe develop an efficient optimization algorithm for the proposed method based on its Fenchel dual representation. We empirically evaluate its effectiveness on several standard benchmarks for multiclass classification taken from various domains, where the proposed approach significantly outperforms the state-of-the-art method of [20] by up to 1%.\nThe remainder of this paper is structured as follows. Section 2 introduces the problem setting and presents the main theoretical results. Motivated by which we propose a new multi-class classification model in Section 3 and give an efficient optimization algorithm based on Fenchel duality theory. In Section 4 we evaluate the approach for the application of visual image recognition and on several standard benchmark datasets taken from various application domains. Section 5 concludes."}, {"heading": "2 Theory", "text": ""}, {"heading": "2.1 Problem Setting", "text": "This paper considers multi-class classification problems with c ≥ 2 classes. Let X denote the input space and Y = {1, 2, . . . , c} denote the output space. Assume that we are given a sequence of examples S = {(x1, y1), . . . , (xn, yn)} ∈ (X × Y)n, independently drawn according to a probability measure P defined on the sample space Z = X × Y. Based on the training examples S, we wish to learn a prediction rule hz from a space H of hypothesis mapping from Z to R and use the mapping x → argmaxy∈Y hz(x, y) to predict. For any hypothesis h ∈ H , the margin ρh(x, y) of the function h at a labeled example (x, y) is ρh(x, y) → h(x, y) − maxy′ 6=y h(x, y ′\n). The prediction rule h makes an error at (x, y) if ρh(x, y) ≤ 0 and thus the expected risk incurred from using h for prediction is R(h) := E[1ρh(x,y)≤0]."}, {"heading": "2.2 Notation", "text": "Any function h : X × Y → R can be equivalently represented by the function vector (h1, . . . , hc) with hj(x) = h(x, j), ∀j = 1, . . . , c. We denote by H̃ := {ρh(x, y) : h ∈ H} the class of margin functions associated to H . Let k : X × X → R be a mercer kernel with φ(x) being the associated feature map, i.e., k(x, y) = 〈φ(x), φ(y)〉. We denote by ‖ · ‖∗ the dual norm of ‖ · ‖, i.e., ‖w‖∗ = sup‖w̄‖≤1〈w, w̄〉. For a convex function f , we denote by f∗ its Fenchel conjugate, i.e., f∗(v) := supw[〈w, v〉 − f(w)]. For any w = (w1, . . . ,wc) we define the ℓ2,p-norm by ‖w‖2,p = [ ∑c j=1 ‖wj‖ p 2]\n1/p. For any p ≥ 1, we denote by p∗ the dual exponent of p satisfying 1/p+ 1/p∗ = 1 and p̄ := p(2− p)−1. In the remainder of the paper, we require the following definitions.\nDefinition 1 (Strong Convexity). A function f : X → R is said to be β-strongly convex w.r.t. a norm\n‖ · ‖ iff ∀x, y ∈ X and ∀α ∈ (0, 1), we have\nf(αx+ (1 − α)y) ≤ αf(x) + (1− α)f(y)− β 2 α(1 − α)‖x− y‖2.\nDefinition 2 (Regular Loss). We call ℓ a L-regular loss if it satisfies the following properties:\n(i) ℓ(t) bounds the 0-1 loss from above: ℓ(t) ≥ 1t≤0; (ii) ℓ is L-Lipschitz in the sense |ℓ(t1)− ℓ(t2)| ≤ L|t1 − t2|; (iii) ℓ(t) is decreasing and it has a zero point cℓ, i.e., ℓ(cℓ) = 0.\nSome examples of L-regular loss functions include the hinge ℓh(t) = (1− t)+ and the margin loss ℓρ(t) = 1t≤0 + (1 − tρ−1)10<t≤ρ, ρ > 0. (1)"}, {"heading": "2.3 Main results", "text": "Our discussion on data-dependent generalization error bounds is based on the established methodology of Rademacher and Gaussian complexities [21].\nDefinition 3 (Rademacher and Gaussian Complexity). Let H be a family of real-valued functions defined on Z and S = (z1, . . . , zn) a fixed sample of size n with elements in Z. Then, the empirical Rademacher and Gaussian complexities of H with respect to the sample S are defined by\nRS(H) = Eσ [ sup h∈H 1 n n∑\ni=1\nσih(zi) ] , GS(H) = Eg [ sup h∈H 1 n n∑\ni=1\ngih(zi) ] ,\nwhere σ1, . . . , σn are independent random variables with equal probability taking values +1 or −1, and g1, . . . , gn are independent N(0, 1) random variables.\nNote that we have the following comparison inequality relating Rademacher and Gaussian complexities [22]:\nRS(H) ≤ √ π\n2 GS(H) ≤ 3\n√ π\n2\n√ lognRS(H). (2)\nExisting work on data-dependent generalization bounds for multi-class classifiers [12–14, 18] build on the following structural result on Rademacher complexities (e.g., [12], Lemma 8.1):\nRS(max{h1, . . . , hc} : hj ∈ Hj , j = 1, . . . , c) ≤ c∑\nj=1\nRS(Hj), (3)\nwhere H1, . . . , Hc are c hypothesis sets. This result is crucial for the standard generalization analysis of multi-class classification since the definition of margin involves the maximum operator, which is removed by the above lemma, but at the expense of a linear dependency on the number of classes. In the following we show that this linear dependency is suboptimal because (3) does not take into account the coupling among different classes. For example, a common regularizer used in multi-class classification algorithms is r(h) = ∑c j=1 ‖hj‖22 [20], for which the components h1, . . . , hc are correlated via a ‖ · ‖2,2 regularizer, and the bound Eq. (3) ignoring this correlation would not be effective in this case [12–14, 18].\nAs a remedy, we here introduce a new structural complexity result on function classes induced by general classes via the maximum operator, while allowing to preserve the correlations among different components meanwhile. Instead of considering the Rademacher complexity, Lemma 4 concerns the structural relationship on Gaussian complexities since it is based on a comparison result among different Gaussian processes.\nLemma 4 (Structural result on Gaussian complexity). Let H be a class of functions defined on X ×Y with Y = {1, . . . , c}. Let g1, . . . , gnc be independent N(0, 1) distributed random variables. Then, for any sample S = {x1, . . . , xn} of size n, we have\nGS ( {max{h1, . . . , hc} : h ∈ H} ) ≤ 1\nn Eg sup\nh∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ihj(xi), (4)\nwhere Eg denotes the expectation w.r.t. to the Gaussian variables g1, . . . , gnc.\nThe proof of Lemma 5 is given in Supplementary Material A. Equipped with Lemma 4, we are now able to present a general data-dependent margin-based generalization bound. The proof of the following results (Theorem 5, Theorem 7 and Corollary 8) is given in Supplementary Material B.\nTheorem 5 (Data-dependent generalization bound for multi-class classification). Let H ⊂ RX×Y be a hypothesis class with Y = {1, . . . , c}. Let ℓ be a L-regular loss function and denote Bℓ := sup(x,y),h ℓ(ρh(x, y)). Suppose that the examples S = {(x1, y1), . . . , (xn, yn)} are independently drawn from a probability measure defined on X ×Y. Then, for any δ > 0, with probability at least 1− δ, the following multi-class classification generalization bound holds for any h ∈ H:\nR(h) ≤ 1 n\nn∑\ni=1\nℓ(ρh(xi, yi)) + 2L\n√ 2π n Eg sup\nh∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ihj(xi) + 3Bℓ √ log 2δ 2n ,\nwhere g1, . . . , gnc are independent N(0, 1) distributed random variables.\nRemark 6. Under the same condition of Theorem 5, [12] derive the following data-dependent generalization bound:\nR(h) ≤ 1 n\nn∑\ni=1\nℓ(ρh(xi, yi)) + 4Lc\nn RS(Π1(H)) + 3Bℓ √ log 2δ 2n ,\nwhere Π1(H) := {x → h(x, y) : y ∈ Y, h ∈ H}. This linear dependence on c is due to the use of Eq. (3). For comparison, Theorem 5 implies that the dependence on the class size is governed by the term ∑n i=1 ∑c j=1 g(j−1)n+ihj(xi), an advantage of which is that the components h1, . . . , hc are jointly coupled. As we will see, this allows us to derive an improved result having a favorable dependence on c, when a constraint is imposed on (h1, . . . , hc).\nThe following Theorem 7 applies the general result in Theorem 5 to kernel-based methods. The hypothesis space is defined by imposing a constraint with a general strongly convex function.\nTheorem 7 (Data-dependent generalization bound for kernel-based multi-class learning algorithms). Suppose that the hypothesis space is defined by\nH := Hf,Λ = {hw = (〈w1, φ(x)〉, . . . , 〈wc, φ(x)〉) : f(w) ≤ Λ}, where f is a β-strongly convex function w.r.t. a norm ‖ · ‖ defined on H satisfying f∗(0) = 0. Let ℓ be a L-regular loss function and denote Bℓ := sup(x,y),h ℓ(ρh(x, y)). Let g1, . . . , gnc be independent N(0, 1) distributed random variables. Then, for any δ > 0, with probability at least 1− δ we have\nR(hw) ≤ 1 n\nn∑\ni=1\nℓ(ρhw(xi, yi))+ 4L\nn √√√√πΛ β Eg n∑\ni=1\n‖(giφ(xi), gn+iφ(xi), . . . , g(c−1)n+iφ(xi))‖2∗+3Bℓ √ log 2δ 2n .\nWe now consider the following specific hypothesis spaces using a ‖ · ‖2,p constraint: Hp,Λ := {hw = (〈w1, φ(x)〉, . . . , 〈wc, φ(x)〉) : ‖w‖2,p ≤ Λ}, 1 ≤ p ≤ 2. (5)\nCorollary 8 (ℓp-norm multi-class SVM generalization bound). Let ℓ be a L-regular loss function and denote Bℓ := sup(x,y),h ℓ(ρh(x, y)). Then, with probability at least 1 − δ, for any hw ∈ Hp,Λ the generalization error R(hw) can be upper bounded by:\n1\nn\nn∑\ni=1\nℓ(ρhw(xi, yi)) + 3Bℓ √ log 2δ 2n + 2LΛ n √√√√ n∑\ni=1\nk(xi, xi)× {√ e(4 log c)1+ 1\n2 log c , if p ≤ 2 log c2 log c−1 ,( 2p p−1 )2− 1 p c p−1 p , otherwise.\nRemark 9. The bounds in Corollary 8 enjoy a mild dependence on the number of classes. The dependence is polynomial with exponent p−1p for 2 log c 2 log c−1 < p ≤ 2 and becomes logarithmic if 1 ≤ p ≤ 2 log c2 log c−1 . Which is substantially milder than the quadratic dependence established in [12, 14, 18] and the linear dependence established in [13]. Our generalization bound is data-dependent and shows clearly how the margin would affect the generalization performance (when ℓ is the margin loss ℓρ): a large margin ρ would increase the empirical error while decrease the model’s complexity, and vice versa."}, {"heading": "2.4 Comparison of the Achieved Bounds to the State of the Art", "text": "Related work on data-independent bounds. The large body of theoretical work on multiclass learning considers data-independent bounds. Based on the ℓ∞-covering number bound of linear operators, [15] obtain a generalization bound exhibiting a linear dependence on the class size, which is improved by [9] to a radical dependence of the form O(n− 1 2 (log 3 2 n) √ c ρ ). Under conditions analogous to Corollary 8, [23] derive a class-size independent generalization guarantee. However, their bound is based on a delicate definition of margin, which is why it is commonly not used in the mainstream multi-class literature. [1] derive the following generalization bound\nE [1 p log ( 1 + ∑\nỹ 6=y ep(ρ−〈ŵy−ŵỹ,φ(x)〉)\n)] ≤ inf\nw∈H [1 p log ( 1 + ∑\nỹ 6=y ep(ρ−〈wy−wỹ,φ(x)〉)\n)\n+ λn\n2(n+ 1) ‖w‖22,2\n] + 2 supx∈X k(x, x)\nλn , (6)\nwhere ρ is a margin condition, p > 0 a scaling factor, and λ a regularization parameter. Eq. (6) is class-size independent, yet Corollary 8 shows superiority in the following aspects: first, for SVMs (i.e., margin loss ℓρ), our bound consists of an empirical error ( 1 n ∑n i=1 ℓρ(ρhw(xi, yi))) and a complexity term divided by the margin value (note that L = 1/ρ in Corollary 8). When the margin is large (which is often desirable) [14], the last term in the bound given by Corollary 8 becomes small, while—on the contrary—-the bound (6) is an increasing function of ρ, which is undesirable. Secondly, Theorem 7 applies to general loss functions, expressed through a strongly convex function over a general hypothesis space, while the bound (6) only applies to a specific regularization algorithm. Lastly, all the above mentioned results are conservative data-independent estimates.\nRelated work on data-dependent bounds. The techniques used in above mentioned papers do not straightforward translate to data-dependent bounds, which is the type of bounds in the focus of the present work. The investigation of these was initiated, to our best knowledge, by [14]: with the structural complexity bound (3) for function classes induced via the maximal operator, [14] derive a margin bound admitting a quadratic dependency on the number of classes. [12] use these results in [14] to study the generalization performance of multi-class SVMs, where the components h1, . . . , hc are coupled with an ‖ · ‖2,p, p ≥ 1 constraint. Due to the usage of the suboptimal Eq. (3), [12] obtain a margin bound growing quadratically w.r.t. the number of classes. [18] develop a new multi-class classification algorithm based on a natural notion called the multi-class margin of a kernel. [18] also present a novel multi-class Rademacher complexity margin bound based on Eq. (3), and the bound also depends quadratically on the class size. More recently, [13] give a refined Rademacher complexity bound for multi-class classification with a linear dependence on the class size. The key reason for this improvement is the introduction of ρθ,h := miny′∈Y [h(x, y)− h(x, y ′\n) + θ1y′=y] bounding margin ρh from below, and since the maximum operation in ρθ,h is applied to the set Y rather than the subset Y − {yi} for ρh, one needs not to consider the random realization of yi. We also use this trick in our proof of Theorem 5. However, [13] failed to improve this linear dependence to a logarithmic dependence, as we achieved in Corollary 8, due to the use of the suboptimal structural result (3)."}, {"heading": "3 Algorithms", "text": "Motivated by the generalization analysis given in Section 2, we now present a new multi-class learning algorithm, based on performing empirical risk minimization in the hypothesis space (5). This corresponds to the following ℓp-norm multi-class SVM (p ≥ 1):\nProblem 10 (Primal problem: ℓp-norm multi-class SVM).\nmin w\n1\n2\n[ c∑\nj=1\n‖wj‖p2 ] 2 p + C n∑\ni=1\nℓ(ti),\ns.t. ti = 〈wyi , φ(xi)〉 −max y 6=yi\n〈wy, φ(xi)〉, (P)\nFor p = 2 we recover the seminal multi-class algorithm by Crammer & Singer [20], which is thus a special case of the proposed formulation. An advantage of the proposed approach over [20] can be that, as shown in Corollary 8, the dependence of the generalization performance on the class size becomes milder as p decreases to 1."}, {"heading": "3.1 Dual problems", "text": "Since the optimization problem (P) is convex, we can derive the associated dual problem for the construction of efficient optimization algorithms. The derivation of the following dual problem is deferred to Supplementary Material C. For a matrix α ∈ Rn×c, we denote by αi the ith row. Denote by ej the j-th unit vector in R c and 1 the vector in Rc with all components being zero.\nProblem 11 (Completely dualized problem for general loss functions). The Lagrangian dual problem of (10) is:\nsup α∈Rn×c − 1 2\n[ c∑\nj=1\n∥∥ n∑\ni=1\nαijφ(xi) ∥∥ pp−1 2 ] 2(p−1) p − C n∑\ni=1\nℓ∗(−αiyi C )\ns.t. αij ≤ 0 ∧ αi · 1 = 0, ∀j 6= yi, i = 1, . . . , n. (D)\nTheorem 12 (Representer theorem). For any dual variable α ∈ Rn×c, the associated primal variable w = (w1, . . . ,wc) minimizing the Lagrangian saddle problem can be represented by:\nwj = [ c∑\nj̃=1\n‖ n∑\ni=1\nαij̃φ(xi)‖ p∗ 2\n] 2 p∗ −1∥∥ n∑\ni=1\nαijφ(xi) ∥∥p∗−2 2 [ n∑\ni=1\nαijφ(xi) ] .\nFor the hinge loss ℓh(t) = (1−t)+, we know its Fenchel-Legendre conjugate is ℓ∗h(t) = t if −1 ≤ t ≤ 0 and ∞ elsewise. Hence ℓ∗h(− αiyi C ) = − αiyi C if −1 ≤ − αiyi C ≤ 0 and ∞ elsewise. Now we have the following dual problem for the hinge loss function:\nProblem 13 (Completely dualized problem for the hinge loss (ℓp-norm multi-class SVM)).\nsup α∈Rn×c − 1 2\n[ c∑\nj=1\n∥∥ n∑\ni=1\nαijφ(xi) ∥∥ pp−1 2\n] 2(p−1) p + n∑\ni=1\nαiyi\ns.t. αi ≤ eyi · C ∧ αi · 1 = 0, ∀i = 1, . . . , n. (7)"}, {"heading": "3.2 Optimization Algorithms", "text": "The dual problems (D) and (7) are not quadratic programs for p 6= 2, and thus generally not easy to solve. To circumvent this difficulty, we rewrite Problem 10 as the following equivalent problem:\nmin w,β\nc∑\nj=1\n‖wj‖22 2βj + C n∑\ni=1\nℓ(ti)\ns.t. ti ≤ 〈wyi , φ(xi)〉 − 〈wy, φ(xi)〉, y 6= yi, i = 1, . . . , n, ‖β‖p̄ ≤ 1, p̄ = p(2− p)−1, βj ≥ 0.\n(8)\nThe class weights β1, . . . , βc in Eq. (8) play a similar role as the kernel weights in ℓp-norm multiple kernel learning (MKL) algorithms [19]. The equivalence between problem (P) and Eq. (8) follows directly from Lemma 26 in [24], which shows that the optimal β = (β1, . . . , βc) in Eq. (8) can be explicitly represented in closed form. Motivated by the recent work on ℓp-norm MKL, we propose to solve the problem (8) via alternately optimizing w and β. As we will show, given temporarily fixed β, the optimization of w reduces to a standard multi-class classification problem. Furthermore, the update of β, given fixed w, can be achieved via an analytic formula.\nProblem 14 (Partially dualized problem for a general loss). For fixed β, the partial dual problem for the sub-optimization problem (8) w.r.t. w is\nsup α∈Rn×c − 1 2\nc∑\nj=1\nβj ∥∥ n∑\ni=1\nαijφ(xi) ∥∥2 2 − C n∑\ni=1\nℓ∗(−αiyi C )\ns.t. αij ≤ 0 ∧ αi · 1 = 0, ∀j 6= yi, i = 1, . . . , n. (9)\nThe primal variable w minimizing the associated Lagrangian saddle problem is\nwj = βj\nn∑\ni=1\nαijφ(xi). (10)\nWe defer the proof to Supplementary Material C. Analogous to Problem 13, we have the following partial dual problem for the hinge loss.\nProblem 15 (Partially dualized problem for the hinge loss (ℓp-norm multi-class SVM)).\nsup α∈Rn×c f(α) := −1 2\nc∑\nj=1\nβj ∥∥ n∑\ni=1\nαijφ(xi) ∥∥2 2 + n∑\ni=1\nαiyi\ns.t. αi ≤ eyi · C ∧ αi · 1 = 0, ∀i = 1, . . . , n. (11)\nThe Problems 14 and 15 are quadratic, so we can use the dual coordinate ascent algorithm [25] to very efficiently solve them for the case of linear kernels. To this end, we need to compute the gradient and solve the restricted problem of optimizing only one αi, ∀i, keeping all other dual variables fixed [25]. The gradient of f can be exactly represented by w:\n∂f\n∂αij = −βj\nn∑\nĩ=1\nαĩjk(xi, xĩ) + 1yi=j = 1yi=j − 〈wj , φ(xi)〉. (12)\nSuppose the additive change to be applied to the current αi is δαi, then\nf(α1, . . . , αi−1, αi + δαi, αi+1, . . . , αn)\n= − c∑\nj=1\nβj\nn∑\nĩ=1\nαĩj(αij + δαij)k(xi, xĩ)− 1\n2\nc∑\nj=1\nβj [δαij ] 2k(xi, xi) + δαiyi + const\n=\nc∑\nj=1\n∂f\n∂αij δαij −\n1\n2\nc∑\nj=1\nβjk(xi, xi)[δαij ] 2 + const.\nTherefore, the sub-problem of optimizing δαi is given by\nmax δαi − 1 2\nc∑\nj=1\nβjk(xi, xi)[δαij ] 2 +\nc∑\nj=1\n∂f\n∂αij δαij\ns.t. δαi ≤ eyi · C −αi ∧ δαi · 1 = 0. (13)\nWe now consider the subproblem of updating class weights β with temporarily fixed w, for which we have the following analytic solution. The proof is deferred to the Supplementary Material C.1.\nProposition 16. (Solving the subproblem with respect to the class weights) Given fixed wj, the minimal βj optimizing the problem (8) is attained at\nβj = ‖wj‖2−p2 ( c∑\nj̃=1\n‖wj̃‖p2 ) p−2 p . (14)\nThe update of βj based on Eq. (14) requires calculating ‖wj‖22, which can be easily fulfilled by recalling the representation established in Eq. (10).\nThe resulting training algorithm for the proposed ℓp-norm multi-class SVM is given Algorithm 1. The algorithm alternates between solving a multi-class SVM problem for fixed class weights (Line 3) and updating the class weights in a closed-form manner (Line 5). Recall that Problem 11 establishes a completely dualized problem, which can be used as a sound stopping and evaluation criterion for the optimization algorithm.\nAlgorithm 1: Training algorithm for ℓp-norm multi-class classification.\ninput: examples {(xi, yi)ni=1} and the kernel k. 1 initialize βj = p̄ √ 1/c,wj = 0 for all j = 1, . . . , c 2 while Optimality conditions are not satisfied do 3 optimize the multi-class classification problem (9) 4 compute ‖wj‖22 for all j = 1, . . . , c, according to Eq. (10) 5 update βj for all j = 1, . . . , c, according to Eq. (14) 6 end"}, {"heading": "4 Empirical Analysis", "text": "We implemented the proposed ℓp-norm multi-class SVM algorithm (Algorithm 1) in C++ and solved the involved MC-SVM problem using dual coordinate ascent [25]. We experiment on three benchmark datasets: the Sector dataset studied in [26], the News 20 dataset collected and originally used for text classification by [27], and the Rcv1 dataset collected by [28]. Table 1 gives a description of these datasets.\nWe compare with the classical multi-class classification algorithm proposed by Crammer & Singer [20], which constitutes strong baseline for these datasets [25]. We employ a 5-fold cross validation on the training set to tune the regularization parameter C by grid search over the set {2−12, 2−11, . . . , 212} and the parameter p from the interval [1.2, 1.25, . . . , 10]. For the parameter p we first use a larger grid of step size 0.5 and then a finer grid of step size 0.1 around the optimum. Note that the model parameters are tuned separately for each training set and only based on the training set, not the test set. We repeat the experiments 10 times, and report in Table 2 on the average accuracy and standard deviations attained on the test set.\nWe observe that the proposed ℓp-normMC-SVM consistently outperforms the method by Crammer & Singer [20] on all considered datasets. Specifically, our method attains 0.31% accuracy gain on Sector, 1.07% accuracy gain on News 20, and 0.53% accuracy gain on Rcv1. These promising results indicate that the proposed ℓp-norm multiclass SVM could further lift the state of the art in multi-class classification, even in real-world applications beyond the ones studied in this paper."}, {"heading": "5 Conclusion", "text": "Motivated by the ever growing size of multi-class datasets in real-world applications such as image annotation and web advertising, which involve tens or hundreds of thousands of classes, we studied the influence of the class size on the generalization behavior of multi-class classifiers. We focus here on data-dependent generalization bounds enjoying the ability to capture the properties of the distribution that has generated the data. Of independent interest, for hypothesis classes that are given as a maximum over base classes, we developed a new structural result on Gaussian complexities that is able to preserve the coupling among different components, while the existing structural results ignore this coupling and may yield suboptimal generalization bounds. We applied the new structural result to study learning rates for multi-class classifiers, and derived, for the first time, a data-dependent bound with a logarithmic dependence on the class size, which substantially outperforms the linear dependence in the state-of-the-art data-dependent generalization bounds.\nMotivated by the theoretical analysis, we proposed a novel ℓp-norm regularized multi-class support vector machine, where the parameter p controls the complexity of the corresponding bounds. This class of algorithms contains the classical model by Crammer & Singer [20] as a special case for p = 2. We developed an effective optimization algorithm based on the Fenchel dual representation. For several standard benchmarks for multi-class classification taken from various domains, the proposed approach surpassed the state-of-the-art method of Crammer & Singer [20], by up to 1%.\nAn exciting future direction will be to derive a data-dependent bound that is completely independent of the class size (even overcoming the mild logarithmic dependence of our bounds). To this end, we will study more powerful structural results than Lemma 4 for controlling complexities of function classes induced via the maximum operator. As a good starting point to this end, we will consider ℓ∞-covering numbers."}, {"heading": "Supplementary Material", "text": ""}, {"heading": "A Proofs on Structural Results on Gaussian Complexity", "text": "Our discussion on complexity bound is based on the following comparison results among different Gaussian processes.\nLemma A.1 (Theorem 1 in [29]). Let {Xθ : θ ∈ Θ} and {Yθ : θ ∈ Θ} be two non-zero real-valued Gaussian processes indexed by the same countable set Θ and suppose that\nE[(Yθ −Yθ̄)2] ≤ E[(Xθ − Xθ̄)2], ∀θ, θ̄ ∈ Θ. (A.1)\nThen, E[sup\nθ Yθ] ≤ E[sup θ Xθ].\nProof of Lemma 4. Define two Gaussian processes indexed by H (for any h ∈ H , we use here the equivalent representation h = (h1, . . . , hc)):\nXh :=\nn∑\ni=1\n[ gimax{h1(xi), h2(xi), . . . , hc(xi)} ] ,\nYh := n∑\ni=1\nc∑\nj=1\ng(j−1)n+ihj(xi), ∀h ∈ H.\nFor any h = (h1, . . . , hc), h̄ = (h̄1, . . . , h̄c) ∈ H , the independence of the gi and the equalities Eg2i = 1 imply that\nE[(Xh − Xh̄)2] = n∑\ni=1\n[ max{h1(xi), . . . , hc(xi)} −max{h̄1(xi), . . . , h̄c(xi)} ]2\nE[(Yh −Yh̄)2] = n∑\ni=1\n[ (h1(xi)− h̄1(xi))2 + · · ·+ (hc(xi)− h̄c(xi))2 ] .\nFor any a = (a1, . . . , ac), b = (b1, . . . , bc) ∈ Rc, it can be directly checked that\n|max{a1, . . . , ac} −max{b1, . . . , bc}| ≤ max{|a1 − b1|, . . . , |ac − bc|} ≤ c∑\ni=1\n|ai − bi|.\nApplying the above inequality with a = (h1(xi), . . . , hc(xi)), b = (h̄1(xi), . . . , h̄c(xi)), i = 1, . . . , n, yields directly the following bounds relating the increments of the two Gaussian processes Xh,Yh:\nE[(Xh − Xh̄)2] ≤ n∑\ni=1\nmax{|h1(xi)− h̄1(xi)|, . . . , |hc(xi)− h̄c(xi)|}2\n=\nn∑\ni=1\nmax{|h1(xi)− h̄1(xi)|2, . . . , |hc(xi)− h̄c(xi)|2}\n≤ n∑\ni=1\nc∑\nj=1\n|hj(xi)− h̄j(xi)|2 = E[(Yh −Yh̄)2], ∀h, h̄ ∈ H.\nThat is, the condition (A.1) holds and therefore Lemma A.1 can be applied here to yield the stated result.\nThe following lemma gives a general Gaussian complexity bound for hypothesis spaces used in multi-class classification.\nLemma A.2 (Gaussian complexity of multi-class hypothesis spaces). Let H be a class of functions defined on X × Y with Y = {1, . . . , c}. Let S = {(x1, y1), . . . , (xn, yn)} be a sequence of examples. Let g1, . . . , gnc be independent N(0, 1) distributed random variables. Then the empirical Gaussian complexity of H can be controlled by:\nGS(H) ≤ 1\nn Eg sup\nh∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ihj(xi).\nProof. Define two Gaussian processes indexed by H :\nXh :=\nn∑\ni=1\ngihyi(xi), Yh :=\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ihj(xi), ∀h ∈ H.\nFor any h, h̄ ∈ H , it is obvious that\nE[(Xh − Xh̄)2] = n∑\ni=1\n[hyi(xi)− h̄yi(xi)]2\n≤ n∑\ni=1\n[ (h1(xi)− h̄1(xi))2 + · · ·+ (hc(xi)− h̄c(xi))2 ]\n= E[(Yh −Yh̄)2].\nNow the stated inequality follows directly from Lemma A.1."}, {"heading": "B Proofs on Generalization bounds For Multi-class Classifiers", "text": ""}, {"heading": "B.1 Proof of Theorem 5", "text": "Proof of Theorem 5. For any θ > 0, introduce the following function bounding ρh(x, y) from below:\nρθ,h(x, y) = h(x, y)−max y′∈Y [h(x, y ′ )− θ1y′=y] = min y′∈Y [h(x, y)− h(x, y′) + θ1y′=y].\nIt can be checked that ρθ,h(x, y) = min(ρh(x, y), θ). Introduce two function classes derived from ρθ,h:\nH̃θ = {ρθ,h(x, y) : h ∈ H}, H̃θ = {ℓ(ρθ,h(x, y)) : h ∈ H}.\nAccording to the definition of L-regular loss function and the relationship ρθ,h ≤ ρh, we have\nR(h) = E[1ρh(X,Y ) ≤ 0] ≤ E[1ρθ,h(X,Y ) ≤ 0] ≤ E[ℓ(ρθ,h(X,Y ))],\nwhich, together with McDiarmid inequality [30], yields the following inequality\nR(h) ≤ 1 n\nn∑\ni=1\nℓ(ρθ,h(xi, yi)) + 2RS(H̃θ) + 3Bℓ √ log 2δ 2n , ∀h ∈ H (B.1)\nwith probability at least 1− δ. For the fixed parameter θ = cℓ, we observe that ρθ,h(x, y) = min(ρh(x, y), cℓ). If ρh(x, y) > cℓ, the definition of L-regular loss implies that\nℓ(ρθ,h(x, y)) = ℓ(cℓ) = 0 = ℓ(ρh(x, y)).\nOtherwise, we have ρθ,h(x, y) = ρh(x, y). Therefore, for any (x, y) we have ℓ(ρθ,h(x, y)) = ℓ(ρh(x, y)), which, coupled with the Lipschitz property of ℓ and Eq. (B.1), yields the following inequality with probability at least 1− δ:\nR(h) ≤ 1 n\nn∑\ni=1\nℓ(ρh(xi, yi)) + 2LRS(H̃θ) + 3Bℓ √ log 2δ 2n , ∀h ∈ H. (B.2)\nThe Rademacher complexity of H̃θ satisfies the following inequality:\nRS(H̃θ) = 1\nn Eσ [ sup h∈H n∑\ni=1\nσi ( h(xi, yi)−max\ny∈Y (h(xi, y)− θ1y=yi)\n)]\n≤ 1 n Eσ[ sup\nh∈H\nn∑\ni=1\nσih(xi, yi)] + 1\nn Eσ [ sup h∈H n∑\ni=1\nσi max y∈Y\n(h(xi, y)− θ1y=yi) ]\n≤ √ π\n2 GS(H) +\n1\nn\n√ π\n2 Eg [ sup h∈H n∑\ni=1\ngimax(h1(xi)− θ1yi=1, . . . , hc(xi)− θ1yi=c) ] ,\n(B.3)\nwhere the last step follows from the relationship between Gaussian and Rademacher processes expressed in Eq. (2). Furthermore, according to Lemma 4, the last term of the above inequality can be addressed by\nEg[ sup h∈H\nn∑\ni=1\ngimax{h1(xi)− θ1yi=1, h2(xi)− θ1yi=2, . . . , hc(xi)− θ1yi=c}]\nLem. 4 ≤ Eg sup\nh∈H\nn∑\ni=1\n[ gi(h1(xi)− θ1yi=1) + gn+i(h2(xi)− θ1yi=2) + · · ·+ g(c−1)n+i(hc(xi)− θ1yi=c) ]\n= Eg sup h∈H\nn∑\ni=1\n[ gih1(xi) + gn+ih2(xi) + · · ·+ g(c−1)n+ihc(xi) ]\n− Eg n∑\ni=1\n[giθ1yi=1 + · · ·+ g(c−1)n+iθ1yi=c]\n= Eg sup h∈H\nn∑\ni=1\n[ gih1(xi) + gn+ih2(xi) + · · ·+ g(c−1)n+ihc(xi) ] .\nWith this inequality and using Lemma A.2 to tackle GS(H), we immediately derive the following bound on RS(H̃θ):\nRS(H̃θ) ≤ √ 2π\nn Eg sup\nh∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ihj(xi).\nPutting this Rademacher complexity bound back into Eq. (B.2), we obtain the stated result."}, {"heading": "B.2 Proof of Theorem 7", "text": "To apply Theorem 5, we need to control the term suph∈H ∑n i=1 ∑c j=1 g(j−1)n+ihj(xi), which we\ntackle by the following lemma due to [31].\nLemma B.1 (Corollary 4 in [31]). If f is β-strongly convex w.r.t. ‖ · ‖ and f∗(0) = 0, then, for any sequence v1, . . . , vn and for any µ we have\nn∑\ni=1\n〈vi, µ〉 − f(µ) ≤ n∑\ni=1\n〈▽f∗(v1:i−1, vi) + 1\n2β\nn∑\ni=1\n‖vi‖2∗,\nwhere v1:i denotes the sum ∑i j=1 vj.\nProof of Theorem 7. For the hypothesis space H and any λ > 0, applying Lemma B.1 with µ =\n(w1, . . . ,wc) and vi = λ(giφ(xi), gn+iφ(xi), . . . , g(c−1)n+iφ(xi)), we have\nλ sup hw∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ih w j (xi) = sup hw∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+i〈wj , λφ(xi)〉\n= sup hw∈H\nn∑\ni=1\n〈(w1, . . . ,wc), (λgiφ(xi), λgn+iφ(xi), . . . , λg(c−1)n+iφ(xi))〉\n≤ sup hw∈H f(w1, . . . ,wc) +\nn∑\ni=1\n〈▽f∗(v1:i−1), vi〉+ λ2\n2β\nn∑\ni=1\n‖(giφ(xi), gn+iφ(xi), . . . , g(c−1)n+iφ(xi))‖2∗.\nTaking expectation on both sides w.r.t. the Gaussian variables g1, . . . , gnc, the term ∑n\ni=1〈▽f∗(v1:i−1), vi〉 vanishes, and therefore we obtain\nEg sup hw∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ih w j (xi) ≤ Λ\nλ +\nλ\n2β\nn∑\ni=1\nEg‖(giφ(xi), gn+iφ(xi), . . . , g(c−1)n+iφ(xi))‖2∗.\nChoosing λ = √\n2βΛ∑ n i=1 Eg‖(giφ(xi),gn+iφ(xi),...,g(c−1)n+iφ(xi))‖2∗ , the above inequality translates to\nEg sup hw∈H\nn∑\ni=1\nc∑\nj=1\ng(j−1)n+ih w j (xi) ≤ √√√√2Λ β n∑\ni=1\nEg‖(giφ(xi), gn+iφ(xi), . . . , g(c−1)n+iφ(xi))‖2∗.\nPutting the above complexity bound into Theorem 5, we obtain the stated result.\nB.3 Proof on ℓp-norm Multi-class Classification Generalization bounds (Corollary 8)\nThe following simple lemma controls the p-th moment of a N(0, 1) distributed random variable. We give the proof here for completeness.\nLemma B.2. Let g be N(0, 1) distributed. For any p > 0, the p-th moment of g can be bounded by\n[E|g|p] 1p ≤ (2p) 12+ 1p .\nProof. Let ∀n ∈ N+ : Γ(n) = (n − 1)! be the Gamma function. The p-th moment of a N(0, 1) distributed random variable can be exactly expressed via Gamma function [32]:\nE|g|p = 2 p 2 √ π Γ (p+ 1 2 ) ≤ 2 p 2 √ π Γ ( ⌈p+ 1 2 ⌉ )\n= 2\np 2\n√ π ⌈p− 1 2 ⌉! ≤ 2\np 2\n√ π\n√ 2π⌈p− 1\n2 ⌉⌈ p−12 ⌉+ 12\n≤ (2p) p2+1,\nwhere in the above deduction we have used Stirling’s approximation [33]:\nn! ≤ √ 2πnn+ 1 2 e−n+1/(12n).\nProof of Corollary 8. Let g1, . . . , gnc be independent N(0, 1) distributed random variables. Denote by τs = [E|g1|s] 1 s the sth moment of a N(0, 1) distributed random variable. Let q be any number satisfying p ≤ q ≤ 2. Introduce the function fq(w) := 12‖w‖22,q. Any hw ∈ Hq,Λ satisfies the inequality\nfq(w) = 1\n2 ‖w‖22,q ≤\n1 2 Λ2.\nSince fq(w) is 1/q ∗-strongly convex w.r.t. the norm ‖ ·‖2,q, and the dual norm of ‖ ·‖2,q is ‖ ·‖2,q∗ [34], the summation of the squared dual norm in Theorem 7 can be rewritten as follows:\nn∑\ni=1\nEg‖(giφ(xi), . . . , g(c−1)n+iφ(xi))‖22,q∗ = n∑\ni=1\nEg\n[ c∑\nj=1\n‖g(j−1)n+iφ(xi)‖q ∗\n2\n] 2 q∗\n=\nn∑\ni=1\nEg\n[ c∑\nj=1\n|g(j−1)n+i|q ∗] 2 q∗ k(xi, xi)\nsymmetry = Eg\n[ c∑\nj=1\n|gj |q ∗] 2 q∗ n∑\ni=1\nk(xi, xi)\nJensen ≤ c 2q∗ τ2q∗\nn∑\ni=1\nk(xi, xi).\nFrom which Theorem 7 immediately implies the following bounds, with probability at least 1− δ and for any hw ∈ Hq,Λ:\nR(hw) ≤ 1 n\nn∑\ni=1\nℓ(ρhw(xi, yi)) + 4LΛc1/q\n∗\nτq∗\nn\n√√√√πq∗ 2 n∑\ni=1\nk(xi, xi) + 3Bℓ √ log 2δ 2n .\nFrom the trivial inequality ‖w‖2,p ≥ ‖w‖2,q, we immediately conclude Hp,Λ ⊂ Hq,Λ. Therefore, for any hw ∈ Hp,Λ, we have\nR(hw) ≤ 1 n\nn∑\ni=1\nℓ(ρhw(xi, yi)) + inf p≤q≤2\n4LΛc1/q ∗\nτq∗\nn\n√√√√πq∗ 2 n∑\ni=1\nk(xi, xi) + 3Bℓ √ log 2δ 2n .\nIt can be directly checked that the function t → √ tc1/t is decreasing along the interval (0, 2 log c) and increasing along the interval (2 log c,∞). Therefore, the above generalization bound satisfies the inequality\nR(hw) ≤ 1 n\nn∑\ni=1\nℓ(ρhw(xi, yi)) + 3Bℓ √ log 2δ 2n +\nLΛ\nn\n√√√√8 n∑\ni=1\nk(xi, xi)× {√\n2e log cτ2 log c, if p ≤ 2 log c2 log c−1 , c p−1 p τ p\np−1\n√ p\np−1 , otherwise.\nApplying Lemma B.2 to bound the moments of Gaussian variables, the stated result follows immediately."}, {"heading": "C Proofs on the Dual Problems", "text": ""}, {"heading": "C.1 Equivalent Representation of ℓp-norm Multi-class Classification", "text": "The equivalence between Problem (P) and Eq. (8) follows directly from the following lemma due to [24].\nLemma C.1 ([24]). Let ai ≥ 0, i ∈ Nd and 1 ≤ r < ∞. Then\nmin η:ηi≥0,\n∑ i∈Nd ηr i ≤1\n∑\ni∈Nd\nai ηi =\n( ∑\ni∈Nd a\nr r+1 i\n)1+ 1 r\nand the minimum is attained at\nηi = a\n1 r+1\ni(∑ k∈Nd a r r+1 k ) 1 r .\nProof of Proposition 16. Fixing w, the sub-optimization of Eq. (8) w.r.t. β is\nmin β\nc∑\nj=1\n‖wj‖22 2βj\ns.t. ‖β‖p̄ ≤ 1, p̄ = p(2− p)−1, βj ≥ 0.\nThe stated result now follows directly by applying Lemma C.1 with r = p̄ and αj = ‖wj‖22."}, {"heading": "C.2 Derivation of the Completely Dualized Problem (Problem 11)", "text": "Derivation of Problem 11. Problem (P) translates to the following equivalent problem\nmin w\n1\n2\n[ c∑\nj=1\n‖wj‖p2 ] 2 p + C n∑\ni=1\nℓ(ti)\ns.t. ti ≤ 〈wyi , φ(xi)〉 − 〈wy, φ(xi)〉, y 6= yi, i = 1, . . . , n. (C.1)\nThe Lagrangian of the above convex optimization problem is\nL = 1 2\n[ c∑\nj=1\n‖wj‖p2 ] 2 p + C n∑\ni=1\nℓ(ti) + n∑\ni=1\n∑ j 6=yi α̃ij ( ti + 〈wj , φ(xi)〉 − 〈wyi , φ(xi)〉 ) ,\nwith Lagrangian variables 0 ≤ α̃ ∈ Rn×(c−1). For the last term of the Lagrangian, we have the following identity:\nn∑\ni=1\n∑ j 6=yi α̃ij〈wj −wyi , φ(xi)〉 = n∑ i=1 ∑ j 6=yi α̃ij〈wj , φ(xi)〉 − n∑ i=1 ∑\nj̃ 6=yi\nα̃ij̃〈wyi , φ(xi)〉\n=\nc∑\nj=1\n〈wj , ∑\ni:yi 6=j α̃ijφ(xi)〉 −\nc∑\nj=1\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃〈wj , φ(xi)〉\n=\nc∑\nj=1\n〈 wj , ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) 〉 .\n(C.2)\nWith this identity, the Lagrangian translates to\nL = 1 2\n[ c∑\nj=1\n‖wj‖p2 ] 2 p + c∑\nj=1\n〈wj , ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi)〉+\nC\nn∑\ni=1\n[ℓ(ti) + 1\nC\n∑\nj̃ 6=yi\nα̃ij̃ti]. (C.3)\nAccording to the definition of Fenchel conjugate function, it holds that\ninf w,t L = − sup w\n[ − 1\n2\n[ c∑\nj=1\n‖wj‖p2 ] 2 p − c∑\nj=1\n〈wj , ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi)〉 ]\n− C n∑\ni=1\nsup ti\n[−ℓ(ti)− ∑\nj 6=yi\n1 C α̃ijti]\n= − [1 2 ∥∥∥ ( − ∑\ni:yi 6=j α̃ijφ(xi) +\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) )c j=1 ∥∥∥ 2 2,p ]∗\n− C n∑\ni=1\nℓ∗ ( − 1\nC\n∑ j 6=yi α̃ij )\n= −1 2\n∥∥∥ ( ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) )c j=1 ∥∥∥ 2\n2, p p−1\n− C n∑\ni=1\nℓ∗ ( − 1\nC\n∑ j 6=yi α̃ij ) ,\n(C.4)\nwhere in the last step of the above deduction we have used the identity: ( 1 2‖ · ‖2 )∗ = 12‖ · ‖2∗ and the fact that the dual norm of ‖ · ‖2,p is ‖ · ‖2, p p−1 . Consequently, the dual problem becomes\nsup α̃∈Rn×(c−1) − 1 2\n[ c∑\nj=1\n∥∥ ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) ∥∥ pp−1 2 ] 2(p−1) p − C n∑\ni=1\nℓ∗ ( − 1\nC\n∑ j 6=yi α̃ij ) ,\ns.t. α̃ ≥ 0. Introducing α ∈ Rn×c via the substitution:\nαij =\n{ −α̃ij if j 6= yi∑\nj̃ 6=yi α̃ij̃ if j = yi, (C.5)\nwe have ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) = − ∑\ni:yi 6=j αijφ(xi)−\n∑\ni:yi=j\nαijφ(xi), (C.6)\nfrom which the stated dual problem follows directly."}, {"heading": "C.3 Proof of the Representer Theorem (Theorem 12)", "text": "Let H1, . . . , Hc be c Hilbert spaces and p ≥ 1. Define the function gp(v1, . . . , vc) : H1×· · ·×Hc → R by\ngp(v1, . . . , vc) = 1\n2 ‖(v1, . . . , vc)‖22,p, p ≥ 1.\nLemma C.2. The gradient of gp is\n∂gp(v1, . . . , vc) ∂vj = [ c∑\nj̃=1\n‖vj̃‖ p 2 ] 2 p −1‖vj‖p−22 vj .\nProof. By the chain rule, we have\n∂gp(v1, . . . , vc)\n∂vj =\n1\np\n[ c∑\nj̃=1\n‖vj̃‖ p 2\n] 2 p −1 ∂〈vj , vj〉 p 2\n∂vj\n= 1\n2\n[ c∑\nj̃=1\n‖vj̃‖ p 2\n] 2 p −1 ∂〈vj , vj〉\n∂vj 〈vj , vj〉\np 2−1\n= [ c∑\nj̃=1\n‖vj̃‖ p 2 ] 2 p −1‖vj‖p−22 vj .\nProof of Representer Theorem (Theorem 12). In our derivation of the dual problem (see Eq. (C.4)), the variable w should meet the optimality in the sense that\nw = argmax v −1 2\n[ c∑\nj=1\n‖vj‖p2 ] 2 p + c∑\nj=1\n〈vj , n∑\ni=1\nαijφ(xi)〉.\nSince (▽f)−1 = ▽f∗ for any convex function f , and the Fenchel-conjugate of gp is gp∗ , we obtain the following representation of w: w = ▽g−1p ( n∑\ni=1\nαi1φ(xi), . . . ,\nn∑\ni=1\nαicφ(xi) )\n= ▽gp∗ ( n∑\ni=1\nαi1φ(xi), . . . ,\nn∑\ni=1\nαicφ(xi) )\n= [ c∑\nj=1\n‖ n∑\ni=1\nαijφ(xi)‖p ∗\n2\n] 2 p∗ −1(∥∥ n∑\ni=1\nαi1φ(xi) ∥∥p∗−2 2 [ n∑\ni=1\nαi1φ(xi) ] , . . . ∥∥ n∑\ni=1\nαicφ(xi) ∥∥p∗−2 2 [ n∑\ni=1\nαicφ(xi) ]) .\nThat is,\nwj = [ c∑\nj̃=1\n‖ n∑\ni=1\nαij̃φ(xi)‖ p∗ 2\n] 2 p∗ −1∥∥ n∑\ni=1\nαijφ(xi) ∥∥p∗−2 2 [ n∑\ni=1\nαijφ(xi) ] ."}, {"heading": "C.4 Derivation of Partially Dualized Problem (Problem 14)", "text": "Derivation of Problem 14. The Lagrangian of the problem (8) w.r.t. w is\nL = c∑\nj=1\n‖wj‖22 2βj + C\nn∑\ni=1\nℓ(ti) +\nn∑\ni=1\n∑ j 6=yi α̃ij ( ti + 〈wj , φ(xi)〉 − 〈wyi , φ(xi)〉 ) ,\nwith Lagrangian variables 0 ≤ α̃ ∈ Rn×(c−1). According to the identity (C.2), the Lagrangian translates to\nL = c∑\nj=1\n‖wj‖22 2βj +\nc∑\nj=1\n〈wj , ∑\ni:yi 6=j α̃ijφ(xi) −\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi)〉 + C n∑\ni=1\n[ℓ(ti) + 1\nC\n∑\nj̃ 6=yi\nα̃ij̃ti]. (C.7)\nAccording to the definition of Fenchel conjugate function, it holds that\ninf w,t\nL = − c∑\nj=1\n[ 1 βj sup wj [ − 1 2 ‖wj‖22 − 〈 wj , βj ( ∑ i:yi 6=j α̃ijφ(xi)− ∑ i:yi=j ∑ j̃ 6=j α̃ij̃φ(xi) )〉]]\n− C n∑\ni=1\nsup ti\n[−ℓ(ti)− ∑\nj 6=yi\n1 C α̃ijti]\n= − c∑\nj=1\n[ 1 βj [1 2 ∥∥βj ( ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) )∥∥2\n2\n]∗] − C n∑\ni=1\nℓ∗ ( − 1\nC\n∑ j 6=yi α̃ij )\n= −1 2\nc∑\nj=1\nβj ∥∥∥ ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) ∥∥∥ 2\n2 − C\nn∑\ni=1\nℓ∗ ( − 1\nC\n∑ j 6=yi α̃ij ) ,\nwhere in the last step of the above deduction we have used the identity: ( 1 2‖ · ‖2 )∗ = 12‖ · ‖2∗ and the fact that the dual norm of ‖ · ‖2,2 is itself. Consequently, the dual problem becomes\nsup α̃∈Rn×(c−1) − 1 2\nc∑\nj=1\nβj ∥∥∥ ∑\ni:yi 6=j α̃ijφ(xi)−\n∑\ni:yi=j\n∑\nj̃ 6=j\nα̃ij̃φ(xi) ∥∥∥ 2\n2 − C\nn∑\ni=1\nℓ∗ ( − 1\nC\n∑ j 6=yi α̃ij ) ,\ns.t. α̃ ≥ 0.\nIntroducing α ∈ Rn×c as in Eq. (C.5) and noticing the identity (C.6), the above dual problem becomes\nsup α∈Rn×c − 1 2\nc∑\nj=1\nβj ∥∥ n∑\ni=1\nαijφ(xi) ∥∥2 2 − C n∑\ni=1\nℓ∗(−αiyi C )\ns.t.\nc∑\nj=1\nαij = 0, ∀i = 1, 2, . . . , n,\nαij ≤ 0, j 6= yi, ∀i = 1, . . . , n.\n(C.8)\nNote that in the above derivation of the dual problem, the variable w should meet the optimality in the sense that\nw = argmax v −1 2\nc∑\nj=1\n‖vj‖22 + c∑\nj=1\nβj〈vj , n∑\ni=1\nαijφ(xi)〉.\nThe representer theorem stated in Problem 14 follows directly from this optimization condition."}], "references": [], "referenceMentions": [], "year": 2015, "abstractText": "<lb>This paper studies the generalization performance of multi-class classification algorithms, for<lb>which we obtain—for the first time—a data-dependent generalization error bound with a logarith-<lb>mic dependence on the class size, substantially improving the state-of-the-art linear dependence<lb>in the existing data-dependent generalization analysis. The theoretical analysis motivates us to<lb>introduce a new multi-class classification machine based on lp-norm regularization, where the<lb>parameter p controls the complexity of the corresponding bounds. We derive an efficient opti-<lb>mization algorithm based on Fenchel duality theory. Benchmarks on several real-world datasets<lb>show that the proposed algorithm can achieve significant accuracy gains over the state of the art.", "creator": "LaTeX with hyperref package"}}}