{"id": "1509.07062", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "23-Sep-2015", "title": "Boolean Hedonic Games", "abstract": "mladen We study chicka hedonic pilaf games simoni with nettlesome dichotomous beckmesser preferences. Hedonic games are cooperative games in skopintsev which 13.4-billion players cavalcade desire loopers to form eurazeo coalitions, but only care census-designated about premieres the makeup of the coalitions of which they india.arie are classe members; reintegrating they cleansers are indifferent about the makeup of affligem other coalitions. boardinghouse The qf4 assumption dimensional of thesz dichotomous preferences 41-40 means petchey that, meespierson additionally, each turn-key player ' gaillac s loco-motion preference bevis relation partitions árpád the set of wolffian coalitions of liberalising which eddison that player is katydids a roue member myrmicinae into just 109.1 two kourtney equivalence segue classes: satisfactory and zahia unsatisfactory. A player faya is platyninae indifferent catostomus between luhovyk satisfactory dearness coalitions, and is 44-22 indifferent buchsbaum between 6.42 unsatisfactory coalitions, custodial but suwit strictly ioannidis prefers umuc any routh satisfactory heur coalition vogler over lambertseter any vowing unsatisfactory coalition. We airlifters develop schertz a succinct representation for such holmenkolbanen games, euro613 in which 2go each jiuyong player ' braunstein s preference wojnilower relation is represented artest by a propositional shkodër formula. kouji We show aue how franziska solution concepts for hedonic grunitzky games diplomacy with interlined dichotomous preferences are characterised impressionists by propositional schrafft formulas.", "histories": [["v1", "Wed, 23 Sep 2015 17:07:54 GMT  (37kb)", "http://arxiv.org/abs/1509.07062v1", "This paper was orally presented at the Eleventh Conference on Logic and the Foundations of Game and Decision Theory (LOFT 2014) in Bergen, Norway, July 27-30, 2014"]], "COMMENTS": "This paper was orally presented at the Eleventh Conference on Logic and the Foundations of Game and Decision Theory (LOFT 2014) in Bergen, Norway, July 27-30, 2014", "reviews": [], "SUBJECTS": "cs.GT cs.AI", "authors": ["haris aziz", "paul harrenstein", "j\\'er\\^ome lang", "michael wooldridge"], "accepted": false, "id": "1509.07062"}, "pdf": {"name": "1509.07062.pdf", "metadata": {"source": "CRF", "title": null, "authors": ["Haris Aziz", "Paul Harrenstein", "Jérôme Lang"], "emails": [], "sections": [{"heading": null, "text": "ar X\niv :1\n50 9.\n07 06\n2v 1\n[ cs\n.G T\nare cooperative games in which players desire to form coalitions, but only care about the makeup of the coalitions of which they are members; they are indifferent about the makeup of other coalitions. The assumption of dichotomous preferences means that, additionally, each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. We develop a succinct representation for such games, in which each player’s preference relation is represented by a propositional formula. We show how solution concepts for hedonic games with dichotomous preferences are characterised by propositional formulas."}, {"heading": "1 Introduction", "text": "Hedonic games are cooperative games in which players desire to form coalitions, but only care about the makeup of the coalitions of which they are members; they are indifferent about the makeup of other coalitions (Drèze and Greenberg, 1980; Chalkiadakis et al., 2011). Because the specification of a hedonic game requires the expression of each player’s ranking over all sets of players including him, in general, such a specification requires exponential space – and, when used by a centralised mechanism, exponential elicitation time. Such an exponential blow-up severely limits the practical applicability of hedonic games, and for this reason researchers have investigated compactly represented hedonic games. One approach to this problem has been to consider possible restrictions on the possible preferences that players have. For example, one may\n∗This paper was presented at the Eleventh Conference on Logic and the Foundations of Game and Decision Theory (LOFT 2014) in Bergen, Norway, July 27-30, 2014.\nassume that each player specifies only a ranking over single players, and that her preferences over coalitions are defined according to the identity of the best (respectively, worst) element of the coalition (Cechlárová and Hajduková, 2004; Cechlárová, 2008). One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller.\nIn this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition.\nWhile to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al. (2001) in the context of Boolean games, by Konieczny and Pino-Pérez (2002) in the context of belief merging, by Bogomolnaia and Moulin (2004) in the context of matching, and by Brams and Fishburn (2007) (and many others) in the context of approval voting.\nWhen the space of all possible alternatives has a combinatorial structure, propositional formulas are a very natural representation of dichotomous preferences. In such a representation, variables correspond to goods (in fair division), outcome variables (Boolean games), state variables (belief merging), or players (coalition formation). In the latter case, which we will be concerned with in the present paper, each player i can express her preferences over coalitions containing her by using propositional atoms of the form ij (j 6= i), meaning that j is in the same coalition as i. Thus, for example, player 1 can express by the formula (12∨ 13)∧¬14 that he wants to be in a coalition with player 2 or with player 3, but not with player 4. Our primary aim in this paper is to present such a propositional framework for specifying hedonic games and computing various solution concepts. We will first define a propositional logic using atoms of the form ij, together with domain axioms expressing that the output of the game should be a partition of the set of players. Then we consider a range of solution concepts, and show that they can be characterised by some specific classes of (sometimes polysize) formulas, and solved using propositional satisfiability solvers. The result is a simple, natural, and compact representation scheme for expressing preferences, and a machinery based on satisfiability for computing partitions satisfying some specific stability criteria such as Nash stability or core stability."}, {"heading": "2 Preliminaries", "text": "In this section, we recall some definitions relating to coalitions, coalition structures (or partitions), and hedonic games. See, e.g., Chalkiadakis et al. (2011) for an in-depth discussion of these and related concepts.\nCoalitions and Partitions We consider a setting in which there is a set N of n players with typical elements i, j, k, . . . . Players can form coalitions, which we will denote by S, T, . . . . A coalition is simply a subset of the players N . One may usefully think of the players as getting together to form teams that will work together. A coalition structure is an exhaustive partition π = {S1, . . . , Sm} of the players into disjoint coalitions, i.e., S1 ∪ · · · ∪ Sm = N and Si ∩ Sj = ∅ for all Si, Sj ∈ π such that i 6= j. For technical convenience, we slightly deviate from standard conventions and require that every coalition structure π contains the empty set ∅. We commonly refer to coalition structures simply as partitions. In examples, we also write, e.g., [12 |34 | 5 ] rather than the more cumbersome {{1, 2}, {3, 4}, {5}, ∅}. For each player i in N , we let Ni = {S ⊆ N : i ∈ S} denote the set of coalitions over N that contain i. If π = {S1, . . . , Sm} is a partition, then π(i) refers to the coalition in π that player i is a member of.\nThe notion of players leaving their own coalition and joining another lies at the basis of many of the solution concepts that we will come to consider. We introduce some notation to represent such situations. For T a group of players (not necessarily a coalition in π), by π|T we refer to the partition {S1 ∩ T, . . . , Sm ∩ T } and we write π|−T for π|N\\T . Moreover, for S a coalition in partition π|−T , we use π[T → S] to refer to the partition that results if the players in T leave their respective coalitions in π and join coalition S. We also allow T to form a coalition of its own, in which case we write π[T → ∅]. Formally, we have, for S ∈ π|−T ,\nπ[T → S] = {Sj ∈ π|−T : Sj 6= S} ∪ {S ∪ T, ∅}.\nIf T is a singleton {i} we also write π|−i and π[i → S] instead of π|−{i} and π[{i} → S], respectively. Thus, e.g., S∪{i} ∈ π[i → S] and π[i → π(i)\\{i}] = π.\nFinally, define π[i ⇄ j] as the partition where i and j exchange their places, i.e.:\nπ[i ⇄ j] = (π \\ {π(i), π(j)}) ∪ {(π(i) \\ {i}) ∪ {j}, (π(j) \\ {j}) ∪ {i}}.\nThus, for partition π = [123|45], we have π(1) = π(2) = {1, 2, 3} and π(4) = {4, 5}. Furthermore, π|{1,2,4,5} = [12|45] and π|−{3,4} = [12|5]. Also, π[1 → {4, 5}] = [23|145], π[1 → ∅] = [1|23|45], and π[3 ⇄ 4] = [124|35].\nHedonic games Hedonic games are the class of coalition formation games in which each player is only interested in the coalition he is a member of, and is indifferent as to how the players outside his own coalition are grouped. Hedonic games were originally introduced by Drèze and Greenberg (1980) and further developed by, e.g., Bogomolnaia and Jackson (2002). Also see Hajduková (2006)\nfor a survey from a more computational point of view. Formally, a hedonic game is a tuple (N,R1, . . . , Rn), where Ri represents i’s transitive, reflexive, and complete preferences over the set of all coalitions Ni containing i. Thus, S Ri T intuitively signifies that player i considers coalition S at least as desirable as coalition T , where S and T are coalitions in Ni. By Pi and Ii we denote the strict and the indifferent part of Ri, respectively. The preferences Ri of a player i are said to be dichotomous whenever Ni can be partitioned into two disjoint sets N +i and N − i such that i strictly prefers all coalitions in N +\ni to those in N −i and is indifferent otherwise, i.e., S Pi T if and only if S ∈ N + i and T ∈ N −i . A coalition S in Ni is acceptable to i if i (weakly) prefers S to coalition {i}, where he is on his own, i.e., if S Ri {i}. By contrast, we say that a coalition S is satisfactory or desirable for i if S ∈ N +i . Satisfactory partitions are thus generally acceptable to all players. The implication in the other direction, however, does not hold.\nWe lift preferences on coalitions to preferences on partitions in a natural way: player i prefers partition π to partition π′ whenever i prefers coalition π(i) to coalition π′(i). We also extend the concepts of acceptability and desirability of coalitions to partitions.\nExample 1 Consider the following Boolean game with four players, 1, 2, 3, and 4, whose (dichotomous) preferences are as follows. (Indifferences are indicated by commas.)\n1: {1, 2, 3}, {1, 2, 4}, {1, 3, 4}, {1, 2, 3, 4} P1 {1}, {1, 2}, {1, 3}, {1, 4}\n2: {2, 1, 3}, {2, 1, 4}, {2, 3, 4} P2 {2}, {2, 1}, {2, 3}, {2, 4}, {2, 1, 3, 4}\n3: {3, 1}, {3, 2}, {3, 1, 2} P3 {3}, {3, 4}, {3, 1, 4}, {3, 2, 4}, {3, 1, 2, 4}\n4: {4, 1}, {4, 2}, {4, 3}, {4, 1, 2}, {4, 1, 3}, {4} P4 {4, 2, 3}, {4, 1, 2, 3}\nThus, player 1 wants to be in a coalition of at least three and player 2 wishes to be in a coalition of exactly three. Moreover, player 3 wants to be in the same coalition as player 1 or as 2. He does not want to be in a coalition with player 4. Finally, player 4 does not want to be with players 2 and 3 together. There is exactly one partition that is satisfactory for all four players, namely [123 |4]. For players 1, 2, and 3, all coalitions are acceptable. For player 4, however, {4, 2, 3} and {1, 2, 3, 4} are unacceptable.\nSolution Concepts for Hedonic Games A solution concept associates with every hedonic game (N,R1, . . . , Rn) a (possibly empty) set of partitions of N . Here we review some of the most common solution concepts for hedonic games.\nIndividual rationality captures the idea that every player prefers the coalition he is in to being on his own, i.e., that coalitions are acceptable to its members. Thus, formally, π is individually rational if, for all players i in N ,\nπ(i) Ri {i}.\nThis condition is obviously equivalent to π Ri π[i → ∅].\nFor dichotomous hedonic games, a partition π is said to be social welfare optimal if it maximises the number of players who are in a satisfactory coalition, that is, if π maximises |{i ∈ N : π(i) ∈ N +i }|. In a similar way, a partition π is Pareto optimal if it maximises the set of players being in a satisfactory coalition with respect to set-inclusion, that is, if there is no partition π′ with\n{i ∈ N : π(i) ∈ N +i } ( {i ∈ N : π ′(i) ∈ N +i }.\nIn the extreme case in which every player is in a most preferred coalition, π is said to be perfect (cf., Aziz et al., 2013). A perfect partition satisfies any other of our stability concepts.\nA partition is Nash stable if no player would like to unilaterally abandon the coalition he is in and join any other existing coalition or stay on his own, that is, if, for all i ∈ N and all S ∈ π,\nπ(i) Ri S ∪ {i}.\nObserve that this condition is equivalent to π Ri π[i → S].\nCore stability concepts consider group deviations instead of individual ones. A group of players, possibly from different coalitions, is said to block a partition if they would all benefit by joining together in a separate coalition. Formally, T blocks (or is blocking) partition π if, for all i ∈ T ,\nT Pi π(i).\nThus, T blocks π if and only if π[T → ∅] Pi π for all i ∈ T . A group T weakly blocks (or is weakly blocking) π if T Ri π(i) holds for all i ∈ T and T Pi π(i) holds for some i ∈ T . Then, π is core stable if no group is blocking it and π is strict core stable if no group is weakly blocking it.\nPartition π is envy-free if no player is envious of another player, that is, if no player i would prefer to change places with another player j. Formally, partition π is envy-free if, for all players i and j,\nπ Ri π[i ⇆ j].\nIf π[i ⇆ j] Pi π we also say that player i envies player j.\nExample 1 (continued) In our example, in partition [1, 2, 3 |4] each player is in a most preferred coalition. As such [1, 2, 3 |4] is perfect as well as social welfare optimal and satisfies all solution concepts mentioned above. Moreover, all partitions except [1 |2, 3, 4] and [1, 2, 3, 4] individually rational.\nNow, consider partition π = [1 |2, 3 |4]. Here, player 2 does not want to abandon her coalition {2, 3} and join another as she prefers none of the following partitions to π: π[2 → {1}] = [1, 2 |3 |4], π[2 → {2, 3}] = [1 |2, 3 |4], π[2 → {4}], and π[2 → ∅] = [1 |2 |3 |4]. As, however, π[1 → {2, 3}] = [1, 2, 3 |4] and [1, 2, 3 |4] P1 π, partition π is not Nash stable.\nAlso observe that for π = [1 |2, 3 |4] the group {1, 2, 3} is strongly blocking, as π[{1, 2, 4} → ∅] = [1, 2, 4 |3] and [1, 2, 4 |3] Pi π for all i ∈ {1, 2, 4}. Thus, π is not core stable. By contrast, [1, 4 |2, 3] is core stable as only player 1 and 2 are not satisfied and both of them will only be if they can form a blocking coalition of exactly three. However, {1, 2, 4} is still weakly blocking, and as such [1, 4 |2, 3] is not strict core stable.\nFor envy-freeness, consider partition π′ = [1 |2, 4 |3]. Then, player 3 envies player 4, as π′[3 ⇆ 4] = [1 |2, 3 |4] and [1 |2, 3 |4] P3 π′. By contrast, player 3 does not envy player 2: we have π′[3 ⇆ 2] = [1 |2 |3, 4] but not [1 |2 |3, 4] P3 π′."}, {"heading": "3 A Logic for Coalition Structures", "text": "In this section, we develop a logic for representing coalition structures. We will then use this logic as a compact specification language for dichotomous preference relations in hedonic games.\nSyntax Given a set N of n players, we define a propositional language LN built from the usual connectives and with for every (unordered) pair {i, j} of distinct players a propositional variable p{i,j}. The set of propositional variables we denote by V . Observe that |V | = (\nn 2\n)\n. For notational convenience we will write ij for p{i,j}. Thus, ij and ji refer to the same symbol. The language is interpreted on coalition structures on N and the informal meaning of ij is “i and j are in the same coalition”. Formally, the formulas of the language LN , with typical element ϕ is given by the following grammar\nϕ ::= ij | ¬ϕ | (ϕ ∨ ϕ)\nwhere i, j ∈ N and i 6= j. By |ϕ| we denote the size of ϕ. For a given coalition S of players, we write VS for the propositional variables in which some i ∈ S appears, i.e.,\nVS = {ij ∈ V : i ∈ S or j ∈ S}.\nNote that for distinct players i and j we have Vi ∩ Vj = {ij}. The propositional language over VS we denote by LS . We write Vi and Li for V{i} and L{i}, respectively. The remaining classical connectives ⊥, ⊤, ∧, →, and ↔ are defined in the usual way. Moreover, for formulas ψ1, . . . , ψk of formulas, we have ∧\n1≤m≤k ψm and ∨\n1≤m≤k ψm abbreviate ψ1 ∧ · · · ∧ ψk and ψ1 ∨ · · · ∨ ψk, respectively. We also make use of the following useful notational shorthand:\ni1 · · · imim+1 · · · ip = ∧\n1≤j≤m\ni1ij ∧ ∧\nm<k≤p\n¬i1ik.\nThus, i1 · · · imim+1 · · · ip conveys that i1, . . . , im are in the same coalition and each of them in another coalition than im+1 · · · ip. Thus, where N = {1, 2, 3, 4}, 1234∨1324∨1423 abbreviates (12∧¬13∧¬14)∨(13∧¬12∧¬14)∨(14∧¬12∧¬13) and signifies that player 1 is in a coalition of two players.\nSemantics We interpret the formulas of LN on partitions π as follows.\nπ |= ij if and only if π(i) = π(j) π |= ¬ϕ if and only if π 6|= ϕ π |= ϕ → ψ if and only if π 6|= ϕ or π |= ψ\nFor Ψ ⊆ LN , we have Ψ |= ϕ if π |= ψ for all ψ ∈ Ψ implies π |= ϕ. If Ψ = ∅, we write |= ϕ and say that ϕ is valid.\nNotice that partitions play a dual role in our framework: both their initial role as coalition structures, and the role of models in our logic. This dual role is key to using formulas of our propositional language as a specification language for preference relations. Thus, e.g., partition [1|2|345] satisfies the following formulas of LN : 345, 31, 34512, ¬12 ∧ (23 ∨ 34), and 12 ↔ 23.\nAxiomatisation We have the following axiom schemes for mutually distinct players i, j, and k,\n(A0) all propositional tautologies\n(A1) ij ∧ jk → ik (transitivity)\nas well as modus ponens as the only rule of the system:\n(MP) from ϕ and ϕ → ψ infer ψ. (modus ponens)\nThe resulting logic we refer to as P and write Ψ ⊢P ϕ if there is a derivation of ϕ from Ψ, (A0), and (A1), using modus ponens.\nTheorem 1 (Completeness) Let Ψ ∪ {ϕ} ⊆ LN . Then,\nΨ ⊢P ϕ if and only if Ψ |= ϕ.\n(sketch): Soundness is straightforward. For completeness a standard Lindenbaum construction can be used. To this end, assume Ψ 6⊢P ϕ. Then, Ψ ∪ {¬ϕ} is consistent and can as such be extended to a maximal consistent theory Ψ∗. Define a relation ∼Ψ∗ such that for all i, j ∈ N ,\ni ∼Ψ∗ j if and only if ij ∈ Ψ ∗.\nThe axiom schemes (A0) and (A1) ensure that ∼Ψ∗ is a well-defined equivalence relation. Let [ i ]∼Ψ∗ = {j ∈ N : i ∼Ψ∗ j} be the equivalence class under ∼Ψ∗ to which player i belongs. Then define the partition πΨ∗ = {[ i ]∼Ψ∗ : i ∈ N}. By a straightforward structural induction, it can then be shown that for all ψ ∈ LN ,\nπΨ∗ |= ψ if and only if ψ ∈ Ψ ∗.\nIt follows that πΨ∗ |= Ψ and πΨ∗ 6|= ϕ. Hence, Ψ 6|= ϕ. ✷\nAlternatively, one can reason with coalition structures in standard propositional logic, by writing the transitivity axiom directly as a propositional logic formula. Let\ntrans = ∧\ni,j,k∈N\n(ij ∧ jk → ik).\nThen, for any propositional formulas ϕ and ψ of LN ,\nϕ ⊢P ψ if and only if ϕ ∧ trans ⊢ ψ\nthat is, checking whether a formula ϕ implies another formula ψ in P is equivalent to saying that ϕ together with the transitivity constraint implies ψ. This means that reasoning tasks in P can be done with a classical propositional theorem prover. In what follows we say that two formulas ϕ and ψ are P-equivalent whenever their equivalence can be proven in P, i.e., ⊢P ϕ ↔ ψ."}, {"heading": "4 Boolean Hedonic Games", "text": "The denotation of a formula ϕ of our propositional language is a set of coalition structures, and we can naturally interpret these as being the desirable or satisfactory coalition structures for a particular player. Thus, instead of writing a hedonic game with dichotomous preferences as a structure (N,R1, . . . , Rn), in which we explicitly enumerate preference relations Ri, we can instead write (N, γ1, . . . , γn), where γi is a formula of our propositional language that acts as a specification of the preference relation Ri. Intuitively, γi represents player i’s ‘goal’ and player i is satisfied if his goal is achieved and unsatisfied if he is not. We refer to a structure (N, γ1, . . . , γn) as a Boolean hedonic game. Thus, a Boolean hedonic game (N, γ1, . . . , γn) represents the (standard) hedonic game (N,R1, . . . , Rn) with for each i,\nπ(i) Ri π ′(i) if and only if π |= γi implies π ′ |= γi.\nObserve that, defined thus, the preferences of each player in a hedonic Boolean game are dichotomous.\nIt should be clear that every dichotomous preference relation Ri can be specified by a propositional formula γi, and hence our propositional language forms a fully expressive representation scheme for Boolean hedonic games.1 In fact, formulas in LN are strictly more expressive in the sense that they can represent any dichotomous preference relation over partitions rather than just preference relations over partitions as induced by a preference relation Ri for a player i over coalitions in Ni. We find, however, that every Boolean hedonic\n1Let i be a player with dichotomous preferences Ri and let Xi be the set of coalitions most preferred by i, i.e., S ∈ Xi if and only if S Ri S\n′ for all coalitions S and S′ containing i. Then, Ri is represented by following formula of Li in disjunctive normal form:\n∨\nS∈Xi\n(\n∧\nj∈S\nij ∧ ∧\nk/∈S\n¬ik ) .\ngame (N, γ1, . . . , γn) represents a hedonic game with dichotomous preferences provided that every player’s goal γi is equivalent to a formula in the language Li, the sublanguage of LN in which only variables in Vi = {ij : j ∈ N \\ {i}} occur. Intuitively, formulas in Li only convey information about the coalitions player i is in or she is not in.\nProposition 1 If a Boolean hedonic game (N, γ1, . . . , γn) represents a hedonic game with dichotomous preferences, then for every player i there is a formula ϕi ∈ Li that is P-equivalent to γi. Moreover, if for every player i there is a formula ϕi ∈ Li that is P-equivalent to γi, then (N, γ1, . . . , γn) represents a hedonic game with dichotomous preferences.\n(sketch): For a player i and ϕ a formula in Li, a straightforward inductive argument shows that\nπ |= ϕ if and only if π′ |= ϕ for all π′ with π′(i) = π(i).\nThen, the result follows as a corollary. ✷\nOften, the use of propositional formulas γi gives a ‘concise’ representation of the preference relation Ri, although of course in the worst case the shortest formula γi representing Ri may be of size exponential in the number of players. In what follows, we will write (N, γ1, . . . , γn), understanding that we are referring to the game (N,R1, . . . , Rn) corresponding to this specification.\nExample 1 (continued) The hedonic game with dichotomous preferences in Example 1 is represented by the Boolean hedonic game (N, γ1, γ2, γ3, γ4) with N = {1, 2, 3, 4} and the players’ goals given by:\nγ1 = (123 ∨ 124 ∨ 134) γ2 = (2134 ∨ 2143∨ 2341)\nγ3 = (31 ∨ 32) ∧ ¬34 γ4 = ¬423.\nFor each player i we then have that π |= γi if and only if π ∈ N + i ."}, {"heading": "5 Substitution and Deviation", "text": "We establish a formal link between substitution in formulas of our language and the possibility of players deviating from their respective coalition in a given partition and joining other coalitions.\nSubstitution We first introduce some formal notation and terminology with respect to substitution of formulas for variables in our logic.\nFor ij a propositional variable in VN and ϕ and ψ formulas of LN , we denote by ϕij←ψ the uniform substitution of variable ij by ψ in ϕ. If ~ı = i1j1, . . . , ikjk is a sequence of k distinct variables in V and ~ψ = ψ1, . . . , ψk a sequence of k formulas,\nϕ ~ı←~ψ = ϕi1j1,...,ikjk←ψ1,...,ψk\ndenotes the simultaneous substitution of each imjm by ψm (1 ≤ m ≤ k). Thus, e.g., (ij ∨ ¬jk)ij,jk←jk,ik = jk ∨ ¬ik. A special case, which recurs frequently in what follows, is if every ψi is a Boolean, i.e., if ψ1, . . . , ψk ∈ {⊤,⊥}. Sequences ~b = b1, . . . , bk where b1, . . . , bk ∈ {⊤,⊥} we will also refer to as Boolean vectors of length k. Thus, e.g., ⊤,⊥ is a Boolean vector of length 2 and (ij ∧ jk → ki)ij,ki←⊤,⊥ = ⊤ ∧ jk → ⊥.\nCharacterising individual deviations Some of the stability concepts for Boolean hedonic games we consider in this paper, e.g., Nash stability, are based on which coalitions an individual player i can join given a partition π. Recall that these coalitions are given by π|−i. Of course, not all groups of agents are included in π−i. For instance, let partition π be given by [ 12 |34 |5 ]. Then, player 1 can join coalition {3, 4} but cannot form a coalition with players 4 and 5 by unilaterally deviating from π. We find that the set π|−i can be characterised in our logic. This furthermore yields a logical characterisation of when a player i can unilaterally break loose from his coalition, join another one and thereby guarantee that a given formula ϕ will be satisfied. A particularly interesting case is if ϕ implies the respective player’s goal. We thus gain expressive power with respect to whether a player can beneficially deviate from a given partition, a crucial concept.\nLemma 1 Let π be a partition, i a player, B a group of players in N \\ {i}. Let furthermore ~b = b1, . . . , bn−1 be a Boolean vector of length n − 1 and i~ = ij1, . . . , ijn−1 an enumeration of Vi such that B = {j : iji~←~b = ⊤}. Then,\n(i) B ∈ π|−i iff π |= transi~←~b,\n(ii) B ∈ π|−i and π[i → B] |= ϕ iff π |= (ϕ ∧ trans)i~←~b.\nProof: We prove (i); the proof for (ii) is by structural induction on ϕ and relies on similar principles as (i). As~b and i~ are fixed throughout the proof, for better readability, we write ϕ′ for ϕ\ni~←~b.\nFor the “only if”-direction, assume that B ∈ π−i as well as π 6|= trans ′. Observe that trans ′ = ∧\nk,l,m\n( kl′ ∧ lm′ → km′ )\n. Accordingly, there are some (mutually distinct) k, l, and m such that π 6|= kl′ ∧ lm′ → km′. It suffices to consider the following three cases.\n(a) i /∈ {k, l,m}, (b) i = k, (c) i = l.\nCase (a) cannot occur as we would have kl′ = kl, lm′ = lm, km′ = km, and kl ∧ lm → km is a theorem of the system.\nIf (b), then π 6|= il′ ∧ lm′ → im′. It follows that π |= il′, π |= lm′, and π 6|= im′. Observe that in this case lm′ = lm. Hence, π(l) = π(m). Also notice that il′, im′ ∈ {⊤,⊥} and, thus, im′ = ⊥ and il′ = ⊤. Accordingly, l ∈ B but m /∈ B. As i 6= m and having assumed B ∈ π|−i, a contradiction follows:\nπ(m) 6= π(i) = π(l) = π(m).\nIf (c), we have π 6|= ik′ ∧ im′ → km′. Thus, π |= ik′, π |= im′, and π 6|= km′. Observe that km′ = km. Hence, π(k) 6= π(m). Moreover, ik′, im′ ∈ {⊤,⊥}, from which follows that ik′ = ⊤ and im′ = ⊤. Accordingly, both k,m ∈ B. With B ∈ π|−i, we obtain that π(k) = π(m), a contradiction.\nFor the “if”-direction, assume B /∈ π|−i and B 6= ∅. Because of the latter, there is some j ∈ B. Accordingly, ij′ = ⊤. As B /∈ π|−i, and thus in particular B 6= π(j) \\ {i}, there are two possibilities:\n(1) there is some k 6= i with k ∈ π(j) and k /∈ B, or\n(2) there is some k 6= i with k /∈ π(j) and k ∈ B.\nIf (1), we have π(j) = π(k) as well as ik′ = ⊥. As jk′ = jk, it holds that π |= ij′ ∧ jk′ but π 6|= ik′. If (2), however, we have π(j) 6= π(k) and ik′ = ⊤. As jk′ = jk, it holds that π |= ij′ ∧ ik′ but π 6|= jk′. In either case it follows that π 6|= trans ′. ✷\nThe following example illustrates Lemma 1.\nExample 2 Consider the partition π = [12 |34 |5]. Then, π|−1 = {{2}, {34}, {5}, ∅}. Let 1~ = 12, 13, 14, 15 be a fixed enumeration of V1. Also let ~b1 = ⊥,⊤,⊤,⊥ and ~b2 = ⊥,⊤,⊥,⊤ be Boolean vectors (of length 4). Then,\n[ 12 |34 |5 ] |= trans12,13,14,15←⊥,⊤,⊤,⊥.\n(This may be established, somewhat tediously, by painstakingly checking all 30 conjuncts of the form (kl ∧ lm) → km of trans.) Now, observe that {j : 1j\n1~j←~b1 } = {3, 4} and that {3, 4} ∈ π−1. On the other hand, observe that\n(13 ∧ 15 → 35) 1~←~b2 = (⊤ ∧ ⊤) → 35. It is easily established, however, that [12|34|5] does not satisfy (⊤∧⊤) → 35 and, hence, neither trans 1~←~b2 . Finally, observe that {j : 1j 1~←~b1 } = {3, 5} and that {3, 5} is not in π|−1.\nWe now introduce the following abbreviation, where i~ = ij1, . . . , ijn−1 is assumed to be a fixed enumeration of Vi.\n∃̂i ϕ = ∨\n~b∈{⊥,⊤}n−1\n(ϕ ∧ trans) i~←~b\nThus, ∃̂i can be understood as the operation of forgetting everything about player i (in the sense of Lin and Reiter (1994)) while taking the transitivity\nconstraint into account. Intuitively, ∃̂i ϕ signifies that given partition π player i can deviate to some coalition such that that ϕ is satisfied.\nProposition 2 Let π be a partition, i a player, and ϕ a formula of LN . Then,\nπ |= ∃̂i ϕ iff π[i → S] |= ϕ for some S ∈ π|−i,\nProof: First assume π |= ∃̂i ϕ. Then, π |= (ϕ ∧ trans) i~←~b for some\n~b ∈\n{⊥,⊤}n−1. Define S = {j : ij i~←~b = ⊤}. By Lemma 1(ii), we then obtain π[i → S] |= ϕ. For the opposite direction, assume that π[i → S] |= ϕ for some S ∈ π|−i. Define ~b = b1, . . . , bn−1 as the Boolean vector of length n−1 such that for every 1 ≤ k ≤ n− 1,\nbk =\n{\n⊤ if j ∈ S ∪ {i}\n⊥ otherwise.\nThen, clearly, S = {j : ij i~←~b = ⊤}. By Lemma 1(ii), it follows that π |= ϕi~←~b. We may conclude that π |= ∃̂i ϕ. ✷\nIt is important to note, however, that the number of Boolean vectors of length k is exponential in k. Accordingly, ∃̂i ϕ abbreviates a formula whose size is exponential in the size of ϕ.\nCharacterising group deviations Besides a single player deviating from its coalition and joining another, multiple players (from possibly different coalitions) could also deviate together and form a coalition of their own. This concept lies at the basis of, e.g., the core stability concept. We establish a formal connection between substitution and group deviations.\nLet T = {i1, . . . , it} be a group of players. Observe that |VT | = ( n 2 ) − ( n−t 2 ) and let ~ıT be a fixed enumeration of VT . By the T -separating Boolean vector (given ~ıT ) we define as the unique Boolean vector ~bT of length ( n 2 ) − ( n−t 2 )\nsuch that for all i ∈ T and all j ∈ N ,\nij ~ı T ←~bT =\n{\n⊤ if j ∈ T ,\n⊥ otherwise.\nIntuitively, ~bT represents the choice of group T to form a coalition of their own. Whenever T is clear from the context we omit the subscript in ~bT and ~ıT . The following characterisation now holds.\nLemma 2 Let (N, γ1, . . . , γn) be a Boolean hedonic game, T a group of players, π a partition, ~ı a fixed enumeration of VT , and ~bT the corresponding T - separating Boolean vector. Then, for every formula ϕ ∈ LN ,\nπ |= ϕ ~ı←~bT if and only if π[T → ∅] |= ϕ."}, {"heading": "6 Characterising Solutions", "text": "Our task in this section is to show how the various solution concepts we introduced above can be characterised as formulas of our propositional language. Let f be a function mapping each Boolean hedonic game G for N to a formula f(G) of LN . Given a solution concept θ, we say that f is a characterisation of θ if for every Boolean hedonic game G on N and every partition π, we\nhave that π is a solution according to θ for game G if and only if π |= f(G). If, furthermore, there exists a polynomial p such that |f(G)| ≤ p(|N |), then f is a polynomial characterisation of θ.\nOnce we have a characterisation of θ, we know that there is a one-to-one correspondence between the partitions of N satisfying θ and the models of f(G). Therefore, given a Boolean hedonic game G:\n• checking whether there exists a partition satisfying θ in G amounts to checking whether f(G) is satisfiable;\n• computing a partition satisfying θ in G amounts to finding a model of f(G);\n• computing all partitions satisfying θ in G amounts to finding all models of f(G).\nThus, once we have a characterisation of a solution concept, one can use a SAT solver to find (some or all) or to check the existence of partitions that satisfy it. This carries over to conjunctions of solution concepts. For instance, if individual rationality is characterised by fIR and envy-freeness by fEF , the there is a one-to-one correspondence between the individual rational envy-free partitions for G and the models of fIR(G) ∧ fEF (G). More generally, these techniques can be used for finding or checking partitions satisfying θ that also have certain other properties expressible in LN .\nIn the remainder of the section we focus on how a number of classical solution concepts, and see how they can be characterised in our logic.\nIndividual rationality, perfection, and optimality Recall that a partition is individually rational if any player is at least as happy in her coalition as being alone, that is, no player would prefer to leave her coalition to form a singleton coalition. Now we have the following characterisation of individual rationality in our logic.\nProposition 3 Let (N, γ1, . . . , γn) be a Boolean hedonic game, let i be a player with goal γ, and let π be a partition. Let, furthermore, i~ be a fixed enumeration of Vi and let ~b = ⊥, . . . ,⊥ be the Boolean vector of length n − 1 only containing ⊥. Then,\n(i) π is acceptable to i iff π |= (γi)i~←~b → γi,\n(ii) π is individually rational iff π |= ∧\ni∈N\n( (γi)i~←~b → γi ) .\nProof: We only give the proof for (i), as (ii) follows as an immediate consequence. For (i), merely consider the following equivalences, of which the third\none follows from Lemma 1(ii).\nπ is acceptable to i iff π Ri π[i → ∅]\niff π[i → ∅] |= γi implies π |= γi\niff π |= (γi)i~←~b implies π |= γi iff π |= (γi)i~←~b → γi.\nThis concludes the proof. ✷\nTo illustrate Proposition 3 we consider again Example 1.\nExample 1 (continued) In the game of our example, all partitions are acceptable to player 1, whose goal is given by γ1 = 123 ∨ 124 ∨ 134. Let V1 be enumerated by 1~ = 12, 13, 14 and let ~b = ⊥,⊥,⊥. Then, (γ2)12,13,14←⊥,⊥,⊥ is P-equivalent to ⊥ and, hence, π |= (γ2)12,13,14←⊥,⊥,⊥ → γ1 for all partitions π. According to Proposition 3 this signifies that to player 1 every partition is acceptable.\nNow consider player 4, whose goal is given by ¬423, that is, by ¬(42 ∧ 43). Let V4 be enumerated by 41, 42, 43 and let ~b = ⊥,⊥,⊥. Then, ¬(42 ∧ 43)41,42,43←⊥,⊥,⊥ = ¬(⊥ ∧ ⊥), which is obviously P-equivalent to ⊤. Hence,\nπ |= ¬(42 ∧ 43)41,42,43←⊥,⊥,⊥ if and only if π |= ¬(42 ∧ 43),\nmeaning that a partition π is acceptable to player 4 if and only if π satisfies his goal.\nThe logical characterisation of perfect perfect partition is immediate, as witnessed by the following proposition.\nProposition 4 Let (N, γ1, . . . , γn) be a Boolean hedonic game. Then, a partition π is perfect if and only if π |= ∧\ni∈N\nγi.\nAs a consequence, a perfect partition exists if and only if the formula trans ∧ ∧\ni∈N γi is satisfiable. Moreover, finding a social welfare maximising partition reduces to finding valuation satisfying a maximum number of formulas γi∧trans , that is, to solving a maxsat problem.\nLeveraging the same idea of iteratively checking whether a perfect partition can be found for a subset of agents, one can compute Pareto optimal solutions for a given game. A subset Ψ of formulas is said to be a maximal trans-consistent if both\n(i) Ψ ∪ {trans} is consistent, and\n(ii) Ψ′ ∪ {trans} is inconsistent for all sets of formulas Ψ′ with Ψ ( Ψ′.\nWe now have the following proposition.\nProposition 5 A partition π of a Boolean hedonic game is Pareto optimal if and only if {γi : π |= γi} is a maximal trans-consistent subset of {γ1, . . . , γn}\nAlgorithms for computing maximal consistent subsets are well-known and could thus be exploited for the computation of Pareto optimal partitions.\nNash stability Recall that a partition π is Nash stable, if no player i wishes to leave his coalition π(i) and join another (possibly empty) coalition so as to satisfy his goal. Leveraging our results from Section 5, we obtain the following characterisation of this fundamental solution concept.\nProposition 6 Let (N, γ1, . . . , γn) be a Boolean hedonic game and π a partition. Then,\nπ is Nash stable if and only if π |= ∧\ni∈N\n( (∃̂i γi) → γi ) .\nProof: Consider an arbitrary player i and observe that following equivalences hold. The fourth equivalence holds in virtue of Proposition 2. The third one is a standard law of logic: merely observe that π |= γi is not dependent on S.\nπ is Nash stable\niff for all i ∈ N and S ∈ π|−i: π Ri π[i → S]\niff for all i ∈ N and S ∈ π|−i: if π[i → S] |= γi then π |= γi\niff for all i ∈ N : if π[i → S] |= γi for some S ∈ π|−i then π |= γi\niff for all i ∈ N : if π |= ∃̂i γi then π |= γi\niff for all i ∈ N : π |= (∃̂i γi) → γi iff π |= ∧\ni∈N\n( (∃̂i γi) → γi )\nThis concludes the proof. ✷\nOur running example illustrates this result.\nExample 1 (continued) Consider again the game of Example 1. Partition [123|4] satisfies each player’s goal and, consequently, is Nash stable. We also have that [123|4] |= γ1 ∧ γ2 ∧ γ3 ∧ γ4 and, thus,\n[123|4] |= ∧\ni∈N\n( (∃̂i γi) → γi ) .\nNow recall that for partition π = [1|23|4] player 2’s goal is not satisfied and that she cannot deviate and join another coalition to make this happen. In this case, π|−2 = {{1}, {3}, {4}}. Moreover, π[2 → {1}] = [12|3|4], π[2 → {3}] = [1|23|4], and π[2 → {4}] = [1|3|24]. Since, [12|3|4] 6|= γ2, [1|23|4] 6|= γ2, and [1|3|24] 6|= γ2, it follows that π 6|= ∃̂2 γ2. Hence, π |= (∃̂2 γ2) → γ2. Player 1, however, could deviate from π2 and join {2, 3} and thus have his goal satisfied. Thus, π is not Nash stable. Now observe that {2, 3} ∈ π|−1 and that π[1 → {2, 3}] = [123|4]. Moreover, [123|4] |= γ1. As thus π |= ∃̂1 γ1, also π 6|= (∃̂1 γ1) → γ1. We may conclude that\n[1|23|4] 6|= ∧\ni∈N\n( (∃̂i γi) → γi ) .\nNash stable partitions are not guaranteed to exist in Boolean hedonic games. The two-player game ({1, 2}, 12,¬21) witnesses this fact, as can easily be appreciated. The translation into a SAT instance gives us a way to compute all Nash stable partitions of a given Boolean hedonic game. Recall, however, that the size of ∃̂i γi is generally exponential in the size of γi.\nCore and strict core stability Core and strict core stability relate to group deviations much in the same way as Nash stability relates to individual deviations. Group deviations we characterised in Section 5. We thus find that Lemma 2 yields a straightforward characterisation in our logic of a specific group blocking or weakly blocking a given partition.\nProposition 7 Let (N, γ1, . . . , γn) be a Boolean hedonic game and T a group of players, and π be a partition. Let, furthermore, ~ı a fixed enumeration of VT and ~b the corresponding T -separating Boolean vector. Then,\n(i) T blocks π if and only if π |= ∧\ni∈T\n( ¬γi ∧ (γi)~ı←~b ) ,\n(ii) T weakly blocks π if and only if\nπ |= ∧\nj∈T\n( γj → (γj)~ı←~b ) ∧ ∨\ni∈T\n( ¬γi ∧ (γi)~ı←~b ) .\nProof: We give the proof for (i), as the one for (ii) runs along analogous lines. Consider the following equivalences, of which the third one follows immediately from Lemma 2.\nT blocks π iff for all i ∈ T : π[T → ∅] Pi π\niff for all i ∈ T : π[T → ∅] |= γi and π 6|= γi\niff for all i ∈ T : π |= (γi)~ı←~b and π 6|= γi iff π |= ∧\ni∈T\n( ¬γi ∧ (γi)~ı←~b ) .\nThis concludes the proof. ✷\nObserve that the size of ∧\ni∈T\n( ¬γi ∧ (γi)~ı←~b )\nis obviously polynomial in ∑\ni∈T |γi| and, hence, a partition π being blocking by particular group T of players can be polynomially characterised. It might also be worth observing that this characterisation is reminiscent of that for individual rationality and, surprisingly, much more so than of the one for Nash stability.\nAs a corollary of Proposition 7 and de Morgan laws, we obtain the following characterisations of a partition being core stable and of a partition being strict core stable. The characterisations, however, involve a conjunctions over all groups of players and as such is not polynomial.\nCorollary 1 Let (N, γ1, . . . , γn) be a Boolean hedonic game and π be a partition. Let for each coalition T , ~ı be an enumeration of VT and ~b the corresponding T -separating Boolean vector. Then,\n(i) π is core stable if and only if π |= ∧\nT⊆N\n∨\ni∈T\n( (γi)~ı←~b → γi ) ,\n(ii) Then, π is strict core stable if and only if\nπ |= ∧\nT⊆N\n(\n∨\nj∈T\n(γj ∧ ¬(γj)~ı←~b) ∨ ∧\ni∈T\n((γi)~ı←~b → γi) ) .\nAlthough core stable coalition structure are not guaranteed to exist in general hedonic games, the restriction to dichotomous preferences allows us to derive this positive result.\nProposition 8 For every Boolean hedonic game, a core stable coalition structure is guaranteed to exist.\nProof: We initialise N ′ to N and partition π to {∅}. We find a maximal subset of S ⊂ N ′ for which all players are in an approved coalition that satisfies their formulas. We modify π to π ∪{S} and N ′ to N ′ \\S. The procedure is repeated until no such maximal subset S exists. If N ′ 6= ∅, then π is set to π ∪ {{i} : i ∈ N ′}.\nWe now argue that π is core stable. We note that each player who was in some subset S will never be part of a blocking coalition. If N ′ was non-empty in the last iteration, then no subset of players in N ′ can form a deviating coalition among themselves. ✷\nBy contrast, a strict core stable partition is not guaranteed to exist. To see this consider the three-player Boolean hedonic game ({1, 2, 3}, 12, 21∨ 23, 32). It is not hard to see that each of the five possible partitions is weakly blocked by either {1, 2} or {2, 3}.\nEnvy-freeness Recall that a partition is envy-free if no player would strictly prefer to exchange places with another player. Observe that for the trivial partitions π0 = [1 | · · · |n] and π1 = [1, . . . , n], we have π0[i ⇆ j] = π0 and π1[i ⇆ j] = π1 for all players i and j. Accordingly π0 and π1 are envy-free. Envy-free partitions are thus guaranteed to exist in our setting. The following lemma allows us to derive a polynomial characterisation of envy-freeness.\nLemma 3 Let (N, γ1, . . . , γn) be a Boolean hedonic game and i and j players in N , and ϕ a formula in LN . Fix, furthermore, an enumeration k1, . . . , kn−2 of N \\ {i, j} and let i~k = ik1, . . . , ikn−2 and j~k = jk1, . . . , jkn−2 enumerate Vi \\ {ij} and Vj \\ {ji}, respectively. Then,\nπ |= ϕ i~k,j~k←j~k,i~k if and only if π[i ⇆ j] |= ϕ.\nProof: With i~k and j~k being fixed we write ϕ′ for ϕ i~k,j~k←j~k,i~k . The proof is then by induction on ϕ. For the basis, let ϕ = lm. There are three possibilities:\n(a) lm = ij, (b) lm ∈ (Vi ∪ Vj) \\ {ij}, and (c) lm /∈ Vi ∪ Vj .\nIf (a), we have that lm′ = ij′ = ij = lm. Now, either π(i) = π(j) or π(i) 6= π(j). If the former, π[i ⇆ j] = π as well as both π |= ij′ and π[i ⇆ j] |= ij. If the latter, however, it can easily be seen that both π 6|= ij′ and π[i ⇆ j] 6|= ij.\nFor case (b), we may assume without loss of generality that lm = ik for some k 6= j. Then, ik′ = jk. In case π(i) = π(j), obviously, π = π[i ⇆ j] as well as k ∈ π(i) if and only if k ∈ π(j). Hence, π |= ik′ if and only if π[i ⇆ j] |= ik. So, assume π(i) 6= π(j). Now, either (i) k ∈ π(i) and k /∈ π(j), (ii) k /∈ π(k) and k ∈ π(j), or (iii) k /∈ π(i) and k /∈ π(j). If (i), π |= ik′ as well as π[i ⇆ j] |= jk. In cases (ii) and (iii), we have π 6|= ik′ and π[i ⇆ j] 6|= jk.\nFinally, if (c), we have lm′ = lm. As l,m /∈ {i, j}, it can then easily be seen that π |= lm′ if and only if π[i ⇆ j] |= lm.\nThe cases ϕ = ¬ψ and ϕ = ψ → χ follow by induction. ✷\nWe are now in a position to state the following result.\nProposition 9 Let (N, γ1, . . . , γn) be a Boolean hedonic game. Furthermore, for every two players, i and j, and enumeration k1, . . . , kn−2 of N \\ {i, j}, let i~k = ik1, . . . , ikn−2 and j~k = jk1, . . . , jkn−2 enumerate Vi \\ {ij} and Vj \\ {ij}, respectively. Then,\nπ is envy-free if and only if π |= ∧\ni,j∈N\n( (γi)i~k,j~k←j~k,i~k → γi ) .\nProof: By virtue of Lemma 3, the following equivalences hold:\nπ is envy-free\niff for all i, j ∈ N : π Ri π[i ⇆ j]\niff for all i, j ∈ N : π[i ⇆ j] |= γi implies π |= γi\niff for all i, j ∈ N : π |= (γi)i~k,j~k←j~k,i~k implies π |= γi iff for all i, j ∈ N : π |= (γi)i~k,j~k←j~k,i~k → γi iff π |= ∧\ni,j∈N\n( (γi)i~k,j~k←j~k,i~k → γi )\nThis concludes the proof. ✷\nObserve that the size of ∧\ni,j∈N\n( (γi)i~k,j~k←j~k,i~k → γi )\nis clearly polynomial in ∑\ni∈T |γi|. Hence, a partition π being envy-free can be polynomially characterised.\nExample 1 (continued) Recall that γ3 = (31 ∨ 32) ∧ ¬34 and that player 3 envies player 4 if partition π′ = [1|24|3] obtains. To see how this is reflected by Proposition 9, let 31, 32 and 41, 42 enumerate V3 \\ {34} and V4 \\ {43}, respectively. Then,\n((31 ∨ 32) ∧ ¬34)31,32,41,42←41,42,31,32 = (41 ∨ 42) ∧ ¬34.\nNow, both π′ |= (41 ∨ 42) ∧ ¬34 and π′ 6|= (31 ∨ 32) ∧ ¬34, and, hence, π′ 6|= (γ3)34,31,32←43,41,42 → γ3."}, {"heading": "7 Related Work and Conclusions", "text": "Our motivation and approach is strongly reminiscent of the setting of Boolean games in the context of non-cooperative game theory (Harrenstein et al., 2001). A major difference with Boolean games and propositional hedonic games is that in Boolean games, players have preferences over outcomes, where an outcome is a truth assignment to outcome variables, and each outcome variable is controlled by a specific player. This control assignment function, which is a central notion in Boolean games, has no counterpart here, where the outcome is a partition of the players. However, there are technical similarities with and conceptual connections to Boolean games, especially when characterising solution concepts. For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al. (2001) was adapted to the setting of cooperative games by Dunne et al. (2008). However, the logic used to specific player’s goals in the work of Dunne et al. was not intended for specifying desirable coalition structures, as we have done in the present paper.\nOur work also shares some common ground with the work of Bonzon et al. (2012), who study the formation of efficient coalitions in Boolean games, that is, coalitions whose joint abilities allow their members to jointly achieve their goals. Our work also bears some resemblance to the work of Elkind and Wooldridge (2009), who were interested in using logic as a foundation upon which to build a compact representation scheme for hedonic games; more precisely, their work made use of weighted Boolean formulas, and was inspired by themarginal contribution nets representation for cooperative games in characteristic function form proposed byIeong and Shoham (2005). The focus of Elkind and Wooldridge (2009), however, was more on complexity issues than in finding exact characterisations for solution concepts.\nFinally, our work contributes to the extensive literature on compact representations for cooperative games, which has expanded rapidly over the past decade (Chalkiadakis et al., 2011).\nOur characterisations of solution concepts enable to compute, using an offthe-shelf SAT solver, a partition or all partitions satisfying a solution concept or a logical combination of solution concepts. Of course, this translation is interesting only when we cannot do better. For instance, for solution concepts\nleading to a polynomial characterisation, we cannot do better if and only if the corresponding decision problem is NP-complete. Identifying the complexity of finding partitions satisfying solution concepts for Boolean hedonic games is therefore the most immediate direction of further research.\nThere are at least three more directions in which our work might be further developed. First, we could think of relaxing our restriction to dichotomous preferences and study more general hedonic games with compact logical representations and derive exact characterisations of solution concepts. There are several ways in which more general preferences can be incorporated in our logical framework for hedonic games. For instance, instead of a single goal, we could associate with each player a prioritised set of goals. The different possibilities in this respect, however, vary in their level of sophistication. For some of the cruder extensions our results extend naturally and straightforwardly. For the more sophisticated settings more research seems to be required, which falls beyond the scope of this paper.\nSecond, our restriction to hedonic preferences can also be relaxed, so that players may have preferences that do depend not only on on the coalition to which they belong. This would also pave the way to a more general logic of coalition structures. Solution concepts, once generalised, can hopefully be characterised. (We have positive preliminary results that go into this direction).\nA third topic of future research would be the characterisation of classes of hedonic and coalition formation games in our logic. As mentioned above, various classes of hedonic games that allow for a concise representation have been proposed in the literature. It would be interesting to see whether these classes can also be polynomially characterised in our logic.\nAcknowledgments The authors would like to thank the anonymous referees of LOFT 2014 for their constructive comments. Haris Aziz has been supported by NICTA which is funded by the Australian Government as represented by the Department of Broadband, Communications and the Digital Economy and the Australian Research Council through the ICT Centre of Excellence program. Jérôme Lang has been supported by the ANR project CoCoRICo-CoDec. Paul Harrenstein and Michael Wooldridge have been supported by the ERC under Advanced Grant 291528 (“RACE”)."}], "references": [{"title": "Pareto optimality in coalition formation", "author": ["H. Aziz", "F. Brandt", "P. Harrenstein"], "venue": "Games and Economic Behavior,", "citeRegEx": "Aziz et al\\.,? \\Q2013\\E", "shortCiteRegEx": "Aziz et al\\.", "year": 2013}, {"title": "The stability of hedonic coalition structures", "author": ["A. Bogomolnaia", "M.O. Jackson"], "venue": "Games and Economic Behaviour,", "citeRegEx": "Bogomolnaia and Jackson.,? \\Q2002\\E", "shortCiteRegEx": "Bogomolnaia and Jackson.", "year": 2002}, {"title": "Random matching under dichotomous", "author": ["A. Bogomolnaia", "H. Moulin"], "venue": "preferences. Econometrica,", "citeRegEx": "Bogomolnaia and Moulin.,? \\Q2004\\E", "shortCiteRegEx": "Bogomolnaia and Moulin.", "year": 2004}, {"title": "Collective choice under dichotomous preferences", "author": ["A. Bogomolnaia", "H. Moulin", "R. Stong"], "venue": "Journal of Economic Theory,", "citeRegEx": "Bogomolnaia et al\\.,? \\Q2005\\E", "shortCiteRegEx": "Bogomolnaia et al\\.", "year": 2005}, {"title": "Compact preference representation and Boolean games", "author": ["E. Bonzon", "M.-C. Lagasquie-Schiex", "J. Lang", "B. Zanuttini"], "venue": "Autonomous Agents and Multi-Agent Systems,", "citeRegEx": "Bonzon et al\\.,? \\Q2009\\E", "shortCiteRegEx": "Bonzon et al\\.", "year": 2009}, {"title": "Effectivity functions and efficient coalitions", "author": ["E. Bonzon", "M.-C. Lagasquie-Schiex", "J. Lang"], "venue": "Boolean games. Synthese,", "citeRegEx": "Bonzon et al\\.,? \\Q2012\\E", "shortCiteRegEx": "Bonzon et al\\.", "year": 2012}, {"title": "Efficiency and envy-freeness in fair division of indivisible goods: Logical representation and complexity", "author": ["S. Bouveret", "J. Lang"], "venue": "Journal of AI Research,", "citeRegEx": "Bouveret and Lang.,? \\Q2008\\E", "shortCiteRegEx": "Bouveret and Lang.", "year": 2008}, {"title": "Stable partition problem", "author": ["K. Cechlárová"], "venue": "In Encyclopedia of Algorithms,", "citeRegEx": "Cechlárová.,? \\Q2008\\E", "shortCiteRegEx": "Cechlárová.", "year": 2008}, {"title": "Stable partitions with W-preferences", "author": ["K. Cechlárová", "J. Hajduková"], "venue": "Discrete Applied Mathematics,", "citeRegEx": "Cechlárová and Hajduková.,? \\Q2004\\E", "shortCiteRegEx": "Cechlárová and Hajduková.", "year": 2004}, {"title": "Cooperative Boolean games", "author": ["P.E. Dunne", "S. Kraus", "W. van der Hoek", "M. Wooldridge"], "venue": "In Proceedings of the Seventh International Joint Conference on Autonomous Agents and Multiagent Systems", "citeRegEx": "Dunne et al\\.,? \\Q2008\\E", "shortCiteRegEx": "Dunne et al\\.", "year": 2008}, {"title": "Hedonic coalition nets", "author": ["E. Elkind", "M. Wooldridge"], "venue": "In Proceedings of the Eigth International Joint Conference on Autonomous Agents and Multiagent Systems", "citeRegEx": "Elkind and Wooldridge.,? \\Q2009\\E", "shortCiteRegEx": "Elkind and Wooldridge.", "year": 2009}, {"title": "Coalition formation games: A survey", "author": ["J. Hajduková"], "venue": "International Game Theory Review,", "citeRegEx": "Hajduková.,? \\Q2006\\E", "shortCiteRegEx": "Hajduková.", "year": 2006}, {"title": "Marginal contribution nets: A compact representation scheme for coalitional games", "author": ["S. Ieong", "Y. Shoham"], "venue": "In Proceedings of the Sixth ACM Conference on Electronic Commerce (EC’05),", "citeRegEx": "Ieong and Shoham.,? \\Q2005\\E", "shortCiteRegEx": "Ieong and Shoham.", "year": 2005}, {"title": "Merging information under constraints: a logical framework", "author": ["S. Konieczny", "R. Pino-Pérez"], "venue": "Journal of Logic and Computation,", "citeRegEx": "Konieczny and Pino.Pérez.,? \\Q2002\\E", "shortCiteRegEx": "Konieczny and Pino.Pérez.", "year": 2002}, {"title": "Forget it", "author": ["F. Lin", "R. Reiter"], "venue": "In Working Notes of AAAI Fall Symposium on Relevance,", "citeRegEx": "Lin and Reiter.,? \\Q1994\\E", "shortCiteRegEx": "Lin and Reiter.", "year": 1994}], "referenceMentions": [{"referenceID": 8, "context": "assume that each player specifies only a ranking over single players, and that her preferences over coalitions are defined according to the identity of the best (respectively, worst) element of the coalition (Cechlárová and Hajduková, 2004; Cechlárová, 2008).", "startOffset": 208, "endOffset": 258}, {"referenceID": 7, "context": "assume that each player specifies only a ranking over single players, and that her preferences over coalitions are defined according to the identity of the best (respectively, worst) element of the coalition (Cechlárová and Hajduková, 2004; Cechlárová, 2008).", "startOffset": 208, "endOffset": 258}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002).", "startOffset": 105, "endOffset": 136}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas.", "startOffset": 106, "endOffset": 251}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller. In this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. While to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al.", "startOffset": 106, "endOffset": 1294}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller. In this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. While to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al.", "startOffset": 106, "endOffset": 1325}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller. In this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. While to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al.", "startOffset": 106, "endOffset": 1355}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller. In this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. While to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al. (2001) in the context of Boolean games, by Konieczny and Pino-Pérez (2002) in the context of belief merging, by Bogomolnaia and Moulin (2004) in the context of matching, and by Brams and Fishburn (2007) (and many others) in the context of approval voting.", "startOffset": 106, "endOffset": 1417}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller. In this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. While to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al. (2001) in the context of Boolean games, by Konieczny and Pino-Pérez (2002) in the context of belief merging, by Bogomolnaia and Moulin (2004) in the context of matching, and by Brams and Fishburn (2007) (and many others) in the context of approval voting.", "startOffset": 106, "endOffset": 1485}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller. In this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. While to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al. (2001) in the context of Boolean games, by Konieczny and Pino-Pérez (2002) in the context of belief merging, by Bogomolnaia and Moulin (2004) in the context of matching, and by Brams and Fishburn (2007) (and many others) in the context of approval voting.", "startOffset": 106, "endOffset": 1552}, {"referenceID": 1, "context": "One may also assume that each player’s preferences depend only on the number of players in her coalition (Bogomolnaia and Jackson, 2002). These representations come with a domain restriction, i.e., a loss of expressivity: Elkind and Wooldridge (2009) consider a fully expressive representation for hedonic games, based on weighted logical formulas. In the worst case, the representation of Elkind and Wooldridge requires space exponential in the number of players, but in many cases the space requirement is much smaller. In this paper, we consider another natural restriction on player preferences. We consider hedonic games with dichotomous preferences. The assumption of dichotomous preferences means that each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. While to the best of our knowledge dichotomous preferences have not been previously studied in the context of hedonic games, they have of course been studied in other economic settings, such as by Bogomolnaia et al. (2005), Bogomolnaia and Moulin (2004), and Bouveret and Lang (2008) in the context of fair division, by Harrenstein et al. (2001) in the context of Boolean games, by Konieczny and Pino-Pérez (2002) in the context of belief merging, by Bogomolnaia and Moulin (2004) in the context of matching, and by Brams and Fishburn (2007) (and many others) in the context of approval voting.", "startOffset": 106, "endOffset": 1613}, {"referenceID": 1, "context": ", Bogomolnaia and Jackson (2002). Also see Hajduková (2006)", "startOffset": 2, "endOffset": 33}, {"referenceID": 1, "context": ", Bogomolnaia and Jackson (2002). Also see Hajduková (2006)", "startOffset": 2, "endOffset": 60}, {"referenceID": 14, "context": "Thus, ∃̂i can be understood as the operation of forgetting everything about player i (in the sense of Lin and Reiter (1994)) while taking the transitivity constraint into account.", "startOffset": 102, "endOffset": 124}, {"referenceID": 4, "context": "For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al.", "startOffset": 202, "endOffset": 223}, {"referenceID": 4, "context": "For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al. (2001) was adapted to the setting of cooperative games by Dunne et al.", "startOffset": 202, "endOffset": 283}, {"referenceID": 4, "context": "For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al. (2001) was adapted to the setting of cooperative games by Dunne et al. (2008). However, the logic used to specific player’s goals in the work of Dunne et al.", "startOffset": 202, "endOffset": 354}, {"referenceID": 4, "context": "For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al. (2001) was adapted to the setting of cooperative games by Dunne et al. (2008). However, the logic used to specific player’s goals in the work of Dunne et al. was not intended for specifying desirable coalition structures, as we have done in the present paper. Our work also shares some common ground with the work of Bonzon et al. (2012), who study the formation of efficient coalitions in Boolean games, that is, coalitions whose joint abilities allow their members to jointly achieve their goals.", "startOffset": 202, "endOffset": 614}, {"referenceID": 4, "context": "For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al. (2001) was adapted to the setting of cooperative games by Dunne et al. (2008). However, the logic used to specific player’s goals in the work of Dunne et al. was not intended for specifying desirable coalition structures, as we have done in the present paper. Our work also shares some common ground with the work of Bonzon et al. (2012), who study the formation of efficient coalitions in Boolean games, that is, coalitions whose joint abilities allow their members to jointly achieve their goals. Our work also bears some resemblance to the work of Elkind and Wooldridge (2009), who were interested in using logic as a foundation upon which to build a compact representation scheme for hedonic games; more precisely, their work made use of weighted Boolean formulas, and was inspired by themarginal contribution nets representation for cooperative games in characteristic function form proposed byIeong and Shoham (2005).", "startOffset": 202, "endOffset": 856}, {"referenceID": 4, "context": "For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al. (2001) was adapted to the setting of cooperative games by Dunne et al. (2008). However, the logic used to specific player’s goals in the work of Dunne et al. was not intended for specifying desirable coalition structures, as we have done in the present paper. Our work also shares some common ground with the work of Bonzon et al. (2012), who study the formation of efficient coalitions in Boolean games, that is, coalitions whose joint abilities allow their members to jointly achieve their goals. Our work also bears some resemblance to the work of Elkind and Wooldridge (2009), who were interested in using logic as a foundation upon which to build a compact representation scheme for hedonic games; more precisely, their work made use of weighted Boolean formulas, and was inspired by themarginal contribution nets representation for cooperative games in characteristic function form proposed byIeong and Shoham (2005). The focus of Elkind and Wooldridge (2009), however, was more on complexity issues than in finding exact characterisations for solution concepts.", "startOffset": 202, "endOffset": 1199}, {"referenceID": 4, "context": "For instance, the characterisation of Nash stable partitions by propositional formulas (Section 4) is similar to the characterisation of Nash equilibria by propositional formulas in Boolean games as by Bonzon et al. (2009). The basic Boolean games model of Harrenstein et al. (2001) was adapted to the setting of cooperative games by Dunne et al. (2008). However, the logic used to specific player’s goals in the work of Dunne et al. was not intended for specifying desirable coalition structures, as we have done in the present paper. Our work also shares some common ground with the work of Bonzon et al. (2012), who study the formation of efficient coalitions in Boolean games, that is, coalitions whose joint abilities allow their members to jointly achieve their goals. Our work also bears some resemblance to the work of Elkind and Wooldridge (2009), who were interested in using logic as a foundation upon which to build a compact representation scheme for hedonic games; more precisely, their work made use of weighted Boolean formulas, and was inspired by themarginal contribution nets representation for cooperative games in characteristic function form proposed byIeong and Shoham (2005). The focus of Elkind and Wooldridge (2009), however, was more on complexity issues than in finding exact characterisations for solution concepts.", "startOffset": 202, "endOffset": 1242}], "year": 2015, "abstractText": "We study hedonic games with dichotomous preferences. Hedonic games are cooperative games in which players desire to form coalitions, but only care about the makeup of the coalitions of which they are members; they are indifferent about the makeup of other coalitions. The assumption of dichotomous preferences means that, additionally, each player’s preference relation partitions the set of coalitions of which that player is a member into just two equivalence classes: satisfactory and unsatisfactory. A player is indifferent between satisfactory coalitions, and is indifferent between unsatisfactory coalitions, but strictly prefers any satisfactory coalition over any unsatisfactory coalition. We develop a succinct representation for such games, in which each player’s preference relation is represented by a propositional formula. We show how solution concepts for hedonic games with dichotomous preferences are characterised by propositional formulas.", "creator": "LaTeX with hyperref package"}}}