{"id": "1509.05463", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "17-Sep-2015", "title": "Learning from Synthetic Data Using a Stacked Multichannel Autoencoder", "abstract": "roomiest Learning from d'oro synthetic huixquilucan data sangare has mintoff many cvm important and practical exekias applications. An dadon example of rhizaria application distler is whitehead photo - sketch recognition. Using synthetic data is challenging due mamizara to govert the differences liboro in conceptually feature bracelin distributions flippen between synthetic hinting and ngân real unheard-of data, campylobacter a phenomenon go-kart we shunters term synthetic gap. karalus In edler this blando paper, soluna we beitz investigate macintax and formalize cochon a brookeville general framework - cusped Stacked pre-decimal Multichannel Autoencoder (SMCAE) that doña enables bridging 5,000-watt the corresponded synthetic gap and learning jigs from synthetic data more inerrancy efficiently. In 8-for-8 particular, assures we prototyped show gymnázium that autochrome our nisi SMCAE anung can choos not sahlins only transform peza and use synthetic paznaun data on toho the 0-fer challenging face - sketch recognition task, q but dehydrator that minguzzi it greek-language can also help lavr simulate real images, pinkas which can rtp-midi be rdt used jiiva for training classifiers trainer for recognition. amidror Preliminary merchandise experiments ajibade validate shatpadi the effectiveness of pigface the framework.", "histories": [["v1", "Thu, 17 Sep 2015 22:26:30 GMT  (2728kb)", "http://arxiv.org/abs/1509.05463v1", null], ["v2", "Mon, 21 Sep 2015 19:28:12 GMT  (4979kb,D)", "http://arxiv.org/abs/1509.05463v2", null]], "reviews": [], "SUBJECTS": "cs.CV cs.AI", "authors": ["xi zhang", "yanwei fu", "shanshan jiang", "leonid sigal", "gady agam"], "accepted": false, "id": "1509.05463"}, "pdf": {"name": "1509.05463.pdf", "metadata": {"source": "CRF", "title": "Learning from Synthetic Data Using a Stacked Multichannel Autoencoder", "authors": ["Xi Zhang", "Yanwei Fu", "Shanshan Jiang", "Leonid Sigal", "Gady Agam"], "emails": ["sjiang20}@hawk.iit.edu", "agam@iit.edu", "lsigal}@disneyresearch.com"], "sections": null, "references": [{"title": "Distance transforms in digital images", "author": ["Gunilla Borgefors"], "venue": "In Computer Vision, Graphics, and Image Processing,", "citeRegEx": "1", "shortCiteRegEx": "1", "year": 1986}, {"title": "Learning from one example through shared densities on transforms", "author": ["Erik G Miller", "Nicholas E Matsakis", "Paul A Viola"], "venue": "In Computer Vision and Pattern Recognition,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 2000}], "referenceMentions": [{"referenceID": 1, "context": "Autoencoder with its different variants [9], [11], [2], [18] was shown to be successful in learning and transferring shared knowledge among data source from different domains [5], [8], [10], and thus benefit other machine learning tasks.", "startOffset": 51, "endOffset": 54}, {"referenceID": 0, "context": "We compare our SMCAE with SMCAE-II, SAE-I, SAEII, LeNet-5 [15] and the best results [1] reported on this data set.", "startOffset": 84, "endOffset": 87}, {"referenceID": 0, "context": "SMCAE+SVM SMCAE−II+SVM SAE−I+SVM SAE−II+SVM LeNet−5 [1] 96 96.", "startOffset": 52, "endOffset": 55}], "year": 0, "abstractText": "Learning from synthetic data has many important and practical applications, An example of application is photosketch recognition. Using synthetic data is challenging due to the differences in feature distributions between synthetic and real data, a phenomenon we term synthetic gap. In this paper, we investigate and formalize a general framework – Stacked Multichannel Autoencoder (SMCAE) that enables bridging the synthetic gap and learning from synthetic data more efficiently. In particular, we show that our SMCAE can not only transform and use synthetic data on the challenging face-sketch recognition task, but that it can also help simulate real images, which can be used for training classifiers for recognition. Preliminary experiments validate the effectiveness of the framework.", "creator": "cairo 1.10.2 (http://cairographics.org)"}}}