{"id": "1510.03623", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "13-Oct-2015", "title": "Elastic regularization in restricted Boltzmann machines: Dealing with $p\\gg N$", "abstract": "llamazares Restricted Boltzmann meszaros machines (9/27 RBMs) conflictual are myroslav endowed with nembe the universal power azaz of shokhin modeling (mariavite binary) succi joint homestays distributions. Meanwhile, as pulte a tibbles result bordes of mazidi their lewenhaupt confining benzino network alers structure, training mahu RBMs confronts less juul difficulties (compared englander with more 232.1 complicated l.h. models, esquipulas e. g. , biały Boltzmann kentwell machines) when shm dealing with approximation and 45.79 inference augury issues. However, teixeira in 1,499 certain mileti computational 3,053 biology rosprirodnadzor scenarios, ornithoptera such sympathising as the cancer icelandair data kegworth analysis, christabel employing coalmine RBMs libido to frn model data eyjafjallajökull features mexican-americans may showbread lose piegan its radcliff efficacy due detuned to forchheim the \" $ p \\ 53-44 gg N $ \" problem, benzine in kyats which destroying the untersuchungen number of features / predictors is non-performing much larger arboviruses than the shanley sample size. The \" $ sharafi p \\ gangliosides gg N $ \" spreading problem denfeld puts palatka the bias - convergencia variance trade - legendarium off in a razgrad more bexhill crucial potsie place when designing statistical amboyna learning tail-end methods. In this kyokutenho manuscript, furse we plutocratic try masferrer to 26.06 address meppen this problem driehaus by proposing stolt-nielsen a scrums novel oulart RBM model, called parme elastic brownless restricted tryscorers Boltzmann xyzzy machine (eRBM ), which rishtey incorporates drik the elastic regularization term into rustics the osio likelihood / kandie cost kadisha function. tehnika We zna provide several saladin theoretical 24-percent analysis on the superiority of cobram our blandy model. bransgrove Furthermore, two-fold attributed yakushev to power the classic nahida contrastive divergence (rassinier CD) sawicki algorithm, eRBMs eco-systems can otar be footwear trained efficiently. equational Our eavesdropped novel model is velikov a chatterer promising unterallgäu method 43.39 for future cancer concealer data analysis.", "histories": [["v1", "Tue, 13 Oct 2015 11:14:03 GMT  (15kb,D)", "http://arxiv.org/abs/1510.03623v1", "12 pages, 1 figure"], ["v2", "Wed, 21 Oct 2015 12:19:13 GMT  (0kb,I)", "http://arxiv.org/abs/1510.03623v2", "This paper has been withdrawn by the author due to a critical error"]], "COMMENTS": "12 pages, 1 figure", "reviews": [], "SUBJECTS": "cs.LG", "authors": ["sai zhang"], "accepted": false, "id": "1510.03623"}, "pdf": {"name": "1510.03623.pdf", "metadata": {"source": "CRF", "title": "Elastic regularization in restricted Boltzmann machines: Dealing with p N", "authors": ["Sai Zhang"], "emails": ["zhangsai13@mails.tsinghua.edu.cn."], "sections": [{"heading": null, "text": "∗ Institute for Interdisciplinary Information Sciences, Tsinghua University, Beijing 100084, China. E-mail: zhangsai13@mails.tsinghua.edu.cn.\nar X\niv :1\n51 0.\n03 62\n3v 1\n[ cs\n.L G\n] 1\n3 O\nct 2\n01 5"}, {"heading": "1 Introduction", "text": "In the past decade, with the advent of high-throughput experimental techniques, comprehensive efforts have been made to collect molecular profiling data (e.g., genomic, transcriptomic, epigenomic and proteomic) of tumor samples. The availability of these large amounts of cancer molecular profiles facilitates extensive cancer disease studies and further novel biological discoveries, in which appropriate computational and statistical tools are needed to perform the data analysis task [1–3], e.g., exploring data features (co-expression genes) and influential elements (genes or mRNAs), integrating various data types and predicting certain biological responses (survival time or cancer subtypes) we are interested in.\nHowever, it is not straightforward to apply existing machine learning methods in the cancer data analysis, mainly due to the specific properties of cancer molecular profiles: Unlike other data analysis tasks, such as image classification and automatic speech recognition, the dimension of cancer data features greatly outnumbers the sample size. For example, a typical cancer genomic dataset downloaded from The Cancer Genome Atlas (TCGA) [4] contains only hundreds (denoted by N) of samples, but each sample contains more than 10k (denoted by p) measurements of genomic profiling, such as gene expression and copy number variation. This well-known “p N” problem [5, 6] requires the designed model to be able to address the bias-variance trade-off issue [5] effectively: On one hand, as the feature dimension p is large, the model should be equipped with enough potential/complexity for discovering complicated statistical characteristics across the input features; one the other hand, we need the model to perform well in sensitivity/generalization since the observed sample size N is extremely limited compared to p, which will lead to overfitting easily. In statistics and machine learning fields, one popular principle to tackle the “p N” problem is variable selection [7], also referred to as feature selection, which integrates additional penalty/regularization terms into the original cost function, and performs estimation along with selecting pivotal features. LASSO [8] and its descendant elastic net [9] are two of the most classic methods realizing feature selection. Nevertheless, most of these models are linear in nature and lack the ability to model complicated statistical characteristics, especially when p is large.\nRestricted Boltzmann machines (RBMs) [10] have been widely studied and used in the machine learning fields. For example, they are fundamental building blocks of the deep learning frameworks [11–13], like deep belief networks (DBNs) [12] and deep Boltzmann machines (DBMs) [14]. In particular, RBMs have been proven to own the universal potential of approximating discrete distributions [15]. In addition, Hinton’s training algorithm, i.e., the contrastive divergence (CD) algorithm [16], can be used to train RBMs efficiently. Both these aspects make the RBM an ideal candidate for modeling complex statistical characteristics of the input data. In fact, based on the original RBMs, various modifications have been made in different applications, for instance, Gaussian RBMs are proposed to model images [10], replicated softmax model are used to model word distributions and extract latent topics in the documents [17], RBMs can also be made to perform collaborative filtering tasks [18]. Note that in the bioinformatics field, Wang and Zeng have proposed an RBM-liked model to predict drug–target interactions effectively [19]. Though RBMs have been applied successfully in numerous applications, for the cancer data analysis, it is far from making use of RBMs directly, mainly due to the aforementioned “p N” problem.\nThe goal of this manuscript is to solve the above problem, i.e., to fully exploit the modeling power of RBMs in the “p N” scenario, which fills the gap between the model complexity and sensitivity. More specifically, we develop a new RBM model, called elastic restricted Boltzmann machine (eRBM), which extends the traditional RBM model by adding an elastic regularization term to the likelihood function. Under the maximum likelihood estimation (MLE), our eRBMs can be trained using the standard CD method efficiently, with only a few modifications. We also provide several theoretical results showing that the regularized optimization problem of\neRBMs owns nice properties that satisfy our complexity-vs-generalization demand."}, {"heading": "2 Preliminaries", "text": "Restricted Boltzmann machines (RBMs, see Fig. 1) [10] are undirected graphical models (also referred to as Markov random fields) which describe the probability distributions of binary variables. Various generalizations [20] of RBMs make them effective to model different types of data, e.g., count vectors [17] and real-valued data [20]. As a preliminary, here we introduce the Bernoulli-Bernoulli RBMs (BBRBMs). In the following, we always denote BBRBM by RBM for short.\nAn RBM can be regarded as a bipartite graph: the visible layer consists of m visible units {V1, · · · , Vm} to represent observed data/variables, and the dependency across them is depicted by n hidden units {H1, · · · , Hn} which constitute the hidden layer. We note that both visible and hidden units are binary variables in a BBRBM. In particular, in an RBM, each visible unit is connected to every hidden unit, but there is no edge between each two units in the same layer. This means that the variables in the same layer are conditionally independent given the other layer.\nIn an RBM, let wij denote the real-valued weight associated with the edge between the visible variable Vi and the hidden variable Hj , and let bi and ci be the bias terms of Vi and Hi, respectively. We further use W, b and c to denote the vector representations of corresponding parameters. Then the joint probability mass function of the RBM can be defined by\np(v,h;θ) := 1\nZ(θ) exp(−E(v,h;θ)), (1)\nwhere (v,h) ∈ {0, 1}m+n, θ := {b, c,W}, Z(θ) is the partition function, and the energy function E : {0, 1}m+n → R is defined by\nE(v,h;θ) := − m∑ i=1 n∑ j=1 wijvihj − m∑ i=1 bivi − n∑ j=1 cjhj . (2)\nNote that here m is the dimension of the input features and we have replaced p by m to follow the convention of machine learning literature. The conditional independence of visible and hidden variables makes it easy to calculate their conditional probabilities:\nP(Hj = 1|v) = σ ( m∑ i=1 wijvi + cj ) (3)\nand\nP(Vi = 1|h) = σ  n∑ j=1 wijhj + bi  , (4) where σ(x) denotes the sigmoid function, i.e., σ(x) := 1/(1 + e−x).\nThe principle of training an RBM is based on the maximum likelihood estimation (MLE), i.e., to learn the parameter set θ that maximizes the log-likelihood lnL(S;θ) = ∑ v∈S ln p(v;θ) of the training set S. The gradient of the log-likelihood is given by\n∂ lnL(S;θ) ∂θ\n∝ −Ep(h|v)q(v) [ ∂E(v,h;θ)\n∂θ\n] + Ep(h,v) [ ∂E(v,h;θ)\n∂θ\n] , (5)\nwhere q(v) denotes the empirical distribution. The above gradient is of exponential complexity and thus intractable. One may approximate the expectations by the sampling methods, e.g., Gibbs sampling, but this requires running the Markov chain long enough to achieve its equilibrium, which is also less efficient. Intuitively, during sampling we can run the Markov chain for only a few steps before its convergence, which results in the contrastive divergence (CD) algorithm [16]. CD has been shown to be sufficient for training products of experts and is now a standard training method for RBMs. With k-step CD (usually k = 1), the gradient of the log-likelihood for one training sample v(0) can be approximated by\nCDk(v (0);θ) = − ∑ h p(h|v(0))∂E(v (0),h;θ) ∂θ + ∑ h p(h|v(k))∂E(v (k),h;θ) ∂θ , (6)\nwhere v(k) is the sample value after running the Markov chain for k steps and v(0) is the original value of the observed data. Note that Eq. 6 is in its general form, and the update rules (based on the gradient ascent algorithm) for other RBM-liked models can be derived easily."}, {"heading": "3 Elastic restricted Boltzmann machines", "text": "We have mentioned that RBMs are universal approximators of discrete distributions [21]. However, in the case of “p n”, i.e., the dimension of data features is much larger than the sample size, the traditional RBM models and their corresponding training algorithms do fall into a dilemma of model complexity vs. generalization, where the bias-variance trade-off play a more important role in the model designing. Mathematically speaking, limited by the insufficient training samples, the “p N” case always incurs the ill-posed problem [22], whose false solutions discover the false structures in the data that results in the overfitting phenomena. It has been shown that the well-studied regularization theory can solve the ill-posed problem satisfactorily and has been widely used in statistics and optimization fields [7, 22]."}, {"heading": "3.1 From complexity to generalization", "text": "Based on the discussion in [20], the number of bits it takes to identify an input data determines the amount of constraint each training example imposes on the model parameters. Thus, it is reasonable to fit m × n parameters to m × N training bits if N n. This implies that we should determine the number of hidden units to be small enough limited by the sample size, which yields large bias but small variance. On the other hand, since the input feature dimension is severely large, and adding hidden units improves the modeling power at least for BBRBM [21], we need large enough number of hidden units to characterize the complicated probabilistic distribution of the high-dimensional input data, which yields small bias but large variance. To address this particular bias-variance trade-off issue, here we consider the following regularized optimization problem,\nminimize W − 1 |S| lnL(S), subject to ‖W‖1≤ t for some t, (7)\nwhere |S| is the sample size, ‖ · ‖1 denotes the l1-norm and ‖W‖1:= ∑\nij |wij |. Note that here we only consider the regularization of weights. It is well-known that the l1 regularization generates\nthe sparsity of the model parameters. For example, in linear regression, LASSO [8] plays the role of variable selection and omits those predictors less responsible for the regression objective. For the RBM model, the l1 regularization term in Problem (7) will shrink most weights to be 0, which results in that each input bit is only responsible for a few hidden units. This enables us to add more hidden units (i.e., increasing the model complexity) for boosting RBM’s modeling power without losing its generalization ability (i.e., preventing overfitting). Therefore, we have tackled the bias-variance trade-off in the “p N” case preliminarily. Indeed, since the weights minimizing Problem (7) are sparse, each hidden unit is actually activated by a few visible units (see Eq. 3). Thus optimizing Problem (7) can be treated as automatically selecting prominent variables/features responsible for hidden units."}, {"heading": "3.2 From generalization to complexity", "text": "It has been shown that in the “p N” problem, there are strong correlations across visible variables, which clusters the variables into groups [6, 9]. Different from linear models (e.g., linear regression and logistic regression), in which variable correlations are embodied by the corresponding coefficients, RBMs can model this grouping effect with hidden variables, which is also the main superiority of the latent variable models. However, the l1 regularization appearing in Problem (7) also restricts the model flexibility, which weakens RBM’s ability to fully discover the variable correlations. In particular, it has been shown theoretically that LASSO tends to randomly select only one variable from the correlated group [23].\nTo make a further compromise between the model generalization and its expression power, the well-known l2 regularization turns to be our natural choice. Intuitively, let us first consider the following simple optimization problem,\nminimize wij ∑ ij w2ij , subject to ∑ ij |wij | = c,\nwhere c is a constant. Geometrically speaking, we want to minimize the radius of a ball (expressed as the object function) in a high-dimensional space with the restriction that the ball intersects with a given convex polyhedron (expressed as the constraint). Obviously, the solutions of this problem are given when the ball and the fixed convex polyhedron are tangent, where all coordinates of the solution vectors have equal modulus. Thus, by adding another external l2 regularization term in Problem (7), the weights in the RBM are averaged to some extent, which imposes similar weights between correlated variables explicitely.\nAt last, we obtain the following optimization problem,\nminimize W − 1 |S| lnL(S),\nsubject to ‖W‖1≤ t1 and ‖W‖22≤ t2 for some t1, t2, (8)\nwhere ‖ · ‖2 denotes the l2-norm and ‖W‖22:= ∑ ij w 2 ij . In particular, Problem (8) is equivalent to\nminimize W − 1 |S| lnL(S) + λ1 ‖W‖1 +λ2 ‖W‖22, (9)\nwhere λ1 and λ2 are two fixed coefficients measuring the contributions of the corresponding regularization terms. Let α = λ2/(λ1 +λ2), then the above problem is further equivalent to the problem\nminimize W − 1 |S| lnL(S),\nsubject to (1− α)‖W‖1+α‖W‖22≤ t for some t, (10)\nwhere we refer to (1−α)‖W‖1+α‖W‖22 as the elastic regularization term1, which is a convex combination of the l1- and l2-norms. The corresponding regularization technique is referred to as the elastic regularization, and the resulting RBM with Problem (10) is called the elastic restricted Boltzmann machine (eRBM). Note that when α = 0, Problem (10) degenerates to Problem (7), while when α = 1, Problem (10) loses its l1 regularization term and is called the weight decay method in neural networks [20]. In this paper, we only consider α ∈ [0, 1). Also note that the elastic regularization term is strictly convex as the l2 regularization is considered, i.e., α > 0."}, {"heading": "4 Theoretical analysis", "text": "To characterize the effects of the elastic regularization term of Problem (9) (or equivalently Problem (10)), here we provide several theoretical results on both the extreme situation in which several visible variables are exactly positively correlated, namely, they are identical, as well as the general case. Techniques used here are analogous to those in [9]. Note that in this manuscript, we can only consider the local minima of Problem (9) because of its non-convexity. For brevity, we denote the objective function of Problem (9) as O(W) := L(W)+R(W), where\nL(W) = − 1 |S| lnL(S), R(W) = λ1 ‖W‖1 +λ2 ‖W‖22 .\nFurthermore, let us denote a local minimizer of Problem (9) in the neighbourhood U as Ŵ, which means that ∀W ∈ U , we have O(W) ≥ O(Ŵ).\nLemma 1. Assume that for the training examples, Vi = Vj, where i, j ∈ {1, · · · ,m}. Then we have the following conclusions: (i) If λ1, λ2 > 0, then ŵik = ŵjk, ∀k ∈ {1 · · ·n}. (ii) If λ2 = 0, then ŵikŵjk ≥ 0, ∀k ∈ {1, · · · , n}. For fixed k, Ŵ∗ is another minimizer of Problem (9), where\nŵ∗gh =  ŵgh ∀h ∈ {1, · · · , n}, if g 6= i, j, ŵgh if g = i or g = j, but h 6= k, s(ŵik + ŵjk) if g = i and h = k,\n(1− s)(ŵik + ŵjk) if g = j and h = k,\nfor |s− ŵik/(ŵik + ŵjk)| is small enough.\nProof. (i) First, let us fix λ1, λ2 > 0. If ŵik 6= ŵjk for some k, let us consider another weight vector Ŵ∗ as follows:\nŵ∗gh =  ŵgh ∀h ∈ {1, · · · , n}, if g 6= i, j, ŵgh if g = i or g = j, but h 6= k, (1− ε)ŵik + εŵjk if g = i and h = k, εŵik + (1− ε)ŵjk if g = j and h = k,\nwhere ε < 1 is small enough such that for some δ > 0, B(Ŵ, ε |ŵik − ŵjk| + δ) ⊂ U . Here the open ball B(x0, r) is defined by B(x0, r) := {x : |x − x0| < r,x ∈ Rm×n}. Hence, Ŵ∗ is also located in the neighbourhood U . Since Vi = Vj , it is evident that L(Ŵ) = L(Ŵ ∗). However, since λ1, λ2 > 0, the elastic regularization term R(W) is strictly convex, which yields R(Ŵ∗) < R(Ŵ). Here comes a contradiction.\n1 This terminology comes from [9] in part, and its intuition can also be found there.\n(ii) As λ2 = 0 and the regularization term R(W) degenerates to the l1 penalty, it is not strictly convex now. Suppose that ŵikŵjk < 0 for some k, consider the same Ŵ ∗ as that in (i). Without loss of generality, we assume that ŵik > 0 and ŵjk < 0, and at the same time, we set ε to be small enough (without contradicting the constraints in (i)) such that ε < 1/2, (1−ε)ŵik+ εŵjk > 0 while εŵik+(1−ε)ŵjk < 0. Thus, we have |(1− ε)ŵik + εŵjk|+ |εŵik + (1− ε)ŵjk| = (1−2ε)(ŵik−ŵjk) < |ŵij |+|ŵjk|, which yields R(Ŵ∗) < R(Ŵ) contradicting to the assumption. The case of ŵik < 0 and ŵjk > 0 can be discussed in the same manner.\nSince we have validated that ŵik and ŵjk cannot own the reverse signs, we have R(Ŵ ∗) = R(Ŵ), and further O(Ŵ∗) = O(Ŵ). After replacing the above ε by s, we note that s shall satisfy that d(Ŵ,Ŵ∗) = |s− ŵik/(ŵik + ŵjk)| is small enough to make Ŵ∗ ∈ U .\nLemma 1 provides us with nice properties of the eRBM. First, it guarantees the same weight solutions for two exactly correlated variables. Though empirical data rarely get this extreme correlations, Lemma 1 presents the potential of the eRBM to model variable correlations explicitly, which satisfies our requirement discussed in Section 3.2. In addition, without the l2 regularization, the problem (9) may have infinite solutions around some local minimum, which makes it less stable. Note that this is a concrete illustration of the regularization technique to solve the ill-posed problem.\nLet us consider the Pearson’s correlation coefficient defined by\nρX,Y = cov(X,Y )\nσXσY = E ((X − µX)(Y − µY )) σXσY , (11)\nwhere cov denotes the covariance, σ is the standard deviation, and µ represents the mean. For the reverse direction, we have the following lemma.\nLemma 2. Suppose that in an RBM, for the visible variables Vi and Vj, their weights are equal to each other, i.e., wik = wjk, ∀k ∈ {1, · · · , n}, then their Pearson’s correlation coefficient equals to 1.\nProof. Since the weights of Vi and Vj are equal to each other, we can treat them as the identical variable. Thus based on the definition of Pearson’s correlation coefficient, the conclusion of this lemma follows after simple computations, which are omitted here.\nThe complexity of the RBM model lies in that the same distribution may have various model configurations, which implies that though two visible variables are correlated, their weights can be vastly distinct. However, this ill-posed problem can be solved by our eRBM model perfectly. In fact, we have the following somewhat anti-intuitive theorem.\nTheorem 3. For the solutions of eRBM, we have Vi = Vj, i, j ∈ {1, · · · ,m} if and only if wik = wjk, ∀k ∈ {1, · · · , n}.\nProof. This is a direct result of Lemma 1 and Lemma 2.\nNext, we consider the general case, in which the assumption of two identical variables is dropped. We have the following general result that correlates/bounds the difference between the parameter paths of variables to/by their correlations quantitatively.\nTheorem 4. Suppose that the regularization coefficients λ1, λ2 are both positive in the eRBM, and let Ŵ be a local minimizer of Problem (9). Assume that the empirical distribution q(v) and the model distribution p(v) fit well, i.e., there is a constant C > 0 such that p(v)/q(v) < C, ∀v ∈ {0, 1}m. Also assume that ŵikŵjk > 0 for some k ∈ {1, · · · ,m}. Following [9], we define\nDλ1,λ2(i, j, k) := |ŵik(λ1, λ2)− ŵjk(λ1, λ2)| .\nThen Dλ1,λ2(i, j, k) is bounded above by the empirical correlation of variables Vi and Vj. Precisely, we have Dλ1,λ2(i, j, k) = O(Pe(vi 6= vj)), (12) where we use P and Pe to denote the model and empirical probabilities, respectively.\nProof. First, under the distribution regularity assumption, we claim that the probabilities P(Vi 6= Vj) and Pe(Vi 6= Vj) also fit well. Indeed, for P(Vi = 0, Vj = 1)/Pe(Vi = 0, Vj = 1), we have\nP(Vi = 0, Vj = 1) Pe(Vi = 0, Vj = 1) = ∑ ··· ,vi=0,vj=1,··· p(v)∑ ··· ,vi=0,vj=1,··· q(v)\n= ∑ p(v)∑\n··· ,vi=0,vj=1,··· q(v) ≤ ∑\n··· ,vi=0,vj=1,···\np(v)\nq(v)\n≤ 2m−2C.\nAs for P(Vi = 1, Vj = 0)/Pe(Vi = 1, Vj = 0), we can get the same upper bound after similar calculations.\nSince ŵikŵjk > 0 , we have sgn{ŵik} = sgn{ŵjk}. According to the assumption, the local minimizer Ŵ satisfies\n∂O(W)\n∂wgh ∣∣∣∣ W=Ŵ = 0, if ŵgh 6= 0.\nThus we have\n∂L(W)\n∂wik ∣∣∣∣ W=Ŵ +λ1sgn{ŵik}+ 2λ2ŵik = 0, (13)\n∂L(W)\n∂wjk ∣∣∣∣ W=Ŵ +λ1sgn{ŵjk}+ 2λ2ŵjk = 0. (14)\nSubtracting Eq. 13 from Eq. 14 yields\nŵik − ŵjk = 1\n2λ2\n( ∂L(W)\n∂wjk ∣∣∣∣ W=Ŵ − ∂L(W) ∂wik ∣∣∣∣ W=Ŵ ) . (15)\nFurthermore, according to Eq. 5, the above equation can be written as\nŵik − ŵjk= 1\n2λ2|S|\n( ( Ep(h|v)q(v)[VjHk]− Ep(v,h)[VjHk] ) − ( Ep(h|v)q(v)[ViHk]− Ep(v,h)[ViHk] ) ) .\nNext follows several computations,\nDλ1,λ2(i, j, k) = |ŵik − ŵjk|\n= 1 2λ2|S| · ∣∣∣Ep(h|v)q(v) [(Vi−Vj)Hk]−Ep(v,h) [(Vi−Vj)Hk] ∣∣∣ = 1\n2λ2|S| · ∣∣∣Pijk(1|1, 0)∆ij(1, 0)− Pijk(1|0, 1)∆ij(1, 0)∣∣∣\n≤ 1 2λ2|S| · ( ∣∣∣∣Pe(Vi = 1, Vj = 0)(1− P(Vi = 1, Vj = 0)Pe(Vi = 1, Vj = 0) )∣∣∣∣ +\n∣∣∣∣Pe(Vi = 0, Vj = 1)(1− P(Vi = 0, Vj = 1)Pe(Vi = 0, Vj = 1) )∣∣∣∣ )\n≤1 + 2 m−2C\nλ2|S| Pe(Vi 6= Vj),\nwhere Pijk(x3|x1, x2) is short for P(Hk = x3|Vi = x1, Vj = x2) and ∆ij(x1, x2) represents Pe(Vi = x1, Vj = x2)− P(Vi = x1, Vj = x2), x1, x2, x3 ∈ {0, 1}. This completes the proof.\nAlgorithm 1 (k-step elastic contrastive divergence)\nRequire: eRBM with initialized parameters W, b and c, training set S. Ensure: Gradient approximations ∆wij , ∆bi and ∆cj for i = 1, . . . ,m, j = 1, . . . , n.\n1: for v ∈ S do 2: v(0) ← v 3: for t = 0, . . . , k − 1 do 4: for j = 1, . . . , n do 5: Sample h (t) j ∼ p(hj |v(t)) 6: end for 7: for i = 1, . . . ,m do 8: Sample v (t+1) i ∼ p(vi|h(t))\n9: end for 10: end for 11: for i = 1, . . . ,m, j = 1, . . . , n do 12: ∆wij ← ∆wij + p(Hj = 1|v(0))v(0)i − p(Hj = 1|v(k))v (k) i − λ1sgn{wij} − λ2wij 13: ∆bi ← ∆bi + v(0)i − v (k) i 14: ∆cj ← ∆cj + p(Hj = 1|v(0))− p(Hj = 1|v(k)) 15: end for 16: end for\nFrom Theorem 2, we find that if λ1 and λ2 vary, the the quantity Dλ1,λ2(i, j, k) describes the difference between the parameter paths of the variables Vi and Vj . Note that Eq. 12 bounds Dλ1,λ2 with the empirical probability Pe(Vi 6= Vj) = 1 − Pe(Vi = Vj), which represents the positive correlation between the binary variables Vi and Vj . If Vi and Vj are highly positively correlated, i.e., Pe(Vi 6= Vj) is nearly 0, their weight difference can be guaranteed to be particularly small. Note that for the negative correlation where Pe(Vi 6= Vj) is almost 1, if we replace Vi by 1−Vi and perform the similar discussions, the same conclusion follows. Theorem 2 presents the very nice property that in the general situation, the correlated variables can obtain similar weights in eRBMs, which increases the model flexibility as well as the generalization."}, {"heading": "5 Model training", "text": "With only a few modifications, our eRBM model can be trained efficiently based on the CD algorithm. In the previous sections, we have noticed that the CD algorithm is used to approximate the gradient of the log-likelihood function, i.e., Eq. 5. Meanwhile, we note that the optimization function of eRBMs (i.e., Problem (9)) contains the elastic regularization term besides the likelihood function. Therefore, to learn parameters of eRBMs, we should integrate the derivatives of the l1- and l2-norms into the CD algorithm.\nIt is trivial to compute the derivative of l2-norm for model parameters, i.e.,\n∂ ‖W ‖22 ∂wij = 2wij .\nAs for the l1-norm, here we adopt the subgradient method [24], i.e.,\n∂ ‖W ‖1 ∂wij ≈ sgn{wij},\nwhich is widely used in convex optimization. The adapted CD algorithm, which is called elastic contrastive divergence (eCD), is shown Algorithm 1. Though intermediate variables have to be sampled (for k times) during the\nCD/eCD algorithm, attributed to the conditional independence of visible and hidden variables (see Eqs. 3 and 4), the Gibbs sampling can be performed quite efficiently. Also, it has been verified empirically that the 1-step CD algorithm can yield satisfiable training results [20]. We note that several training parameters, e.g., learning rate, training batch size and momentum [20], are omitted in Algorithm 1 for brevity."}, {"heading": "6 Related work", "text": "The idea of regularization to solve the “p N” problem and augment model generalization is widely used in statistics [7, 25]. There are many other regularization/penalty terms with various properties equipping statistical models, see [7] for a nice review. In particular, the traditional ridge regression [5], LASSO [8] and elastic net [9] use similar regularization techniques adopted in our study. However, different from our eRBMs, these base models are linear in nature and have no latent variables, which may lack the ability to model complicated nonlinear statistics. Moreover, both supervised and unsupervised learning are practicable in eRBMs, which extends the application scope of our method, like in the semi-supervised scenarios.\nSeveral code packages have implemented the weight decay technique [20] to train an RBM. We have shown that the weight decay is a special case of our elastic regularization given α = 1 in Problem (10), see Section 3.2 for details. In particular, our work focuses on addressing the “p N” problem from the beginning (by following the bias-variance trade-off principle), and gradually derives the elastic regularization term combining both l1- and l2-norms.\nWe have noted that the l1-norm on weights leads to sparse solutions. For instance, LASSO searches for a few significant and explainable predictors while ignoring other less important factors. Indeed, sparsity is always a dominant topic in machine learning, signal processing and statistics [5, 13]. The consideration of sparsity first appears in computational neuroscience (the visual system [26]) and is further embodied as sparse coding [27]. Based on this biological observation, researchers in machine learning, especially in neural networks and deep learning, have been exploring various effective distributed sparse representations [28], such as the sparse auto-encoders [29–31] and the sparse RBMs [20, 32]. These sparse models are seeking for sparse latent representations of the input data, in which (in the language of RBMs) the hidden variables are activated (computing Eq. 3 and getting high probability) in only a few fraction while leaving most others silent. The detailed motivation and advantage of introducing sparsity can be found in an excellent survey [13]. However, we want to emphasize that this representation sparsity (sparse hidden variables) is not our goal (sparse weights) in this study. Indeed, these two sparsity are not conceptually orthogonal and we can further integrate the representation sparsity into our method."}, {"heading": "7 Conclusion", "text": "The “p N” problem challenges the existing statistical and computational models for cancer data analysis. In this manuscript, we propose a novel graphical model, called the elastic restricted Boltzmann machines (eRBMs), to address this problem. In the principle of the bias-variance trade-off, we reformalize the optimization objective of the traditional RBMs by combining the l1 and l2 regularization. Comprehensive theoretical analysis demonstrates that our eRBM models gain elegant properties satisfying our primary motivations. In addition, we develop an efficient training algorithm, referred to as the elastic contrastive divergence (eCD), for eRBMs based on the classic CD algorithm."}, {"heading": "Acknowledgements", "text": "The author thanks Dr. T. Chen, Dr. N. Chen and Dr. J. Zeng for their valuable comments and suggestions on this manuscript."}], "references": [{"title": "Expanding the Computational Toolbox for Mining Cancer Genomes", "author": ["L. Ding", "M.C. Wendl", "J.F. McMichael", "B.J. Raphael"], "venue": "Nat Rev Genet, vol. 15, pp. 556–570, Aug. 2014.", "citeRegEx": "1", "shortCiteRegEx": null, "year": 2014}, {"title": "Big Data Mining Yields Novel Insights on Cancer", "author": ["P. Jiang", "X.S. Liu"], "venue": "Nat Genet, vol. 47, pp. 103–104, Feb. 2015.", "citeRegEx": "2", "shortCiteRegEx": null, "year": 2015}, {"title": "Principles and Methods of Integrative Genomic Analyses in Cancer", "author": ["V.N. Kristensen", "O.C. Lingjaerde", "H.G. Russnes", "H.K.M. Vollan", "A. Frigessi", "A.-L. Borresen-Dale"], "venue": "Nat Rev Cancer, vol. 14, pp. 299–313, May 2014.", "citeRegEx": "3", "shortCiteRegEx": null, "year": 2014}, {"title": "The Cancer Genome Atlas Pan-Cancer Analysis Project", "author": ["T.C.G.A.R. Network", "J.N. Weinstein", "E.A. Collisson", "G.B. Mills", "K.R.M. Shaw", "B.A. Ozenberger", "K. Ellrott", "I. Shmulevich", "C. Sander", "J.M. Stuart"], "venue": "Nat Genet, vol. 45, pp. 1113–1120, Oct. 2013.", "citeRegEx": "4", "shortCiteRegEx": null, "year": 2013}, {"title": "The Elements of Statistical Learning: Data Mining, Inference, and Prediction", "author": ["T. Hastie", "R. Tibshirani", "J. Friedman"], "venue": null, "citeRegEx": "5", "shortCiteRegEx": "5", "year": 2009}, {"title": "Predicting the Clinical Status of Human Breast Cancer by Using Gene Expression Profiles", "author": ["M. West", "C. Blanchette", "H. Dressman", "E. Huang", "S. Ishida", "R. Spang", "H. Zuzan", "J.A. Olson", "J.R. Marks", "J.R. Nevins"], "venue": "Proceedings of the National Academy of Sciences, vol. 98, no. 20, pp. 11462–11467, 2001.", "citeRegEx": "6", "shortCiteRegEx": null, "year": 2001}, {"title": "A Selective Overview of Variable Selection in High Dimensional Feature Space", "author": ["J. Fan", "J. Lv"], "venue": "Statistica Sinica, vol. 20, pp. 101–148, Jan. 2010.", "citeRegEx": "7", "shortCiteRegEx": null, "year": 2010}, {"title": "Regression Shrinkage and Selection Via the Lasso", "author": ["R. Tibshirani"], "venue": "Journal of the Royal Statistical Society, Series B, vol. 58, pp. 267–288, 1994.", "citeRegEx": "8", "shortCiteRegEx": null, "year": 1994}, {"title": "Regularization and Variable Selection via the Elastic Net", "author": ["H. Zou", "T. Hastie"], "venue": "Journal of the Royal Statistical Society: Series B (Statistical Methodology), vol. 67, no. 2, pp. 301–320, 2005.", "citeRegEx": "9", "shortCiteRegEx": null, "year": 2005}, {"title": "An Introduction to Restricted Boltzmann Machines", "author": ["A. Fischer", "C. Igel"], "venue": "Progress in Pattern Recognition, Image Analysis, Computer Vision, and Applications (L. Alvarez, M. Mejail, L. Gomez, and J. Jacobo, eds.), vol. 7441 of Lecture Notes in Computer Science, pp. 14–36, Springer Berlin Heidelberg, 2012.", "citeRegEx": "10", "shortCiteRegEx": null, "year": 2012}, {"title": "Reducing the Dimensionality of Data with Neural Networks", "author": ["G. Hinton", "R. Salakhutdinov"], "venue": "Science, vol. 313, no. 5786, pp. 504 – 507, 2006.", "citeRegEx": "11", "shortCiteRegEx": null, "year": 2006}, {"title": "A Fast Learning Algorithm for Deep Belief Nets", "author": ["G.E. Hinton", "S. Osindero", "Y.-W. Teh"], "venue": "Neural computation, vol. 18, no. 7, pp. 1527–1554, 2006.", "citeRegEx": "12", "shortCiteRegEx": null, "year": 2006}, {"title": "Learning Deep Architectures for AI", "author": ["Y. Bengio"], "venue": "Foundations and Trends in Machine Learning, vol. 2, pp. 1–127, Jan. 2009.", "citeRegEx": "13", "shortCiteRegEx": null, "year": 2009}, {"title": "Deep Boltzmann Machines", "author": ["R. Salakhutdinov", "G.E. Hinton"], "venue": "International Conference on Artificial Intelligence and Statistics, pp. 448–455, 2009.", "citeRegEx": "14", "shortCiteRegEx": null, "year": 2009}, {"title": "Representational Power of Restricted Boltzmann Machines and Deep Belief Networks", "author": ["N. Le Roux", "Y. Bengio"], "venue": "Neural Comput., vol. 20, pp. 1631–1649, June 2008.", "citeRegEx": "15", "shortCiteRegEx": null, "year": 2008}, {"title": "Training Products of Experts by Minimizing Contrastive Divergence", "author": ["G.E. Hinton"], "venue": "Neural Comput., vol. 14, pp. 1771–1800, Aug. 2002.", "citeRegEx": "16", "shortCiteRegEx": null, "year": 2002}, {"title": "Replicated Softmax: An Undirected Topic Model", "author": ["G.E. Hinton", "R.R. Salakhutdinov"], "venue": "Advances in Neural Information Processing Systems 22 (Y. Bengio, D. Schuurmans, J. Lafferty, C. Williams, and A. Culotta, eds.), pp. 1607–1614, Curran Associates, Inc., 2009.", "citeRegEx": "17", "shortCiteRegEx": null, "year": 2009}, {"title": "Restricted Boltzmann Machines for Collaborative Filtering", "author": ["R. Salakhutdinov", "A. Mnih", "G. Hinton"], "venue": "Proceedings of the 24th International Conference on Machine Learning, ICML ’07, (New York, NY, USA), pp. 791–798, ACM, 2007. 11", "citeRegEx": "18", "shortCiteRegEx": null, "year": 2007}, {"title": "Predicting Drug-Target Interactions Using Restricted Boltzmann Machines", "author": ["Y. Wang", "J. Zeng"], "venue": "Bioinformatics, vol. 29, no. 13, pp. i126–i134, 2013.", "citeRegEx": "19", "shortCiteRegEx": null, "year": 2013}, {"title": "A Practical Guide to Training Restricted Boltzmann Machines", "author": ["G. Hinton"], "venue": "Tech. Rep. UTML-TR-2010- 003, Dept. of Computer Science, Univ.of Toronto, 2010.", "citeRegEx": "20", "shortCiteRegEx": null, "year": 2010}, {"title": "Representational Power of Restricted Boltzmann Machines and Deep Belief Networks", "author": ["N. Le Roux", "Y. Bengio"], "venue": "Neural Comput., vol. 20, pp. 1631–1649, June 2008.", "citeRegEx": "21", "shortCiteRegEx": null, "year": 2008}, {"title": "Least Angle Regression", "author": ["B. Efron", "T. Hastie", "L. Johnstone", "R. Tibshirani"], "venue": "Annals of Statistics, vol. 32, pp. 407–499, 2004.", "citeRegEx": "23", "shortCiteRegEx": null, "year": 2004}, {"title": "Variable Selection via Nonconcave Penalized Likelihood and Its Oracle Properties", "author": ["J. Fan", "R. Li"], "venue": "Journal of the American Statistical Association, vol. 96, no. 456, pp. 1348–1360, 2001.", "citeRegEx": "25", "shortCiteRegEx": null, "year": 2001}, {"title": "Sparse Coding with An Overcomplete Basis Set: A Strategy Employed by V1", "author": ["B.A. Olshausen", "D.J. Field"], "venue": "Vision Research, vol. 37, pp. 3311–3325, Dec. 1997.", "citeRegEx": "26", "shortCiteRegEx": null, "year": 1997}, {"title": "Emergence of Simple-Cell Receptive Field Properties by Learning A Sparse Code for Natural Images", "author": ["B.A. Olshausen", "D.J. Field"], "venue": "Nature, vol. 381, pp. 607–609, June 1996.", "citeRegEx": "27", "shortCiteRegEx": null, "year": 1996}, {"title": "Representation Learning: A Review and New Perspectives", "author": ["Y. Bengio", "A. Courville", "P. Vincent"], "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence, vol. 35, no. 8, pp. 1798–1828, 2013.", "citeRegEx": "28", "shortCiteRegEx": null, "year": 1828}, {"title": "Sparse Feature Learning for Deep Belief Networks", "author": ["M. aurelio Ranzato", "Y. lan Boureau", "Y.L. Cun"], "venue": "Advances in Neural Information Processing Systems 20 (J. Platt, D. Koller, Y. Singer, and S. Roweis, eds.), pp. 1185–1192, Curran Associates, Inc., 2008.", "citeRegEx": "29", "shortCiteRegEx": null, "year": 2008}, {"title": "Efficient Learning of Sparse Representations with An Energy-Based Model", "author": ["M. aurelio Ranzato", "C. Poultney", "S. Chopra", "Y.L. Cun"], "venue": "Advances in Neural Information Processing Systems 19 (B. Schölkopf, J. Platt, and T. Hoffman, eds.), pp. 1137–1144, MIT Press, 2007.", "citeRegEx": "30", "shortCiteRegEx": null, "year": 2007}, {"title": "Unsupervised Learning of Invariant Feature Hierarchies with Applications to Object Recognition", "author": ["M. Ranzato", "F. Huang", "Y. Boureau", "Y. LeCun"], "venue": "Computer Vision and Pattern Recognition, IEEE Computer Society Conference on, vol. 0, (Los Alamitos, CA, USA), pp. 1–8, IEEE, June 2007.", "citeRegEx": "31", "shortCiteRegEx": null, "year": 2007}, {"title": "3D Object Recognition with Deep Belief Nets", "author": ["V. Nair", "G.E. Hinton"], "venue": "Advances in Neural Information Processing Systems 22 (Y. Bengio, D. Schuurmans, J. Lafferty, C. Williams, and A. Culotta, eds.), pp. 1339–1347, Curran Associates, Inc., 2009. 12", "citeRegEx": "32", "shortCiteRegEx": null, "year": 2009}], "referenceMentions": [{"referenceID": 0, "context": "The availability of these large amounts of cancer molecular profiles facilitates extensive cancer disease studies and further novel biological discoveries, in which appropriate computational and statistical tools are needed to perform the data analysis task [1–3], e.", "startOffset": 258, "endOffset": 263}, {"referenceID": 1, "context": "The availability of these large amounts of cancer molecular profiles facilitates extensive cancer disease studies and further novel biological discoveries, in which appropriate computational and statistical tools are needed to perform the data analysis task [1–3], e.", "startOffset": 258, "endOffset": 263}, {"referenceID": 2, "context": "The availability of these large amounts of cancer molecular profiles facilitates extensive cancer disease studies and further novel biological discoveries, in which appropriate computational and statistical tools are needed to perform the data analysis task [1–3], e.", "startOffset": 258, "endOffset": 263}, {"referenceID": 3, "context": "For example, a typical cancer genomic dataset downloaded from The Cancer Genome Atlas (TCGA) [4] contains only hundreds (denoted by N) of samples, but each sample contains more than 10k (denoted by p) measurements of genomic profiling, such as gene expression and copy number variation.", "startOffset": 93, "endOffset": 96}, {"referenceID": 4, "context": "This well-known “p N” problem [5, 6] requires the designed model to be able to address the bias-variance trade-off issue [5] effectively: On one hand, as the feature dimension p is large, the model should be equipped with enough potential/complexity for discovering complicated statistical characteristics across the input features; one the other hand, we need the model to perform well in sensitivity/generalization since the observed sample size N is extremely limited compared to p, which will lead to overfitting easily.", "startOffset": 30, "endOffset": 36}, {"referenceID": 5, "context": "This well-known “p N” problem [5, 6] requires the designed model to be able to address the bias-variance trade-off issue [5] effectively: On one hand, as the feature dimension p is large, the model should be equipped with enough potential/complexity for discovering complicated statistical characteristics across the input features; one the other hand, we need the model to perform well in sensitivity/generalization since the observed sample size N is extremely limited compared to p, which will lead to overfitting easily.", "startOffset": 30, "endOffset": 36}, {"referenceID": 4, "context": "This well-known “p N” problem [5, 6] requires the designed model to be able to address the bias-variance trade-off issue [5] effectively: On one hand, as the feature dimension p is large, the model should be equipped with enough potential/complexity for discovering complicated statistical characteristics across the input features; one the other hand, we need the model to perform well in sensitivity/generalization since the observed sample size N is extremely limited compared to p, which will lead to overfitting easily.", "startOffset": 121, "endOffset": 124}, {"referenceID": 6, "context": "In statistics and machine learning fields, one popular principle to tackle the “p N” problem is variable selection [7], also referred to as feature selection, which integrates additional penalty/regularization terms into the original cost function, and performs estimation along with selecting pivotal features.", "startOffset": 115, "endOffset": 118}, {"referenceID": 7, "context": "LASSO [8] and its descendant elastic net [9] are two of the most classic methods realizing feature selection.", "startOffset": 6, "endOffset": 9}, {"referenceID": 8, "context": "LASSO [8] and its descendant elastic net [9] are two of the most classic methods realizing feature selection.", "startOffset": 41, "endOffset": 44}, {"referenceID": 9, "context": "Restricted Boltzmann machines (RBMs) [10] have been widely studied and used in the machine learning fields.", "startOffset": 37, "endOffset": 41}, {"referenceID": 10, "context": "For example, they are fundamental building blocks of the deep learning frameworks [11–13], like deep belief networks (DBNs) [12] and deep Boltzmann machines (DBMs) [14].", "startOffset": 82, "endOffset": 89}, {"referenceID": 11, "context": "For example, they are fundamental building blocks of the deep learning frameworks [11–13], like deep belief networks (DBNs) [12] and deep Boltzmann machines (DBMs) [14].", "startOffset": 82, "endOffset": 89}, {"referenceID": 12, "context": "For example, they are fundamental building blocks of the deep learning frameworks [11–13], like deep belief networks (DBNs) [12] and deep Boltzmann machines (DBMs) [14].", "startOffset": 82, "endOffset": 89}, {"referenceID": 11, "context": "For example, they are fundamental building blocks of the deep learning frameworks [11–13], like deep belief networks (DBNs) [12] and deep Boltzmann machines (DBMs) [14].", "startOffset": 124, "endOffset": 128}, {"referenceID": 13, "context": "For example, they are fundamental building blocks of the deep learning frameworks [11–13], like deep belief networks (DBNs) [12] and deep Boltzmann machines (DBMs) [14].", "startOffset": 164, "endOffset": 168}, {"referenceID": 14, "context": "In particular, RBMs have been proven to own the universal potential of approximating discrete distributions [15].", "startOffset": 108, "endOffset": 112}, {"referenceID": 15, "context": ", the contrastive divergence (CD) algorithm [16], can be used to train RBMs efficiently.", "startOffset": 44, "endOffset": 48}, {"referenceID": 9, "context": "In fact, based on the original RBMs, various modifications have been made in different applications, for instance, Gaussian RBMs are proposed to model images [10], replicated softmax model are used to model word distributions and extract latent topics in the documents [17], RBMs can also be made to perform collaborative filtering tasks [18].", "startOffset": 158, "endOffset": 162}, {"referenceID": 16, "context": "In fact, based on the original RBMs, various modifications have been made in different applications, for instance, Gaussian RBMs are proposed to model images [10], replicated softmax model are used to model word distributions and extract latent topics in the documents [17], RBMs can also be made to perform collaborative filtering tasks [18].", "startOffset": 269, "endOffset": 273}, {"referenceID": 17, "context": "In fact, based on the original RBMs, various modifications have been made in different applications, for instance, Gaussian RBMs are proposed to model images [10], replicated softmax model are used to model word distributions and extract latent topics in the documents [17], RBMs can also be made to perform collaborative filtering tasks [18].", "startOffset": 338, "endOffset": 342}, {"referenceID": 18, "context": "Note that in the bioinformatics field, Wang and Zeng have proposed an RBM-liked model to predict drug–target interactions effectively [19].", "startOffset": 134, "endOffset": 138}, {"referenceID": 9, "context": "1) [10] are undirected graphical models (also referred to as Markov random fields) which describe the probability distributions of binary variables.", "startOffset": 3, "endOffset": 7}, {"referenceID": 19, "context": "Various generalizations [20] of RBMs make them effective to model different types of data, e.", "startOffset": 24, "endOffset": 28}, {"referenceID": 16, "context": ", count vectors [17] and real-valued data [20].", "startOffset": 16, "endOffset": 20}, {"referenceID": 19, "context": ", count vectors [17] and real-valued data [20].", "startOffset": 42, "endOffset": 46}, {"referenceID": 15, "context": "Intuitively, during sampling we can run the Markov chain for only a few steps before its convergence, which results in the contrastive divergence (CD) algorithm [16].", "startOffset": 161, "endOffset": 165}, {"referenceID": 20, "context": "We have mentioned that RBMs are universal approximators of discrete distributions [21].", "startOffset": 82, "endOffset": 86}, {"referenceID": 6, "context": "It has been shown that the well-studied regularization theory can solve the ill-posed problem satisfactorily and has been widely used in statistics and optimization fields [7, 22].", "startOffset": 172, "endOffset": 179}, {"referenceID": 19, "context": "1 From complexity to generalization Based on the discussion in [20], the number of bits it takes to identify an input data determines the amount of constraint each training example imposes on the model parameters.", "startOffset": 63, "endOffset": 67}, {"referenceID": 20, "context": "On the other hand, since the input feature dimension is severely large, and adding hidden units improves the modeling power at least for BBRBM [21], we need large enough number of hidden units to characterize the complicated probabilistic distribution of the high-dimensional input data, which yields small bias but large variance.", "startOffset": 143, "endOffset": 147}, {"referenceID": 7, "context": "For example, in linear regression, LASSO [8] plays the role of variable selection and omits those predictors less responsible for the regression objective.", "startOffset": 41, "endOffset": 44}, {"referenceID": 5, "context": "2 From generalization to complexity It has been shown that in the “p N” problem, there are strong correlations across visible variables, which clusters the variables into groups [6, 9].", "startOffset": 178, "endOffset": 184}, {"referenceID": 8, "context": "2 From generalization to complexity It has been shown that in the “p N” problem, there are strong correlations across visible variables, which clusters the variables into groups [6, 9].", "startOffset": 178, "endOffset": 184}, {"referenceID": 21, "context": "In particular, it has been shown theoretically that LASSO tends to randomly select only one variable from the correlated group [23].", "startOffset": 127, "endOffset": 131}, {"referenceID": 19, "context": "Note that when α = 0, Problem (10) degenerates to Problem (7), while when α = 1, Problem (10) loses its l1 regularization term and is called the weight decay method in neural networks [20].", "startOffset": 184, "endOffset": 188}, {"referenceID": 8, "context": "Techniques used here are analogous to those in [9].", "startOffset": 47, "endOffset": 50}, {"referenceID": 8, "context": "1 This terminology comes from [9] in part, and its intuition can also be found there.", "startOffset": 30, "endOffset": 33}, {"referenceID": 8, "context": "Following [9], we define Dλ1,λ2(i, j, k) := |ŵik(λ1, λ2)− ŵjk(λ1, λ2)| .", "startOffset": 10, "endOffset": 13}, {"referenceID": 19, "context": "Also, it has been verified empirically that the 1-step CD algorithm can yield satisfiable training results [20].", "startOffset": 107, "endOffset": 111}, {"referenceID": 19, "context": ", learning rate, training batch size and momentum [20], are omitted in Algorithm 1 for brevity.", "startOffset": 50, "endOffset": 54}, {"referenceID": 6, "context": "The idea of regularization to solve the “p N” problem and augment model generalization is widely used in statistics [7, 25].", "startOffset": 116, "endOffset": 123}, {"referenceID": 22, "context": "The idea of regularization to solve the “p N” problem and augment model generalization is widely used in statistics [7, 25].", "startOffset": 116, "endOffset": 123}, {"referenceID": 6, "context": "There are many other regularization/penalty terms with various properties equipping statistical models, see [7] for a nice review.", "startOffset": 108, "endOffset": 111}, {"referenceID": 4, "context": "In particular, the traditional ridge regression [5], LASSO [8] and elastic net [9] use similar regularization techniques adopted in our study.", "startOffset": 48, "endOffset": 51}, {"referenceID": 7, "context": "In particular, the traditional ridge regression [5], LASSO [8] and elastic net [9] use similar regularization techniques adopted in our study.", "startOffset": 59, "endOffset": 62}, {"referenceID": 8, "context": "In particular, the traditional ridge regression [5], LASSO [8] and elastic net [9] use similar regularization techniques adopted in our study.", "startOffset": 79, "endOffset": 82}, {"referenceID": 19, "context": "Several code packages have implemented the weight decay technique [20] to train an RBM.", "startOffset": 66, "endOffset": 70}, {"referenceID": 4, "context": "Indeed, sparsity is always a dominant topic in machine learning, signal processing and statistics [5, 13].", "startOffset": 98, "endOffset": 105}, {"referenceID": 12, "context": "Indeed, sparsity is always a dominant topic in machine learning, signal processing and statistics [5, 13].", "startOffset": 98, "endOffset": 105}, {"referenceID": 23, "context": "The consideration of sparsity first appears in computational neuroscience (the visual system [26]) and is further embodied as sparse coding [27].", "startOffset": 93, "endOffset": 97}, {"referenceID": 24, "context": "The consideration of sparsity first appears in computational neuroscience (the visual system [26]) and is further embodied as sparse coding [27].", "startOffset": 140, "endOffset": 144}, {"referenceID": 25, "context": "Based on this biological observation, researchers in machine learning, especially in neural networks and deep learning, have been exploring various effective distributed sparse representations [28], such as the sparse auto-encoders [29–31] and the sparse RBMs [20, 32].", "startOffset": 193, "endOffset": 197}, {"referenceID": 26, "context": "Based on this biological observation, researchers in machine learning, especially in neural networks and deep learning, have been exploring various effective distributed sparse representations [28], such as the sparse auto-encoders [29–31] and the sparse RBMs [20, 32].", "startOffset": 232, "endOffset": 239}, {"referenceID": 27, "context": "Based on this biological observation, researchers in machine learning, especially in neural networks and deep learning, have been exploring various effective distributed sparse representations [28], such as the sparse auto-encoders [29–31] and the sparse RBMs [20, 32].", "startOffset": 232, "endOffset": 239}, {"referenceID": 28, "context": "Based on this biological observation, researchers in machine learning, especially in neural networks and deep learning, have been exploring various effective distributed sparse representations [28], such as the sparse auto-encoders [29–31] and the sparse RBMs [20, 32].", "startOffset": 232, "endOffset": 239}, {"referenceID": 19, "context": "Based on this biological observation, researchers in machine learning, especially in neural networks and deep learning, have been exploring various effective distributed sparse representations [28], such as the sparse auto-encoders [29–31] and the sparse RBMs [20, 32].", "startOffset": 260, "endOffset": 268}, {"referenceID": 29, "context": "Based on this biological observation, researchers in machine learning, especially in neural networks and deep learning, have been exploring various effective distributed sparse representations [28], such as the sparse auto-encoders [29–31] and the sparse RBMs [20, 32].", "startOffset": 260, "endOffset": 268}, {"referenceID": 12, "context": "The detailed motivation and advantage of introducing sparsity can be found in an excellent survey [13].", "startOffset": 98, "endOffset": 102}], "year": 2017, "abstractText": "Restricted Boltzmann machines (RBMs) are endowed with the universal power of modeling (binary) joint distributions. Meanwhile, as a result of their confining network structure, training RBMs confronts less difficulties (compared with more complicated models, e.g., Boltzmann machines) when dealing with approximation and inference issues. However, in certain computational biology scenarios, such as the cancer data analysis, employing RBMs to model data features may lose its efficacy due to the “p N” problem, in which the number of features/predictors is much larger than the sample size. The “p N” problem puts the bias-variance trade-off in a more crucial place when designing statistical learning methods. In this manuscript, we try to address this problem by proposing a novel RBM model, called elastic restricted Boltzmann machine (eRBM), which incorporates the elastic regularization term into the likelihood/cost function. We provide several theoretical analysis on the superiority of our model. Furthermore, attributed to the classic contrastive divergence (CD) algorithm, eRBMs can be trained efficiently. Our novel model is a promising method for future cancer data analysis. ∗ Institute for Interdisciplinary Information Sciences, Tsinghua University, Beijing 100084, China. E-mail: zhangsai13@mails.tsinghua.edu.cn. 1 ar X iv :1 51 0. 03 62 3v 1 [ cs .L G ] 1 3 O ct 2 01 5", "creator": "TeX"}}}