{"id": "1607.01274", "review": {"conference": "AAAI", "VERSION": "v1", "DATE_OF_SUBMISSION": "4-Jul-2016", "title": "Temporal Topic Analysis with Endogenous and Exogenous Processes", "abstract": "sidransky We consider the problem of mandalika modeling limpar temporal textual codirector data 3450 taking australia/new endogenous ferley and exogenous processes into 8,480 account. Such text paxil documents hartlepool arise in faulhaber real world sstl applications, hells including job belew advertisements and hdw economic direct-entry news yellow-crowned articles, prioritising which miz are 18-25 influenced houck by discala the 39-06 fluctuations of luso the general tuttle economy. We propose a hierarchical epigraphs Bayesian teruya topic riqueza model which imposes sundarban a \" group - abounds correlated \" hierarchical lgv structure on the evolution of to-2 topics downbeats over investigates time grego incorporating heartiest both processes, netweaver and show that this model ikkō-ikki can saytiev be estimated from olympiodorus Markov feni chain Monte Carlo 40,250 sampling methods. adilabad We further magical demonstrate zlatko that abubakari this north-eastwards model pavlović captures the intrinsic relationships between the topic distribution hocker and well-preserved the time - dependent lalu factors, dourado and 1.30 compare pulumur its weight-saving performance terrarum with kirchen latent chile Dirichlet nicoll allocation (upgrades LDA) and two i.r.a. other related models. chekhov The indo-aryans model gp9 is applied hunch to qilada two karytaina collections 21/22 of eadulf documents galdós to illustrate its zeev empirical chloroquine performance: online reichling job advertisements from eastville DirectEmployers Association and cetatea journalists ' taradale postings pavkovic on certificated BusinessInsider. com.", "histories": [["v1", "Mon, 4 Jul 2016 01:16:55 GMT  (347kb,D)", "http://arxiv.org/abs/1607.01274v1", null]], "reviews": [], "SUBJECTS": "cs.CL cs.IR cs.LG", "authors": ["baiyang wang", "diego klabjan"], "accepted": true, "id": "1607.01274"}, "pdf": {"name": "1607.01274.pdf", "metadata": {"source": "META", "title": "Temporal Topic Analysis with Endogenous and Exogenous Processes", "authors": ["Baiyang Wang", "Diego Klabjan"], "emails": ["baiyang@u.northwestern.edu", "d-klabjan@northwestern.edu"], "sections": [{"heading": "1 Introduction", "text": "Many organizations nowadays provide portals for job posting and job search, such as glassdoor.com from Glassdoor, indeed.com from Recruit, and my.jobs from DirectEmployers Association. Our work is inspired by data collected from the portal my.jobs, a website where job seekers can apply to the posted job openings through a provided link. The data collected from the website includes user clickstreams (users create accounts on the site) and attributes of job advertisements, such as their description, location, company name, and posted date.\nIn this paper, we investigate the relationship between economic fluctuations and the related changes in job advertisements, which can reveal the economic conditions of different time periods. More generally, this question is about the influence of any exogenous process on textual data with temporal dimensions. We adopt the perspective that the documents are organized into a certain number of topics, and study the impact of the exogenous process on the topic distribution, i.e. the relative topic proportions. Given a corpus of text\nCopyright c© 2016, Association for the Advancement of Artificial Intelligence (www.aaai.org). All rights reserved.\ndocuments with time stamps and a related exogenous process, the problem is to find a relationship between the topics discussed and the exogenous process. This setting is natural in an economic context; for instance, changes in macroeconomic indicators have an impact on government reports and Wall Street Journal news articles. Meanwhile, we also notice that for most temporal documents, the topic proportions change over time, which indicates an endogenous process of topic evolution.\nWith the goal of establishing topic dependency on the endogenous and exogenous processes, LDA-type topic models are especially suitable. The latent Dirichlet allocation (LDA) (Blei, Ng, and Jordan 2003) is the original model. Since then, a large number of variants have been proposed, many of which can be found in Blei (2011).\nMeanwhile, there has been relatively limited discussion on modeling time-dependent documents when there are relevant simultaneous exogenous processes. Many timedependent topic models without the exogenous component have been proposed, such as the Topics over Time (ToT) model (Wang and McCallum 2006) and the dynamic topic model (DTM) (Blei and Lafferty 2006), to name a few. However, to the best of our knowledge, none of these papers incorporate the effect of exogenous processes. On the other hand, the structural topic model (STM) (Roberts, Stewart, and Airoldi 2015) considers the effect of metadata, i.e. the attributes specified for each document, on the topic distribution. While STM can be applied for mining time-dependent textual data with exogenous covariates, it does not explicitly consider the time factor or the endogenous topic evolution processes of time-stamped documents.\nOur approach to this problem is to incorporate both endogenous and exogenous processes into a topic model. For the endogenous part of our paper, we impose a Markovian structure on the topic distribution over time, similar to Blei and Lafferty (2006) and Dubey et al. (2014). For the exogenous process, we incorporate it into the topic distribution in each period, adjusting the endogenous topic evolution process. In this way, our model is essentially a stick-breaking truncation of a ”group-correlated” hierarchical Dirichlet process. Our model has the following contributions: (i) it addresses the question of measuring the influence of exogenous processes on the topics in related documents, (ii) it incorporates both endogenous and exogenous aspects,\nar X\niv :1\n60 7.\n01 27\n4v 1\n[ cs\n.C L\n] 4\nJ ul\n2 01\n6\nand (iii) it demonstrates that text mining can also have useful implications in the realm of economics, which, from the authors’ perspective, is a relatively new finding.\nSection 2 offers a brief review on the topic modeling techniques related to our model. Section 3 develops our hierarchical Bayesian model and describes how to make posterior inferences with a variant of the Markov chain Monte Carlo (MCMC) technique. Section 4 studies the online job advertisements from DirectEmployers Association and journalists’ postings in finance on BusinessInsider.com with our proposed method, providing a comparison of performance with the standard LDA and STM. Section 5 suggests possible directions for the future and concludes the paper."}, {"heading": "2 Review of Time-Dependent Topic Modeling", "text": "We first introduce the standard model of LDA (Blei, Ng, and Jordan 2003). Suppose that there is a collection of documents di, i = 1, . . . , N and words {xi,j}Jij=1 within each document di indexed by a common dictionary containing V words, where N is the number of documents, and Ji is the number of words in di. The LDA model is as follows,{\nθi iid∼ Dir(α), φk iid∼ Dir(β), zi,j |θi iid∼ Cat(θi), xi,j |zi,j ∼ Cat(φzi,j ). (1)\nHere i = 1, . . . , N , j = 1, . . . , Ji, k = 1, . . . ,K; θi is the length-K per-document topic distribution for di, φk is the length-V per-topic word distribution for the k-th topic, zji is the topic for the j-th word in di, and K is the number of topics. Dir(·) denotes the Dirichlet distribution and Cat(·) denotes the categorical distribution, a special case of the multinomial distribution when nobs = 1.\nThe Dirichlet process is a class of randomized probability measures and can be applied for non-parametric modeling of mixture models. Denoting the concentration parameter by α and the mean probability measure by H , a realization G from the Dirichlet process can be written as G ∼ DP (γ,H). With the stick-breaking notation (Sethuraman 1994), we have\nG = ∞∑ k=1 bkδϕk , (2)\nwhere δϕk is a “delta” probability measure with all the probability mass placed at ϕk, ϕk iid∼ H , bk = b′k ∏k−1 i=1 (1 − b′i), b ′ k\niid∼ Beta(1, γ), k = 1, 2, · · · . We write b = (b1, b2, . . .) ∼ Stick(γ). More properties of the Dirichlet process can be found in Ferguson (1973).\nA hierarchical Dirichlet process (HDP) was proposed in the context of text modeling by Teh et al. (2005). The following hierarchical structure is assumed, G0|γ ∼ DP (γ,H), G1, . . . , GN |(α,G)\niid∼ DP (α,G), φi,j |Gi iid∼ Gi, xi,j ∼ Cat(φi,j). (3)\nHere i = 1, . . . , N , j = 1, . . . , Ji. The length-V random vectors G0, G1, . . . , GN are “random word distributions,” each of which is a draw from a Dirichlet process in (3). Moreover, each draw from a random word distribution is a length-V fixed vector φi,j ; it is the word distribution for xi,j . The posterior inference can be achieved by different strategies of Gibbs sampling.\nThere are mainly two approaches in the literature of measuring endogenous topic evolution processes. One approach is to impose a finite mixture structure on the topic distribution: a dynamic hierarchical Dirichlet process (dHDP) (Ren, Dunson, and Carin 2008) was proposed by adding a temporal dimension, and its variation was further applied on topic modeling with a stick-breaking truncation of Dirichlet processes (Pruteanu-Malinici et al. 2010). The other approach imposes a Markovian structure. For instance, the dynamic topic model (DTM) (Blei and Lafferty 2006) is as follows, φt,k|φt−1,k ∼ N(φt−1,k, σ2I), αt|αt−1 ∼ N(αt−1, δ2I), θt,i|αt iid∼ N(αt, a2I), zt,i,j |θt,i\niid∼ Cat(exp(θt,i)), xt,i,j |zt,i,j ∼ Cat(exp(φt,zt,i,j )).\n(4)\nHere t = 1, . . . , T , i = 1, . . . , Nt, j = 1, . . . , Jt,i, k = 1, . . . ,K (t ≥ 2 for the first two equations); T is the number of time periods, Nt is the number of documents in the t-th period, and Jt,i is the number of words in the i-th document in the t-th period; the rest are similarly defined as in LDA. One major difference between DTM and LDA is that the topic distributions θt,i and word distributions φt,k are in log-scale in DTM. A variational Kalman filtering was proposed for the posterior inference. As this Markovian approach is simpler for both interpretation and posterior inference, we apply a more generalized version of it to specify the endogenous process in our model.\nThe structural topic model (STM) (Roberts, Stewart, and Airoldi 2015) measures the effect of metadata of each document with the logistic normal distribution. Their model for each document di is as follows, θi|(Xiγ,Σ) ∼ LogisticNormal(Xiγ,Σ), p(φi,k) ∝ exp(m+ κk + κgi + κkgi), zi,j |θi iid∼ Cat(θi), xi,j |zi,j ∼ Cat(φi,zi,j ), (5)\nwhere i = 1, . . . , N , j = 1, . . . , Ji; Xi is the metadata matrix, γ is a coefficient vector, Σ is the covariance matrix,φi,k is the word distribution for di and the k-th topic,m is a baseline log-word distribution, κk, and κgi and κkgi are the topic, group, and interaction effects; the rest are defined similarly to LDA. This model explicitly considers exogenous factors, and can be applied to find the relationship between topic distributions and exogenous processes. Below we adopt a slightly more general approach, incorporating both endogenous and exogenous factors."}, {"heading": "3 Model and Algorithm", "text": ""}, {"heading": "3.1 Motivation: A Group-Correlated Hierarchical Dirichlet Process", "text": "We formulate our problem as follows: we are given time periods t = 1, . . . , T , documents from each period dt,i, i = 1, . . . , Nt, t = 1, . . . , T , and the indices of words {xt,i,j} Jt,i j=1 within each document dt,i from the first word to the last. The words are indexed by a dictionary containing V words in total. We begin with a hierarchical Dirichlet process in time 1: let G1|γ ∼ DP (γ,H), G1i|(α1, G1) ∼ DP (α1, G1), where G1 is a baseline random word distribution for time 1, and G1i is the random word distribution for document d1i. For G2, . . . GT , we have the following Markovian structure,\np(Gt)|Gt−1 ∝ exp[−d(Gt, Gt−1)], t = 2, . . . , T. (6)\nHere d(·, ·) is some distance between two probability measures. This completes our endogenous process. To take an exogenous process {yt}Tt=1 into account, we assume the following\nG̃t =M(Gt,yt), t = 1, . . . , T, (7)\nwhereM maps the endogenous baseline random word distribution Gt to the realized baseline random word distribution G̃t for time t, considering the influence of {yt}Tt=1. Therefore, we further assume that each per-document random word distribution Gt,i is sampled with mean G̃t rather than Gt. The final model is as follows, G1|γ ∼ DP (γ,H), p(Gt)|Gt−1 ∝ exp[−d(Gt, Gt−1)], G̃t =M(Gt,yt), Gt,i|(αt, G̃t)\niid∼ DP (αt, G̃t), φt,i,j |Gt,i iid∼ Gt,i, xt,i,j ∼ Cat(φt,i,j).\n(8)\nHere t = 1, . . . , T , i = 1, . . . , Nt, j = 1, . . . , Jt,i (t ≥ 2 for the first line). Throughout this paper, our model is fully conditional on {yt}Tt=1, i.e. we assume {yt}Tt=1 to be fixed; this has an intuitive explanation, as our temporal documents represent a very small portion of the underlying environment, i.e. the exogenous process, so their influence on {yt}Tt=1 is almost negligible."}, {"heading": "3.2 A Group-Correlated Temporal Topic Model: Stick-Breaking Truncation", "text": "Below we consider a stick-breaking truncation of the model above, since posterior inference of the exact model can be intricate. With the stick-breaking expression of G1 in (8), we have  φ1,φ2, . . . , iid∼ H,\nπ1 = (π11, π12, . . .) ∼ Stick(γ), G1 = ∑∞ k=1 π1kδφk .\n(9)\nHere we set d(·, ·) = +∞ if the two probability measures have different supports; this necessitates that all periods share the same topics. Our intent is that the topics should remain the same to investigate their relationships with endogenous and exogenous processes; otherwise, changes in topics can blur the relationships and possibly result in overfitting. We apply the total variation distance d(p, q) = λ · ∫ |p− q|dµ with λ > 0, although many others can also be applied and lead to, for instance, a log-normal model in DTM, or a normal model (Dubey et al. 2014; Zhang, Kim, and Xing 2015). We have the following, Gt = ∑∞ k=1 πtkδφk , πtk = πt−1 k + Lap(λ),\nπt = (πt1, πt2, . . .).\n(10)\nHere t = 2, . . . , T , k = 1, 2, . . ., and Lap(λ) denotes a Laplacian distribution with scale parameter λ. For the exogenous part, we consider specifying the relationship between πt and π̃t = (π̃t1, π̃t2, . . .) such that G̃t =∑∞ k=1 π̃tkδφk , Gt,i = ∑∞ k=1 θt,i,kδφk . We let π̃t = πt + η · yt, t = 1, . . . , T, 1′ · η = 0. (11) Here η is a K × p matrix which indicates the relationship between the topic distribution π̃t and the length-p vector yt. However, we notice that π̃t and πt are of infinite length, which creates difficulty in our inference. Therefore we adopt a stick-breaking truncation approach, i.e. we only consider {φk}Kk=1 in our model; the probability weights for {φk}∞k=K+1 in πt will be added into πtK . We note that a number of papers in topic modeling have put this approach into practice (Pruteanu-Malinici et al. 2010; Wang, Paisley, and Blei 2011).\nIt has been shown (Pruteanu-Malinici et al. 2010) that when the truncation levelK is large, we may as well replace the distribution of π1 with π1 ∼ Dir(γπ0), where γ = 1, π0 = (1/K, . . . , 1/K). We also let H = Dir(β, . . . , β) as in the paper by Teh et al. (2005). We summarize our model, φ1, . . . ,φK iid∼ Dir(β, . . . , β), π1 ∼ Dir(γπ0), πtk = πt−1 k + Lap(λ), π̃t = πt + η · yt, θt,i|(αt, π̃t)\niid∼ Dir(αtπ̃t), zt,i,j |θt,i iid∼ Cat(θt,i), xt,i,j ∼ Cat(φzt,i,j ).\n(12)\nHere t = 1, . . . , T , i = 1, . . . , Nt, j = 1, . . . , Jt,i (t ≥ 2 for the second line). The last two lines above are derived as in Teh et al. (2005). We note that here φk is the per-topic word distribution, θt,i is the per-document topic distribution, and zt,i,j is the actual topic for each word; they have the same meaning as in LDA.\nWe name our model a “group-correlated temporal topic model” (GCLDA). Here a “group” stands for all the documents within the same time period. We use the term ”correlated” because the baseline topic distributions {πt}Tt=1 for each period, controlling for {yt}Tt=1, are endogenously correlated; meanwhile, the realized baseline topic distributions {π̃t}Tt=1 for each period are also correlated with the given exogenous process {yt}Tt=1."}, {"heading": "3.3 Sampling the posterior: An MCMC Approach", "text": "Direct estimation of the Bayesian posterior is often intractable since the closed-form expression, if it exists, can be difficult to integrate and thus, many approaches to approximate the posterior have been proposed. Monte Carlo methods, which draw a large number of samples from the posterior as its approximation, are particularly helpful. In this paper, we adopt the Markov chain Monte Carlo (MCMC) approach which constructs samples from a Markov chain and is asymptotically exact. Below we provide the Metropoliswithin-Gibbs sampling approach tailored to our situation, which is a variant of the general MCMC approach. It only requires specifying the full conditionals of the unknown variables, which is covered below.\nWe consider sampling the following variables Z = {zt,i,j} Jt,i j=1 Nt i=1 T t=1, {αt}Tt=1, {π̃t}Tt=1, η, λ. We integrate out {θt,i}Nti=1 Tt=1 and {φk}Kk=1 to speed up calculation. Following Griffiths and Steyvers (2004), conditioning on all other variables listed for sampling,\np(zt,i,j = k|rest) ∝ (C(−1)t,i,k + αtπ̃tk) C\n(−1) xt,i,k,k + β C (−1) k + V β . (13)\nHere C(−1)t,i,k is the count of elements inZ\\{zt,i,j} which belong to dt,i and has values equal to k; C (−1) xt,i,k,k\nis the count of elements in Z\\{zt,i,j} whose values are k and corresponding words are xt,i,j ; C (−1) k is the count of elements in Z\\{zt,i,j} whose values are k. Also following Griffiths and Steyvers (2004), we have for αt and π̃t\np(αt, π̃t|rest) ∝ p(Z|αt, π̃t)p(π1,...,T |γ,π0)p(αt) ∝ [\nΓ(αt)∏ k Γ(αtπ̃tk) ]Nt Nt∏ i=1 ∏ k Γ(Ct,i,k + αtπ̃tk) Γ(Jt,i + αt)\n× exp [−λ (1t<T · ‖πt+1 − πt‖1 + 1t>1 · ‖πt − πt−1‖1)] × p(π1|γπ0)p(αt). (14)\nHere the difference between Ct,i,k and C (−1) t,i,k is to replace Z\\{zt,i,j} with Z. We also view πt, πtk, etc. as functions of the other parameters; specifically, πtk = π̃tk − ηkyt, where ηk is the k-th row of η. This involves a transformation of variables; however, the related Jacobian determinant det(J) = 1, so (14) is still valid. For parameter η, we have\np(η|rest) ∝ T∏ t=2 p(πt|πt−1, λ) · p(η)\n∝ exp ( −λ ·\nT∑ t=2 ‖πt − πt−1‖1\n) p(η). (15)\nFinally, for parameter λ, we have\np(λ|rest) ∝ T∏ t=2 p(πt|πt−1, λ) · p(λ)\n∝ λ(T−1)K exp ( −λ ·\nT∑ t=2 ‖πt − πt−1‖1\n) p(λ). (16)\nWe note that (13) and (16) are full conditionals, and we can easily derive the full conditionals of αt, πtk, and ηk from (14) and (15). Since each zt,i,j |rest has a categorical distribution, and λ|rest has a Gamma distribution with a conjugate prior, they can be updated with Gibbs updates. For αt, πtk, and ηk, we replace a Gibbs update with a Metropolis update. Specifically, suppose we know p(par|rest) up to a multiplicative constant, where par is any length-1 parameter. We also assume par = par(r) at the r-th iteration. Then at the (r + 1)-th iteration,\nparnew ∼ q(·|par(r)),\npar(r+1) = { parnew with prob. P, par(r) with prob. 1− P, (17)\nwhere P = min{p(parnew|rest)/p(par(r)|rest), 1}, and q(·|·) is a known conditional probability distribution such that q(x|y) = q(y|x).\nThis completes our sampling and posterior inference. For the theoretical convergence properties of Metropolis-withinGibbs samplers, the reader can refer to Robert and Casella (2004) and Roberts and Rosenthal (2006)."}, {"heading": "4 Case Studies", "text": "The proposed model, “GCLDA,” is demonstrated on two data sets: (1) online job advertisements from my.jobs from February to September in 2014, and (2) journalists’ postings in 2014 in the “Finance” section in BusinessInsider.com, an American business and technology news website. Our algorithm has been implemented in Java, and we compare GCLDA with LDA, ToT, and STM."}, {"heading": "4.1 Experiment Settings", "text": "We initialize the hyperparameters of LDA as follows: α = (50/K, . . . , 50/K), β = (0.01, . . . , 0.01), according to a rule of thumb which has been carried out in Berry and Kogan (2010) and Sridhar (2015). For ToT, we use the same α and β and linearly space the timestamps to make computation feasible. For GCLDA, we let γ = 1,π0 = (1/K, . . . , 1/K), αt iid∼ Γ(1, 1), p(η) ∝ e−0.01 ∑ |ηk|, λ ∼ Γ(1, 1), β = 0.01. We carry out the Metropolis-within-Gibbs algorithm as described in Section 3.3 for GCLDA, and run 5,000 iterations of the Markov chain with 1,000 burn-in samples for GCLDA, LDA, and ToT; for LDA, we apply the collapsed Gibbs sampling as in Griffiths and Steyvers (2004). The number of topics is set to K = 50 for both data sets. For STM, we apply the “Spectral” initialization (Roberts, Stewart, and Tingley 2015) together with other default settings in the R package stm. We perform data cleaning, remove the stopwords, stem the documents, and keep most frequent V words in each study. For the job advertisements, V = 2,000 and covers 96.2% of all words with repetition, which means that the choice of words in job advertisements is quite narrow; for the journalists’ postings, V = 3,000 and covers 93.9% of all words with repetition.\nWe use perplexity to compare the difference of the prediction power between LDA, ToT, and GCLDA. The perplexity for Ntest held-out documents given the training data D is defined as\nperp = exp { − ∑Ntest i=1 log p(dtest,i|D)∑Ntest\ni=1 ntest,i\n} (18)\nwhere dtest,i represents the i-th held-out document, and ntest,i is the number of words in dtest,i. We expect the perplexity to be small when a model performs well, since this means that under the estimated model, the probability of a word in the testing documents being written a priori is large. We apply the “Left-to-right” algorithm (Wallach et al. 2009) and apply point estimates for “Φ” and “αm” using the training data, as suggested in Section 3 in the same paper."}, {"heading": "4.2 My.jobs: Online Job Advertisements", "text": "The number of online job advertisements on my.jobs from February to September in 2014 amounts to 17,147,357 in total, and the number of advertisements each day varies greatly. Therefore, we gather a stratified sample of 44,660 advertisements with a roughly equal number of samples for each day, so that we have sampled 0.26% of all the documents in total. The training data set consists of 40,449 advertisements, and the testing data set consists of 4,211 advertisements (9.4% of the sample). For the exogenous variable {yt}Tt=1, we use the standardized Consumer Price Index from February to September in 2014, so that p = 1, and T = 8.\nFigure 1 implies that GCLDA better predicts the words in the new documents in terms of perplexity. This is due to the fact that the introduction of both endogenous and exogenous processes allows us to make more accurate inference on the topic distributions of the documents in a given period of time. The standard errors for the perplexity in each period are also shown; we can observe that the difference is quite significant.\nThe 20 most common topics are presented in Figure 2. The only axis, the x-axis, represents the degree of correlation ρ = η/π for all topics, i.e. the percent change in the topic proportion given one unit change in the exogenous covariate. Here π and η denote the related component of ∑ πt/T and η for each topic. Table 1 lists the highest probability words sorted by their probabilities from high to low inside the five topics with highest ρ in Figure 2.\nA number of facts can be inferred from Figure 2. The topics with positive ρ are those that have a positive correlation with the growth of the CPI in 2014. We can observe that two of them are supported by the U.S. government spending, namely “equal opportunity” and “health care,” the latter of which is probably related to the Affordable Care Act programs. This suggests that there is a causal relationship between the increase in government spending and the increase in the number of jobs in these categories, and the former was also an underlying factor in the growth of the CPI in 2014. We also observe that “software” and “secretarial” were moving in the same direction of CPI, while some traditional higher-paid job categories, such as engineering and marketing, were not. This partly agrees with some news articles in 2014 in that while the labor market was recovering, there was relatively lower growth in traditional higher-paid job categories (Lowrey 2014; Coy 2014).\nTherefore, we posit that GCLDA could be helpful in identifying topics in temporal documents which are closely related to an exogenous process. The changes in the topic proportions may be caused by the exogenous process, or its underlying factors, as is illustrated by this example, where more demand of goods increases the CPI and creates more jobs in certain categories. The other way around is also possible; changes in an exogenous process are caused by certain kinds of news, as is demonstrated in the next example. Such relationships require a more case-specific examination.\nWe also compare our method with STM. Below is the STM counterpart of Figure 2. We can observe that the topics and correlation scores from GCLDA seem to be more timerelated and tend to be more informative of the labor market during the period."}, {"heading": "4.3 BusinessInsider.com: Financial News Articles", "text": "We consider all contributions in the “Finance” section of BusinessInsider.com on all trading days in 2014. There are 15,659 articles in total, which are divided into a training data set containing 12,527 articles and a testing data set containing 3,132 articles (20% of all articles). We increase the proportion of testing documents and let T = 252 (all trading days) in order to create a more challenging scenario for GCLDA. We apply the daily price of the Chicago Board Options Exchange Market Volatility Index (VIX) as the exogenous process, measuring the volatility of the U.S. financial market. The other settings are the same as those in Section 4.2. We provide an analysis of the perplexity of LDA, GCLDA, and ToT in Figure 4. The lines are smoothed by LOESS with a span of 0.2, as there are large fluctuations in perplexity from day to day.\nAgain we observe that GCLDA generates a lower perplexity for the testing documents over time, therefore improving the fitting of the topic model. Also, the perplexities obtained from LDA and ToT are largely the same.\nFrom Figure 5 and Table 2 below, the topics that are strongly positively correlated with the VIX are generally short-term news, such as stock market news and announcements from central banks, as in the topics “FED” (the Federal Reserve), “revenue,” and “stock market,” which are indeed closely related to changes in the stock market. From our analysis, the drop in oil price and the instability in Russia and Ukraine were also major causes of fluctuations in the stock market in 2014. On the other hand, we observe that news about longer-term economic trends is not positively correlated with the VIX, such as “companies” and “labor market.” These are generally consistent with our understanding of the stock market.\nIn this example, we demonstrate an application of GCLDA for finding documents that are major contributors to changes in an exogenous process during a period of time. We can easily estimate the topic distribution for each document, and therefore, we can select the news articles that are mostly related to the stock market. Such a direction could possibly evoke future research. We also note that in this example, the causal relationship between the topic distribution and the stock market is bidirectional; news can change the stock market, and vice versa.\nWe also compare our method with STM, with Figure 6 being the STM counterpart of Figure 5. Again we observe that the topics and correlation scores from GCLDA seem to be more time-related and tend to be more informative of the stock market during the period. These findings assert our view that GCLDA improves the structure of the topic model and makes it more time-dependent."}, {"heading": "5 Conclusion", "text": "We have developed a temporal topic model which analyzes time-stamped text documents with known exogenous processes. Our new model, GCLDA, takes both endogenous and exogenous processes into account, and applies Markov chain Monte Carlo sampling for calibration. We have demonstrated that this model better fits temporal documents in terms of perplexity, and extracts well information from job advertisements and financial news articles. We suggest that a possible direction for the future could be analyzing the contents of temporal documents so that they could predict the trends of related exogenous processes."}, {"heading": "Acknowledgments", "text": "This research was conducted in collaboration with the Workforce Science Project of the Searle Center for Law, Regulation and Economic Growth at Northwestern University. We are indebted to Deborah Weiss, Director, Workforce Science Project, for introducing us to the subject of workforce and providing guidance. We are also very grateful for the help and data from DirectEmployers Association."}], "references": [{"title": "Text Mining: Applications and Theory", "author": ["M. Berry", "J. Kogan"], "venue": "Chichester, UK: Wiley.", "citeRegEx": "Berry and Kogan,? 2010", "shortCiteRegEx": "Berry and Kogan", "year": 2010}, {"title": "Dynamic topic models", "author": ["D. Blei", "J. Lafferty"], "venue": "23rd International Conference on Machine Learning.", "citeRegEx": "Blei and Lafferty,? 2006", "shortCiteRegEx": "Blei and Lafferty", "year": 2006}, {"title": "Latent dirichlet allocation", "author": ["D. Blei", "A. Ng", "M. Jordan"], "venue": "Journal of Machine Learning Research 3:993– 1022.", "citeRegEx": "Blei et al\\.,? 2003", "shortCiteRegEx": "Blei et al\\.", "year": 2003}, {"title": "America’s low-paying recovery: More jobs than ever, worse wages", "author": ["P. Coy"], "venue": "Bloomberg Business. www.bloomberg.com/bw/articles/2014-08-11/reportnew-jobs-in-u-dot-s-dot-offer-lower-wages-than-beforerecession.", "citeRegEx": "Coy,? 2014", "shortCiteRegEx": "Coy", "year": 2014}, {"title": "Dependent nonparametric trees for dynamic hierarchical clustering", "author": ["A. Dubey", "Q. Ho", "S. Williamson", "E. Xing"], "venue": "Advances in Neural Information Processing Systems 28. MIT Press.", "citeRegEx": "Dubey et al\\.,? 2014", "shortCiteRegEx": "Dubey et al\\.", "year": 2014}, {"title": "Bayesian analysis of some nonparametric problems", "author": ["T. Ferguson"], "venue": "Annals of Statistics 1:209–230.", "citeRegEx": "Ferguson,? 1973", "shortCiteRegEx": "Ferguson", "year": 1973}, {"title": "Finding scientific topics", "author": ["T. Griffiths", "M. Steyvers"], "venue": "Proceedings of the National Academy of Sciences 101:5228–5235.", "citeRegEx": "Griffiths and Steyvers,? 2004", "shortCiteRegEx": "Griffiths and Steyvers", "year": 2004}, {"title": "Recovery has created far more low-wage jobs than better-paid ones", "author": ["A. Lowrey"], "venue": "The New York Times. www.nytimes.com/2014/04/28/business/economy/recoveryhas-created-far-more-low-wage-jobs-than-better-paidones.html.", "citeRegEx": "Lowrey,? 2014", "shortCiteRegEx": "Lowrey", "year": 2014}, {"title": "Hierarchical bayesian modeling of topics in time-stamped documents", "author": ["I. Pruteanu-Malinici", "L. Ren", "J. Paisley", "E. Wang", "L. Carin"], "venue": "IEEE Trans. Pattern Analysis Machine Intelligence 32:996–1011.", "citeRegEx": "Pruteanu.Malinici et al\\.,? 2010", "shortCiteRegEx": "Pruteanu.Malinici et al\\.", "year": 2010}, {"title": "The dynamic hierarchical dirichlet process", "author": ["L. Ren", "D. Dunson", "L. Carin"], "venue": "25th International Conference on Machine Learning.", "citeRegEx": "Ren et al\\.,? 2008", "shortCiteRegEx": "Ren et al\\.", "year": 2008}, {"title": "Monte Carlo Statistical Methods", "author": ["C. Robert", "G. Casella"], "venue": "New York: Springer, 2nd ed. edition.", "citeRegEx": "Robert and Casella,? 2004", "shortCiteRegEx": "Robert and Casella", "year": 2004}, {"title": "Harris recurrence of metropolis-within-gibbs and trans-dimensional markov chains", "author": ["G. Roberts", "J. Rosenthal"], "venue": "The Annals of Applied Probability 16:2123–2139.", "citeRegEx": "Roberts and Rosenthal,? 2006", "shortCiteRegEx": "Roberts and Rosenthal", "year": 2006}, {"title": "A model of text for experimentation in the social sciences", "author": ["M. Roberts", "B. Stewart", "E. Airoldi"], "venue": "scholar.harvard.edu/files/bstewart/files/stm.pdf.", "citeRegEx": "Roberts et al\\.,? 2015", "shortCiteRegEx": "Roberts et al\\.", "year": 2015}, {"title": "Navigating the local modes of big data: The case of topic models", "author": ["M. Roberts", "B. Stewart", "D. Tingley"], "venue": "Data Analytics in Social Science, Government, and Industry. New York: Cambridge University Press. forthcoming.", "citeRegEx": "Roberts et al\\.,? 2015", "shortCiteRegEx": "Roberts et al\\.", "year": 2015}, {"title": "A constructive definition of dirichlet priors", "author": ["J. Sethuraman"], "venue": "Statistica Sinica 4:639–650.", "citeRegEx": "Sethuraman,? 1994", "shortCiteRegEx": "Sethuraman", "year": 1994}, {"title": "Unsupervised topic modeling for short texts using distributed representations of words", "author": ["V. Sridhar"], "venue": "Proceedings of NAACL-HLT 2015.", "citeRegEx": "Sridhar,? 2015", "shortCiteRegEx": "Sridhar", "year": 2015}, {"title": "Hierarchical dirichlet processes", "author": ["Y. Teh", "M. Jordan", "M. Beal", "D. Blei"], "venue": "Journal of the American Statistical Association 101:1566–1582.", "citeRegEx": "Teh et al\\.,? 2005", "shortCiteRegEx": "Teh et al\\.", "year": 2005}, {"title": "Evaluation methods for topic models", "author": ["H. Wallach", "I. Murray", "R. Salakhutdinov", "D. Mimno"], "venue": "26th International Conference on Machine Learning.", "citeRegEx": "Wallach et al\\.,? 2009", "shortCiteRegEx": "Wallach et al\\.", "year": 2009}, {"title": "Topics over time: A non-markov continuous-time model of topical trends", "author": ["X. Wang", "A. McCallum"], "venue": "12th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining.", "citeRegEx": "Wang and McCallum,? 2006", "shortCiteRegEx": "Wang and McCallum", "year": 2006}, {"title": "Online variational inference for the hierarchical dirichlet process", "author": ["C. Wang", "J. Paisley", "D. Blei"], "venue": "Artificial Intelligence and Statistics.", "citeRegEx": "Wang et al\\.,? 2011", "shortCiteRegEx": "Wang et al\\.", "year": 2011}, {"title": "Dynamic topic modeling for monitoring market competition from online text and image data", "author": ["H. Zhang", "G. Kim", "E. Xing"], "venue": "21st ACM SIGKDD Conference on knowledge Discovery and Data Mining.", "citeRegEx": "Zhang et al\\.,? 2015", "shortCiteRegEx": "Zhang et al\\.", "year": 2015}], "referenceMentions": [{"referenceID": 18, "context": "Many timedependent topic models without the exogenous component have been proposed, such as the Topics over Time (ToT) model (Wang and McCallum 2006) and the dynamic topic model (DTM) (Blei and Lafferty 2006), to name a few.", "startOffset": 125, "endOffset": 149}, {"referenceID": 1, "context": "Many timedependent topic models without the exogenous component have been proposed, such as the Topics over Time (ToT) model (Wang and McCallum 2006) and the dynamic topic model (DTM) (Blei and Lafferty 2006), to name a few.", "startOffset": 184, "endOffset": 208}, {"referenceID": 1, "context": "For the endogenous part of our paper, we impose a Markovian structure on the topic distribution over time, similar to Blei and Lafferty (2006) and Dubey et al.", "startOffset": 118, "endOffset": 143}, {"referenceID": 1, "context": "For the endogenous part of our paper, we impose a Markovian structure on the topic distribution over time, similar to Blei and Lafferty (2006) and Dubey et al. (2014). For the exogenous process, we incorporate it into the topic distribution in each period, adjusting the endogenous topic evolution process.", "startOffset": 118, "endOffset": 167}, {"referenceID": 14, "context": "With the stick-breaking notation (Sethuraman 1994), we have", "startOffset": 33, "endOffset": 50}, {"referenceID": 5, "context": "More properties of the Dirichlet process can be found in Ferguson (1973).", "startOffset": 57, "endOffset": 73}, {"referenceID": 16, "context": "A hierarchical Dirichlet process (HDP) was proposed in the context of text modeling by Teh et al. (2005). The following hierarchical structure is assumed,  G0|γ ∼ DP (γ,H), G1, .", "startOffset": 87, "endOffset": 105}, {"referenceID": 8, "context": "One approach is to impose a finite mixture structure on the topic distribution: a dynamic hierarchical Dirichlet process (dHDP) (Ren, Dunson, and Carin 2008) was proposed by adding a temporal dimension, and its variation was further applied on topic modeling with a stick-breaking truncation of Dirichlet processes (Pruteanu-Malinici et al. 2010).", "startOffset": 315, "endOffset": 346}, {"referenceID": 1, "context": "For instance, the dynamic topic model (DTM) (Blei and Lafferty 2006) is as follows,  φt,k|φt−1,k ∼ N(φt−1,k, σI), αt|αt−1 ∼ N(αt−1, δI), θt,i|αt iid ∼ N(αt, aI), zt,i,j |θt,i iid ∼ Cat(exp(θt,i)), xt,i,j |zt,i,j ∼ Cat(exp(φt,zt,i,j )).", "startOffset": 44, "endOffset": 68}, {"referenceID": 4, "context": "We apply the total variation distance d(p, q) = λ · ∫ |p− q|dμ with λ > 0, although many others can also be applied and lead to, for instance, a log-normal model in DTM, or a normal model (Dubey et al. 2014; Zhang, Kim, and Xing 2015).", "startOffset": 188, "endOffset": 234}, {"referenceID": 8, "context": "We note that a number of papers in topic modeling have put this approach into practice (Pruteanu-Malinici et al. 2010; Wang, Paisley, and Blei 2011).", "startOffset": 87, "endOffset": 148}, {"referenceID": 8, "context": "It has been shown (Pruteanu-Malinici et al. 2010) that when the truncation levelK is large, we may as well replace the distribution of π1 with π1 ∼ Dir(γπ0), where γ = 1, π0 = (1/K, .", "startOffset": 18, "endOffset": 49}, {"referenceID": 8, "context": "We note that a number of papers in topic modeling have put this approach into practice (Pruteanu-Malinici et al. 2010; Wang, Paisley, and Blei 2011). It has been shown (Pruteanu-Malinici et al. 2010) that when the truncation levelK is large, we may as well replace the distribution of π1 with π1 ∼ Dir(γπ0), where γ = 1, π0 = (1/K, . . . , 1/K). We also let H = Dir(β, . . . , β) as in the paper by Teh et al. (2005). We summarize our model,  φ1, .", "startOffset": 88, "endOffset": 417}, {"referenceID": 16, "context": "The last two lines above are derived as in Teh et al. (2005). We note that here φk is the per-topic word distribution, θt,i is the per-document topic distribution, and zt,i,j is the actual topic for each word; they have the same meaning as in LDA.", "startOffset": 43, "endOffset": 61}, {"referenceID": 6, "context": "Following Griffiths and Steyvers (2004), conditioning on all other variables listed for sampling,", "startOffset": 10, "endOffset": 40}, {"referenceID": 6, "context": "Also following Griffiths and Steyvers (2004), we have for αt and π̃t p(αt, π̃t|rest) ∝ p(Z|αt, π̃t)p(π1,.", "startOffset": 15, "endOffset": 45}, {"referenceID": 10, "context": "For the theoretical convergence properties of Metropolis-withinGibbs samplers, the reader can refer to Robert and Casella (2004) and Roberts and Rosenthal (2006).", "startOffset": 103, "endOffset": 129}, {"referenceID": 10, "context": "For the theoretical convergence properties of Metropolis-withinGibbs samplers, the reader can refer to Robert and Casella (2004) and Roberts and Rosenthal (2006).", "startOffset": 103, "endOffset": 162}, {"referenceID": 0, "context": "01), according to a rule of thumb which has been carried out in Berry and Kogan (2010) and Sridhar (2015).", "startOffset": 64, "endOffset": 87}, {"referenceID": 0, "context": "01), according to a rule of thumb which has been carried out in Berry and Kogan (2010) and Sridhar (2015). For ToT, we use the same α and β and linearly space the timestamps to make computation feasible.", "startOffset": 64, "endOffset": 106}, {"referenceID": 6, "context": "3 for GCLDA, and run 5,000 iterations of the Markov chain with 1,000 burn-in samples for GCLDA, LDA, and ToT; for LDA, we apply the collapsed Gibbs sampling as in Griffiths and Steyvers (2004). The number of topics is set to K = 50 for both data sets.", "startOffset": 163, "endOffset": 193}, {"referenceID": 17, "context": "We apply the “Left-to-right” algorithm (Wallach et al. 2009) and apply point estimates for “Φ” and “αm” using the training data, as suggested in Section 3 in the same paper.", "startOffset": 39, "endOffset": 60}, {"referenceID": 7, "context": "This partly agrees with some news articles in 2014 in that while the labor market was recovering, there was relatively lower growth in traditional higher-paid job categories (Lowrey 2014; Coy 2014).", "startOffset": 174, "endOffset": 197}, {"referenceID": 3, "context": "This partly agrees with some news articles in 2014 in that while the labor market was recovering, there was relatively lower growth in traditional higher-paid job categories (Lowrey 2014; Coy 2014).", "startOffset": 174, "endOffset": 197}], "year": 2016, "abstractText": "We consider the problem of modeling temporal textual data taking endogenous and exogenous processes into account. Such text documents arise in real world applications, including job advertisements and economic news articles, which are influenced by the fluctuations of the general economy. We propose a hierarchical Bayesian topic model which imposes a ”groupcorrelated” hierarchical structure on the evolution of topics over time incorporating both processes, and show that this model can be estimated from Markov chain Monte Carlo sampling methods. We further demonstrate that this model captures the intrinsic relationships between the topic distribution and the time-dependent factors, and compare its performance with latent Dirichlet allocation (LDA) and two other related models. The model is applied to two collections of documents to illustrate its empirical performance: online job advertisements from DirectEmployers Association and journalists’ postings on BusinessInsider.com.", "creator": "TeX"}}}