{"id": "1609.05374", "review": {"conference": "arxiv", "VERSION": "v1", "DATE_OF_SUBMISSION": "17-Sep-2016", "title": "Online Learning of Combinatorial Objects via Extended Formulation", "abstract": "lentivirus The merola convex hull of $ mahaweli n $ - novarro symbol single-edged Huffman pbhi trees is fara known sidelnikov to pellorneidae have exponentially akritas many facets / constraints. e-sahaba This orvil makes the feasa standard on - 59-39 line half-open learning techniques palilula for learning boys-only Huffman trees impractical, since northen they ozdemir use 97.30 multiplicative cranley updates followed surp by ahuntsic-cartierville projections to satisfy all of the taklung constraints. lovable However, there beru are imron general lampshades extended formulation techniques that acclimatization encode navalar the stanleys convex hull of anifah Huffman anti-capitalist trees tablemates as a chulack polytope in eulogised a higher self-professed dimensional itō space bibulus with aerofoil only ouzou polynomially p-39s many facets. ipsilateral This extended ātman formulation ironclads methodology pre-sales can also hafun be used to encode the $ n $ - mabee element permutahedron in $ laggardly O (rgl n \\ nonofficial log 13:57 n) $ dimensions with only macedonian a glengormley polynomial grindley number saadia of facets. We develop piggybacking a general roadway technique olivio for converting warthogs these tyre extended formulations into 2-for-2 efficient 19-meter on - 10-piece line drewnowski algorithms with good rabinal relative loss bounds. The hoopoe resulting algorithms have fetac nearly blackfield the theikdi same elaheh regret bloedel bounds grodzisk as usborne state of the 1994-2007 art algorithms tsiolkovsky for nadon permutations, mesic and meffert are the manipulative first gucheng efficient yoani algorithms poignance for the healthfully on - line intercooler learning of offsides Huffman trees.", "histories": [["v1", "Sat, 17 Sep 2016 18:38:46 GMT  (26kb)", "http://arxiv.org/abs/1609.05374v1", null], ["v2", "Tue, 21 Feb 2017 19:51:28 GMT  (218kb,D)", "http://arxiv.org/abs/1609.05374v2", null], ["v3", "Thu, 6 Apr 2017 16:28:45 GMT  (262kb,D)", "http://arxiv.org/abs/1609.05374v3", null], ["v4", "Thu, 8 Jun 2017 01:49:06 GMT  (218kb,D)", "http://arxiv.org/abs/1609.05374v4", null], ["v5", "Mon, 30 Oct 2017 20:33:11 GMT  (40kb)", "http://arxiv.org/abs/1609.05374v5", null]], "reviews": [], "SUBJECTS": "cs.LG", "authors": ["holakou rahmanian", "s v n vishwanathan", "david p helmbold"], "accepted": false, "id": "1609.05374"}, "pdf": {"name": "1609.05374.pdf", "metadata": {"source": "CRF", "title": "Extended Formulation for Online Learning of Combinatorial Objects", "authors": ["Holakou Rahmanian"], "emails": ["holakou@ucsc.edu", "vishy@ucsc.edu", "dph@ucsc.edu"], "sections": [{"heading": null, "text": "ar X\niv :1\n60 9.\n05 37\n4v 1\n[ cs\n.L G"}, {"heading": "1 Introductions", "text": "This paper introduces a general methodology for developing efficient and effective on-line learning algorithms over combinatorial structures. Examples include learning the best permutation of a set of elements for scheduling or assignment problems, or learning the best Huffman tree for compressing sequences of symbols. On-line learning algorithms are being successfully applied to an increasing variety of problems, so it is important to have good tools and techniques for creating good algorithms that match the particular problem at hand.\nThe on-line learning setting proceeds in a series of trials where the algorithm makes a prediction or takes an action associated with a combinatorial object in the space and then receives the loss of its choice in such a way that the loss of any of the possible combinatorial objects can be easily computed. The algorithm can then update its internal representation based on this feedback and the process moves on to the next trial. Unlike batch learning settings, there is no assumed distribution from which losses are randomly drawn, instead the losses are drawn adversarially. In general, an adversary can force arbitrarily large loss on the algorithm, so instead of measuring the algorithm’s performance by the total loss incurred, the algorithm is measured by its regret, the amount of loss the algorithm incurs above that of the single best predictor in some comparator class. Usually the comparator class is the class of predictors defined by the combinatorial space being learned. To\nmake the setting concrete, consider the case of learning Huffman trees. In each trial, the algorithm would predict a Huffman tree, and then obtain a sequence of symbols to be encoded. The loss of the algorithm on that trial can be the inner product of any [0, 1]n loss vector and the sequence of code lengths of the symbols. Using frequencies as the loss vector, the loss will be the average code length of the sequence. Over a series of trials, the regret of the algorithm is the difference in combined average code lengths between the on-line algorithm and the single best Huffman tree chosen in hindsight. Therefore the regret of the algorithm can be viewed as the cost of not knowing the best combinatorial object ahead of time. With proper tuning, the regret is typically logarithmic in the number of combinatorial objects.\nOne way to create algorithms for these combinatorial problems is to use one of the well-known socalled “experts algorithms” like weighted majority [15] or hedge [5] with each combinatorial object treated as an “expert”. However, this requires explicitly keeping track of one weight for each of the exponentially many combinatorial objects, and thus results in an inefficient algorithm. Furthermore, it also causes an additional loss range factor in regret bounds as well. There has been much work on creating efficient algorithms that implicitly encode the weights over the set of combinatorial objects using a concise representations. For example, many distributions over the 2n subsets of n elements can be encoded by the probability of including each of the n elements. In addition to subsets, such work includes permutations [9, 21], paths [14, 19], and k-sets [20]. The component hedge algorithm of Koolen, Warmuth, and Kivinen [13] is a powerful generic technique when the implicit encodings are suitably simple.\nThe component hedge algorithm works by performing multiplicative updates on the parameters of its implicit representation. However, the implicit representation is typically constrained to lie in a convex polytope. Therefore Bregman projections are used after the update to return the implicit representation to the desired polytope. The technique for proving good relative loss bounds is to, on each trial, relate the excess loss of the algorithm to its movement (from both update and projection) towards the implicit representation of an arbitrary comparator in the class. Note that this process is only efficient when there are simply a small (polynomial) number of constraints on the implicit representations.\nMathematicians have studied the problem of concisely specifying the convex hulls of complicated combinatorial structures like permutations and trees using few constraints. They have developed a powerful technique of representing these polytopes as a linear projection of a higher-dimensional polyhedron using extended formulations so that the polytope description has way less (polynomial instead of exponential) constraints. Unfortunately component hedge techniques do not apply to these extended formulations.\nOur main contribution is a general methodology for creating efficient and effective on-line learning algorithms over combinatorial structures that exploit these extended formulations. This methodology creates new on-line leaning algorithms over structures like permutations that already have efficient algorithms, as well as efficient algorithms over structures like Huffman Trees that are not suitable for component hedge techniques and did not have efficient on-line learning algorithms.\nOur methodology with extended formulations includes a novel way of producing predictions directly from the algorithm’s implicit representation. Previous techniques require that the algorithm perform a potentially expensive decomposition of its implicit representation into a convex combination of corners of its convex polytope, and then samples one of these corners to use as its prediction. In contrast, we can sample directly from the algorithm’s implicit representation without require a decomposition step.\nThe remainder of the paper is organized as follows. In Section 2, we discuss existing work in area of online learning generally, and over structured concepts specifically, as well as extended formulation techniques. Section 3 explains the extended formulation used in our setting by reviewing the work by Kaibel and Pashkovich [12]. We then propose our algorithm along its technical steps in Section 4. Finally, Section 5 concludes with contrasting our approach to existing ones and describing directions of future work."}, {"heading": "2 Related Work", "text": "On-line learning is a rich and vibrant area, see [3] for a textbook treatment. The implicit representations for structured concepts (sometimes called ‘indirect representations’) have been used for a variety of problems [7, 8, 16, 18, 19]. In the case of permutations [9, 21] and component hedge [13] the implicit representations seem to be better matched with the combinatorial structure than the explicit representation, allowing not only decreased running time but also the proof of better bounds. Our more general methodology with extended formulations also has this advantage, although perhaps to a lesser extent than the permutation-specific algorithms.\nAs in [21], the loss family provided in our approach is linear over the first order representation of the objects [4]. Concretely, for permutations of n items, we work with vectors v ∈ Rn in which each of the elements of {1, 2, . . . , n} appears exactly once. Also for Huffman trees of n symbols, we work with vectors v ∈ Rn in which vi indicates the depth of the node corresponding to symbol i in the coding tree. In contrast, [9] works with the second order representation, and consequently losses, which is a more general loss family (See [21] for comparison).\nThere have been several works aimed at efficiently describing the polytope of different combinatorial objects like permutations [6] and Huffman trees [17]. Discovered by the combinatorial optimization community, extended formulation, on which our results rely, is a general methodology to nicely describe combinatorial polyhedra [11, 12]."}, {"heading": "3 Extended Formulation", "text": "There are many combinatorial objects whose polytope cannot be described other than using exponentially many facets in its original space (e.g. see [17]). In order to have more efficient algorithms, there have been several efforts in the field of combinatorial optimization towards describing these polytopes in some other spaces. In recent years, the concept of representing these polytopes as a linear projection of a higher-dimensional polyhedron – which is known as extended formulation – has received significant attention. There are many combinatorial objects whose associated polyhedra can be described using small numbers of facets by projections of higher dimensional polyhedra comparing to the original space. See [11] for some of the tools for constructing such extended formulations. In the following subsections, we first overview the work by Kaibel and Pashkovich [12], and then extract the formulation fitting to our methodology."}, {"heading": "3.1 Constructing Extended Formulation from Reflection Relations", "text": "One of the tools to construct polynomial size extended formulations is the framework developed by [12] using reflection relations. The basic idea is to start with a corner of the polytope (e.g. a permutation) and then create a sequence of reflections through hyperplanes (e.g. swapping a pair of elements) so that any corner of the polytope can be generated by applying a subsequence of the reflections to the canonical corner. The convex hull is then generated by allowing “partial reflections” (i.e. containing the entire line segment connecting the original point and its reflection). Any point in the convex hull is then created by a sequence of partial reflections, and can be encoded by a sequence of variables indicating how much of each reflection was used. In fact, there is no need to start with a single corner, one could consider passing an entire polytope as an input through the sequence of (partial) reflections to generate a new polytope.\nThis framework provides an inductive construction of higher dimensional polytopes via sequence of reflection relations (see Theorem 1 in [12]). Concretely, let Pnobj be the polytope of a given combinatorial object of size n (i.e. the convex hull of H – the set of all vectors of the combinatorial object in Rn). The typical approach is to properly embed Pnobj ⊂ Rn into P̂nobj ⊂ Rn+1, and then feed it through an appropriate sequence of reflection relations as an input polytope in order to obtain an extended formulation for Pn+1obj ⊂ Rn+1. Theorem 1 in [12] provides the sufficient conditions for the correctness of this procedure.\nBy doing this inductive step, there will be additional variables and inequalities in the formulations. In fact, for each reflection relation, there will be one additional variable indicating the extent to which the reflection occurs, and two additional inequalities indicating the two extreme cases of complete reflection and remaining unchanged. Therefore, if polynomially many reflection relations\nare used to go from n to n + 1, then we can construct an extended formulation of polynomial size for Pnobj for all n."}, {"heading": "3.2 Extended Formulation of Objects Closed under Re-Ordering", "text": "Assume we want to construct an extended formulation for the class of combinatorial objects which is closed under any re-ordering. Note that Huffman trees and – trivially – permutations belong to such class of objects. In these cases, for reflection relations, one can use hyperplanes going through the origin with normal vector of form ek − eℓ which makes reflections as swapping kth and ℓth elements. Now let us figure out the form of extended formulation in this particular case. First, we find the additional variable along with two additional inequalities associated with this reflection relation. Concretely, assume v ∈ Rn is going through this reflection relation and v′ ∈ Rn is the output. Since v′ must fall into the line segment connecting v and its reflection via the hyperplane, we have ∃x ∈ R v′ − v = x (ek − eℓ) and 〈ek − eℓ,v〉 ≤ 〈ek − eℓ,v′〉 ≤ − 〈ek − eℓ,v〉. Using these two properties, one can obtain the relation between v′ and v via a linear transformation given the additional variable x as well as the constraints enforced on x:\nv′ = m x+ v, mi =\n\n\n\n1 i = k −1 i = ℓ 0 otherwise\n(1)\n0 ≤ x ≤ vℓ − vk1 (2)\nNotice that x indicates the value that is being swapped between kth and ℓth elements which can go from zero (remaining unchanged) to the maximum swap capacity (complete swap). Also note that the sequence of reflection relations can be viewed as a sequence of comparators in a network [1]. In the case of permutations, the comparators associated with combined sequences of reflection relations form bubble-sort networks as in each inductive step a sequence of length n of corresponding comparators must bubble-out the largest element. For Huffman trees, however, the sequence of comparators used in the inductive step consists of two sweeps of the elements to bubble-out the two largest elements which are associated with the two deepest leaves in the tree [12]. Furthermore, since the construction of the polytope is inductive, the order of reflection relations is the opposite of the direction of the network of comparators. In fact, one can observe that the extended formulation of a Huffman tree/permutation is the swap values of the comparators in the sorting network. Moreover, a mixture of Huffman trees/permutations can be represented by partial swap values in the comparators (See Figure 1).\nNow we can express the extended formulation using the results above. Suppose we are using m reflection relations in total. Then starting from an anchor point c and applying Equation (1) successively, we obtain the affine transformation connecting the extended formulation space X and original space V :\nv = M x+ c, v, c ∈ V ⊂ Rn, x ∈ X ⊂ Rm, M ∈ {−1, 0, 1}n×m\nThe anchor point c is [1, 2, . . . , n]T and [1, 2, . . . , n− 2, n− 1, n− 1]T in case of permutation and Huffman tree, respectively. Also using all the inequalities from the reflection relations as in (2), the\n1vℓ − vk may already be in terms of previous variables in extended formulation.\nextended formulation space X can be described as X = {x ∈ Rm : Ax ≤ b and x ≥ 0} in which A ∈ Rm×m and b ∈ Rm. See the Appendix for some theoretical results of the structure of A and b. Note: In description above, for simplicity, we explained the basic inductive approach of building extended formulation for permutations and Huffman trees. However, one can build an extended formulation both for permutations and Huffman tree non-inductively and more efficiently. Concretely, for permutations one can construct an extended formulation based on an arbitrary sorting network. Similarly, by using an arbitrary sorting network along with some additional comparators and simple linear maps, an extended formulation for Huffman trees can also be built (See Theorem 7 in [12])."}, {"heading": "3.3 Combinatorial Polytope Description in Augmented Formulation", "text": "Even though the polytope can now be described using polynomial number of facets in extended formulation x ∈ X , it is not natural to define linear loss over the elements of x. However, one can concatenate the original formulation v ∈ V to the extended formulation x ∈ X , so that it is possible to not only efficiently describe the polytope, but also provide meaningful losses such as average code length and sum of completion times in Huffman trees and permutations, respectively. So given a loss vector ℓ ∈ [0, 1]n defined over V , we can work with (V ,X ) as shown in the left column of Table 1.\nIn addition, in order to have the comfort of working with affine subspaces2, we add a positive slack vector λ to turn all inequalities into equalities. As a result, we define the augmented formulation space W (See the right column of the Table 1). Observe that there exists a duality between x and λ. Concretely, xi +λi indicates the swap value capacity at ith reflection relation and comparator. Also xi λi = 0 for all i ∈ [m] for any arbitrary pure Huffman trees/permutations since either comparator either passes or swaps its input elements."}, {"heading": "4 Algorithm", "text": "In this section, we propose our algorithm Extended-Learn, discuss its technical steps, and prove its regret bounds. The main idea of our algorithm is to maintain a distribution over all instances of the objects by keeping track of an evolving point wt = (vt,xt,λt) in the augmented formulation space W through trials t = 1, . . . , T . The main structure of Extended-Learn is show in Algorithm 1. Similar to [13], our algorithm consists of three main technical parts:\n1. Prediction: Predict with an instance γt−1 ∈ H such that E [ γt−1 ] = vt−1\n2. Update: Update the mixture wt−1 to ŵt−1 according to the incurred loss multiplicatively.\n3. Projection: Project the updated mixture ŵt−1 back to the polytope W and obtain wt.\nIn the prediction step, which is discussed in 4.1, we draw an instance probabilistically from the distribution latent in wt−1 ∈ W such that it has the same expected value as vt−1 ∈ V . For the update step, having defined Lt = (ℓt,0,0), the updated ŵt−1 is obtained from a trade-off between the linear loss and the unnormalized relative entropy [13]. :\nŵ t−1 = argmin\nw∈Rn+2m\n∆(w||wt−1) + ηw · Lt\n2The reader will see having affine subspaces allows us to take an efficient projection approach, namely iterative Bregman projections, in Section 4.2\nIt is fairly straight-forward to see:\n∀i ∈ [n+ 2m], ŵt−1i = wt−1i e−η L t i −→\n\n \n \n∀i ∈ [n], v̂t−1i = vt−1i e−η ℓ t i ∀i ∈ [m], x̂t−1i = xt−1i ∀i ∈ [m], λ̂t−1i = λ̂t−1i\nIn the projection step, for which we propose an iterative approach in 4.2, we obtain wt, the Bregman projection of ŵt−1 back to the augmented formulation space W ,\nwt = argmin w∈W ∆(w||ŵt−1)\nAlgorithm 1 Extended-Learn\n1: w0 ← q ∈ W – a proper prior distribution discussed in 4.3 2: For t = 1, . . . , T 3: wt−1 = (vt−1,xt−1,λt−1) ∈ W 4: Execute Prediction(wt−1) and get a random instance γt−1 ∈ H s.t. E [ γt−1 ] = vt−1 5: Incur a loss γt−1 · ℓt 6: Update ŵt−1 = (v̂t−1, x̂t−1, λ̂ t−1 ): 7: Keep unchanged x̂t−1 ← xt−1, λ̂t−1 ← λt−1 8: Update v̂t−1 as v̂t−1i ← vt−1i e−η ℓ t i 9: Execute Projection(ŵt−1) and obtain wt which is wt = argmin w∈W ∆(w||ŵt−1)"}, {"heading": "4.1 Prediction", "text": "In this subsection, we describe how to probabilisticly predict with an instance such that it has the same expected value as the mixture vector of which we are keeping track. First we propose an algorithm for decomposing any mixture point into convex combination of instances. Despite its inefficiency, it leads us to another algorithm which does efficiently produce proper predictions.\nInefficient Decomposition The decomposition algorithm is shown in Algortihm 2. The main idea of the algorithm is to exploit the notion of partial swaps in the comparators corresponding to reflection relations in our extended formulation. In other words, at each comparator, we want to decompose based on the extent to which we used swap capacity. One can show that Algorithm 2, despite its inefficiency, results in valid convex combination of instances (See the Appendix for the proof):\nLemma 1. (i) Given (v,x,λ), Algorithm 2 generates a decomposition set S of (γ, pγ) pairs with γ ∈ H such that v = ∑(γ,pγ )∈S pγ γ. (ii) The time complexity of Algorithm 2 is O(2 m).\nAlgorithm 2 Extended-Decomposition\n1: Input: (v,x,λ) ∈ W ⊆ Rn+2m 2: Output: A decomposition set S of (instance, probability)-pairs – (γ, pγ) 3: S ← {(c, 1)} 4: for i = 1 to m do 5: if xi = 0 then 6: continue 7: else if λi = 0 then 8: Swap the associated coordinates for all s ∈ S 9: else\n10: for (γ, pγ) ∈ S do 11: pi ← xixi+λi 12: Remove (γ, pγ) from S 13: Add (γ, (1 − pi)pγ) and (Mi(γ), pipγ) to S 3 14: end for 15: end if 16: end for 17: return S\nEfficient Prediction In order to achieve efficiency, despite the vastly common idea in the literature [9, 13, 20, 21], one can avoid decomposition and do prediction directly. To this purpose, in Algorithm 2, we replace the idea of partial swaps with probabilistic swaps. Algorithm 3 describes this idea in concrete terms. It can be shown (see the proof in the Appendix) that Algorithm 3 does proper prediction efficiently:\nLemma 2. (i) Given (v,x,λ), the Algorithm 3 generates a γ ∈ H such that E[γ] = v. (ii) The time complexity of Algorithm 3 is O(m).\nAlgorithm 3 Extended-Prediction\n1: Input: (v,x,λ) ∈ W ⊆ Rn+2m 2: Output: A prediction γ ∈ H 3: γ ← c 4: for i = 1 to m do 5: if xi = 0 then 6: continue 7: else 8: γ ← {\nMi(γ) with probability xi/(xi + λi) γ with probability λi/(xi + λi)\n9: end if 10: end for 11: return S"}, {"heading": "4.2 Projection", "text": "Formally, the problem is to find the ∆-projection of the multiplicatively-updatedp back onto set W :\nP∆W (p) = argmin q∈W ∆(q||p) (3)\nIn which ∆(·||·) is the unnormalized relative entropy. Observe that W is an intersection of affine subspaces presented by m + n equality constraints in Ax + λ = b and Mx + c = v denoted by C1, . . . , Cm+n. Since the non-negativity constraints are already in the definition of ∆, it is possible to solve (3) by simply using iterative ∆-projections 4 [2]. Starting from p0 = p, we iteratively\n3Mi denotes the swap action associated with the ith reflection relation. 4In [9] Sinkhorn balancing is used for projection which is also a special case of iterative Bregman projection\ncompute: ∀k > 0, pk = P∆Ck(pk−1) (4)\nin which the index k is (m + n)-periodic (i.e. ∀k ∈ N, Ck+m+n = Ck). It is proved [2] that pk converges to the unique solution of (3). In the Appendix, we discuss how one can project onto each hyperplane Ck for all k ∈ [n+m]. Although the iterative projection is only guaranteed to enter the simplex in the limit, the approaches in [9, 13] provide ways to overcome this issue."}, {"heading": "4.3 Regret Bounds", "text": "Using the vectors wt ∈ W produced by the algorithm, we can prove the following cumulative regret bound:\nLemma 3. E\n[\nT ∑\nt=1\nγt−1 · ℓt ] ≤ ηmin γ∈H\n∑T t=1 γ · ℓt +∆(θ||w0)\n1− e−η in which θ ∈ W is the augmented\nformulation corresponding to the instance γ ∈ V .\nThe proof is standard in the online learning literature (see, e.g., [13]) and is shown in the Appendix. Now, we prove that there exists a good initial point w0 in W such that the ∆(θ||w0) divergences are all appropriately bounded (shown in the Appendix).\nLemma 4. Assume we are working with m reflection relations. Also assume that associated network does not have any redundant comparator. Then given n ≤ m ≤ n2, there exists 5 q ∈ W such that for all p ∈ W , we have ∆(p||q) ≤ 16mn logn.\nBy Lemmas 3 and 4, we can now show the main regret bound result (see the Appendix for the proof):\nTheorem 5. Assume the number of reflection relations used in the extended formulation is m ∈ [n, n2] 6 and none of the corresponding comparators in the network are redundant. Then, given ℓt ∈ [0, 1]n for all t = 1 . . . T , we have:\nE\n[\nT ∑\nt=1\nγt−1 · ℓt ] ≤ ηmin γ∈H\n∑T t=1 γ · ℓ t + 16mn logn\n1− e−η\nFurthermore, in both cases of permutations and Huffman trees, by choosing a sorting network of size m = O(n log n) and tuning η appropriately, the expected regret of Extended-Learn is at most O(n2 logn √ T )."}, {"heading": "5 Comparisons and Conclusion", "text": "Table 2 contains a comparison of the regret bounds for the new Extended-Learn algorithm, previous algorithms for permutations, and the hedge algorithm [5] which inefficiently maintains an explicit weight for each of the exponential in n logn permutations or trees. Using loss vectors from the general unit cube, for permutations we assume the scheduling loss from [21] that has range [0, n2] per trial. When compared with the state of the art implicit algorithms PermELearn [9] and PermutahedLearn [21], the general Extended-Learn methodology has a small additional regret bound penalty of √\nlog(n). When compared with the generic explicit hedge algorithm (which is not computationally efficient), Extended-Learn has a better loss bound by a factor of √ n/ logn.\nWhen comparing Extended-Learn with explicit hedge on Huffman trees, we consider two loss regimes: (i) one where the loss vectors are from the general unit cube, and consequently, the pertrial losses are in [0, n2] (like permutations), (ii) and one where the loss vectors represent frequencies and lie on the unit simplex so the per-trial losses are in [0, n]. In the first case, Extended-Learn and Hedge have the same asymptotic bounds as with permutations. In the second case, the lower loss range favors Hedge, and the inefficient algorithm’s bound is slightly better by a factor of √ logn.\n5The construction of q can be done as a pre-processing step and may depend on the network of comparators. For instance, if we use the bubble-sort sorting network in case of permutation, the average of the augmented formulation of the two permutation [1, 2, . . . , n] and [n, n− 1, . . . , 1] will be a good choice.\n6We still have ∆(p||q) = O(mn log n) and the same bounds asymptotically with m = poly(n).\nIn conclusion, we have presented a general methodology for creating on-line learning algorithms from generic extended formulation constructions. Because these extended formulations are designed to describe complex polytopes using a manageable number of constraints, they allow efficient learning on structures, like the polytope of Huffman trees, that previously could not be learned efficiently. Several areas for future work remain. We mentioned how to generate a good initial w0 for particular extended formulations. It would be nice to have a generic w0 generation method for an arbitrary extended formulation. Also recall that the iterative Bregman projections (see Section 4.2) may only enter the polytope W in the limit. Although this causes a negligible increase in regret with Sinkhorn balancing [9], it would be helpful to have a formal analysis of when Extended-Learn makes predictions using wt just outside the polytope. Finally, and most importantly, one can investigate extended formulations for other combinatorial objects and analyze the learning algorithms that result from the Extended-Learn methodology."}, {"heading": "6 Appendix", "text": ""}, {"heading": "6.1 Structure of Inequality Constraints in Extended Formulation", "text": "Lemma 6. If M is the matrix of affine transformation corresponding to m reflection relations, the we have: A = Tri(MTM) + I, b = −MTc in which Tri(·) is a function over square matrices which zeros out the upper triangular part of the input including the diagonal.\nProof. Let vk be the vector in V after going through the kth reflection relation. Also denote the kth column of M by Mk. Observe that v0 = c and vk = c + ∑k i=1 Mixi. Let Mk = er − es. Then, using (2), the inequality associated with the kth row of Ax ≤ b will be obtained as below:\nxk ≤ vk−1s − vk−1r = −MTk vk−1 = −MTk\n(\nc+\nk−1 ∑\ni=1\nMixi\n)\n−→ xk + k−1 ∑\ni=1\nMTk Mixi ≤ −MTk c = bk\nThus:\n∀ i, j ∈ [m] Aij =\n\n\n\nMTi Mj i > j 1 i = j\n0 i < j\n, ∀ k ∈ [m] bk = −MTk c\nwhich concludes the proof."}, {"heading": "6.2 Proof of Lemma 1", "text": "Proof. Let x = [x1x2 . . . xm]T . We prove that by the end of the ith iteration of ExtendedDecomposition, S is the correct decomposition for xi = [x1 . . . xi 0 . . . 0]. The lemma is proved as a result of this statement for i = m. We prove the statement by induction. The base case i = 0 is indeed true, since S is initialized to {(c, 1)} and we have v0 = Mx0 + c = c. Now consider that by the end of the (k − 1)th iteration we have the right decompositon namely vk−1 = ∑\nγ pγ γ.\nAssume that the kth comparator is applied on rth and sth element. Thus the kth column of M will be Mk = er − es. Now, according to (2) the swap capacity at kth comparator is:\nxk + λk = v k−1 s − vk−1r =\n∑\nγ\npγ (γs − γr) = − ∑\nγ\npγ M T k γ = −MTk\n∑\nγ\npγ γ\nNow observe:\nvk = Mxk + c = xkMk +Mx k−1 + c = xkMk + v k−1 = xkMk + ∑\nγ\npγ γ\n= pkMk (xk + λk) + ∑\nγ\npγ γ = − pkMkMTk ∑\nγ\npγ γ + ∑\nγ\npγ γ\n= ( I − pkMkMTk )\n∑\nγ\npγ γ = ((1− pk) I + pk Trs) ∑\nγ\npγ γ\n= ∑\nγ\n(1− pk) pγ γ + pkpγ Trs γ\nin which Trs is row-switching matrix that is obtained form switching rth and sth row from identity matrix. This concludes the inductive proof. It is easy to see that the time complexity of the algorithm is O(2m) since S may grow exponentially and we have to go through all elements of it in each iteration."}, {"heading": "6.3 Proof of Lemma 2", "text": "Proof. For each comparator i ∈ [m] in the network, the Extended-Prediction algorithm defines the distribution below for the action of the comparator i:\nP (actioni) =\n{\npi actioni = swap 1− pi actioni = pass\nIt is easy to see from Lemma 1 that the distribution of a given instance is drawn as below:\nP (γ) =\nm ∏\ni=1\nP (actioni)\nThat is, the distribution over instances γ ∈ H is decomposed into individual actions of swap/pass through the network of comparators independently. Thus one can draw an instance according to the distribution by simply doing independent Bernoulli trials associated with the comparators. It is also easy to see that the time complexity of the algorithm is O(m) since one just needs to do m Bernoulli trials."}, {"heading": "6.4 Projection onto Each Constraint", "text": "Each constraint of the polytope in the augmented formulation is of the form aTw = a0. Formally, the projection w∗ of a give point w to this constraint is solution to the following:\nargmin aTw∗=a0\n∑\ni\nw∗i log\n(\nw∗i wi\n)\n+ wi − w∗i\nUsing the method of Lagrange multipliers, we have:\nL(w∗, µ) = ∑\ni\nw∗i log\n(\nw∗i wi\n)\n+ wi − w∗i − µ\n\n\n2m+n ∑\nj=1\naiw ∗ i − a0\n\n\n∂L\n∂w∗i = log\n(\nw∗i wi\n)\n− µai = 0, ∀i ∈ [n+ 2m]\n∂L ∂µ =\n2m+n ∑\nj=1\nai w ∗ i − a0 = 0\nReplacing β = e−µ, we have w∗i = wi β ai . By enforcing ∂L ∂µ = 0, one needs to find β > 0 such that: n+2m ∑\ni=1\nai wi β ai − a0 = 0 (5)\nObserve that due to the structure of matrices M and A (see Lemma 6), ai ∈ Z and ai ≥ −1 for all i ∈ [n + 2m], and furthermore a0 ≥ 0. Thus we can re-write the equation (5) as the polynomial below:\nf(β) = αkβ k + . . .+ α2β 2 − α1β − α0 = 0 in which all αi’s are positive real numbers. Note that f(0) < 0 and f(β) → +∞ as β → +∞. Thus f(β) has at least one positive root. However, it can not have more than one positive roots and we can prove it by contradiction. Assume that there exist 0 < r1 < r2 such that f(r1) = f(r2) = 0. Since f is convex on positive real line, using Jensen’s inequality, we can obtain the contradiction below:\n0 = f(r1) = f\n(\nr2 − r1 r2 × 0 + r1 r2 × r2 ) < r2 − r1 r2 f(0) + r1 r2 f(r2) = r2 − r1 r2 f(0) < 0\nTherefore f has exactly one positive root which can be found by Newton’s method starting from a sufficiently large initial point. 7"}, {"heading": "6.5 Proof of Lemma 3", "text": "Proof. Assuming w = (v,x,λ), θ = (γ,xθ,λθ) and L = (ℓ,0,0):\n(1− e−η)vt−1 · ℓt = (1− e−η)wt−1 ·Lt\n≤ ∑\ni\nwt−1i (1− e−η L t i )\n= ∆(θ||wt−1)−∆(θ||ŵt−1) + η θ · Lt\n≤ ∆(θ||wt−1)−∆(θ||wt) + η γ · ℓt\nThe first inequality is obtained using 1 − e−ηx ≥ (1 − e−η)x for x ∈ [0, 1] as done in [15]. The second inequality is a result of the Generalized Pythagorean Theorem [10], since wt is a Bregman projection of ŵt−1 into the convex set W which contains θ. By summing over t = 1 . . . T and using the non-negativity of divergences, we obtain:\n(1− e−η) T ∑\nt=1\nvt−1 · ℓt ≤ ∆(θ||w0)−∆(θ||wT ) + η T ∑\nt=1\nγ · ℓt\n−→ E [ T ∑\nt=1\nγt−1 · ℓt ] ≤ ηmin γ∈H\n∑T t=1 γ · ℓt +∆(θ||w0)\n1− e−η\n7Note that if the constraint belongs to v = Mx + c, since all the coefficinets are in {−1, 0, 1}, the f will be quadratic and the positve root can be found through the closed form formula."}, {"heading": "6.6 Proof of Lemma 4", "text": "Proof. According to the definition:\n∆(p||q) = ∑\ni\npi log pi qi + qi − pi\n= ∑\ni\npi log pi − pi log qi + qi − pi\nWe will bound each term of the expression above. First observe that, given Sp = ∑\ni pi, we have: ∑\ni\npi Sp log pi Sp ≤ log(n+ 2m)\n−→ ∑\ni\npi log pi ≤ Sp log(n+ 2m) + Sp logSp\nNote that for an arbitrary point (v,x,λ) ∈ W , for all i ∈ [m], xi + λi ≤ n because it indicates the maximum swap value at reflection relation i. Also since vi ≤ n for all i ∈ [n], thus Sq, Sp ≤ n2 +mn ≤ 2mn. Therefore:\n∑\ni\npi log pi ≤ Sp log(n+ 2m) + Sp log Sp\n≤ 4mn logn+ 6mn logn = 10mn logn\nNow we only need to bound ∑ i−pi log qi. To do so, we choose q to be the average of some instances {θ(j)}j∈J ⊂ W such that for all i ∈ [n + 2m], qi is sufficiently large. Trivially vθ ≥ 1. Also note that, since we do not have any redundant comparator in our network, we can assume for all i ∈ [m], there exists a witness instance in W such that xi ≥ 1. Same argument can be made for λi’s. Now let q be the average of all these 2m instances. Therefore for all i ∈ [n + 2m], qi ≥ 12m and consequently − log qi ≤ log 2m.\nPutting everything together, we obtain:\n∆(p||q) = ∑\ni\npi log pi − pi log qi + qi − pi\n≤ 10mn logn+ 2mn log 2m+ 2mn ≤ 16mn logn"}, {"heading": "6.7 Proof of Theorem 5", "text": "Proof. The first part is the immediate consequence of Lemmas 3 and 4:\nE\n[\nT ∑\nt=1\nγt−1 · ℓt ] ≤ ηmin γ∈H\n∑T t=1 γ · ℓt + 16mn logn\n1− e−η\nLet Lbest = min γ∈H\n∑T t=1 γ · ℓt. We can tune η as instructed in Lemma 4 in [5]:\nE\n[\nT ∑\nt=1\nγt−1 · ℓt ]\n− min γ∈H\nT ∑\nt=1\nγ · ℓt ≤ √\n2Lbest 16mn logn+ 16mn logn\nApplying Lbest ≤ Tn2 and m = O(n log n) (by choosing an appropriate sorting network [1]) into inequality above, we will obtain the desired result."}], "references": [{"title": "The relaxation method of finding the common point of convex sets and its application to the solution of problems in convex programming", "author": ["Lev M Bregman"], "venue": "USSR computational mathematics and mathematical physics,", "citeRegEx": "2", "shortCiteRegEx": "2", "year": 1967}, {"title": "Prediction, learning, and games", "author": ["Nicolo Cesa-Bianchi", "Gábor Lugosi"], "venue": "Cambridge university press,", "citeRegEx": "3", "shortCiteRegEx": "3", "year": 2006}, {"title": "Group representations in probability and statistics", "author": ["Persi Diaconis"], "venue": "Lecture Notes-Monograph Series,", "citeRegEx": "4", "shortCiteRegEx": "4", "year": 1988}, {"title": "A decision-theoretic generalization of on-line learning and an application to boosting", "author": ["Yoav Freund", "Robert E Schapire"], "venue": "Journal of computer and system sciences,", "citeRegEx": "5", "shortCiteRegEx": "5", "year": 1997}, {"title": "Smallest compact formulation for the permutahedron", "author": ["Michel X Goemans"], "venue": "Mathematical Programming,", "citeRegEx": "6", "shortCiteRegEx": "6", "year": 2015}, {"title": "Direct and indirect algorithms for on-line learning of disjunctions", "author": ["David P Helmbold", "Sandra Panizza", "Manfred K Warmuth"], "venue": "Theoretical Computer Science,", "citeRegEx": "7", "shortCiteRegEx": "7", "year": 2002}, {"title": "Predicting nearly as well as the best pruning of a decision tree", "author": ["David P Helmbold", "Robert E Schapire"], "venue": "Machine Learning,", "citeRegEx": "8", "shortCiteRegEx": "8", "year": 1997}, {"title": "Learning permutations with exponential weights", "author": ["David P Helmbold", "Manfred K Warmuth"], "venue": "The Journal of Machine Learning Research,", "citeRegEx": "9", "shortCiteRegEx": "9", "year": 2009}, {"title": "Tracking the best linear predictor", "author": ["Mark Herbster", "Manfred K Warmuth"], "venue": "The Journal of Machine Learning Research,", "citeRegEx": "10", "shortCiteRegEx": "10", "year": 2001}, {"title": "Extended formulations in combinatorial optimization", "author": ["Volker Kaibel"], "venue": "arXiv preprint arXiv:1104.1023,", "citeRegEx": "11", "shortCiteRegEx": "11", "year": 2011}, {"title": "Constructing extended formulations from reflection relations", "author": ["Volker Kaibel", "Kanstantsin Pashkovich"], "venue": "In Facets of Combinatorial Optimization,", "citeRegEx": "12", "shortCiteRegEx": "12", "year": 2013}, {"title": "Optimum follow the leader algorithm", "author": ["Dima Kuzmin", "Manfred K Warmuth"], "venue": "In Learning Theory,", "citeRegEx": "14", "shortCiteRegEx": "14", "year": 2005}, {"title": "The weighted majority algorithm", "author": ["Nick Littlestone", "Manfred K Warmuth"], "venue": "Information and computation,", "citeRegEx": "15", "shortCiteRegEx": "15", "year": 1994}, {"title": "Efficient learning with virtual threshold gates", "author": ["Wolfgang Maass", "Manfred K Warmuth"], "venue": "Information and Computation,", "citeRegEx": "16", "shortCiteRegEx": "16", "year": 1998}, {"title": "On the convex hull of huffman trees", "author": ["Jean-François Maurras", "Thanh Hai Nguyen", "Viet Hung Nguyen"], "venue": "Electronic Notes in Discrete Mathematics,", "citeRegEx": "17", "shortCiteRegEx": "17", "year": 2010}, {"title": "Predicting nearly as well as the best pruning of a planar decision graph", "author": ["Eiji Takimoto", "Manfred K Warmuth"], "venue": "Theoretical Computer Science,", "citeRegEx": "18", "shortCiteRegEx": "18", "year": 2002}, {"title": "Path kernels and multiplicative updates", "author": ["Eiji Takimoto", "Manfred K Warmuth"], "venue": "The Journal of Machine Learning Research,", "citeRegEx": "19", "shortCiteRegEx": "19", "year": 2003}, {"title": "Randomized online pca algorithms with regret bounds that are logarithmic in the dimension", "author": ["Manfred K Warmuth", "Dima Kuzmin"], "venue": "Journal of Machine Learning Research,", "citeRegEx": "20", "shortCiteRegEx": "20", "year": 2008}, {"title": "Online linear optimization over permutations", "author": ["Shota Yasutake", "Kohei Hatano", "Shuji Kijima", "Eiji Takimoto", "Masayuki Takeda"], "venue": "In Algorithms and Computation,", "citeRegEx": "21", "shortCiteRegEx": "21", "year": 2011}], "referenceMentions": [{"referenceID": 14, "context": "Abstract The convex hull of n-symbol Huffman trees is known to have exponentially many facets/constraints [17].", "startOffset": 106, "endOffset": 110}, {"referenceID": 12, "context": "One way to create algorithms for these combinatorial problems is to use one of the well-known socalled “experts algorithms” like weighted majority [15] or hedge [5] with each combinatorial object treated as an “expert”.", "startOffset": 147, "endOffset": 151}, {"referenceID": 3, "context": "One way to create algorithms for these combinatorial problems is to use one of the well-known socalled “experts algorithms” like weighted majority [15] or hedge [5] with each combinatorial object treated as an “expert”.", "startOffset": 161, "endOffset": 164}, {"referenceID": 7, "context": "In addition to subsets, such work includes permutations [9, 21], paths [14, 19], and k-sets [20].", "startOffset": 56, "endOffset": 63}, {"referenceID": 18, "context": "In addition to subsets, such work includes permutations [9, 21], paths [14, 19], and k-sets [20].", "startOffset": 56, "endOffset": 63}, {"referenceID": 11, "context": "In addition to subsets, such work includes permutations [9, 21], paths [14, 19], and k-sets [20].", "startOffset": 71, "endOffset": 79}, {"referenceID": 16, "context": "In addition to subsets, such work includes permutations [9, 21], paths [14, 19], and k-sets [20].", "startOffset": 71, "endOffset": 79}, {"referenceID": 17, "context": "In addition to subsets, such work includes permutations [9, 21], paths [14, 19], and k-sets [20].", "startOffset": 92, "endOffset": 96}, {"referenceID": 10, "context": "Section 3 explains the extended formulation used in our setting by reviewing the work by Kaibel and Pashkovich [12].", "startOffset": 111, "endOffset": 115}, {"referenceID": 1, "context": "2 Related Work On-line learning is a rich and vibrant area, see [3] for a textbook treatment.", "startOffset": 64, "endOffset": 67}, {"referenceID": 5, "context": "The implicit representations for structured concepts (sometimes called ‘indirect representations’) have been used for a variety of problems [7, 8, 16, 18, 19].", "startOffset": 140, "endOffset": 158}, {"referenceID": 6, "context": "The implicit representations for structured concepts (sometimes called ‘indirect representations’) have been used for a variety of problems [7, 8, 16, 18, 19].", "startOffset": 140, "endOffset": 158}, {"referenceID": 13, "context": "The implicit representations for structured concepts (sometimes called ‘indirect representations’) have been used for a variety of problems [7, 8, 16, 18, 19].", "startOffset": 140, "endOffset": 158}, {"referenceID": 15, "context": "The implicit representations for structured concepts (sometimes called ‘indirect representations’) have been used for a variety of problems [7, 8, 16, 18, 19].", "startOffset": 140, "endOffset": 158}, {"referenceID": 16, "context": "The implicit representations for structured concepts (sometimes called ‘indirect representations’) have been used for a variety of problems [7, 8, 16, 18, 19].", "startOffset": 140, "endOffset": 158}, {"referenceID": 7, "context": "In the case of permutations [9, 21] and component hedge [13] the implicit representations seem to be better matched with the combinatorial structure than the explicit representation, allowing not only decreased running time but also the proof of better bounds.", "startOffset": 28, "endOffset": 35}, {"referenceID": 18, "context": "In the case of permutations [9, 21] and component hedge [13] the implicit representations seem to be better matched with the combinatorial structure than the explicit representation, allowing not only decreased running time but also the proof of better bounds.", "startOffset": 28, "endOffset": 35}, {"referenceID": 18, "context": "As in [21], the loss family provided in our approach is linear over the first order representation of the objects [4].", "startOffset": 6, "endOffset": 10}, {"referenceID": 2, "context": "As in [21], the loss family provided in our approach is linear over the first order representation of the objects [4].", "startOffset": 114, "endOffset": 117}, {"referenceID": 7, "context": "In contrast, [9] works with the second order representation, and consequently losses, which is a more general loss family (See [21] for comparison).", "startOffset": 13, "endOffset": 16}, {"referenceID": 18, "context": "In contrast, [9] works with the second order representation, and consequently losses, which is a more general loss family (See [21] for comparison).", "startOffset": 127, "endOffset": 131}, {"referenceID": 4, "context": "There have been several works aimed at efficiently describing the polytope of different combinatorial objects like permutations [6] and Huffman trees [17].", "startOffset": 128, "endOffset": 131}, {"referenceID": 14, "context": "There have been several works aimed at efficiently describing the polytope of different combinatorial objects like permutations [6] and Huffman trees [17].", "startOffset": 150, "endOffset": 154}, {"referenceID": 9, "context": "Discovered by the combinatorial optimization community, extended formulation, on which our results rely, is a general methodology to nicely describe combinatorial polyhedra [11, 12].", "startOffset": 173, "endOffset": 181}, {"referenceID": 10, "context": "Discovered by the combinatorial optimization community, extended formulation, on which our results rely, is a general methodology to nicely describe combinatorial polyhedra [11, 12].", "startOffset": 173, "endOffset": 181}, {"referenceID": 14, "context": "see [17]).", "startOffset": 4, "endOffset": 8}, {"referenceID": 9, "context": "See [11] for some of the tools for constructing such extended formulations.", "startOffset": 4, "endOffset": 8}, {"referenceID": 10, "context": "In the following subsections, we first overview the work by Kaibel and Pashkovich [12], and then extract the formulation fitting to our methodology.", "startOffset": 82, "endOffset": 86}, {"referenceID": 10, "context": "1 Constructing Extended Formulation from Reflection Relations One of the tools to construct polynomial size extended formulations is the framework developed by [12] using reflection relations.", "startOffset": 160, "endOffset": 164}, {"referenceID": 10, "context": "This framework provides an inductive construction of higher dimensional polytopes via sequence of reflection relations (see Theorem 1 in [12]).", "startOffset": 137, "endOffset": 141}, {"referenceID": 10, "context": "Theorem 1 in [12] provides the sufficient conditions for the correctness of this procedure.", "startOffset": 13, "endOffset": 17}, {"referenceID": 10, "context": "For Huffman trees, however, the sequence of comparators used in the inductive step consists of two sweeps of the elements to bubble-out the two largest elements which are associated with the two deepest leaves in the tree [12].", "startOffset": 222, "endOffset": 226}, {"referenceID": 10, "context": "Similarly, by using an arbitrary sorting network along with some additional comparators and simple linear maps, an extended formulation for Huffman trees can also be built (See Theorem 7 in [12]).", "startOffset": 190, "endOffset": 194}, {"referenceID": 7, "context": "Efficient Prediction In order to achieve efficiency, despite the vastly common idea in the literature [9, 13, 20, 21], one can avoid decomposition and do prediction directly.", "startOffset": 102, "endOffset": 117}, {"referenceID": 17, "context": "Efficient Prediction In order to achieve efficiency, despite the vastly common idea in the literature [9, 13, 20, 21], one can avoid decomposition and do prediction directly.", "startOffset": 102, "endOffset": 117}, {"referenceID": 18, "context": "Efficient Prediction In order to achieve efficiency, despite the vastly common idea in the literature [9, 13, 20, 21], one can avoid decomposition and do prediction directly.", "startOffset": 102, "endOffset": 117}, {"referenceID": 0, "context": "Since the non-negativity constraints are already in the definition of ∆, it is possible to solve (3) by simply using iterative ∆-projections 4 [2].", "startOffset": 143, "endOffset": 146}, {"referenceID": 7, "context": "In [9] Sinkhorn balancing is used for projection which is also a special case of iterative Bregman projection", "startOffset": 3, "endOffset": 6}, {"referenceID": 0, "context": "It is proved [2] that pk converges to the unique solution of (3).", "startOffset": 13, "endOffset": 16}, {"referenceID": 7, "context": "Although the iterative projection is only guaranteed to enter the simplex in the limit, the approaches in [9, 13] provide ways to overcome this issue.", "startOffset": 106, "endOffset": 113}, {"referenceID": 3, "context": "5 Comparisons and Conclusion Table 2 contains a comparison of the regret bounds for the new Extended-Learn algorithm, previous algorithms for permutations, and the hedge algorithm [5] which inefficiently maintains an explicit weight for each of the exponential in n logn permutations or trees.", "startOffset": 180, "endOffset": 183}, {"referenceID": 18, "context": "Using loss vectors from the general unit cube, for permutations we assume the scheduling loss from [21] that has range [0, n] per trial.", "startOffset": 99, "endOffset": 103}, {"referenceID": 7, "context": "When compared with the state of the art implicit algorithms PermELearn [9] and PermutahedLearn [21], the general Extended-Learn methodology has a small additional regret bound penalty of √", "startOffset": 71, "endOffset": 74}, {"referenceID": 18, "context": "When compared with the state of the art implicit algorithms PermELearn [9] and PermutahedLearn [21], the general Extended-Learn methodology has a small additional regret bound penalty of √", "startOffset": 95, "endOffset": 99}], "year": 2017, "abstractText": "The convex hull of n-symbol Huffman trees is known to have exponentially many facets/constraints [17]. This makes the standard on-line learning techniques for learning Huffman trees impractical, since they use multiplicative updates followed by projections to satisfy all of the constraints. However, there are general extended formulation techniques that encode the convex hull of Huffman trees as a polytope in a higher dimensional space with only polynomially many facets. This extended formulation methodology can also be used to encode the n-element permutahedron in O(n log n) dimensions with only a polynomial number of facets. We develop a general technique for converting these extended formulations into efficient on-line algorithms with good relative loss bounds. The resulting algorithms have nearly the same regret bounds as state of the art algorithms for permutations, and are the first efficient algorithms for the on-line learning of Huffman trees.", "creator": "LaTeX with hyperref package"}}}